000001021014     A*%%***********************************************************************
000002021014     A*%%TS  RD  20021014  102048  GEODET1     REL-V4R4M0  5769-PW1
000003021014     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004021014     A*%%FI       0000000000000000000000000000000000000000000000000
000005021014     A*%%***********************************************************************
000006021014      **************************************************************************
000007021014      * Parametri di compilazione ....
000008021014      *                                PAGESIZE(72 132)
000009021014      *                                CPI(10)
000010021014      *                                OVRFLW(72)
000011021014      **************************************************************************
000012021014     A                                      REF(*LIBL/DICTIOP)
000018021014     A*----------------------------------------------------------------------
000019021014     A*               B O N   D E  L I V R A I S O N
000020021014     A*----------------------------------------------------------------------
000021021015     A          R BOX1
000022021015     A*
000023021016     A                                      BOX(0.30 0.30 11.40 8.00 0.01)
000024021016     A                                      BOX(9.60 6.05  9.95 8.00 0.02)
000025021015     A                                      LINE(3.70 0.3 7.70 *HRZ +
000026021015     A                                      0.01 *BOT)
000027021015     A                                      LINE(3.95 0.3 7.70 *HRZ +
000028021015     A                                      0.01 *BOT)
000029021015     A                                      LINE(9.60 0.3 7.70 *HRZ +
000030021015     A                                      0.01 *BOT)
000031021015     A                                      LINE(9.95 0.3 7.70 *HRZ +
000032021015     A                                      0.01 *BOT)
000033021015     A                                      LINE(10.35 0.3 7.70 *HRZ +
000034021015     A                                      0.01 *BOT)
000035021016     A                                      LINE(10.85 0.3 7.70 *HRZ +
000036021015     A                                      0.01 *BOT)
000037021015     A                                      LINE(1.20 4.00 4.00 *HRZ +
000038021015     A                                      0.01 *BOT)
000039021015     A                                      LINE(2.10 4.00 4.00 *HRZ +
000040021015     A                                      0.01 *BOT)
000041021015     A                                      LINE(2.95 4.00 4.00 *HRZ +
000042021015     A                                      0.01 *BOT)
000043021016     A                                      LINE(1.45 0.30 3.70 *HRZ +
000044021015     A                                      0.01 *BOT)
000045021016     A                                      LINE(1.70 0.30 3.70 *HRZ +
000046021016     A                                      0.01 *BOT)
000047021015     A                                      LINE(2.10 0.30 3.70 *HRZ +
000048021015     A                                      0.01 *BOT)
000049021015     A                                      LINE(2.45 0.30 3.70 *HRZ +
000050021015     A                                      0.01 *BOT)
000051021015     A                                      LINE(2.85 0.30 3.70 *HRZ +
000052021015     A                                      0.01 *BOT)
000053021015     A                                      LINE(3.20 0.30 3.70 *HRZ +
000054021015     A                                      0.01 *BOT)
000055021015     A                                      LINE(0.30 4.00 3.40 *VRT +
000056021015     A                                      0.01 *LEFT)
000057021016     A                                      LINE(2.10 2.15 1.10 *VRT +
000058021015     A                                      0.01 *LEFT)
000059021015     A                                      LINE(3.70 2.25 5.90 *VRT +
000060021015     A                                      0.01 *LEFT)
000061021015     A                                      LINE(3.70 3.25 5.90 *VRT +
000062021015     A                                      0.01 *LEFT)
000063021016     A                                      LINE(9.60 1.65 0.35 *VRT +
000064021016     A                                      0.01 *LEFT)
000065021016     A                                      LINE(9.60 2.30 0.35 *VRT +
000066021016     A                                      0.01 *LEFT)
000067021016     A                                      LINE(9.60 3.20 0.35 *VRT +
000068021016     A                                      0.01 *LEFT)
000069021016     A                                      LINE(9.60 4.30 0.35 *VRT +
000070021016     A                                      0.01 *LEFT)
000071021016     A                                      LINE(9.60 5.15 0.35 *VRT +
000072021016     A                                      0.01 *LEFT)
000073021016     A                                      LINE(9.95 3.05 0.40 *VRT +
000074021016     A                                      0.01 *LEFT)
000075021016     A                                      LINE(9.95 5.75 0.40 *VRT +
000076021016     A                                      0.01 *LEFT)
000077021016     A                                      LINE(10.35 4.00 0.50 *VRT +
000078021016     A                                      0.01 *LEFT)
000079021016     A                                      LINE(10.85 1.80 0.55 *VRT +
000080021016     A                                      0.01 *LEFT)
000081021016     A                                      LINE(10.85 3.30 0.55 *VRT +
000082021016     A                                      0.01 *LEFT)
000083021016     A                                      LINE(10.85 4.80 0.55 *VRT +
000084021016     A                                      0.01 *LEFT)
000085021016     A                                      LINE(10.85 6.30 0.55 *VRT +
000086021016     A                                      0.01 *LEFT)
000087021016     A          R SCRITTE
000089021016     A            CST01         52
000090021016     A                                      POSITION(1.60 0.40)
000091021016     A                                      FONT(223)
000092021016     A            CST02          6
000093021016     A                                      POSITION(1.80 0.40)
000094021016     A                                      FONT(223)
000095021016     A            CST03          6
000096021016     A                                      POSITION(2.20 0.40)
000097021016     A                                      FONT(223)
000098021016     A            CST04          6
000099021016     A                                      POSITION(2.20 2.25)
000100021016     A                                      FONT(223)
000101021016     A            CST05         11
000102021016     A                                      POSITION(2.55 0.40)
000103021016     A                                      FONT(223)
000104021016     A            CST06          7
000105021016     A                                      POSITION(2.55 2.25)
000106021016     A                                      FONT(223)
000107021016     A            CST07          5
000108021016     A                                      POSITION(2.95 0.40)
000109021016     A                                      FONT(223)
000110021016     A            CST08          4
000111021016     A                                      POSITION(2.95 2.25)
000112021016     A                                      FONT(223)
000113021016     A            CST09         14
000114021016     A                                      POSITION(3.30 0.40)
000115021016     A                                      FONT(223)
000116021016     A            CST10         12
000117021016     A                                      POSITION(0.48 4.10)
000118021016     A                                      FONT(223)
000119021016     A            CST11          9
000120021016     A                                      POSITION(0.87 4.10)
000121021016     A                                      FONT(223)
000122021016     A            CST12         21
000123021016     A                                      POSITION(1.30 4.10)
000124021016     A                                      FONT(223)
000125021016     A            CST13         11
000126021016     A                                      POSITION(2.20 4.10)
000127021016     A                                      FONT(223)
000128021016     A            CST14         10
000129021016     A                                      POSITION(3.05 4.10)
000130021016     A                                      FONT(223)
000131021016     A            CST15          8
000132021016     A                                      POSITION(3.87 0.40)
000133021016     A            CST16          8
000134021016     A                                      POSITION(3.87 2.40)
000135021016     A            CST17         11
000136021016     A                                      POSITION(3.87 3.40)
000137021016     A            CST18         16
000138021016     A                                      POSITION(9.70 0.40)
000139021016     A                                      FONT(223)
000140021016     A            CST19          5
000141021016     A                                      POSITION(9.70 1.75)
000142021016     A                                      FONT(223)
000143021016     A            CST20          4
000144021016     A                                      POSITION(9.70 2.40)
000145021016     A                                      FONT(223)
000146021016     A            CST21          6
000147021016     A                                      POSITION(9.70 3.30)
000148021016     A                                      FONT(223)
000149021016     A            CST22          6
000150021016     A                                      POSITION(9.70 4.40)
000151021016     A                                      FONT(223)
000152021016     A            CST23          6
000153021016     A                                      POSITION(9.70 5.25)
000154021016     A                                      FONT(223)
000155021016     A            CST24         12
000156021016     A                                      POSITION(9.70 6.15)
000157021016     A                                      FONT(223)
000158021016     A            CST25         20
000159021016     A                                      POSITION(10.05 0.40)
000160021016     A                                      FONT(223)
000161021016     A            CST26          5
000162021016     A                                      POSITION(10.05 3.15)
000163021016     A                                      FONT(223)
000164021016     A            CST27         17
000165021016     A                                      POSITION(10.05 5.85)
000166021016     A                                      FONT(223)
000167021016     A            CST28          7
000168021016     A                                      POSITION(10.45 4.10)
000169021016     A                                      FONT(223)
000170021016     A            CST29         25
000171021016     A                                      POSITION(10.95 0.40)
000172021016     A                                      FONT(281)
000173021016     A            CST30         16
000174021016     A                                      POSITION(10.95 1.90)
000175021016     A                                      FONT(281)
000176021016     A            CST31         15
000177021016     A                                      POSITION(10.95 3.40)
000178021016     A                                      FONT(281)
000179021016     A            CST32          5
000180021016     A                                      POSITION(10.95 4.90)
000181021016     A                                      FONT(281)
000182021016     A            CST33         21
000183021016     A                                      POSITION(10.95 6.40)
000184021016     A                                      FONT(281)
000185021016     A            CST34         70
000186021016     A                                      POSITION(10.45 0.40)
000187021016     A                                      FONT(281)
000188021016     A            CST35         70
000189021016     A                                      POSITION(10.52 0.40)
000190021016     A                                      FONT(281)
000191021016     A            CST36         70
000192021016     A                                      POSITION(10.59 0.40)
000193021016     A                                      FONT(281)
000194021016     A            CST37         70
000195021016     A                                      POSITION(10.66 0.40)
000196021016     A                                      FONT(281)
000197021016     A            CST38         70
000198021016     A                                      POSITION(10.73 0.40)
000199021016     A                                      FONT(281)
000200021016     A            CST39         70
000201021016     A                                      POSITION(10.80 0.40)
000202021016     A                                      FONT(281)
000203021016     A          R LOGO
000204021016     A*
000205021016     A                                      PAGSEG(LOGOBART 0.4 0.4)
000206021014     A          R TESTATA_1
000207021014     A*%%***********************************************************************
000208021014     A*%%RI 00000
000209021014     A*%%FS 001
000210021014     A*%%***********************************************************************
000211021016     A                                  4 60'BARTOLINI S.P.A.'
000212021016     A                                  5 60'VIA E. MATTEI, 42'
000213021016     A                                  6 50'40138'
000214021016     A                                  6 60'BOLOGNA'
000215021016     A                                  6 93'BO'
000216021016     A            T00212        35      7 60
000217021016     A            T00214         9      8 50
000218021016     A            T00215        35      8 60
000219021016     A            T00216        35   O  9 60
000220021015     A            B1RSL1    R          12 60
000221021015     A            B1RSL2    R          13 60
000222021015     A            B1ADL1    R          14 60
000223021015     A            B1ADL2    R          15 60
000224021015     A            B1CPSL    R          16 50
000225021015     A            B1VILL    R          16 60
000226021015     A            C1RSF1    R          19 60
000227021015     A            SPTYBL         3A    16  6
000228021015     A                                 16  9
000229021014     A                                      '/'
000230021015     A            SPANNO         4  0  16 10
000231021014     A                                      EDTCDE(Z)
000232021015     A                                 16 14
000233021014     A                                      '/'
000234021015     A            B1NBL     R          16 15
000235021014     A                                      EDTCDE(Z)
000236021015     A            C1RSF2    R          20 60
000237021015     A            C1ADF1    R          21 60
000238021015     A            C1XEXP    R          19  6
000239021015     A            NUMPAG         4  0  19 28
000240021014     A                                      EDTCDE(Z)
000241021015     A            C1ADF2    R          22 60
000242021015     A            C1CPSF    R          23 50
000243021015     A            C1VILF    R          23 60
000244021015     A            C1NLIV    R          22  6
000245021015     A            C1CLIL    R        O 22 28
000246021015     A            C1BCHP    R        O 25  6
000247021014     A                                      EDTCDE(Z)
000248021015     A            C1NCOM    R        O 25 28
000249021014     A                                      EDTCDE(Z)
000250021015     A            C5RS1V        35A  O 26 60
000251021015     A            C5RS2V        35A  O 27 60
000252021015     A            C1TXE1    R          28  6
000253021015     A            C5INV         35A  O 28 60
000254021015     A            C1TXE2    R          29  6
000255021015     A            C5CPV          9A  O 29 50
000256021015     A            C5LOV         35A  O 29 60
000257021015     A                                 35  6' '
000258021014     A*%%***********************************************************************
000259021014     A*%%SS
000260021014     A*%%CL 001
000261021014     A*%%CL 001
000262021014     A*%%CL 001
000263021014     A*%%CL 001
000264021014     A*%%CL+001
000265021014     A*%%CL                       XX
000266021014     A*%%CL 001
000267021014     A*%%CL 001
000268021014     A*%%CL 001
000269021014     A*%%CL 001
000270021014     A*%%CL 001
000271021014     A*%%CL 002
000272021014     A*%%CL 001
000273021014     A*%%CL 001
000274021014     A*%%CL 001
000275021014     A*%%CL 001
000276021014     A*%%CL 002
000277021014     A*%%CL 001
000278021014     A*%%CL 001
000279021014     A*%%CL 001
000280021014     A*%%CL 002
000281021014     A*%%***********************************************************************
000282021014      **************************************************************************
000283021014      * DETTAGLIO
000284021014      **************************************************************************
000285021014     A          R DETTAGLIO
000286021014     A*%%***********************************************************************
000287021014     A*%%RI 00000
000288021014     A*%%***********************************************************************
000289021015     A            C2ART     R              6
000290021014     A                                      SPACEB(001)
000291021015     A            B2QLUC    R             30
000292021014     A                                      EDTCDE(2)
000293021015     A            A1LIB     R             42
000294021014     A*%%***********************************************************************
000295021014     A*%%SS
000296021014     A*%%CL 001
000297021014     A*%%***********************************************************************
000298021014      **************************************************************************
000299021014      * DETTAGLIO2
000300021014      **************************************************************************
000301021014     A          R DETTAGLIO2
000302021014     A*%%***********************************************************************
000303021014     A*%%RI 00000
000304021014     A*%%***********************************************************************
000305021015     A            A1LIB2    R             42
000306021014     A                                      SPACEB(001)
000307021014     A*%%***********************************************************************
000308021014     A*%%SS
000309021014     A*%%CL 001
000310021014     A*%%***********************************************************************
000311021014     A          R TESTATA_3
000312021014     A*%%***********************************************************************
000313021014     A*%%RI 00000
000314021014     A*%%FS 030
000315021014     A*%%***********************************************************************
000316021016     A                                 79  6
000317021016     A                                      'CARTONI'
000318021016     A            NBCOLISBL      5  0  79 22
000319021014     A                                      EDTCDE(Z)
000320021016     A            PESO_TOT       7  2  79 29
000321021014     A                                      EDTCDE(2)
000322021016     A            VOLUMEBL       9  3  79 40
000323021014     A                                      EDTCDE(2)
000324021016     A            CONTRBL       13  3  79 75
000325021016     A                                      EDTCDE(2)
000326021016     A            CONTEUR        3     79 93
000327021016     A            T02803        30     82 39
000328021015     A            T02303        30     82  6
000329021016     A            T02403        30     82 71
000330021016     A            T1RSL1    R          84 60
000331021016     A            T1ADL1    R          85 60
000332021016     A            T1CPSL    R          86 50
000333021016     A            T1VILL    R          86 60
000334021014     A*%%***********************************************************************
000335021014     A*%%SS
000336021014     A*%%CL 002
000337021014     A*%%CL 003
000338021014     A*%%CL 001
000339021014     A*%%CL 001
000340021014     A*%%CL 003
000341021014     A*%%***********************************************************************
000342021014      **************************************************************************
000343021014      * SEGUE ...
000344021014      **************************************************************************
000345021014     A          R SEGUE
000346021014     A*%%***********************************************************************
000347021014     A*%%RI 00000
000348021014     A*%%***********************************************************************
000349021014     A                                      SPACEB(001)
000350021014     A                                    75
000351021014     A                                      'SEGUE -->'
000352021014     A*%%***********************************************************************
000353021014     A*%%SS
000354021014     A*%%***********************************************************************
000355021014      **************************************************************************
000356021014      * TESTATA MATRICOLE
000357021014      **************************************************************************
000358021014     A          R MATR
000359021014     A*%%***********************************************************************
000360021014     A*%%RI 00000
000361021014     A*%%***********************************************************************
000362021014     A                                      SPACEB(001)
000363021014     A                                     4
000364021014     A                                      'Matricole'
000365021014     A            MTSN1         30        24
000366021014     A            MTSN2         30        55
000367021014     A*%%***********************************************************************
000368021014     A*%%SS
000369021014     A*%%***********************************************************************
000370021014      **************************************************************************
000371021014      * COMMENTI TESTATA / PIEDE
000372021014      **************************************************************************
000373021014     A          R COMMTESPIE
000374021014     A*%%***********************************************************************
000375021014     A*%%RI 00000
000376021014     A*%%***********************************************************************
000377021014     A                                      SPACEB(001)
000378021016     A            C4TEXT    R             42
000379021016     A                                      FONT(223)
000380021014     A*%%***********************************************************************
000381021014     A*%%SS
000382021014     A*%%***********************************************************************
000383021014      **************************************************************************
000384021014      * COMMENTI DETTAGLIO
000385021014      **************************************************************************
000386021014     A          R COMMDETT
000387021014     A*%%***********************************************************************
000388021014     A*%%RI 00000
000389021014     A*%%***********************************************************************
000390021014     A                                      SPACEB(001)
000391021016     A            C4TEXT    R             42
000392021016     A                                      FONT(223)
000393021014     A*%%***********************************************************************
000394021014     A*%%SS
000395021014     A*%%***********************************************************************
000396021014     A          R DETTMATT
000397021014     A*%%***********************************************************************
000398021014     A*%%RI 00000
000399021014     A*%%***********************************************************************
000400021014     A                                      SPACEB(001)
000401021014     A            RIGAMT        75        38
000402021014     A                                      CPI(15)
000403021014     A*%%***********************************************************************
000404021014     A*%%SS
000405021014     A*%%***********************************************************************
000406021014      **************************************************************************
000407021014      * FINE PAGINA
000408021014      **************************************************************************
000409021014     A          R FINPAG
000410021014     A*%%***********************************************************************
000411021014     A*%%RI 00000
000412021014     A*%%FS 013
000413021014     A*%%***********************************************************************
000414021014     A                                      SKIPB(089)
000415021014     A                                      SKIPA(001)
000416021014     A*%%***********************************************************************
000417021014     A*%%SS
000418021014     A*%%CL 001
000419021014     A*%%***********************************************************************
000420021014     A          R RUDO
000421021014     A*%%***********************************************************************
000422021014     A*%%RI 00000
000423021014     A*%%***********************************************************************
000424021014     A                                      SPACEA(001)
000425021014     A            C1XOL     R              6
000426021014     A                                      SPACEB(001)
000427021014     A            B1ZONL    R             16
000428021014     A            PAGAMENTO     30        23
000429021014     A            T1ADL2    R             54
000430021014     A            COSTANTE      15A  O     6
000431021014     A                                      SPACEB(001)
000432021014     A            NOTE          30A  O    22
000433021014     A                                      SPACEB(001)
000434021014     A            PESO_RIGA      7  2     53
000435021014     A                                      EDTCDE(2)
000436021014     A                                      SPACEB(001)
000437021014     A            CEXT           4        62
000438021014     A                                      SPACEB(001)
000439021014     A            T1CPSL    R             68
000440021014     A            T00212        35         6
000441021014     A                                      SPACEB(001)
000442021014     A            T00214         9         6
000443021014     A                                      SPACEB(001)
000444021014     A            CITTA2        27        16
000445021014     A                                      SPACEB(001)
000446021014     A            A1FAM     R             67
000447021014     A                                      SPACEB(001)
000448021014     A            T00211A       30         6
000449021014     A                                      SPACEB(001)
000450021014     A*%%***********************************************************************
000451021014     A*%%SS
000452021014     A*%%CL 001
000453021014     A*%%CL 001
000454021014     A*%%CL 001
000455021014     A*%%CL 001
000456021014     A*%%CL 001
000457021014     A*%%CL 001
000458021014     A*%%CL 001
000459021014     A*%%CL 001
000460021014     A*%%CL 001
000461021014     A*%%CL 001
000462021014     A*%%CL 001
000463021014     A*%%***********************************************************************
000464021014     A*----------------------------------------------------------------------
000465021014     A*               L I S T E   D E   C O L I S A G E                     -
000466021014     A*----------------------------------------------------------------------
000467021014     A          R LIGNELC
000468021014     A*%%***********************************************************************
000469021014     A*%%RI 00000
000470021014     A*%%***********************************************************************
000471021014     A                                      SPACEB(001)
000472021014     A                                      CPI(15)
000473021014     A  27        IDCOLUM   R              4
000474021014     A                                      REFFLD(N1IDUM)
000475021014     A                                      SPACEB(001)
000476021014     A  28                                 2
000477021014     A                                      '*'
000478021014     A                                      HIGHLIGHT
000479021014     A  27        NATCOLUM       8        13
000480021014     A            ARTCOL    R             22
000481021014     A                                      REFFLD(N2ART)
000482021014     A            NBRUCCOL  R             43
000483021014     A                                      REFFLD(N2QUVC)
000484021014     A                                      EDTCDE(Z)
000485021014     A  27        PDSCOLUM  R             51
000486021014     A                                      REFFLD(N1PDSB)
000487021014     A                                      EDTCDE(4)
000488021014     A* 28                                  HIGHLIGHT
000489021014     A  27        HAUTCOLUM R             67
000490021014     A                                      REFFLD(N1HAUT)
000491021014     A                                      EDTCDE(Z)
000492021014     A* 28                                  HIGHLIGHT
000493021014     A  27                                +0
000494021014     A                                      '*'
000495021014     A  27        LARGCOLUM R             +0
000496021014     A                                      REFFLD(N1LARG)
000497021014     A                                      EDTCDE(Z)
000498021014     A* 28                                  HIGHLIGHT
000499021014     A  27                                +0
000500021014     A                                      '*'
000501021014     A  27        PROFCOLUM R             +0
000502021014     A                                      REFFLD(N1PROF)
000503021014     A                                      EDTCDE(Z)
000504021014     A* 28                                  HIGHLIGHT
000505021014     A  27        VOLCOLUM  R             60
000506021014     A                                      REFFLD(N1VOL)
000507021014     A*                                     EDTCDE(4)
000508021014     A* 28                                  HIGHLIGHT
000509021014     A            LOTART    R             79
000510021014     A                                      REFFLD(N2NLOT)
000511021014     A*%%***********************************************************************
000512021014     A*%%SS
000513021014     A*%%CL 001
000514021014     A*%%CP+999CRTPRTF
000515021014     A*%%CP+    CPI(15)
000516021014     A*%%CP+    OVRFLW(70)
000517021014     A*%%CP+    FILE(GEODEBA6/BONLIV)
000518021014     A*%%CP+    DEVTYPE(*SCS)
000519021014     A*%%CP     PAGESIZE(70       198      *N     )
000520021014     A*%%***********************************************************************
