000100011018 CONVFNMS:   PGM
000200000913             DCL        VAR(&SYSNAME) TYPE(*CHAR) LEN(8)
000300011018             DCL        VAR(&SOCIETA) TYPE(*CHAR) LEN(3)
000400000913             RTVNETA    SYSNAME(&SYSNAME)
000500000913
000600011018             CHGVAR     &SOCIETA VALUE(%SST(&SYSNAME 3 3))
000700011018             CALL       PGM(CONVFNMSR) PARM(&SOCIETA)
000800970607             ENDPGM
