000100020911     A*%%TS  SD  20020911  120759  EDPMM       REL-V4R4M0  5769-PW1
000200020911     A*%%EC
000300020911     A                                      DSPSIZ(24 80 *DS3)
000400020911     A                                      REF(*LIBL/CNDIZION)
000500020911     A                                      CHGINPDFT
000600020911     A                                      PRINT
000700020911     A*  91/11/11  11:37:35    EDPDB       REL-R03M00  5728-PW1
000800020911     A          R CNVNU01
000900020911     A*%%TS  SD  20020911  120759  EDPMM       REL-V4R4M0  5769-PW1
001000020911     A                                      CA03
001100020911     A                                      CF06
001200020911     A                                  1 28'* Conversione numeratori *'
001300020911     A                                      DSPATR(RI)
001400020911     A                                      DSPATR(UL)
001500020911     A                                  1 72DATE
001600020911     A                                      EDTCDE(Y)
001700020911     A            KNSIF         10A  O  2  2
001800020911     A            KNMUS         10A  O  2 13
001900020911     A                                  2 72TIME
002000020911     A                                 13 25'Numeratore........:'
002100020911     A            V1CNUM         3Y 0B 13 47
002200020911     A N41                                  DSPATR(CS)
002300020911     A N41                                  DSPATR(HI)
002400020911     A  41                                  DSPATR(RI)
002500020911     A  41                                  DSPATR(PC)
002600020911     A                                      EDTCDE(Z)
002700020911     A                                 24  2'F3=Fine Lavoro'
002800020911     A                                      DSPATR(HI)
002900020911     A                                 24 69'F6=Conferma'
003000020911     A                                      DSPATR(HI)
