000100071112     H DECEDIT('0,')
000200080325     ffnbrv07l  if   e           k disk
000300080630     d ora             s               z
000400080630     c                   time                    ora
000500080630     C                   dsply                   ora
000600020502     C                   SETON                                        LR
