000100000000     H DECEDIT('0,') DATEDIT(*DMY.)
000200000000     H*--------------------------------------------------------------*
000300061009     D kpjba         E DS
000400170612     D UT§DSE0f      E DS
000500170612     D cncr80        E DS
000600170612     C                   CALL      'X§PARUT'
000700170612     C                   PARM                    ut§dse0f
000800170612     c                   eval      cncr80=rec80
000900061006     C*
001000020502     C                   SETON                                        LR
