000100000000     H DECEDIT('0,') DATEDIT(*DMY.)
000200000000     F*--------------------------------------------------------------*
000300020802     D
000400160216     d Trul27ds1     e ds
000500160216     d Trulc7ds      e ds
000600980528     I***************************************************************
000700980528     c**
000800160216     c                   clear                   trul27ds1
000900160216     c                   clear                   trulc7ds
001000160216     c                   eval      i27lna=190
001100160216     c                   call      'TRUL27R1'
001200160216     c                   parm                    trul27ds1
001300160216     c*
001400160216     c                   eval      ic7tfie=o27fie
001500020322     C*
001600020322     C                   SETON                                        LR
