000100890907     A*---------------------------------------------------------------*
000200050103     A*  STORICO INV
000300890907     A*---------------------------------------------------------------*
000400050103     A          R FIINV000                  TEXT('STORICO INV')
000500050103      *
000600050103     A            INVLNM        10          TEXT('LIBRERIA NOME')
000700050124     A            INVLTX        50          TEXT('LIBRERIA TESTO')
000800050103     A            INVLUC        10          TEXT('LIBRERIA UTENTE CREAZIONE')
000900050103     A            INVONM        10          TEXT('OGGETTO NOME')
001000050103     A            INVOTI         8          TEXT('OGGETTO TIPO')
001100050103     A            INVOAT        10          TEXT('OGGETTO ATTRIBUTO')
001200050124     A            INVOTX        50          TEXT('OGGETTO TESTO')
001300050103     A            INVOUC        10          TEXT('OGGETTO UTENTE CREAZIONE')
