000100990504     H DEBUG DECEDIT('0,') DATEDIT(*DMY/)
000200060125      *****************************************************************
000300060125      *
000400060125      *****************************************************************
000500161104     Fftt_sav   IF   E             DISK    rename(ftt_sav:fttsav) prefix(x)
000600161104     Ffiftt00f  uf   E             DISK
000700030429     F*---------------------------------------------------------------------------------
000800000607     D kpjba         e ds
000900020205     c**********************************************************************
001000030429      *
001100161104     c     *start        setll     ftt_sav
001200161026     c                   do        *hival
001300161104     c                   read      ftt_sav
001400161104     c                   if        %eof(ftt_sav)
001500161026     c                   leave
001600161026     c                   endif
001700161104     c                   z-add     xnrrel        rek               9 0
001800161104     c     rek           chain     fiftt00f
001900161104     c                   if        %found(fiftt00f)
002000161104     c                   if        fttdft > 0
002100161104     c                   iter
002200161104     c                   endif
002300161104     c                   z-add     xfreimp       ftttim
002400161104     c                   update    fiftt000
002500161026     c                   endif
002600161026     c                   enddo
002700000607     c                   seton                                        lr
002800020205     C**-------------------------------------------------------------**
002900000607     c     *inzsr        begsr
003000060125     C**-------------------------------------------------------------**
003100000607     c     *entry        plist
003200020205     c                   parm                    kpjba
003300020402     c*
003400020402     c                   endsr
