000100040302      /TITLE Aggiorna TITAS31C TASFA2.
000200030711
000300030711     H DFTACTGRP(*NO) ACTGRP(*CALLER)
000400030711
000500130417     FTITAS30C  UF   E           K DISK
000600030711     F                                     USROPN
000700040302     F                                     COMMIT
000800030711
000900030711     D Eseguito        C                   '0'
001000030711     D Errore          C                   '1'
001100040302     D StornoTotale    C                   'S'
001200030711
001300030711     D KPJBA         E DS
001400040302
001500040302     ITITAS000      01
001600040302     ITITAS010      02
001700040302     ITITASP00      03
001800030711
001900030711     ***********************************************************************
002000030711     **?
002100030711     **?Main
002200030711     **?
002300030711     ***********************************************************************
002400030711     C     *ENTRY        PLIST
002500030711     C                   PARM                    KPJBA
002600030711
002700040302
002800130417     C                   OPEN      TITAS30C
002900040302
003000130417     C                   MOVE      2013          TASaas
003100130417     C     tasaas        SETLL     TITAS30C
003200040302
003300040302     C                   DO        *HIVAL
003400040302     C
003500040302     C                   EVAL      *IN01 = *OFF
003600040302     C                   EVAL      *IN02 = *OFF
003700040302     C                   EVAL      *IN03 = *OFF
003800130417     C     tasaas        READE     TITAS30C
003900040302     C
004000040302     C                   IF        %EOF
004100040302     C                   LEAVE
004200040302     C                   ENDIF
004300040302     C
004400040302     C                   ENDDO
004500040302
004600130417     C                   CLOSE     TITAS30C
004700030711
004800130417     c                   seton                                        lr
004900040302
005000030711     ***********************************************************************
005100030711     **?
005200030711     **?Operazioni iniziali.
005300030711     **?
005400030711     ***********************************************************************
005500030711     C     *INZSR        BEGSR
005600030711
005700030711
005800030711     C                   ENDSR
005900030711
