000100040120             PGM
000200080222
000300080321/* _____ Sposta i programmi dalla GAICUR001 alla OBJ ______________________________*/
000400080321             CALL       PGM(GAITRAOBJ/TNSYMVC) PARM('GAICUR001 ' +
000500080321                          'GAITRAOBJ' '*ALL     ')
000600040915             MONMSG     MSGID(CPF0000)
000700040907
000800040716             ENDPGM
