000100060111/*********************************************************************/
000200060317             pgm
000300060317
000301060414/* _____ Azioni e menù ______________________________________________*/
000302060414             call       pgm(XAMKCSE)
000900060331
001000060317             endpgm
