000100040120             PGM
000200081029
000300090225/* _____ Sposta i programmi dalla EDPWKSE alla OBJ ______________________________*/
000400090225             CALL       PGM(GAITRAOBJ/TNSYMVC) PARM('EDPWKSE   ' +
000500090225                          'GAITRAOBJ' '*ALL     ')
000600090225             MONMSG     MSGID(CPF0000)
000700081029
000800040716             ENDPGM
