000100091109/*********************************************************************/
000200091109             pgm
000300100304
000400110527/* _____ Azioni e menù ______________________________________________*/
000500110527             call       pgm(GAITRAOBJ/XAMKCSE)
000600110527             monmsg     msgid(CPF0000)
000700120531
000800091109             endpgm
