000100060317             pgm
000200070131
002800060428/* _____ Sposta i programmi dalla EDPWKSE alla OBJ __________________*/
002900060428             call       pgm(GAITRAOBJ/TNSYMVC) +
003000060428                        parm('EDPWKSE   ' 'GAITRAOBJ' '*ALL     ')
003200080502
003300060317             endpgm
