000100161117             pgm
000200161118
000300161117
000400170406/* _____ Sposta i programmi dalla EDPWKSE alla OBJ __________________*/
000500170406             call       pgm(GAITRAOBJ/TNSYMVC) +
000600170406                        parm('EDPWKSE   ' 'GAITRAOBJ' '*ALL     ')
000700170406
000800161117
000900170406             DLTPGM     PGM(GAICUR049/FNLS45R)
001000170406             monmsg cpf0000
001100170406             DLTPGM     PGM(GAICUR049/FNLSI4R)
001200170406             monmsg cpf0000
001300170406             DLTPGM     PGM(GAICUR049/FNLS65R)
001400170406             monmsg cpf0000
001500170406
001600170406             DLTPGM     PGM(GAICUR015/FNLR31R)
001700170406             monmsg cpf0000
001800170406
001900170406             DLTPGM     PGM(GAICUR001/FNLSU2R)
002000170406             monmsg cpf0000
002100170406             DLTPGM     PGM(GAICUR001/FNLG86R)
002200170406             monmsg cpf0000
002300170406             DLTPGM     PGM(GAICUR001/FNLG87R)
002400170406             monmsg cpf0000
002500170406             DLTF       FILE(GAICUR001/FNLG87D)
002600170406             monmsg cpf0000
002700170407
002800170407             DLTPGM     pgm(GAICUR001/FNLG10R)
002900170407             monmsg cpf0000
003000170407             DLTpgm     pgm(GAICUR001/FNLG14R)
003100170407             monmsg cpf0000
003200170407             DLTpgm     pgm(GAICUR001/FNLG15R)
003300170407             monmsg cpf0000
003400170407             DLTpgm     pgm(GAICUR001/FNLG31R)
003500170407             monmsg cpf0000
003600170407             DLTpgm     pgm(GAICUR001/FNLG9630R)
003700170407             monmsg cpf0000
003800170407             DLTF       FILE(GAICUR001/FNLG10D)
003900170407             monmsg cpf0000
004000170406
004100170406             DLTPGM     PGM(GAICUR028/FNLSU2R)
004200170406             monmsg cpf0000
004300170406             DLTPGM     PGM(GAICUR028/FNLS45R)
004400170406             monmsg cpf0000
004500170406             DLTPGM     PGM(GAICUR028/FIMS76R)
004600170406             monmsg cpf0000
004700170406             DLTPGM     PGM(GAICUR028/FNLR30R)
004800170406             monmsg cpf0000
004900170406             DLTPGM     PGM(GAICUR028/FNLR31R)
005000170406             monmsg cpf0000
005100170406             DLTPGM     PGM(GAICUR028/FNLGI1R)
005200170406             monmsg cpf0000
005300170406             DLTPGM     PGM(GAICUR028/FNLG86R)
005400170406             monmsg cpf0000
005500170406             DLTPGM     PGM(GAICUR028/FNLG87R)
005600170406             monmsg cpf0000
005700170406             DLTF       FILE(GAICUR028/FNLG87D)
005800170406             monmsg cpf0000
005900161118
006000170406             DLTPGM     PGM(GAICUR006/FNLSU2R)
006100170406             monmsg cpf0000
006200170406             DLTPGM     PGM(GAICUR006/FNLS45R)
006300170406             monmsg cpf0000
006400170406             DLTPGM     PGM(GAICUR006/FIMS76R)
006500170406             monmsg cpf0000
006600170406             DLTPGM     PGM(GAICUR006/FNLR30R)
006700170406             monmsg cpf0000
006800170406             DLTPGM     PGM(GAICUR006/FNLR31R)
006900170406             monmsg cpf0000
007000170406             DLTPGM     PGM(GAICUR006/FNLG86R)
007100170406             monmsg cpf0000
007200170406             DLTPGM     PGM(GAICUR006/FNLG87R)
007300170406             monmsg cpf0000
007400170406             DLTF       FILE(GAICUR006/FNLG87D)
007500170406             monmsg cpf0000
007600170406             DLTPGM     PGM(GAICUR006/FNLGI1R)
007700170406             monmsg cpf0000
007800170406
007900170406             DLTF       FILE(GAICUR166/FNLSW1D)
008000170406             monmsg cpf0000
008100170406             DLTPGM     PGM(GAICUR166/FNLSW2R)
008200170406             monmsg cpf0000
008300170406             DLTPGM     PGM(GAICUR166/FNLSW1R)
008400170406             monmsg cpf0000
008500170406
008600170406
008700170406/* _____ Elimino pgm e file ORM __001_____________*/
008800170406             DLTPGM     PGM(GAICUR001/FIOR05R)
008900170406             monmsg cpf0000
009000170406             DLTPGM     PGM(GAICUR001/FIOR07R)
009100170406             monmsg cpf0000
009200170406             DLTPGM     PGM(GAICUR001/FIOR18R)
009300170406             monmsg cpf0000
009400170406             DLTPGM     PGM(GAICUR001/FIOR20R)
009500170406             monmsg cpf0000
009600170406             DLTPGM     PGM(GAICUR001/FIOR25R)
009700170406             monmsg cpf0000
009800170406             DLTPGM     PGM(GAICUR001/FIOR56R)
009900170406             monmsg cpf0000
010000170406             DLTPGM     PGM(GAICUR001/FIOR60R)
010100170406             monmsg cpf0000
010200170406             DLTPGM     PGM(GAICUR001/FIOR62R)
010300170406             monmsg cpf0000
010400170406             DLTPGM     PGM(GAICUR001/FIOR63R)
010500170406             monmsg cpf0000
010600170406             DLTPGM     PGM(GAICUR001/FIOR68R)
010700170406             monmsg cpf0000
010800170406             DLTPGM     PGM(GAICUR001/FIOR69R)
010900170406             monmsg cpf0000
011000170406             DLTPGM     PGM(GAICUR001/FIOR72R)
011100170406             monmsg cpf0000
011200170406             DLTPGM     PGM(GAICUR001/FIOR97R)
011300170406             monmsg cpf0000
011400170406             DLTF       FILE(GAICUR001/FIOR05D)
011500170406             monmsg cpf0000
011600170406             DLTF       FILE(GAICUR001/FIOR07D)
011700170406             monmsg cpf0000
011800170406             DLTF       FILE(GAICUR001/FIOR20D)
011900170406             monmsg cpf0000
012000170406             DLTF       FILE(GAICUR001/FIOR25D)
012100170406             monmsg cpf0000
012200170406             DLTF       FILE(GAICUR001/FIOR60D)
012300170406             monmsg cpf0000
012400170406             DLTF       FILE(GAICUR001/FIOR62D)
012500170406             monmsg cpf0000
012600170406
012700170406
012800170406/* _____ Elimino pgm e file ORM __006_____________*/
012900170406             DLTPGM     PGM(GAICUR006/FIOR05R)
013000170406             monmsg cpf0000
013100170406             DLTPGM     PGM(GAICUR006/FIOR07R)
013200170406             monmsg cpf0000
013300170406             DLTPGM     PGM(GAICUR006/FIOR18R)
013400170406             monmsg cpf0000
013500170406             DLTPGM     PGM(GAICUR006/FIOR20R)
013600170406             monmsg cpf0000
013700170406             DLTPGM     PGM(GAICUR006/FIOR25R)
013800170406             monmsg cpf0000
013900170406             DLTPGM     PGM(GAICUR006/FIOR56R)
014000170406             monmsg cpf0000
014100170406             DLTPGM     PGM(GAICUR006/FIOR60R)
014200170406             monmsg cpf0000
014300170406             DLTPGM     PGM(GAICUR006/FIOR62R)
014400170406             monmsg cpf0000
014500170406             DLTPGM     PGM(GAICUR006/FIOR63R)
014600170406             monmsg cpf0000
014700170406             DLTPGM     PGM(GAICUR006/FIOR68R)
014800170406             monmsg cpf0000
014900170406             DLTPGM     PGM(GAICUR006/FIOR69R)
015000170406             monmsg cpf0000
015100170406             DLTPGM     PGM(GAICUR006/FIOR72R)
015200170406             monmsg cpf0000
015300170406             DLTPGM     PGM(GAICUR006/FIOR97R)
015400170406             monmsg cpf0000
015500170406             DLTF       FILE(GAICUR006/FIOR05D)
015600170406             monmsg cpf0000
015700170406             DLTF       FILE(GAICUR006/FIOR07D)
015800170406             monmsg cpf0000
015900170406             DLTF       FILE(GAICUR006/FIOR20D)
016000170406             monmsg cpf0000
016100170406             DLTF       FILE(GAICUR006/FIOR25D)
016200170406             monmsg cpf0000
016300170406             DLTF       FILE(GAICUR006/FIOR60D)
016400170406             monmsg cpf0000
016500170406             DLTF       FILE(GAICUR006/FIOR62D)
016600170406             monmsg cpf0000
016700170406
016800170406
016900170406/* _____ Elimino pgm e file ORM __028_____________*/
017000170406             DLTPGM     PGM(GAICUR028/FIOR05R)
017100170406             monmsg cpf0000
017200170406             DLTPGM     PGM(GAICUR028/FIOR07R)
017300170406             monmsg cpf0000
017400170406             DLTPGM     PGM(GAICUR028/FIOR18R)
017500170406             monmsg cpf0000
017600170406             DLTPGM     PGM(GAICUR028/FIOR20R)
017700170406             monmsg cpf0000
017800170406             DLTPGM     PGM(GAICUR028/FIOR25R)
017900170406             monmsg cpf0000
018000170406             DLTPGM     PGM(GAICUR028/FIOR56R)
018100170406             monmsg cpf0000
018200170406             DLTPGM     PGM(GAICUR028/FIOR60R)
018300170406             monmsg cpf0000
018400170406             DLTPGM     PGM(GAICUR028/FIOR62R)
018500170406             monmsg cpf0000
018600170406             DLTPGM     PGM(GAICUR028/FIOR63R)
018700170406             monmsg cpf0000
018800170406             DLTPGM     PGM(GAICUR028/FIOR68R)
018900170406             monmsg cpf0000
019000170406             DLTPGM     PGM(GAICUR028/FIOR69R)
019100170406             monmsg cpf0000
019200170406             DLTPGM     PGM(GAICUR028/FIOR72R)
019300170406             monmsg cpf0000
019400170406             DLTPGM     PGM(GAICUR028/FIOR97R)
019500170406             monmsg cpf0000
019600170406             DLTF       FILE(GAICUR028/FIOR05D)
019700170406             monmsg cpf0000
019800170406             DLTF       FILE(GAICUR028/FIOR07D)
019900170406             monmsg cpf0000
020000170406             DLTF       FILE(GAICUR028/FIOR20D)
020100170406             monmsg cpf0000
020200170406             DLTF       FILE(GAICUR028/FIOR25D)
020300170406             monmsg cpf0000
020400170406             DLTF       FILE(GAICUR028/FIOR60D)
020500170406             monmsg cpf0000
020600170406             DLTF       FILE(GAICUR028/FIOR62D)
020700170406             monmsg cpf0000
020800170406
020900161117             endpgm
