000100161117             pgm
000200161118
000300161117
000900161117
001000170505/*______ Spostamento file fnfta00F da filtra201 a unitragru ___ */
001001170505             MOVOBJ     OBJ(FILTRA201/FNFTA00F) OBJTYPE(*FILE) +
001002170505                          TOLIB(UNITRAGRU)
001003170505             MONMSG     MSGID(CPF0000)
001015170120
005300161118
005400161117             endpgm
