000100981116     H
000200981116     F*+----------------------------------------------------------*
000300981116     F*- RELEASE PROJ  CAMBIO I CAPICONTO   IN PARUT              *
000500981116     F*-----------------------------------------------------------*
000600981116     FPARUT00FUF  E           K        DISK
000700981116     E                    KCU        50  4 0
000829981116     IPARDS     E DSPARUT00F
000837981116     I                                    P  14 163 KCU
000838981116     C                     Z-ADD1         CDUT    10
000900981116     C                     Z-ADD20        TIPO    20
001000981116     C           KEY       CHAINPARUT                70
001100981116     C  N70                DO
001102981116      *CLIENTI
001103981116     C                     Z-ADD151       KCU,1
001107981116     C                     Z-ADD151       KCU,2
001108981116      *FORNITORI
001111981116     C                     Z-ADD400       KCU,3
001115981116     C                     Z-ADD400       KCU,4
001116981116      *BANCHE
001119981116     C                     Z-ADD201       KCU,7
001120981116      *VUOTI
001123981116     C                     Z-ADD0         KCU,8
001125981116     C                     Z-ADD0         KCU,9
001126981116      *IVA
001127981116     C                     Z-ADD440       KCU,10
001128981116      *CASSA
001129981116     C                     Z-ADD207       KCU,11
001130981116      *RAGGR
001131981116     C                     Z-ADD0         KCU,12
001132981116      *RAGGR
001133981116     C                     Z-ADD0         KCU,13
001134981116      *RAGGR
001135981116     C                     Z-ADD0         KCU,14
001136981116      *RAGGR
001137981116     C                     Z-ADD0         KCU,15
001138981116      *C.D.C
001139981116     C                     Z-ADD9000      KCU,16
001140981116      *VUOTO
001141981116     C                     Z-ADD0         KCU,17
001142981116      *VUOTO
001143981116     C                     Z-ADD0         KCU,18
001144981116      *VUOTO
001145981116     C                     Z-ADD0         KCU,20
001146981116      *VUOTO
001147981116     C                     Z-ADD0         KCU,21
001148981116      *VUOTO
001149981116     C                     Z-ADD0         KCU,22
001150981116      *VUOTO
001151981116     C                     Z-ADD0         KCU,23
001152981116      *VUOTO
001153981116     C                     Z-ADD0         KCU,24
001154981116      *VUOTO
001155981116     C                     Z-ADD0         KCU,25
001156981116      *VUOTO
001157981116     C                     Z-ADD0         KCU,26
001158981116      *VUOTO
001159981116     C                     Z-ADD0         KCU,27
001160981116      *VUOTO
001161981116     C                     Z-ADD0         KCU,28
001162981116      *VUOTO
001163981116     C                     Z-ADD0         KCU,29
001300981116     C                     UPDATPARUT
001301981116     C                     ENDDO
001302981116      *
001303981116     C                     SETON                     LR
001304981116      *
001400981116     C           KEY       KLIST
001500981116     C                     KFLD           CDUT
001600981116     C                     KFLD           TIPO
