000100000000     A*--------------------------------------------------------------*
000200090623     A* TARIFFE 950 IT
000300000000     A*--------------------------------------------------------------*
000400090623     A          R TAR                       TEXT('TARIFFE')
000500090623     A            KSC            7S 0
000600090623     A            CTR            3S 0
000700090623     A            PRG            3S 0
