000100920124 FLFS01C:    PGM        PARM(&KPJBA)
000200030609
000300030609             DCL        VAR(&KPJBA)    TYPE(*CHAR)  LEN(502)
000400091023             DCL        VAR(&DBLP)    TYPE(*CHAR)  LEN(816)
000500010810             DCL        VAR(&DTASV)   TYPE(*CHAR)  LEN(160)
000600030609             DCL        VAR(&FLAG) TYPE(*CHAR) LEN(1)  +
000700030610                          /* P = Prepagati */
000800030609
000900030609 /* IMPOSTO LA RICHIESTA DELLE STAMPANTI  */
001000030610             DCL        VAR(&TRUL90DS) TYPE(*CHAR) LEN(186) VALUE('SS') +
001100030609                      /* Imposto richiesta stampante ETICHETTE e LDV */
001200030610             DCL        VAR(&D90F3) TYPE(*CHAR) LEN(1) VALUE(' ') +
001300030609                      /* Torna con F3 */
001400920124
001500030609             DCL        VAR(&MODBOL4) TYPE(*CHAR) LEN(10) +
001600030610                          /*  Modulo LDV A4 X Laser */
001700030609             DCL        VAR(&MODBOL5) TYPE(*CHAR) LEN(10) +
001800030610                          /*  Modulo LDV A5 X Laser */
001900030609             DCL        VAR(&MODETI) TYPE(*CHAR) LEN(10) +
002000030610                          /*  Modulo ETICHETTE */
002100920124
002200030609             DCL        VAR(&VIDPRB4) TYPE(*CHAR) LEN(10) +
002300030610                          /*  Stampante LDV A4 */
002400030609             DCL        VAR(&VIDPRB5) TYPE(*CHAR) LEN(10) +
002500030610                          /*  Stampante LDV A5 */
002600030609             DCL        VAR(&VIDPRE) TYPE(*CHAR) LEN(10) +
002700030610                          /*  Stampante ETICHETTE */
002800940928
002900080709             DCL        VAR(&usrdta) TYPE(*CHAR) LEN(10) +
003000080709                          /*  dati utente  */
003100080709
003200921006/* RICHIAMO PGM SCELTA STAMPANTI                */
003300030610             CALL       PGM(TRUL90R) PARM(&KPJBA &TRUL90DS)
003400940928
003500030610             CHGVAR     VAR(&D90F3)   VALUE(%SST(&TRUL90DS 85  1))
003600940928
003700921006/* CMD3 - FINE LAVORO                           */
003800030610             IF         COND(&D90F3 *EQ '1') THEN(GOTO CMDLBL(ENDF))
003900921006
004000030610             CHGVAR     VAR(&MODBOL4) VALUE(%SST(&TRUL90DS 127 10))
004100030610             CHGVAR     VAR(&MODBOL5) VALUE(%SST(&TRUL90DS 137 10))
004200030610             CHGVAR     VAR(&MODETI) VALUE(%SST(&TRUL90DS  5 10))
004300030611             CHGVAR     VAR(&VIDPRB4) VALUE(%SST(&TRUL90DS 158 10))
004400030611             CHGVAR     VAR(&VIDPRB5) VALUE(%SST(&TRUL90DS 168 10))
004500030610             CHGVAR     VAR(&VIDPRE) VALUE(%SST(&TRUL90DS 55 10))
004600920124
004700920124/* APERTURA FILES CONDIVISI DAI PGM RICHIAMATI  */
004800920124             OVRDBF     FILE(CNACO00F) RCDFMTLCK((CNACO000 *SHRRD)) +
004900920124                          SHARE(*YES)
005000920124             OPNDBF     FILE(CNACO00F) OPTION(*ALL)
005100941110             OVRDBF     FILE(TNTAM01L) RCDFMTLCK((TNTAM000 *SHRRD)) +
005200941110                          SHARE(*YES)
005300941110             OPNDBF     FILE(TNTAM01L) OPTION(*ALL)
005400920124             OVRDBF     FILE(AZORG01L) RCDFMTLCK((AZORG *SHRRD)) +
005500920124                          SHARE(*YES)
005600920124             OPNDBF     FILE(AZORG01L) OPTION(*ALL)
005700920124             OVRDBF     FILE(TABEL00F) SHARE(*YES)
005800920124             OPNDBF     FILE(TABEL00F) OPTION(*ALL)
005900020917             OVRDBF     FILE(FIVAD01L) SHARE(*YES)
006000020917             OPNDBF     FILE(FIVAD01L) OPTION(*ALL)
006100930205             MONMSG     MSGID(CPF4125)
006200921006
006300030609/* FILE DI STAMPA  */
006400990702             CHGVAR     VAR(&FLAG) VALUE(%SST(&KPJBA 502 1))
006500080709
006600030625   /* NON PREPAGATI */
006700030625             IF         COND(&FLAG *NE 'P') THEN(DO)
006800080709             CHGVAR     VAR(&usrdta) VALUE('Bolle__A4')
006900080709             enddo
007000080709             ELSE       CMD(DO)
007100080709             CHGVAR     VAR(&usrdta) VALUE('Prepag_A4')
007200080709             enddo
007300030625
007400030609             OVRPRTF    FILE(FNLSB5PA4) OUTQ(&VIDPRB4) +
007500080709                          FORMTYPE(&MODBOL4) USRDTA(&usrdta) +
007600030609                          SHARE(*YES)
007700080709
007800080709             CHGVAR     VAR(%sst(&usrdta 9 1)) VALUE('5')
007900030609             OVRPRTF    FILE(FNLSB5PA5) OUTQ(&VIDPRB5) +
008000080709                          FORMTYPE(&MODBOL5) USRDTA(&usrdta) +
008100030609                          SHARE(*YES)
008200910305
008300941221             OVRPRTF    FILE(FNLV22P) OUTQ(&VIDPRE) +
008400941010                          FORMTYPE(&MODETI) USRDTA('Segnacolli') +
008500941010                          SHARE(*YES)
008600921006
008700010810/* IMPOSTO IN DBLP FLG PROVENIENZA=' ' PER INDICARE CHE NON E'     */
008800940930/*   RICHIAMATO DA NESSUNO                                         */
008900010810             CHGVAR     VAR(%SST(&DBLP 1 1))  VALUE(' ')
009000940930
009100030610             CALL       PGM(FNLS01R) PARM(&KPJBA &DBLP &DTASV +
009200030610                          &TRUL90DS)
009300940930
009400900924             RCLRSC     LVL(*CALLER)
009500900925             DLTOVR     FILE(*ALL)
009600910305ENDF:        ENDPGM
