000100011001     H DECEDIT('0,')
000200011001     FQsysprt   O    F  132        printer
000300981229     C**
000400011001     C                   DO        2000
000500011001     c                   except    stampa
000600011001     c                   enddo
000700011001     C**
000800011001     C                   SETON                                        LR
000900011001     OQsysPrt   E            stampa           03
001000011001     O                                            1 '*'
001100011001     O          E            STAMPA      1
001200011001     O                                            2 '*'
001300011001     O          E            STAMPA      1
001400011001     O                                            3 '*'
001401011002     O          E            STAMPA      1
001402011002     O                                            4 '*'
001403011002     O          E            STAMPA      1
001404011002     O                                            5 '*'
001405011002     O          E            STAMPA      1
001406011002     O                                            6 '*'
001407011002     O          E            STAMPA      1
001408011002     O                                            7 '*'
001409011002     O          E            STAMPA      1
001410011002     O                                            8 '*'
001411011002     O          E            STAMPA      1
001412011002     O                                            9 '*'
001413011002     O          E            STAMPA      1
001414011002     O                                           10 '*'
001415011002     O          E            STAMPA      1
001416011002     O                                           11 '*'
001417011002     O          E            STAMPA      1
001418011002     O                                           12 '*'
001419011002     O          E            STAMPA      1
001420011002     O                                           13 '*'
001421011002     O          E            STAMPA      1
001422011002     O                                           14 '*'
001423011002     O          E            STAMPA      1
001424011002     O                                           15 '*'
001425011002     O          E            STAMPA      1
001426011002     O                                           16 '*'
001427011002     O          E            STAMPA      1
001428011002     O                                           17 '*'
001429011002     O          E            STAMPA      1
001430011002     O                                           18 '*'
001431011002     O          E            STAMPA      1
001432011002     O                                           19 '*'
001433011002     O          E            STAMPA      1
001434011002     O                                           20 '*'
001435011002     O          E            STAMPA      1
001436011002     O                                           21 '*'
001437011002     O          E            STAMPA      1
001438011002     O                                           22 '*'
001439011002     O          E            STAMPA      1
001440011002     O                                           23 '*'
001441011002     O          E            STAMPA      1
001442011002     O                                           24 '*'
001443011002     O          E            STAMPA      1
001444011002     O                                           25 '*'
001445011002     O          E            STAMPA      1
001446011002     O                                           26 '*'
001447011002     O          E            STAMPA      1
001448011002     O                                           27 '*'
001449011002     O          E            STAMPA      1
001450011002     O                                           28 '*'
001451011002     O          E            STAMPA      1
001452011002     O                                           29 '*'
001453011002     O          E            STAMPA      1
001454011002     O                                           30 '*'
001455011002     O          E            STAMPA      1
001456011002     O                                           31 '*'
001500011001     O          E            STAMPA      1
001600011002     O                                           75 'A N N U L L A T O '
001700011001     O          E            STAMPA      1
001800011002     O                                          101 '*'
001900011002     O          E            STAMPA      1
002000011002     O                                          102 '*'
002100011002     O          E            STAMPA      1
002200011002     O                                          103 '*'
002300011002     O          E            STAMPA      1
002400011002     O                                          104 '*'
002500011002     O          E            STAMPA      1
002600011002     O                                          105 '*'
002700011002     O          E            STAMPA      1
002800011002     O                                          106 '*'
002900011002     O          E            STAMPA      1
003000011002     O                                          107 '*'
003100011002     O          E            STAMPA      1
003200011002     O                                          108 '*'
003300011002     O          E            STAMPA      1
003400011002     O                                          109 '*'
003500011002     O          E            STAMPA      1
003600011002     O                                          110 '*'
003700011002     O          E            STAMPA      1
003800011002     O                                          111 '*'
003900011002     O          E            STAMPA      1
004000011002     O                                          112 '*'
004100011002     O          E            STAMPA      1
004200011002     O                                          113 '*'
004300011002     O          E            STAMPA      1
004400011002     O                                          114 '*'
004500011002     O          E            STAMPA      1
004600011002     O                                          115 '*'
004700011002     O          E            STAMPA      1
004800011002     O                                          116 '*'
004900011002     O          E            STAMPA      1
005000011002     O                                          117 '*'
005100011002     O          E            STAMPA      1
005200011002     O                                          118 '*'
005300011002     O          E            STAMPA      1
005400011002     O                                          119 '*'
005500011002     O          E            STAMPA      1
005600011002     O                                          120 '*'
005700011002     O          E            STAMPA      1
005800011002     O                                          121 '*'
005900011002     O          E            STAMPA      1
006000011002     O                                          122 '*'
006100011002     O          E            STAMPA      1
006200011002     O                                          123 '*'
006300011002     O          E            STAMPA      1
006400011002     O                                          124 '*'
006500011002     O          E            STAMPA      1
006600011002     O                                          125 '*'
006700011002     O          E            STAMPA      1
006800011002     O                                          126 '*'
006900011002     O          E            STAMPA      1
007000011002     O                                          127 '*'
007100011002     O          E            STAMPA      1
007200011002     O                                          128 '*'
007300011002     O          E            STAMPA      1
007400011002     O                                          129 '*'
007500011002     O          E            STAMPA      1
007600011002     O                                          130 '*'
007700011002     O          E            STAMPA      1
007800011002     O                                          131 '*'
007900011002     O          E            STAMPA      1
008000011002     O                                          132 '*'
