000100040302             PGM        PARM(&LIBP &LIBA)
000200011116
000300031028             DCL        VAR(&LIBP) TYPE(*CHAR) LEN(10) /* LIBRERIA +
000400031028                          FILE DA INSTALLARE */
000500031028             DCL        VAR(&LIBA) TYPE(*CHAR) LEN(10) /* LIBRERIA +
000600031028                          IN CUI INSTALLARE */
000700040302             DCL        VAR(&PO) TYPE(*CHAR) LEN(3)
000800031028             DCL        VAR(&NOMEA_F) TYPE(*CHAR) LEN(10)
000900031028             DCL        VAR(&NOMEA_L) TYPE(*CHAR) LEN(10)
001000031028             DCL        VAR(&NOMEB_F) TYPE(*CHAR) LEN(10)
001100031028             DCL        VAR(&NOMEB_L) TYPE(*CHAR) LEN(10)
001200011116
001300040302             DCLF       FILE(QSYS/QADSPOBJ)
001400040302
001500040302             DSPOBJD    OBJ(&LIBA/FLTR6*) OBJTYPE(*FILE) +
001600040302                          OUTPUT(*OUTFILE) OUTFILE(QTEMP/§§FLTR6)
001700040302             OVRDBF     FILE(QADSPOBJ) TOFILE(QTEMP/§§FLTR6)
001800040302
001900040302             DLTF       FILE(&LIBA/FLTR6*)
002000040302
002100040302READ:
002200040302             RCVF
002300040302             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDF))
002400040302
002500040302             IF         COND(&ODOBNM = 'FLTR600F') THEN(GOTO +
002600040302                          CMDLBL(READ))
002700040303             IF         COND(%SST(&ODOBNM 6 1) = 'B') THEN(GOTO +
002800040303                          CMDLBL(READ))
002900040303             IF         COND(&ODOBAT = 'LF      ') THEN(GOTO +
003000040302                          CMDLBL(READ))
003100040302
003200040302/* ----------------------------------------------------------------- */
003300040302             CHGVAR     VAR(&PO) VALUE(%SST(&ODOBNM 7 3))
003400040302             CHGVAR     VAR(&NOMEA_F) VALUE('FLTR6A' *CAT &PO *CAT 'F')
003500040302             CHGVAR     VAR(&NOMEA_L) VALUE('FLTR6A' *CAT &PO *CAT 'L')
003600040302             CHGVAR     VAR(&NOMEB_F) VALUE('FLTR6B' *CAT &PO *CAT 'F')
003700040302             CHGVAR     VAR(&NOMEB_L) VALUE('FLTR6B' *CAT &PO *CAT 'L')
003800031028
003900031028             RNMOBJ     OBJ(&LIBP/FLTR600F) OBJTYPE(*FILE) +
004000031028                          NEWOBJ(&NOMEA_F)
004100031028             RNMOBJ     OBJ(&LIBP/FLTR601L) OBJTYPE(*FILE) +
004200031028                          NEWOBJ(&NOMEA_L)
004300031028
004400031028             CRTDUPOBJ  OBJ(FLTR6A*) FROMLIB(&LIBP) OBJTYPE(*FILE) +
004500031028                          TOLIB(&LIBA)
004600031028
004700031028             RNMOBJ     OBJ(&LIBP/&NOMEA_F) OBJTYPE(*FILE) +
004800031028                          NEWOBJ(&NOMEB_F)
004900031028             RNMOBJ     OBJ(&LIBP/&NOMEA_L) OBJTYPE(*FILE) +
005000031028                          NEWOBJ(&NOMEB_L)
005100031028
005200031028             CRTDUPOBJ  OBJ(FLTR6B*) FROMLIB(&LIBP) OBJTYPE(*FILE) +
005300031028                          TOLIB(&LIBA)
005400040302
005500040302             RNMOBJ     OBJ(&LIBP/&NOMEB_F) OBJTYPE(*FILE) +
005600040302                          NEWOBJ(FLTR600F)
005700040302             RNMOBJ     OBJ(&LIBP/&NOMEB_L) OBJTYPE(*FILE) +
005800040302                          NEWOBJ(FLTR601L)
005900040302
006000040302             GOTO       CMDLBL(READ)
006100040302/* --------------------------------------------------------------- */
006200040302endf:
006300040302             CRTDUPOBJ  OBJ(FLTR60*) FROMLIB(&LIBP) OBJTYPE(*FILE) +
006400040302                          TOLIB(&LIBA)
006500040302
006600010802
006700990129             ENDPGM
