000010030314     A*%%TS  SD  20030314  143612  EDPAB       REL-V4R4M0  5769-PW1
000020030314     A*%%EC
000030030314     A                                      DSPSIZ(24 80 *DS3)
000040030314     A                                      CHGINPDFT
000050030314     A                                      PRINT
000060030314     A                                      MSGALARM
000070030314     A                                      INDARA
000080030314     A                                      ERRSFL
000090030314     A                                      CA03
000100030314     A                                      CF06
000110030314     A          R TNVRAB8
000120030314     A*%%TS  SD  20030314  143612  EDPAB       REL-V4R4M0  5769-PW1
000130030314     A                                  1  4'- TNVRAB8R -'
000140030314     A                                      DSPATR(RI)
000150030314     A                                  1 21' Chiude Bolle DPD senza data Conse-
000160030314     A                                      gna '
000170030314     A                                      DSPATR(RI)
000180030314     A                                      DSPATR(UL)
000190030314     A                                  1 61DATE
000200030314     A                                      EDTCDE(Y)
000210030314     A                                  2 21'     e con un solo evento MIC     -
000220030314     A                                          '
000230030314     A                                      DSPATR(RI)
000240030314     A                                      DSPATR(UL)
000250030314     A                                  2 61TIME
000260030314     A                                  9 21'Bolle del Periodo:'
000270030314     A                                 11 23'Anno'
000280030314     A            D8ANNO         4Y 0B 11 32EDTCDE(Z)
000290030314     A                                      DSPATR(HI)
000300030314     A                                 12 23'Da MMGG'
000310030314     A            D8DMG          4Y 0B 12 32EDTWRD('  /  ')
000320030314     A                                      DSPATR(HI)
000330030314     A                                 13 23'A  MMGG'
000340030314     A            D8AMG          4Y 0B 13 32EDTWRD('  /  ')
000350030314     A                                      DSPATR(HI)
000360030314     A            SQLR1         75   O 17  4
000370030314     A            SQLR2         75   O 18  4
000380030314     A            SQLR3         75   O 19  4
000390030314     A            SQLR4         75   O 20  4
000400030314     A                                 22  4'F3 - Fine'
000410030314     A                                 22 36'F6 - Esegue'
