000100020312             PGM
000200020312
000300020313             OVRPRTF    FILE(PRTF198) OUTQ(QPRINTS) +
000400020313                          HOLD(*YES) SAVE(*YES) USRDTA('AG-Visite')
000500020306
000600020313             CALL       PGM(edpwk/TNVR23R3)
000700020117
000800020117             DLTOVR     FILE(*ALL)
000900020307
001000020312             ENDPGM
