000100980612     A*------------------------------------------------------------------------*
000200980612     A                                      DSPSIZ(24 80 *DS3)
000300980612     A                                      CHGINPDFT(HI CS)
000400980612     A                                      PRINT
000500980612     A                                      CF01
000600980612     A                                      CF02
000700980612     A                                      CF03
000800980612     A                                      CF04
000900980612     A                                      CF05
001000980612     A                                      CF06
001100980612     A                                      CF07
001200980612     A                                      CF08
001300980612     A                                      CF09
001400980612     A                                      CF10
001500980612     A                                      CF11
001600980612     A                                      CF12
001700980612     A                                      CF13
001800980612     A                                      CF14
001900980612     A                                      CF15
002000980612     A                                      CF16
002100980612     A                                      CF17
002200980612     A                                      CF18
002300980612     A                                      CF19
002400980612     A                                      CF20
002500980612     A                                      CF21
002600980612     A                                      CF22
002700980612     A                                      CF23
002800980612     A                                      CF24
002900980612     A                                      ROLLUP(97)
003000980612     A                                      ROLLDOWN(97)
003100980612     A                                      HELP
003200980612     A*------------------------------------------------------------------------*
003300980612     A          R VR96DVT
003400980612     A            DSFIRS        20A  O  1  2
003500980612     A                                  1 32'* ALLINEA SINONIMI *'
003600980612     A                                      DSPATR(RI)
003700980612     A                                      DSPATR(UL)
003800980612     A                                  1 63'TNVR96R'
003900980612     A                                  1 72DATE
004000980612     A                                      EDTCDE(Y)
004100980612     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004200980612     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004300980612     A                                  2 72TIME
004400980612     A*------------------------------------------------------------------------*
004500980612     A          R VR96DVF
004600980612     A                                      OVERLAY
004700980612     A            VFD001        19A  O 22  2
004800980612     A            VFD002        19A  O 22 22
004900980612     A            VFD003        19A  O 22 42
005000980612     A            VFD004        19A  O 22 62
005100980612     A            VFD005        19A  O 23  2
005200980612     A            VFD006        19A  O 23 22
005300980612     A            VFD007        19A  O 23 42
005400980612     A            VFD008        19A  O 23 62
005500980612     A*------------------------------------------------------------------------*
005600980612     A          R VR96DV1
005700980612     A                                      OVERLAY
005800980612     A                                  5  2'TIPO LANCIO'
005900980612     A                                      DSPATR(HI)
006000980612     A                                  6  2'1] Bartolini -> Sdi'
006100980612     A                                  7  2'2] Sdi -> Bartolini .........:'
006200980612     A            V1CSEN         1A  B  7 34
006300980612     A N60                                  DSPATR(HI)
006400980612     A  60                                  DSPATR(RI)
006500980612     A  60                                  DSPATR(PC)
006600980612     A                                  7 37'(1/2)'
006700980612     A                                  9  2'SELEZIONI'
006800980612     A                                      DSPATR(HI)
006900980612     A                                 10  2'Versione cappario ...........:'
007000980612     A            V1CVER    R     Y  B 10 34REFFLD(CPCVER AZCPC00F)
007100980612     A N61                                  DSPATR(HI)
007200980612     A  61                                  DSPATR(RI)
007300980612     A  61                                  DSPATR(PC)
007400980612     A                                      CHECK(RB)
007500980612     A                                      EDTCDE(Z)
007600980612     A*------------------------------------------------------------------------*
007700980612     A          R VR96DVM                   SFL
007800980612     A                                      SFLMSGRCD(24)
007900980612     A            VMCKEY                    SFLMSGKEY
008000980612     A            VMCQUE                    SFLPGMQ
008100980612     A*------------------------------------------------------------------------*
008200980612     A          R VR96DVK                   SFLCTL(VR96DVM)
008300980612     A                                      OVERLAY
008400980612     A                                      SFLDSP
008500980612     A  40                                  SFLCLR
008600980612     A  44                                  SFLEND
008700980612     A                                      SFLSIZ(0002)
008800980612     A                                      SFLPAG(0001)
