000001171130     A*%%***********************************************************************
000002171130     A*%%TS  RD  20171130  084359  EDPMB       REL-V7R2M0  5770-WDS
000003171130     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004171130     A*%%FI       0000000000000000000000000000000000000000000000000
000005171130     A*%%***********************************************************************
000006171130      **************************************************************************
000007171130      *  CONTROLLO ORM SPOSTAMENTO DATA RITIRO
000008171130      **************************************************************************
000009171130     A          R MB5801P
000010171130     A*%%***********************************************************************
000011171130     A*%%RI 00000
000012171130     A*%%***********************************************************************
000013171130     A                                      SKIPB(001)
000014171130     A                                    45
000015171130     A                                      'ANTICIPO DATA RITIRO'
000016171130     A                                      HIGHLIGHT
000017171130     A                                      UNDERLINE
000018171130     A                                   107
000019171130     A                                      'PAG.'
000020171130     A                                   112
000021171130     A                                      PAGNBR
000022171130     A                                      EDTCDE(Z)
000023171130     A*%%***********************************************************************
000024171130     A*%%SS
000025171130     A*%%***********************************************************************
000026171130     A          R MB5802P
000027171130     A*%%***********************************************************************
000028171130     A*%%RI 00000
000029171130     A*%%FS 001
000030171130     A*%%***********************************************************************
000031171130     A                                      SPACEB(002)
000032171130     A                                     4
000033171130     A                                      'Data immissione'
000034171130     A            DATA           8S 0O    20
000035171130     A                                      EDTCDE(Y)
000036171130     A                                     4
000037171130     A                                      'Immessi da:'
000038171130     A*%%***********************************************************************
000039171130     A*%%SS
000040171130     A*%%***********************************************************************
000041171130     A          R MB5803P
000042171130     A*%%***********************************************************************
000043171130     A*%%RI 00000
000044171130     A*%%FS 001
000045171130     A*%%***********************************************************************
000046171130     A                                      SPACEB(002)
000047171130     A                                     3
000048171130     A                                      'Filiale'
000049171130     A                                    32
000050171130     A                                      'Matt/Pom'
000051171130     A                                    49
000052171130     A                                      'Oggi'
000053171130     A                                    62
000054171130     A                                      '+1gg'
000055171130     A                                    75
000056171130     A                                      '+2gg'
000057171130     A                                    87
000058171130     A                                      'Oltre'
000059171130     A*%%***********************************************************************
000060171130     A*%%SS
000061171130     A*%%***********************************************************************
000062171130     A          R MB5805P
000063171130     A*%%***********************************************************************
000064171130     A*%%RI 00000
000065171130     A*%%***********************************************************************
000066171130     A                                      SPACEB(001)
000067171130     A            FIL            3S 0O     3
000068171130     A                                      EDTCDE(Z)
000069171130     A            DES           20A  O    +1
000070171130     A            TOT            9S 0O    +2
000071171130     A                                      EDTCDE(2)
000072171130     A            DAO0           9S 0O    +2
000073171130     A                                      EDTCDE(2)
000074171130     A            DAO1           9S 0O    +2
000075171130     A                                      EDTCDE(2)
000076171130     A            DAO2           9S 0O    +2
000077171130     A                                      EDTCDE(2)
000078171130     A            DAOO           9S 0O    +2
000079171130     A                                      EDTCDE(2)
000080171130     A*%%***********************************************************************
000081171130     A*%%SS
000082171130     A*%%CP+999CRTPRTF
000083171130     A*%%CP+    FILE(GAITRAFIL/TNVRMB58P)
000084171130     A*%%CP+    DEVTYPE(*SCS)
000085171130     A*%%CP+    PAGESIZE(*N 132)
000086171130     A*%%CP+    CPI(10)
000087171130     A*%%CP     OVRFLW(64)
000088171130     A*%%CS+999CRTPRTF
000089171130     A*%%CS+    FILE(QTEMP/QPRDRPT   )
000090171130     A*%%CS+    DEVTYPE(*SCS)
000091171130     A*%%CS     PAGESIZE(*N       132      *N     )
000092171130     A*%%***********************************************************************
