000100011003     H DECEDIT('0,') DATEDIT(*DMY.)
000200011003     FTITAS10F  O  A E           K DISK
000300011003     FTITAS38C  UF   E           K DISK
000400011003     F                                     IGNORE(TITASP00)
000500011003     F                                     IGNORE(TITAS010)
000600011003     C*------------------------------------------------------------------------*
000700011003     C* MAIN LINE
000800011003     C*------------------------------------------------------------------------*
000900011003     C     INIZIO        TAG
001000011003     C*
001100011003     C     *LOVAL        SETLL     TITAS000
001200011003     C                   DO        *HIVAL
001300011003     C                   READ      TITAS000                               21
001400011003     C   21              LEAVE
001500011003     C*
001600011003     C                   IF        TASFIC = '1'
001700011003     C*
001800011003     C                   DELETE    TITAS000
001900011003     C*
002000011003     C                   WRITE     TITAS010                             40
002100011003     C*
002200011003     C                   ENDIF
002300011003     C*
002400011003     C                   ENDDO
002500011003     C
002600011003     C                   SETON                                        LR
