000100081216             PGM        PARM(&AGGIORNA)
000200081216             DCL        VAR(&AGGIORNA) TYPE(*CHAR) LEN(1)
000300081230
000400090427
000500090423
000600090429             CALL       PGM(TNVRA10C) PARM(&AGGIORNA)
000700090429
000800090429             CALL       PGM(TNVRA15C) PARM(&AGGIORNA)
000900090423
001000090429             CALL       PGM(TNVRA15C1) PARM(&AGGIORNA)
001100090423
001200090112
001300081230finepgm:
001400050510             ENDPGM
