000100990211     H
000200990211     F*+----------------------------------------------------------*
000300990211     F*- PULIZIA NUMERATORI IN FLNUF00F CON CHIAVE 201 / 205      *
000400990211     F*-----------------------------------------------------------*
000500990211     FFLNUF01LUF  E           K        DISK
000600990211      *
000700990211      * PULISCO I 201
000800990211      * --------------
000900990211     C*
001000990211     C           KNUF      KLIST
001100990211     C                     KFLD           AAA
001200990211     C                     KFLD           CNU
001300990211     C*
001400990211     C                     Z-ADD99        AAA     20
001500990211     C                     Z-ADD201       CNU     30
001600990211     C*
001700990211     C           KNUF      SETLLFLNUF01L
001800990211     C                     DO   *HIVAL
001900990211     C           KNUF      READEFLNUF01L                 20
002000990211     C   20                LEAVE
002100990211      * AZZERO
002200990211     C                     Z-ADD*ZEROS    NUFNUM
002300990211     C                     UPDATFLNUF
002400990211      *
002500990211     C                     ITER
002600990211     C                     ENDDO
002700990211      *
002800990211     C                     Z-ADD205       CNU
002900990211     C*
003000990211     C           KNUF      SETLLFLNUF01L
003100990211     C                     DO   *HIVAL
003200990211     C           KNUF      READEFLNUF01L                 20
003300990211     C   20                LEAVE
003400990211      * AZZERO
003500990211     C                     Z-ADD*ZEROS    NUFNUM
003600990211     C                     UPDATFLNUF
003700990211      *
003800990211     C                     ITER
003900990211     C                     ENDDO
004000990211      *
004100990211      *----- FINE
004200990211     C                     SETON                     LR
004300990211      *-------------------------------------------------
