000100050207             PGM        PARM(&PKJBA)
000200050207             DCL        VAR(&KPJBA)  TYPE(*CHAR) LEN(502)
000300050207             ADDLIBLE   LIB(EDPGAIST)
000400050207             OVRPRTF    FILE(TNVRISTP) TOFILE(TNVRISTP) MAXRCDS(*NOMAX)
000500050207             CALL       PGM(TNVRISTR) PARM(&KPJBA)
000600050207             DLTOVR     FILE(*ALL)
000700050207             ENDPGM
