000100100413      //---------------------------------------------------------------
000200110331      //?TNVRCRM10 - Aggiorno VOF del SIC con dati anagrafici
000300100413      //---------------------------------------------------------------
000400100413
000500100413     h decedit('0,') datedit(*ymd/) option(*nodebugio)
000600100413
000700100413      //---------------------------------------------------------------
000800100413      //?Dichiarazione file.
000900100413      //---------------------------------------------------------------
001000100413
001100110331      // - File offerte
001200110331     fTIVOFC0F  UF   E             DISK    usropn
001300110209     f                                     extfile(wFLib)
001400100413      //---------------------------------------------------------------
001500100413      //?Definizione costanti.
001600100413      //---------------------------------------------------------------
001700100413
001800100413      //---------------------------------------------------------------
001900100413      //?Definizione schiere.
002000100413      //---------------------------------------------------------------
002100090715
002200100413      //---------------------------------------------------------------
002300100413      //?Definizione aree dati.
002400100413      //---------------------------------------------------------------
002500100413
002600100413      //---------------------------------------------------------------
002700100413      //?Definizione strutture dati.
002800100413      //---------------------------------------------------------------
002900110401
003000110401      // File VOF del SIC
003100110401     d TIVOFCds      e ds                  extname(TIVOFC0F)
003200110401     d                                     prefix(o_)
003300100415
003400100413      //---------------------------------------------------------------
003500100413      //?Definizione variabili globali.
003600100413      //---------------------------------------------------------------
003700100413
003800100413      // - Flags booleani
003900110204     d $Fine           s               n   inz(*off)
004000110204
004100110204      // - Indici di schiera
004200110204     d xx              s              4  0 inz
004300110208
004400110208      // - Campi di comodo
004500110209     d nRec            s             10  0 inz
004600110209
004700110331       // - Nome libreria del file TIVOFC
004800110209     d wFLib           s             21    inz
004900110331
005000110331       // - Reperimento dati anagrafici
005100110331     d TIBS69ds      e ds
005200110331     d DS_cnaco      e ds                  inz extname(CNACO00F)
005300110331     d DS_cnind      e ds                  inz extname(CNIND00F)
005400110331     d DS_cnclp      e ds                  inz extname(CNCLP00F)
005500110331     d DS_fncls      e ds                  inz extname(FNCLS00F)
005600100413
005700100413      //---------------------------------------------------------------
005800100413      //?Definizione procedure esterne.
005900100413      //---------------------------------------------------------------
006000100413
006100100413      //---------------------------------------------------------------
006200110204      //?Prototipi.
006300100413      //---------------------------------------------------------------
006400110331
006500110331      /copy gaitrasrc/srcprotopr,tibs69r
006600100413
006700100413      //---------------------------------------------------------------
006800100413      //?Definizione key-list.
006900100413      //---------------------------------------------------------------
007000100413
007100100413      //---------------------------------------------------------------
007200100413      //?Riepilogo indicatori.
007300100413      //---------------------------------------------------------------
007400100413
007500100413      //---------------------------------------------------------------
007600100413      //?M A I N - L I N E
007700100413      //---------------------------------------------------------------
007800100413
007900100413      /free
008000100413
008100100413       //?Operazioni iniziali
008200100513       exsr RoutInz;
008300110204
008400110204       exec sql set option dynusrprf = *owner, closqlcsr = *endmod;
008500100413
008600100726       //?Elaboro
008700100726       exsr Elabora;
008800100413
008900100413       //?Operazioni finali
009000100513       exsr RoutEnd;
009100100413
009200100413       //--------------------------------------------------------------
009300100413       //?Operazioni iniziali.
009400100413       //--------------------------------------------------------------
009500100513       BEGSR RoutInz;
009600110209
009700110209         //?Apro il file delle trattative
009800110401         wFLib = 'GAITRAAZM/TIVOFC0F';
009900110401         open  TIVOFC0F;
010000100413
010100100413       ENDSR;
010200100413
010300100413       //--------------------------------------------------------------
010400100422       //?Elaboro.
010500100413       //--------------------------------------------------------------
010600100513       BEGSR Elabora;
010700110401
010800110401         $Fine = *off;
010900110209
011000110401         exec sql DECLARE VOC cursor for
011100110401                  SELECT rrn(TIVOFC0F) as nRec,
011200110401                  TIVOFC0F.* from GAITRAAZM/TIVOFC0F
011300110401                  WHERE VOCksc > 0
011400110401                  ORDER BY VOCksc;
011500110209
011600110401         exec sql open VOC;
011700110401         IF  sqlcode < 0;
011800110401           $Fine = *on;
011900110401         ENDIF;
012000110209
012100110401       //?Leggo VOF del SIC
012200110401         DOW  not $Fine;
012300110401           exec sql FETCH next from VOC into :nRec, :TIVOFCds;
012400110401           IF  sqlcod = 100 or sqlcod < 0;
012500110401             $Fine = *on;
012600110401             leave;
012700110401           ENDIF;
012800110208
012900110401          //?Cerco i dati anagrafici del KSC
013000110401           exsr Dec_Ksc;
013100110208
013200110401          //?Aggiorno VOF del SIC con RRN
013300110401           exsr AggVof;
013400110208
013500110401         ENDDO;
013600110208
013700110401         exec sql CLOSE VOC;
013800100413
013900100413       ENDSR;
014000100726
014100100726       //--------------------------------------------------------------
014200110401       //?Cerco i dati anagrafici del KSC.
014300100726       //--------------------------------------------------------------
014400110401       BEGSR Dec_Ksc;
014500100726
014600110401         clear  tibs69ds;
014700110401         I69kac = o_VOCksc;
014800110401         I69kin = o_VOCksc;
014900110401         I69kcp = o_VOCksc;
015000110401         TIBS69R (tibs69ds:ds_cnaco:ds_cnind:ds_cnclp:ds_fncls);
015100110401
015200100726       ENDSR;
015300110208
015400110208       //--------------------------------------------------------------
015500110401       //?Aggiorno dati anagrafici del KSC presente sul VOF del SIC.
015600110208       //--------------------------------------------------------------
015700110401       BEGSR AggVof;
015800110208
015900110401         chain nRec TIVOFC0F;
016000110208         IF  %found;
016100110401           VOCrag = ACOrag;
016200110401           VOCclv = CLPclv;
016300110401           VOCctm = ACOitc;
016400110401           VOCcap = INDcae;
016500110401           update TIVOFC00;
016600110208         ENDIF;
016700110208
016800110208       ENDSR;
016900100413
017000100413       //--------------------------------------------------------------
017100100413       //?Operazioni finali.
017200100413       //--------------------------------------------------------------
017300100513       BEGSR RoutEnd;
017400100413
017500100413         *inLR = *on;
017600100413         return;
017700100413
017800100413       ENDSR;
017900100413
018000100413      /end-free
