000100980127     FAZCAE02LUF  E           K        DISK
000200980107     C*
000300980127     C           'A'       SETLLAZCAE02L
000400980127     C           'A'       READEAZCAE02L                 30
000500980107     C           *IN30     DOWEQ*OFF
000600980129     C           CAETFA    IFGT 200
000700980129     C           CAETFA    ANDLT300
000800980129     C           CAETFA    ANDNE210
000900980129     C           CAETFA    ANDNE235
001000980129     C           CAETFA    ANDNE249
001100980129     C           CAETFA    ANDNE220
001200980129     C           CAETFA    ANDNE202
001300980129     C           CAETFA    ANDNE277
001400980129     C           CAETFA    ANDNE275
001500980129     C           CAETFA    ANDNE214
001600980129     C           CAETFA    ANDNE289
001700980129     C           CAETFA    ANDNE224
001800980129     C           CAETFA    ANDNE255
001900980129     C           CAETFA    ANDNE207
002000980129     C           CAEDSC    ANDGT19980130
002100980129     C                     Z-ADD19980130  CAEDSC
002200980116     C                     MOVE *BLANKS   CAEFTR
002300980107     C                     MOVE *ZEROS    CAEDTR
002400980107     C                     UPDATAZCAE000
002500980128     C                     END
002600980127     C           'A'       READEAZCAE02L                 30
002700980107     C                     ENDDO
002800980107     C                     SETON                     LR
