000100940224     H*--------------------------------------------------------------*
000200100421     FTNTBE01L  uF   E           K DISK
000300100421      *---------------------------------------------------------------*
000400100421     d daut          e ds
000500100408      *---------------------------------------------------------------*
000600100416     c                   eval      tbeCOD = 'AUT'
000700100421      *
000800100416     C     TbeCOD        setll     TnTbe01l
000900100416     C     TbeCOD        reade     TnTbe01l
001000100421      *
001100100416     c                   dow       not %EoF(TnTbe01l)
001200100416      *
001300100421     c                   movel     tbeUNI        DAUT
001400100421     c                   move      'N'           §AUTSDT
001500100421     c                   eval      tbeUNI  =  DAUT
001600100416      *   aggiorna sempre
001700100421     c                   update    tntbe000
001800100416     C     TbeCOD        reade     TnTbe01l
001900100416     c                   end
002000100416      *
002100100420     c     fine          tag
002200000000     C                   SETON                                        LR
002300100416      *---------------------------------------------------------------*
