000001050511     A*%%***********************************************************************
000002050511     A*%%TS  RD  20050511  115303  EDPAB       REL-V4R4M0  5769-PW1
000003050511     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004050511     A*%%FI       0000000000000000000000000000000000000000000000000
000005050511     A*%%***********************************************************************
000006050511     A          R TESTA
000007050511     A*%%***********************************************************************
000008050511     A*%%RI 00000
000009050511     A*%%***********************************************************************
000010050511     A                                      SKIPB(001)
000011050511     A                                      CPI(15)
000012050511     A                                      SPACEA(001)
000013050511     A            KNSIF         10A  O     2
000014050511     A            KNMUS         10A  O    13
000015050511     A                                    27
000016050511     A                                      '  FATTURATO Medio Giornaliero Auti-
000017050511     A                                      sti x P.O. '
000018050511     A                                      UNDERLINE
000019050511     A                                      HIGHLIGHT
000020050511     A            NOMPGM        10A  O    78
000021050511     A                                    91
000022050511     A                                      'pag.'
000023050511     A            PAGE           3  0     96
000024050511     A                                      EDTCDE(Z)
000025050511     A            RSUT          20A  O     2
000026050511     A                                      SPACEB(001)
000027050511     A                                    27
000028050511     A                                      'periodo in esame dal'
000029050511     A                                      UNDERLINE
000030050511     A            PDADATA        8S 0O    48
000031050511     A                                      HIGHLIGHT
000032050511     A                                      UNDERLINE
000033050511     A                                      EDTCDE(Y)
000034050511     A                                    59
000035050511     A                                      'al'
000036050511     A                                      UNDERLINE
000037050511     A            PADATA         8S 0O    62
000038050511     A                                      HIGHLIGHT
000039050511     A                                      UNDERLINE
000040050511     A                                      EDTCDE(Y)
000041050511     A            DAY            8S 0O    78
000042050511     A                                      EDTCDE(Y)
000043050511     A            ORE             T  O    91
000044050511     A                                      SPACEA(002)
000045050511     A                                      CPI(15)
000046050511     A                                     3
000047050511     A                                      'Distretto'
000048050511     A                                      HIGHLIGHT
000049050511     A                                    15
000050050511     A                                      'Area'
000051050511     A                                      HIGHLIGHT
000052050511     A                                    22
000053050511     A                                      'Punto Oper.'
000054050511     A                                      HIGHLIGHT
000055050511     A                                    36
000056050511     A                                      'Nr.Aut.'
000057050511     A                                      HIGHLIGHT
000058050511     A                                    46
000059050511     A                                      'Media Giornaliera'
000060050511     A                                      HIGHLIGHT
000061050511     A*%%***********************************************************************
000062050511     A*%%SS                   a
000063050511     A*%%CL 001
000064050511     A*%%CL 002
000065050511     A*%%CL 001
000066050511     A*%%***********************************************************************
000067050511     A          R DETTAGLI
000068050511     A*%%***********************************************************************
000069050511     A*%%RI 00000
000070050511     A*%%***********************************************************************
000071050511     A                                      SPACEB(001)
000072050511     A                                      CPI(15)
000073050511     A            PDIST          1A        6
000074050511     A            PAREA          3S 0     15
000075050511     A                                      EDTCDE(Z)
000076050511     A            PPOPER         3S 0     25
000077050511     A                                      EDTCDE(Z)
000078050511     A            PNUMAUT        5S 0     37
000079050511     A                                      EDTCDE(Z)
000080050511     A            PMEDIA        11S 3     48
000081050511     A                                      EDTCDE(K)
000082050511     A*%%***********************************************************************
000083050511     A*%%SS
000084050511     A*%%***********************************************************************
000085050511     A          R NODATI
000086050511     A*%%***********************************************************************
000087050511     A*%%RI 00000
000088050511     A*%%FS 001
000089050511     A*%%***********************************************************************
000090050511     A                                      SPACEB(002)
000091050511     A                                      CPI(15)
000092050511     A                                      SPACEA(001)
000093050511     A                                     4
000094050511     A                                      '*-- NON  TROVATI  DATI  PER  LA  R-
000095050511     A                                      ICHIESTA  EFFETTUATA --*'
000096050511     A                                      HIGHLIGHT
000097050511     A*%%***********************************************************************
000098050511     A*%%SS
000099050511     A*%%CL 001
000100050511     A*%%CP+999CRTPRTF
000101050511     A*%%CP+    FILE(GAITRAFIL/TNVR1ABP)
000102050511     A*%%CP+    DEVTYPE(*SCS)
000103050511     A*%%CP+    PAGESIZE(70 100)
000104050511     A*%%CP+    CPI(15)
000105050511     A*%%CP     OVRFLW(66)
000106050511     A*%%CS+999CRTPRTF
000107050511     A*%%CS+    FILE(QTEMP/QPRDRPT)
000108050511     A*%%CS+    DEVTYPE(*SCS)
000109050511     A*%%CS+    PAGESIZE(70 132)
000110050511     A*%%CS+    CPI(15)
000111050511     A*%%CS     OVRFLW(66)
000112050511     A*%%***********************************************************************
000113050511     **
