000100971218             PGM        PARM(&FILE &LIB)
000200971218             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
000300971218             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
000400971218             DCLF       FILE(QAFDMBRL)
000500891128
000600971218             DSPFD      FILE(&LIB/&FILE) TYPE(*MBRLIST) +
000700971218                          OUTPUT(*OUTFILE) OUTFILE(QTEMP/§DSPFD)
000800971218             MONMSG     MSGID(CPF0000) EXEC(GOTO CMDLBL(ENDF))
000900971218
001000971218             OVRDBF     FILE(QAFDMBRL) TOFILE(QTEMP/§DSPFD)
001100971218READ:        RCVF
001200971218             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDF))
001300971218
001400971218             IF         COND(&MLNAME *NE '         ') THEN(DO)
001500971218             IF         COND(&MLNRCD *EQ 0) THEN(DO)
001600971218             RMVM       FILE(&LIB/&FILE) MBR(&MLNAME)
001700971218             MONMSG     MSGID(CPF0000)
001800971218             ENDDO
001900971218             ENDDO
002000971218
002100971218             GOTO       CMDLBL(READ)
002200971218ENDF:
002300931027             ENDPGM
