000100170629     A*%%TS  SD  20170629  113102  EDPLC       REL-V7R2M0  5770-WDS
000200970526     A*-------------------------------------------------------------------------
000300170629     A*%%EC
000400170629     A                                      DSPSIZ(24 80 *DS3)
000500170629     A                                      CHGINPDFT(HI CS)
000600170629     A                                      PRINT
000700170629     A                                      CF02
000800170629     A                                      CF03
000900170629     A                                      CF04
001000170629     A                                      CF05
001100170629     A                                      CF06
001200170629     A                                      CF07
001300170629     A                                      CF08
001400170629     A                                      CF09
001500170629     A                                      CF10
001600170629     A                                      CF11
001700170629     A                                      CF12
001800170629     A                                      CF13
001900170629     A                                      CF14
002000170629     A                                      CF15
002100170629     A                                      CF16
002200170629     A                                      CF17
002300170629     A                                      CF18
002400170629     A                                      CF19
002500170629     A                                      CF20
002600170629     A                                      CF21
002700170629     A                                      CF22
002800170629     A                                      CF23
002900170629     A                                      CF24
003000170629     A                                      HELP
003100970526     A*-------------------------------------------------------------------------
003200170629     A          R AS01D01
003300170629     A*%%TS  SD  20170629  092725  EDPLC       REL-V7R2M0  5770-WDS
003400170629     A                                      TEXT('Testata')
003500170629     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
003600170629     A                                  1 24'* Confr. instradamento TISIE3/D4R -
003700170629     A                                      *'
003800170629     A                                      DSPATR(RI)
003900170629     A                                      DSPATR(UL)
004000170629     A                                  1 60'TNVRVAS01R'
004100170629     A                                  1 71DATE
004200170629     A                                      EDTCDE(Y)
004300170629     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004400170629     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004500170629     A                                  2 32'      LANCIO        '
004600170629     A                                      DSPATR(HI)
004700170629     A                                      DSPATR(RI)
004800170629     A                                  2 71TIME
004900970526     A*-------------------------------------------------------------------------
005000170629     A          R AS01D02
005100970526     A                                      OVERLAY
005200970526     A            FUN001        19A  O 22  2
005300970526     A            FUN002        19A  O 22 22
005400970526     A            FUN003        19A  O 22 42
005500970526     A            FUN004        19A  O 22 62
005600970526     A            FUN005        19A  O 23  2
005700970526     A            FUN006        19A  O 23 22
005800970526     A            FUN007        19A  O 23 42
005900970526     A            FUN008        19A  O 23 62
006000970526     A*-------------------------------------------------------------------------
006100170629     A          R AS01D03
006200170629     A*%%TS  SD  20170629  113102  EDPLC       REL-V7R2M0  5770-WDS
006300170629     A                                      OVERLAY
006400170629     A                                  4  2'INPUT                             -
006500170629     A                                                                         -
006600170629     A                                               '
006700170629     A                                      DSPATR(UL)
006800170629     A                                  5  2'Data spedizione..... DA:'
006900170629     A            D03DTSPED      8Y 0B  5 27EDTCDE(Y)
007000170629     A  50                                  DSPATR(RI)
007100170629     A  50                                  DSPATR(PC)
007200170629     A                                  5 40'A:'
007300170629     A            D03DTSPEA      8Y 0B  5 43EDTCDE(Y)
007400170629     A  51                                  DSPATR(RI)
007500170629     A  51                                  DSPATR(PC)
007600170629     A                                  6  2'Linea di arrivo .......:'
007700170629     A            D03LNA         3Y 0B  6 27EDTCDE(1)
007800170629     A                                  7  2'Servizio DPD ..........:'
007900170629     A            D03SRVC        3Y 0B  7 27EDTCDE(1)
008000170629     A                                      VALUES(101, 136)
008100170629     A  52                                  DSPATR(RI)
008200170629     A  52                                  DSPATR(PC)
008300170629     A            VIDMSG        76A  O 21  3DSPATR(HI)
008400970526     A*-------------------------------------------------------------------------
008500170629     A          R AS01DMS                   SFL
008600970526     A                                      SFLMSGRCD(24)
008700970526     A            MSGKEY                    SFLMSGKEY
008800970526     A            MSGQUE                    SFLPGMQ
008900970526     A*-------------------------------------------------------------------------
009000170629     A          R AS01DMC                   SFLCTL(AS01DMS)
009100970526     A                                      OVERLAY
009200970526     A                                      SFLDSP
009300970526     A  40                                  SFLCLR
009400970526     A                                      SFLSIZ(0002)
009500970526     A                                      SFLPAG(0001)
