000100031003     A*%%TS  SD  20031003  092348  EDPMB       REL-V4R4M0  5769-PW1
000200031003     A*%%EC
000300031003     A                                      DSPSIZ(24 80 *DS3)
000400031003     A                                      CHGINPDFT(UL)
000500031003     A                                      PRINT
000600031003     A          R TNVRRCC1
000700031003     A*%%TS  SD  20031003  092348  EDPMB       REL-V4R4M0  5769-PW1
000800031003     A                                      CF06
000900031003     A                                      CA03
001000031003     A                                      WINDOW(10 20 6 40)
001100031003     A  28        V1CMSG        40   M
001200031003     A                                  1 13'Modifica fase ORM'
001300031003     A                                      DSPATR(UL)
001400031003     A                                      DSPATR(HI)
001500031003     A                                  3  7'O.R.M. n.:'
001600031003     A            V1CPOE    R     Y  B  3 18REFFLD(FNORM000/ORMPOE GAITRAGRPF/F-
001700031003     A                                      NORM00F)
001800031003     A                                      CHECK(RZ)
001900031003     A  40                                  DSPATR(PC)
002000031003     A            V1CNSR    R     Y  B  3 22REFFLD(FNORM000/ORMNSR GAITRAGRPF/F-
002100031003     A                                      NORM00F)
002200031003     A                                      CHECK(RB)
002300031003     A            V1CNOR    R     Y  B  3 25REFFLD(FNORM000/ORMNOR GAITRAGRPF/F-
002400031003     A                                      NORM00F)
002500031003     A                                      CHECK(RB)
002600031003     A            V1CNRV    R     Y  B  3 33REFFLD(FNORM000/ORMNRV GAITRAGRPF/F-
002700031003     A                                      NORM00F)
002800031003     A                                      CHECK(RB)
002900031003     A                                  5  2'F3=Fine'
003000031003     A                                  5 29'F6=Conferma'
