000100170830      */*PRM mbr(*none) size(1 0 0)
000200170830      */*END
000300170830      **-------------------------------------------------------------**
000400170830      **?TNVRSPIDS - Aggiornamento ANSPI00F con dati da "finanze.it"?**
000500170830      **-------------------------------------------------------------**
000600170830     A                                      REF(ANSPI00F)
000700170830      *
000800170830     A          R TNVRSPI1S                 TEXT('PARMS PER AGGIORNAM.-
000900170830     A                                       ANSPI00F CON DATI DA FINA-
001000170830     A                                      NZE.IT')
001100170830      *
001200171207     A            VRSP1ACO  R     S         REFFLD(SPIACO)
001300171207     A            VRSP1AOI  R               REFFLD($FLA       CNDIZION)
001400171207     A                                      TEXT('Flag tipo Aggiornam/-
001500171207     A                                      Inserim')
001600170830     A            VRSP1DDE  R     S         REFFLD(SPIDDE)
001700170830     A            VRSP1DSC  R     S         REFFLD(SPIDSC)
001800171207      *
001900171207     A            VRSP1DSSA R     S         REFFLD(SPIDSC)
002000171207     A                                      TEXT('Inser.: Data Sacad. -
002100171207     A                                      Soggetti Attivi')
