000100990525             PGM
000200990525
000300050303             OVRDBF     FILE(FIGNP01L) TOFILE(FILTRA201/FIGNP01L)
000400050303             OVRDBF     FILE(FIGNA01L) TOFILE(FILTRA201/FIGNA01L)
000500050303             OVRDBF     FILE(FIGNPX1L) TOFILE(GAITRAGRU/FIGNP01L)
000600990525
000700050128             CALL       PGM(TNVRTGNPR)
000800990525
000900050131             DLTOVR     FILE(*ALL)
001000050131
001100990525             ENDPGM
