000100990901     H*------------------------------------------------------------------------*
000200000330     H* AGGIORNA I CAMPI TASPKB E TASPKF ELIMINANDO GLI EVENTUALI DECIMALI     *
000300000330     H*   SOLO X TITAS00F PER I CLIENTI 0930674/0930422/0050581/0050572        *
000400000308     H***********************************************************              *
000500000308     H***     ATTENZIONE!!! COMPILARE CON L'OPZIONE "PC"      ***              *
000600000327     H***********************************************************              *
000700990901     H*------------------------------------------------------------------------*
000800000327     H DATEDIT(*YMD)   EXPROPTS(*RESDECPOS)
000900990901     F*------------------------------------------------------------------------*
001000990901     F* DATA BASE
001100990901     F*------------------------------------------------------------------------*
001200000327     F*
001300990901     D*------------------------------------------------------------------------*
001400990901     D* SCHIERE
001500990901     D*------------------------------------------------------------------------*
001600000203     D*---
001700000327     D* SCHIERA PER COSTRUZIONE STRINGHE DI COMANDO SQL
001800000203     D*---
001900000331     D  COMMAND        S             80    dim(2) CTDATA PERRCD(1)
002000990901     C*------------------------------------------------------------------------*
002100990901     C* MAIN LINE
002200990901     C*------------------------------------------------------------------------*
002300990901     C*
002400000204     C* ESECUZIONE COMANDI NAVIGAZIONALI
002500000204     C                   EXSR      EXESQL
002600000204     C*
002700000204     C                   SETON                                        LR
002800000204     C*------------------------------------------------------------------------*
002900000204     C* EXESQL - ESECUZIONE COMANDI NAVIGAZIONALI
003000000204     C*------------------------------------------------------------------------*
003100000204     C     EXESQL        BEGSR
003200000204     C*
003300000330     C* Composizione stringa per composizione comando SQL da passare.
003400000330     C                   MOVEL     *blanks       STRINGA         256
003500000330     C*
003600000330     C                   EVAL      STRINGA=%trim(STRINGA)+%trim(COMMAND(1))
003700000330     C                   EVAL      STRINGA=%trim(STRINGA)+' '+%trim(COMMAND(2))
003800000330     C*
003900000327     C/EXEC SQL
004000000327     C+     EXECUTE IMMEDIATE :STRINGA
004100000327     C/END-EXEC
004200000203     C*
004300000204     C                   ENDSR
004400990901     C*------------------------------------------------------------------------*
004500990901     C* *INZSR - OPERAZIONI INIZIALI
004600990901     C*------------------------------------------------------------------------*
004700990901     C     *INZSR        BEGSR
004800000204     C*
004900990901     C                   ENDSR
005000000203     C*------------------------------------------------------------------------*
005100000330**CTDATA COMMAND
005200000331UPDATE TITAS00F SET TASPKB=INT(TASPKB), TASPKF=INT(TASPKF)
005300000331WHERE TASKSC=0930674 OR TASKSC=0930422 OR TASKSC=0050581 OR TASKSC=0050572
