000100051024             PGM        PARM(&DATA)
000200051024             DCL        VAR(&DATA) TYPE(*CHAR) LEN(8)
000300051024
000400051024             CLRPFM     FILE(FNBLPWRK)
000500051024
000600051024             CALL       PGM(TNVRB2R) PARM(&DATA)
000700031024
000800031024 ENDF:
000900031024
001000031024             ENDPGM
