000100000601             PGM
000200040428             OVRDBF     FILE(SICOP01L) TOFILE(BUDGET/SICOP01L)
000300040428             CALL       PGM(TNVRCOPR)
000400000601             DLTOVR *ALL
000500000601             ENDPGM
