001219050502     C/EXEC SQL
001220090410     C+ update gaitragru/titas00f set tasll2 ='A'
001221090410     C+ WHERE tasaas = 2009 and tasmgs between
001222090410     C+ 0401 and 0402
001225050502     C/END-EXEC
001300090410     c                   seton                                        lr
