000100041122             PGM
000200041122
000300060321             OVRDBF     FILE(FIFCENEW) TOFILE(EDPAB/FIFCENEW)
000302060320             OVRDBF     FILE(FNARB00F) TOFILE(FILTRA201/FNARB00F)
000303060320             OVRDBF     FILE(FNARB01L) TOFILE(FILTRA201/FNARB01L)
000400041122
000500060320             CALL       PGM(TNVRAB30R)
000600041122
000700041122             DLTOVR     FILE(*ALL)
000800041122
000900041122             ENDPGM
