000001050207     A*%%***********************************************************************
000002050207     A*%%TS  RD  20050207  115505  EDPGA       REL-V4R4M0  5769-PW1
000003050207     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004050207     A*%%FI       0000000000000000000000000000000000000000000000000
000005050207     A*%%***********************************************************************
000006050207      *---------------------------------------------------------------*
000007050207      *  STAMPA ELENCO C.A.
000008050207      *---------------------------------------------------------------*
000009050207      *      COMPILARE CON:     PAGESIZE(66 198)
000010050207      *                         CPI(15)
000011050207      *---------------------------------------------------------------*
000012050207      * ?  T E S T A T A    D I    S T A M P A  ?
000013050207     A          R SISTT1
000014050207     A*%%***********************************************************************
000015050207     A*%%RI 00000
000016050207     A*%%FS 001
000017050207     A*%%***********************************************************************
000018050207     A                                      SKIPB(002)
000019050207     A            RSUT          20A        1
000020050207     A                                    75
000021050207     A                                      HIGHLIGHT
000022050207     A                                      'Simulazione Tassazione ISTAT spedi-
000023050207     A                                      zioni 2005'
000024050207     A                                   155
000025050207     A                                      'TNVRISTR'
000026050207     A            WDATE          8S 0    171
000027050207     A                                      EDTWRD('  /  /    ')
000028050207     A                                   191
000029050207     A                                      'PAG.'
000030050207     A                                   195
000031050207     A                                      PAGNBR
000032050207     A                                      EDTCDE(Z)
000033050207     A                                      SPACEB(001)
000034050207     A            KNSIF     R              1
000035050207     A                                      REFFLD(KNSIF KPJBA)
000036050207     A            KNMUS     R             12
000037050207     A                                      REFFLD(KNMUS KPJBA)
000038050207     A            WORA           6S 0    171
000039050207     A                                      EDTWRD('  :  :  ')
000040050207     A                                     4
000041050207     A                                      'S P E D I Z I O N E'
000042050207     A                                      SPACEB(002)
000043050207     A                                   +14
000044050207     A                                      'Tp'
000045050207     A                                    +4
000046050207     A                                      'Cod'
000047050207     A                                     2
000048050207     A                                      'LNP /  Numero   / Anno'
000049050207     A                                      SPACEB(001)
000050050207     A                                    +3
000051050207     A                                      'Cliente'
000052050207     A                                    +3
000053050207     A                                      'Bo'
000054050207     A                                    +4
000055050207     A                                      'Tar'
000056050207     A                                    +4
000057050207     A                                      'Vecchio IMP'
000058050207     A                                   +10
000059050207     A                                      'Nuovo IMP'
000060050207     A                                   +14
000061050207     A                                      'ISTAT'
000062050207     A                                    +9
000063050207     A                                      'Differenza'
000064050207     A*%%***********************************************************************
000065050207     A*%%SS
000066050207     A*%%CL 001
000067050207     A*%%CL 002
000068050207     A*%%CL 001
000069050207     A*%%***********************************************************************
000070050207      *---------------------------------------------------------------*
000071050207      * ?  R I G A    D I    S E P A R A Z I O N E  ?
000072050207     A          R SISTT2
000073050207     A*%%***********************************************************************
000074050207     A*%%RI 00000
000075050207     A*%%***********************************************************************
000076050207     A                                      SPACEB(001)
000077050207     A                                     1
000078050207     A                                      '-----------------------------------
000079050207     A                                      ------------------------------------
000080050207     A                                      ------------------------------------
000081050207     A                                      ------------------------------------
000082050207     A                                      ------------------------------------
000083050207     A                                      ------------------------'
000084050207     A*%%***********************************************************************
000085050207     A*%%SS
000086050207     A*%%***********************************************************************
000087050207      *---------------------------------------------------------------*
000088050207     A          R SISTD01
000089050207     A*%%***********************************************************************
000090050207     A*%%RI 00000
000091050207     A*%%***********************************************************************
000092050207     A                                      SPACEB(000)
000093050207     A                                      SPACEA(001)
000094050207     A            TASLNP         3S 0O     2
000095050207     A                                      EDTCDE(L)
000096050207     A                                      SPACEB(001)
000097050207     A            TASNRS         2S 0O    +1
000098050207     A                                      EDTCDE(Z)
000099050207     A            TASNSP         7S 0O    +0
000100050207     A                                      EDTCDE(Z)
000101050207     A            TASAAS         4S 0O    +4
000102050207     A                                      EDTCDE(L)
000103050207     A            TASKSC         7S 0O    +2
000104050207     A                                      EDTCDE(Z)
000105050207     A            TASTBL         2A  O    +3
000106050207     A            TASCTR         3S 0O    +4
000107050207     A            PREIMV        13S 3O    +2
000108050207     A                                      EDTWRD('          ,   ')
000109050207     A            TASIMV        13S 3O    +7
000110050207     A                                      EDTWRD('          ,   ')
000111050207     A            IMPIST        13S 3O    +5
000112050207     A                                      EDTCDE(M)
000113050207     A            DIFFE         13S 3O    +5
000114050207     A                                      EDTCDE(M)
000115050207     A*%%***********************************************************************
000116050207     A*%%SS
000117050207     A*%%CL 001
000118050207     A*%%SN TASLNP     999
000119050207     A*%%SN TASAAS     9999
000120050207     A*%%SN IMPIST     9999999999999
000121050207     A*%%SN DIFFE      9999999999999
000122050207     A*%%CL 001
000123050207     A*%%CP+999CRTPRTF
000124050207     A*%%CP+    FILE(GAITRAFIL/TNVRISTP)
000125050207     A*%%CP+    DEVTYPE(*SCS)
000126050207     A*%%CP+    PAGESIZE(*N 198)
000127050207     A*%%CP     CPI(15)
000128050207     A*%%***********************************************************************
000129050207      *---------------------------------------------------------------*
