000100950929     A*------------------------------------------------------------------------*
000200080111      *  TOTALE PARCELS MOVIMENTATI PER OGNI SINGOLO DEPOT NEL MESE DI ....
000300080111     A*------------------------------------------------------------------------*
000400080121     A          R DPDTOTALIE
000500030825      *
000600080117     A            IMP_O_EXP      3A         TEXT('BOLLE DI')
000700080117     A                                      COLHDG('BOLLE DI')
000800080117     A                                      ALIAS(BOLLE_DI)
000900080117     A            NOMEDEPOT      4A         TEXT('CODICE DEPOT')
001000080117     A                                      COLHDG('DEPOT DPD')
001100080117     A                                      ALIAS(DEPOT_DPD)
001200080111     A            ANNO           4S 0       TEXT('ANNO')
001300080111     A                                      COLHDG('ANNO')
001400080111     A                                      ALIAS(DELL_ANNO)
001500080111     A            MESE           2S 0       TEXT('MESE')
001600080111     A                                      COLHDG('MESE')
001700080111     A                                      ALIAS(DEL_MESE)
001800080111     A            TOTPARCELS     7S 0       TEXT('TOTALE PARCELS')
001900080111     A                                      COLHDG('NUM.TOT.PARCELS')
002000080111     A                                      ALIAS(TOT_PARCELS_X_DEPOT)
002100080111     A            TOTRESI        7S 0       TEXT('NUM.TOT.PARCELS RESI')
002200080111     A                                      COLHDG('NUM.TOT.PARCELS RESI')
002300080111     A                                      ALIAS(TOT_PARCELS_RESI_X_DEPOT)
002400080114      *
002500080114     A          K IMP_O_EXP
002600080117     A          K NOMEDEPOT
002700080114     A          K ANNO
002800080114     A          K MESE
