000100111201     A*--------------------------------------------------------------*
000200111201     A*         TARIFFE AUTISTI AFF/DEF TESTATA                      *
000300111201     A*--------------------------------------------------------------*
000400111201     A                                      REF(CNDIZION)
000500111201     A          R FIADTXXX                  TEXT('TARIFFE AUTISTI - AFF/DEF')
000600111201     A            ADTATB    R               REFFLD($ATB)
000700111201     A            ADTPDR    R               REFFLD($PDR)
000800111201     A            ADTTSR    R               REFFLD($TSR)
000900111201     A            ADTPRG    R               REFFLD($PRG)
001000111201     A*
001100111201     A            ADTDDT    R               REFFLD($DDT)
001200111201     A            ADTDST    R               REFFLD($DST)
001300111201     A            ADTDCN    R               REFFLD($DCN)
001400111201     A                                      TEXT('DATA STAMPA IN SEDE')
001500111201     A            ADTDTS    R               REFFLD($DTS)
001600111201     A                                      TEXT('DATA CONVALIDA FILIALE')
001700111201     A            ADTDUV    R               REFFLD($DUV)
001800111201     A            ADTPCAR   R               REFFLD($PCAR)
001900111201     A            ADTPKL    R               REFFLD($PKL)
002000111201     A            ADTVLU    R               REFFLD($VLU)
002100111201     A*
002200111201     A            ADTDRC         8P 0       TEXT('DATA RITORNO COPIA FIRMATA')
002300111201     A            ADTNRC         7P 0       TEXT('NUMERO CONTRATTO')
002400111201     A            ADTTMPC        4  0       TEXT('TEMPI CARICO')
002500111201     A            ADTTMPS        4  0       TEXT('TEMPI SCARICO')
002600111201     A            ADTCDF    R               REFFLD($CDF)
002700111201     A                                      TEXT('CODICE FORNITORE')
002800111201     A            ADTCSF    R               REFFLD($CSF)
002900111201     A                                      TEXT('COD.SISTEMA INFORMATIVO -
003000111201     A                                      FORNITORE')
003100111201     A            ADTFIL         3P 0       TEXT('FIL. GESTIONE CONTRATTO')
003200111201     A                                      COLHDG('FILIALE' 'GESTIONE')
003300111201     A            ADTUNODC  R               REFFLD($UNODC)
003400111201     A            ADTDFA    R               REFFLD($DFA)
003500111201     A            ADTFLR        30          TEXT('FILLER')
