000100890918     A*--------------------------------------------------------------*
000200140904     A*                                                              *
000300890918     A*--------------------------------------------------------------*
000400990906     A                                      REF(CNDIZION)
000500160223     A          R WFEXPORT0                 TEXT('SPEDIZIONI RICAVI COMPETENZE')
000600060804     A*
000800160223     A            WAAS      R     S         REFFLD($AAS)
000900060804     A                                      TEXT('ANNO SPEDIZIONE')
001000160223     A            WLNP      R     S         REFFLD($LNP)
001100060804     A                                      TEXT('LINEA PARTENZA SPEDIZIONE')
001200160223     A            WNRS      R     S         REFFLD($NRS)
001300060804     A                                      TEXT('SERIE SPEDIZIONE')
001400160223     A            WNSP      R     S         REFFLD($NSP)
001500060804     A                                      TEXT('NUMERO SPEDIZIONE')
001501160223     A            WTBL      R               REFFLD($TBL)
001502160223     A            WLNA      R     S         REFFLD($LNA)
001503160223     A                                      TEXT('LNA')
001504160223     A            WRICAVO       19S 3       TEXT('RICAVO')
001505160223     A                                      COLHDG('RICAVO')
001506160223     A            WCOMPE        19S 5       TEXT('COMPETENZA')
001507160223     A                                      COLHDG('COMPETENZA')
001508160223     A            WRICARICO     19S 5       TEXT('RICARICO')
001509160223     A                                      COLHDG('RICARICO')
001600060804     A*
