000100000000     A*--------------------------------------------------------------*
000200111013     A* WF TOTALE SPEDIZIONI PER CCM CON AVVISO AL DESTINATARIO CON EMAIL
000300000000     A*--------------------------------------------------------------*
000301111013     A                                      REF(CNDIZION)
000400111013     A          R WFEMD000                  TEXT('CLIENTI CON "EMD"')
000401111013     A            EMDDEL         8S 0       TEXT('DATA ELABORAZIONE')
000402111013     A            EMDUSR    R               REFFLD($PRU)
000403111013     A            EMDDAL         8S 0       TEXT('DATA DAL')
000404111013     A            EMDAL          8S 0       TEXT('DATA AL')
000405111013     A            EMDCAR    R               REFFLD($CAR)
000406111013     A                                      TEXT('COD. AREA DEL COMM.LE')
000407111013     A            EMDDAR        25          TEXT('DESCRIZIONE AREA')
000408111013     A                                      COLHDG('DESCR.' 'AREA')
000409111013     A            EMDAGE    R     S         REFFLD($AGE)
000410111013     A            EMDDAG        25          TEXT('RAGIONE SOCIALE COMM.LE')
000500111013     A            EMDCCM    R     S         REFFLD($CCM)
000501111013     A            EMDRAG    R               REFFLD($RAGSOC)
000502111013     A                                      TEXT('RAGIONE SOCIALE')
000600111013     A            EMDCBA         5A         TEXT('SUPPORTO CLI > BARTOLINI   ')
000700111013     A            EMDTSP         8S 0       TEXT('TOT.SPED. CON AVVISO EMAIL')
