000100941206     A*------------------------------------------------------------------------*
000200160223     A*  L.F. X  SPEDIZIONE
000300941206     A*------------------------------------------------------------------------*
000400160223     A          R WFEXPORT0                 PFILE(WFEXPORTF)
000500160223     A          K WAAS
000600160223     A          K WLNP
000700160223     A          K WNRS
000800160223     A          K WNSP
000900160223     A          K WTBL
