000100150909      *------------------------------------------------------------------------*
000200150911      *?WORKFILE ORM A TOTALE NEW INSTRADAMENTO                      ?*
000300150909      *------------------------------------------------------------------------*
000400150911     A          R WFORMTOT0                 PFILE(WFORMTOT)
000500070531      *
000600150911     A          K TIPO
000700150911     A          K POE
000800150911     A          K POR
000900150911     A          K NEWPOR
