000100100510      *---------------------------------------------------------------*
000200160204      *?WORKFILE X CONTROLLO ADDEBTIO ORM TELEFONICO                 ?*
000300100510      *---------------------------------------------------------------*
000400160204     A          R WFORM0                    TEXT('WF ADDEBITO ORM TELEFONICO')
000500150909
000600160204     A            DATADA         8S 0       TEXT('DATA ELABORAZIONE DA')
000700160204     A            DATAA          8S 0       TEXT('DATA ELABORAZIONE A ')
000800160205     A            TOTORM         9S 0       TEXT('ORM PERIODO')
000900160205     A            BOLLEOK        9S 0       TEXT('BOLLA CON FLAG ADDEBITO')
001000160205     A            NOBOLLE        9S 0       TEXT('NO BOLLA')
001100160205     A            BOLLENDATA     9S 0       TEXT('BOLLA NON DEL PERIODO')
001200160205     A            ASSEGNATI      9S 0       TEXT('BOLLA IN ASSEGNATO')
001300160204     A            LNPEXPORT      9S 0       TEXT('LNP EXPORT')
001400160205     A            PREPAGATI      9S 0       TEXT('PREPAGATO')
001500160204     A            ALTRO          9S 0       TEXT('ALTRO')
001600160205     A            PIUNOFLG       9S 0       TEXT('BOLLA CON PIU NO FLAG')
001700160205     A            PAGAORDASS     9S 0       TEXT('PAGA ORD.BOLLA ASS.')
001800160208     A            PAGAMITASS     9S 0       TEXT('PAGA MIT.BOLLA ASS.')
001900160208     A            PAGADESASS     9S 0       TEXT('PAGA DES.BOLLA ASS.')
