000100940628     A*---------------------------------------------------------------*
000200940629     A*  L.F. ARCHIVIO BOLLE PARTENZA
000300000000     A*--------------------------------------------------------------*
000400900330     A                                      UNIQUE
000500160205     A          R WFRMASS00                 PFILE(WFRMASSF)
000600160205     A          K RMKSC
