000100941206     A*------------------------------------------------------------------------*
000200131001     A* FILE DI LAVORO PER ORM IMMESSI OGNI 30 MINUTI                          *
000300941206     A*------------------------------------------------------------------------*
000400131001     A          R WFSTAT                    TEXT('WF ORM OGNI 30 MIN.')
000500131001     A            FILIALE        3S 0       TEXT('FILIALE')
000600131001     A            DESCRI        20A         TEXT('DESCRIZIONE')
000700131001     A            DATA           8S 0       TEXT('DATA')
000800131001     A            ORADA          6S 0       TEXT('ORA DA')
000900131001     A            ORAA           6S 0       TEXT('ORA A')
001000131001     A            TOTALE         7S 0       TEXT('NR. ORM IMMESSI')
