000100000000     A*------------------------------------------------------------------------*
000200000000     A* STATISTICHE DELTA - FILE DI LAVORO                                     *
000300000000     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500110202     A          R WFVAL000
000501061129      **
000502110202     A            WCAR           3  0       TEXT('COD.AREA')
000503110202     A            WCARD         25          TEXT('DESCRIZIONE AREA')
000504110202     A            WATB      R               REFFLD($ATB)
000505110202     A            WKSC      R               REFFLD($CSC)
000506110202     A            WRAG      R               REFFLD(ACORAG)
000507110202     A            WCTR      R               REFFLD($CTR)
000516110202     A            WPRG      R               REFFLD($PRG)
001400110202     A            W70NSP        12  0       TEXT('NUMERO SPEDIZIONI')
001500110202     A            W70NCO        12  0       TEXT('NUMERO COLLI')
001600110202     A            W70PKG        13  1       TEXT('PESO IN KG.')
001700110202     A            W70VOL        13  3       TEXT('VOLUME TOTALE')
001800110202     A            W70RIC        16  3       TEXT('RICAVO REALE')
001900110202     A            W70RIR        16  3       TEXT('RICAVO DELTA REALE')
001901110202     A            W70RIP        16  3       TEXT('RICAVO DELTA PRESUNTO')
