000100970515     A                                      UNIQUE
000200090608     A          R XXPTY000                  PFILE(XXPTY00F)
000300090608     A          K XPTYCAP
000400090608     A          K XPTYLOC
