000100050103             PGM        PARM(&LIBD &LIBA)
000200050103
000300050103             DCL        VAR(&LIBD) TYPE(*CHAR) LEN(10)
000400050103             DCL        VAR(&LIBA) TYPE(*CHAR) LEN(10)
000500050103
000600050103             DCLF       FILE(QSYS/QADSPOBJ)
000700050103
000800050124             DSPOBJD    OBJ(QSYS/INV*) OBJTYPE(*LIB) +
000900050124                          OUTPUT(*OUTFILE) OUTFILE(QTEMP/WWLIB)
001000050103
001100050103             OVRDBF     FILE(QADSPOBJ) TOFILE(QTEMP/wwlib)
001200050103 read:
001300050103             RCVF
001400050103             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDF))
001500050103
001600050103/* escludere TEST     */
001700050103
001800050103             IF         COND(&ODOBNM < &LIBD) THEN(GOTO CMDLBL(READ))
001900050103             IF         COND(&ODOBNM > &LIBA) THEN(GOTO CMDLBL(READ))
002000050103
002100050103             DSPOBJD    OBJ(&ODOBNM/*ALL) OBJTYPE(*ALL) +
002200050103                          OUTPUT(*OUTFILE) OUTFILE(QTEMP/WWOBJ)
002300050103
002400050124             CALL       PGM(STORINVR) PARM(&ODOBNM &ODOBTX &ODCRTU)
002500050103
002600070605             DLTLIB     LIB(&ODOBNM)
002700050103
002800050103             GOTO       CMDLBL(READ)
002900050103
003000050103 ENDF:
003100050124             DLTOVR     FILE(*ALL)
003200050103             ENDPGM
