000100170117             PGM
000200050103
000300170117 CICLO:
000400170117             DLTF       FILE(FILTRA201/FNBLP01I)
000500170117             MONMSG     MSGID(CPF0000) EXEC(DO)
000600170117             GOTO       CMDLBL(CICLO)
000700170117             ENDDO
000800050103
000900050103             ENDPGM
