000100990517     A          R QWHDRDBR                  PFILE(XRDBR00F)
000200990517     A          K WHRLI
000300990525     A          K WHRFI
000400990531     A          K WHREFI
000500990531     A          K WHRELI
000600990517     A          S WHRTYP                    CMP(EQ 'P')
