000100990520     A                                      DYNSLT
000200990514     A                                      JDFTVAL
000300990517     A          R XRDBRPGM                  JFILE(XRDBR00F XRPGM00F)
000400990514     A          J                           JOIN(XRDBR00F XRPGM00F)
000500990517     A                                      JFLD(WHREFI WHFNAM)
000600990517     A* Campi di XRDBR00F
000700990514     A            WHRTYP         1A
000800990514     A            WHRFI         10A
000900990514     A            WHRLI         10A
001000990514     A            WHRMB         10A
001100990514     A            WHRRD         10A
001200990514     A            WHNO           5S 0
001300990514     A            WHDTM         13A
001400990514     A            WHREFI        10A
001500990514     A            WHRELI        10A
001600990514     A            WHREMB        10A
001700990514     A            WHTYPE         1A
001800990514     A            WHJDIL         2S 0
001900990514     A            WHJREF         2S 0
002000990514     A            WHCTLN        10A
002100990514     A            WHCSTN       260A
002200990517     A* Campi di XRPGM00F
002300990514     A            WHLIB         10A
002400990514     A            WHPNAM        10A
002500990514     A            WHTEXT        50A
002600990514     A            WHFNUM         5S 0
002700990514     A            WHDTTM        13A
002800990514     A            WHFNAM        11A
002900990514     A            WHLNAM        11A
003000990514     A            WHSNAM        11A
003100990514     A            WHRFNO         3S 0
003200990514     A            WHFUSG         2S 0
003300990514     A            WHRFNM        10A
003400990514     A            WHRFSN        13A
003500990514     A            WHRFFN         5S 0
003600990514     A            WHOBJT         1A
003700990514     A            WHOTYP        10A
003800990514     A            WHSPKG         1A
003900990514     A            WHRFNB         5S 0
004000990517     A*
004100990517     A          K WHRFI
004200990517     A          K WHRLI
004300990517     A          K WHREFI
004400990517     A          K WHRELI
004500990520     A*
004600990520     A          S WHREFI                    CMP(NE ' ')
