000100990514     A                                      UNIQUE
000200990514     A          R XRLIB000                  PFILE(XRLIB00F)
000300990514     A          K XRFLIB
