000100900426     A*---------------------------------------------------------------*
000200900426     A*  ARCHIVI RICEVUTI
000300900426     A*---------------------------------------------------------------*
000400900426     A*
000500900426     A*
000600900426     A          R CMRIC000                  TEXT('ARCHIVI RICEVUTI   ')
000700900426     A            RICDSD         3  0       TEXT('DALLA FILIALE      ')
000800900426     A                                      COLHDG('FIL DA')
000900900426     A            RICTRA        10          TEXT('TRANSITO           ')
001000900426     A                                      COLHDG('TRANSITO')
001100900426     A            RICLBA        10          TEXT(' ALLA LIBRERIA     ')
001200900426     A                                      COLHDG('ALLA LIBRERIA')
001300900426     A            RICFLA        10          TEXT(' AL FILE           ')
001400900426     A                                      COLHDG('AL FILE')
001500900426     A            RICMBA        10          TEXT(' AL MEMBRO         ')
001600900426     A                                      COLHDG('AL MEMBRO')
001700900426     A            RICDAT         7  0       TEXT('DATA OPERAZIONE    ')
001800900426     A                                      COLHDG('DATA OP')
001900900426     A            RICORA         6  0       TEXT('ORA OPERAZIONE     ')
002000900426     A                                      COLHDG('ORA OP')
002100900426     A            RICFL1         1          TEXT('" "= DA CONTROLLARE')
002200900426     A            RICFL2         1          TEXT('USI FUTURI         ')
002300900427     A            RICNRR         7  0       TEXT('NR RECORD          ')
002400900427     A                                      COLHDG('RECORD')
002500900508     A            RICNR1         7  0       TEXT('NR RECORD CONTROL  ')
002600900508     A                                      COLHDG('RECORD CONTR')
002700900521     A            RICPRR        10          TEXT('PREREQUISITO       ')
002800900521     A                                      COLHDG('PREREQ.')
