000001921123     A* Menu a formato libero: CMZ000
000010921123     A*%%TS  SD  19921123  092317  QPGMR       REL-V2R1M0  5738-PW1
000020900719     A*  90/07/19  12:30:38    QSECOFR     REL-R02M00  5728-PW1
000030921123     A*%%EC
000040921123     A                                      DSPSIZ(24 80 *DS3                  -
000050921123     A                                             27 132 *DS4)
000060921123     A                                      CHGINPDFT
000070921123     A                                      INDARA
000080921123     A                                      PRINT(*LIBL/QSYSPRT)
000090900719     A*  90/07/19  12:30:38    QSECOFR     REL-R02M00  5728-PW1
000100921123     A          R CMZ000
000110921123     A*%%TS  SD  19921123  092317  QPGMR       REL-V2R1M0  5738-PW1
000120921123     A                                      DSPMOD(*DS3)
000130921123     A                                      LOCK
000140921123     A                                      SLNO(01)
000150921123     A                                      CLRL(*ALL)
000160921123     A                                      ALWROL
000170921123     A                                      CF03
000180921123     A                                      HELP
000190921123     A                                      HOME
000200921123     A                                      HLPRTN
000210921123     A                                  1  2'CMZ000'
000220921123     A                                      COLOR(BLU)
000230921123     A                                  1 33'CMZ000 Menu'
000240921123     A                                      DSPATR(HI)
000250921123     A                                  3  3'1.'
000260921123     A                                  4  3'2.'
000270921123     A                                  5  3'3.'
000280921123     A                                  6  3'4.'
000290921123     A                                  7  3'5.'
000300921123     A                                  8  3'6.'
000310921123     A                                  9  3'7.'
000320921123     A                                 10  3'8.'
000330921123     A                                 11  3'9.'
000340921123     A                                 12  2'10. Aggiorna configurazione sistem-
000350921123     A                                      i remoti '
000360921123     A                                  3  6'Parametri'
000370921123     A                                  3 16'Installazione'
000380921123     A                                  4  6'Anagrafica'
000390921123     A                                  4 17'sistemi'
000400921123     A                                  4 25'remoti'
000410921123     A                                  6  6'Invio'
000420921123     A                                  6 12'file'
000430921123     A                                  7  6'Gestione'
000440921123     A                                  7 15'code'
000450921123     A                                  7 20'di'
000460921123     A                                  7 23'invio'
000470921123     A                                  9  6'Visualizza'
000480921123     A                                  9 17'LOG'
000490921123     A                                  6 17'estemporaneo'
000500921123     A                                 10  6'Lista'
000510921123     A                                 10 12'archivi'
000520921123     A                                 10 20'non'
000530921123     A                                 10 24'spediti'
000540921123     A                                 13  2'11.'
000550921123     A                                 13  6'Pulizia'
000560921123     A                                 13 14'e'
000570921123     A                                 13 16'salvataggio'
000580921123     A                                 13 28'storici'
000590921123     A                                 11  6'Lista'
000600921123     A                                 11 12'archivi'
000610921123     A                                 11 20'spediti'
000620921123     A* CMDPROMPT  Non cancellare questa specifica DDS.
000621921123     A                                019  2'                                  -
000630921123     A                                          '
000640921123     A                                  5  6'Avvio'
000650921123     A                                  5 12'video'
000660921123     A                                  5 18'passante'
000670921123     A                                 14  2'12.'
000680921123     A                                 14  6'Menu'
000690921123     A                                 14 11'distribuzione'
000700921123     A                                 14 25'oggetti'
000710921123     A                                 16  2'13. Gestione salvataggio giornali'
000720921123     A                                  3 49'14.'
000730921123     A                                  3 53'Posta'
000740921123     A                                  4 49'15. Liste di distribuzione posta'
000750921123     A                                  5 49'16.'
000760921123     A                                  5 53'Pulizia'
000770921123     A                                  5 62'posta'
