000100930417 CMZ033C:    PGM
000500940117             DCL        VAR(&CTL)   TYPE(*CHAR) LEN(10)
000700910225             DCLF       FILE(QSYS/QADSPOBJ)
000701011123
000800011123             ADDLIBLE   LIB(GAITRAOBJ) POSITION(*LAST)
000801011123             MONMSG     MSGID(CPF0000)
000802011123
001000100518/* RICERCA TUTTE LE CONTROL UNIT REMOTE  */
001100910225
001110100518             DSPOBJD    OBJ(R*) OBJTYPE(*CTLD) OUTPUT(*OUTFILE) +
001111100518                          OUTFILE(QTEMP/§§REMAS) OUTMBR(*FIRST)
001112000509             MONMSG     MSGID(CPF0000)
001900910225
002000930617             OVRDBF     FILE(QADSPOBJ) TOFILE(QTEMP/§§REMAS)
002100910225READ:
002200910225             RCVF
002300110627             MONMSG     MSGID(CPF0864 CPF4101) EXEC(GOTO CMDLBL(ENDF))
002400910225
002800940117             CHGVAR     VAR(&CTL) VALUE(%SUBSTRING(&ODOBNM 1 10))
002900930617             CALL       PGM(CMZ033C1) PARM(&CTL)
002901100518             MONMSG     MSGID(CPF0000)
005200910226
005300910226             GOTO       CMDLBL(READ)
005500981104 ENDF:
005600981104             ENDPGM
