000001051219     A* Menu a formato libero: CMZ000
000010051219     A*%%TS  SD  20051219  165943  EDPSM       REL-V5R3M0  5722-WDS
000020051219     A*%%EC
000030051219     A                                      DSPSIZ(24 80 *DS3                  -
000040051219     A                                             27 132 *DS4)
000050051219     A                                      CHGINPDFT
000060051219     A                                      INDARA
000070051219     A                                      PRINT(*LIBL/QSYSPRT)
000700051219     A*
000080051219     A          R CMZ000
000090051219     A                                      DSPMOD(*DS3)
000100051219     A                                      LOCK
000110051219     A                                      SLNO(01)
000120051219     A                                      CLRL(*ALL)
000130051219     A                                      ALWROL
000140051219     A                                      CF03
000150051219     A                                      HELP
000160051219     A                                      HOME
000170051219     A                                      HLPRTN
000180051219     A                                  1  2'CMZ000'
000190051219     A                                      COLOR(BLU)
000200051219     A                                  1 33'CMZ000 Menu'
000210051219     A                                      DSPATR(HI)
000220051219     A*
000230051219     A                                  3  3'1. Parametri Installazione'
000240051219     A                                  4  3'2. Anagrafica sistemi remoti'
000250051219     A                                  5  3'3. Avvio video passante'
000260051219     A                                  6  3'4. Invio file estemporaneo'
000270051219     A                                  7  3'5. Gestione code di invio'
000280051219     A                                  8  3'6.'
000290051219     A                                  9  3'7. Visualizza LOG'
000300051219     A                                 10  3'8. Lista archivi non spediti'
000310051219     A                                 11  3'9. Lista archivi spediti'
000320051219     A                                 12  2'10. Aggiorna configurazione sistem-
000330051219     A                                      i remoti '
000340051219     A***                              13  2'11. Pulizia e salvataggio storici'
000350051219     A                                 14  2'12. Menu distribuzione oggetti'
000360051219     A                                 16  2'13. Gestione salvataggio giornali'
000370051219     A*
000380051219     A                                  3 48'14. Posta'
000390051219     A                                  4 48'15. Liste di distribuzione posta'
000400051219     A                                  5 48'16. Pulizia posta'
000410051219     A* CMDPROMPT  Non cancellare questa specifica DDS.
000420051219     A                                019  2'                                  -
000430051219     A                                          '
