000100900515     A*---------------------------------------------------------------*
000200900515     A*  PARAMETRI IN ENTRATA DI CMZ216R
000300900515     A*---------------------------------------------------------------*
000400900515     A*
000500900515     A*
000600900515     A          R CMZ216DS
000700900515     A            PDAT1          7S 0       TEXT('DALLA DATA         ')
000800900515     A            PDAT2          7S 0       TEXT(' ALLA DATA         ')
000900900515     A            PDST1          3S 0       TEXT('DALLA FILIALE      ')
001000900515     A            PDST2          3S 0       TEXT('ALLA FILIALE       ')
001100900515     A            PFLG           1          TEXT('" " DALL ULT. INVIO')
001200910404     A            PDET           1          TEXT('" =NO TOT 1=SOLO TOT 2=TUTTO')
