000100921104     A*
000200921104     A*---------------------------------------------------------------*
000300921104     A*  DS PER AREA DATI CMZM01
000400921104     A*---------------------------------------------------------------*
000500921104     A*
000600921104     A*
000700921104     A          R CMZM0100
000800921104     A            M01NRR         7A         TEXT('NUMERATORE')
