000500871019     A*  * TFAZI01L *                    - AZISEQ
000601981202     A                                      UNIQUE
001700000000     A          R TFAZI                     PFILE(TFAZI00F)
001900871019     A          K AZISEQ
