000100040805             PGM
000200020703
000300130530             OVRDBF     FILE(fltr7new) TOFILE(*LIBl/fltr702l) +
000400040805                          OVRSCOPE(*JOB)
000500161214             OVRDBF     FILE(fnmsaNew) TOFILE(*LIBl/fnmsa03l) +
000600161214                          OVRSCOPE(*JOB)
000700170210             OVRDBF     FILE(fimspnww) TOFILE(*LIBl/fimsp01l) +
000800170210                          OVRSCOPE(*JOB)
000900020701
001000020701             ENDPGM
