000100040805             PGM
000200020703
000300050228             OVRDBF     FILE(tntbenew) TOFILE(*LIBl/tntbe01l) +
000400040805                          OVRSCOPE(*JOB)
000500020701
000600020701             ENDPGM
