000100040805             PGM
000200020703
000300040915             OVRDBF     FILE(SISDTnew) TOFILE(*LIBl/SISDT01l) +
000400040805                          OVRSCOPE(*JOB)
000500040915             OVRDBF     FILE(SISDrnew) TOFILE(*LIBl/SISDr01l) +
000600040915                          OVRSCOPE(*JOB)
000700040915             OVRDBF     FILE(SISDfnew) TOFILE(*LIBl/SISDf01l) +
000800040915                          OVRSCOPE(*JOB)
000900020701
001000020701             ENDPGM
