000100100326 FITS63C:    PGM        PARM(&FILE &LIB &libparz)
000200100325             DCL        VAR(&FILE) TYPE(*CHAR) LEN(10)
000300100325             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10)
000400100326             DCL        VAR(&LIBparz) TYPE(*CHAR) LEN(10)
000500100326             DCLF       FILE(QSYS/QAFDBASI)
000600100326
000700100326/* Muovo via oggetti vecchi e sposto i nuovi    */
000800100326
000900100326
001000100326             DSPFD      FILE(&LIB/&FILE) TYPE(*BASATR) +
001100100326                          OUTPUT(*OUTFILE) FILEATR(*ALL) +
001200100326                          OUTFILE(QTEMP/§FPH3)
001300100326             MONMSG     MSGID(CPF3012 CPF3020)
001400100326
001500100326             OVRDBF     FILE(QAFDBASI) TOFILE(QTEMP/§FPH3)
001600100326
001700100326READ3:
001800100326             RCVF
001900100326             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDF3))
002000100326
002100100326             IF         COND(&ATFTYP = 'P' *OR &ATFTYP = 'L') THEN(DO)
002200100326
002300100326             MOVOBJ     OBJ(&LIB/&ATFILE) OBJTYPE(*FILE) TOLIB(ZUNIOLD)
002400100326             MOVOBJ     OBJ(&libparz/&ATFILE) OBJTYPE(*FILE) TOLIB(&LIB)
002500100326
002600100326             ENDDO
002700100326
002800100326             GOTO READ3
002900100326
003000100326ENDF3:
003100100326             ENDPGM
