000100040924     A          R TIVTL010                  PFILE(TIVTL10F)
000200050209     A          K VTLSUN
000300041129     A          K VTLRPYMMT                 DESCEND
