000100841213     A***- DDS/38 -* A N T A B 1 5 7 *-------------------***
000200841213     A*                                                    *
000300841213     A*          DESCRIZIONE ESTERNA TABELLA CLASSI        *
000400841213     A*          APPROVVIGIONAMENTO M.P.                   *
000500000000     A*                                                    *
000600000000     A***------------------------------------------------***
000700000000     A**
000800841213     A          R TAB157                    TEXT('TABELLA CLASSI APPROVVIGION.')
000900841213     A            DES157        25A         TEXT('DESCRIZIONE CLASSE APPROVV. ')
001000840926     A            FI1157         4A         TEXT('FILLER 1                    ')
001100000000     A            GGM157         3A         TEXT('GG. MEDI DI CONSEGNA        ')
001200840926     A            FI2157        43A         TEXT('FILLER 2                    ')
