000100841213     A**- DDS/38 -* A N T A B 1 5 1 *--------------------***
000200841213     A*                                                    *
000300990331     A*          DESCRIZIONE ESTERNA FATTURAZIONE MAGAZZINO*
000400841213     A*          D/A MAGAZZINO                             *
000500000000     A*                                                    *
000600000000     A***------------------------------------------------***
000700000000     A**
000800990331     A          R TAB155                    TEXT('TABELLA COLONNE D/A MAGAZZ. ')
000900990331     A            DES155        29A         TEXT('DESCRIZIONE ')
001000110914      *
001100110914     A            KCC155V        6A         TEXT('CC VENDITE - NON UTILIZZATO')
001200110914     A            KSC155V        8A         TEXT('SCONTO VEN- NON UTILIZZ.')
001300110914     A            ESE155V        3A         TEXT('ESENZ IVA VEN- NON UTILIZZ.')
001400110914     A            ALI155V        5S 2       TEXT('ALIQUOTA IVA VEN- NON UTIL.')
001500110914     A            VOC155V        8A         TEXT('VOCE CONTO VEN- NON UTILIZZ.')
001600110914      *
001700110902     A            PE1155V        1A         TEXT('ORDINE PIANIFICATO OBBLIGAT-
001800110902     A                                      ORIO')
001900110902     A            PE2155V        1A         TEXT('ORDINE PIANIFICATO FACOLTA-
002000110902     A                                      TIVO')
002100110902     A            PE3155V        1A         TEXT('ORDINE A -
002200110802     A                                      CONSUMO')
