000010990409     A*%%TS  SD  19990409  114951  EDPMM       REL-V4R2M0  5769-PW1
000020871209     A*            16:06:05    EDPGAI0001  REL-R08M00  5714-UT1
000030000000     A*** FILE : MPH114D ----------------------------------***
000040000000     A**         MANUTENZIONE MOVIMENTI DI MAGAZZINO M.P.   **
000050000000     A***--------------------------------------------------***
000060990409     A*%%EC
000070990409     A                                      DSPSIZ(24 80 *DS3)
000080990409     A                                      CHGINPDFT
000090990409     A                                      MSGLOC(24)
000100990409     A                                      PRINT
000110990409     A                                      CA03
000120871209     A*            16:06:05    EDPGAI0001  REL-R08M00  5714-UT1
000130000000     A*--------------------------------------------------------
000140990120     A          R MPH114TS
000150990120     A*%%TS  SD  19990120  171154  EDPMM       REL-V3R7M0  5716-PW1
000160990120     A                                      OVERLAY
000170990120     A            DESDIT        20A  O  1  3
000180990120     A                                  1 35'*-MPH/114-*'
000190990120     A                                      DSPATR(UL)
000200990120     A            KNMUS         10A  O  1 70
000210990120     A                                  2 19'*-->  Manutenz. Movimenti MAGAZZIN-
000220990120     A                                      O M.P. <--*'
000230990120     A                                      DSPATR(UL)
000240990120     A                                      DSPATR(RI)
000250990120     A                                  2 72DATE
000260990120     A                                      EDTCDE(Y)
000270990120     A  01                              3  3'Movimenti dal'
000280990120     A  01        DAL114         8Y 0O  3 17DSPATR(HI)
000290990120     A                                      EDTWRD('  /  /    ')
000300990120     A  01                              3 29'al'
000310990120     A  01        AL114          8Y 0O  3 33DSPATR(HI)
000320990120     A                                      EDTWRD('  /  /    ')
000330990120     A  01                              4  3'x|DatMov.|Codice     Prodotto     -
000340990120     A                                                  |cau|um.|   Quantità  |-
000350990120     A                                      Magazz.|'
000360990120     A                                      DSPATR(RI)
000370871209     A*            16:06:05    EDPGAI0001  REL-R08M00  5714-UT1
000380000000     A*--------------------------------------------------------
000390990409     A          R MPH114PT
000400990409     A*%%TS  SD  19990409  114951  EDPMM       REL-V4R2M0  5769-PW1
000410990409     A  90                                  ALARM
000420990409     A                                      OVERLAY
000430990409     A                                  8 23'Anno di Competenza ......:'
000440990409     A                                      DSPATR(UL)
000450990409     A            AAA114         4Y 0B  8 50
000460990409     A  10 90                               DSPATR(RI)
000470990409     A                                      DSPATR(CS)
000480990409     A                                      DSPATR(MDT)
000490990409     A                                 10 23'Codice Magazzino ........?'
000500990409     A            MAG114         7A  B 10 50DSPATR(HI)
000510990409     A                                      DSPATR(CS)
000520990409     A  11 90                               DSPATR(RI)
000530990409     A  11                                  DSPATR(PC)
000540990409     A                                 10 63'(9.9 = Tutti)'
000550990409     A                                 12 23'Movimenti dal '
000560990409     A                                      DSPATR(UL)
000570990409     A            DAL114         8Y 0B 12 38DSPATR(HI)
000580990409     A                                      DSPATR(CS)
000590990409     A  12 90                               DSPATR(RI)
000600990409     A                                      DSPATR(PC)
000610990409     A                                      EDTWRD('  /  /    ')
000620990409     A                                      EDTMSK('  &  &    ')
000630990409     A                                 12 50' al '
000640990409     A                                      DSPATR(UL)
000650990409     A            AL114          8Y 0B 12 56DSPATR(HI)
000660990409     A                                      DSPATR(CS)
000670990409     A  12 90                               DSPATR(RI)
000680990409     A                                      EDTWRD('  /  /    ')
000690990409     A                                      EDTMSK('  &  &    ')
000700990409     A                                 14 23'Causale .................?'
000710990409     A                                      DSPATR(UL)
000720990409     A            CAU114         3A  B 14 50DSPATR(CS)
000730990409     A                                      DSPATR(HI)
000740990409     A  13 90                               DSPATR(RI)
000750990409     A  13                                  DSPATR(PC)
000760990409     A                                 14 63'(999 = Tutte)'
000770990409     A                                 16 23'Codice Prodotto  ........?'
000780990409     A            MAT114        12A  B 16 50DSPATR(HI)
000790990409     A                                      DSPATR(CS)
000800990409     A  14 90                               DSPATR(RI)
000810990409     A  14                                  DSPATR(PC)
000820990409     A                                 16 63'(9.9 = Tutti)'
000830990409     A            DES114        30A  O 17 23DSPATR(UL)
000840990409     A                                 20 23'Data Stampa Giornale ....:'
000850990409     A                                      DSPATR(UL)
000860990409     A            DGIOV          8Y 0O 20 50EDTWRD('  /  /    ')
000870990409     A                                 23 10'F03=FINE LAVORO'
000880990409     A  90        ERRORE        30A  O 24 49DSPATR(RI)
000890871209     A*            16:06:05    EDPGAI0001  REL-R08M00  5714-UT1
000900000000     A*--------------------------------------------------------
000910990120     A          R SFL1                      SFL
000920990120     A*%%TS  SD  19990120  171154  EDPMM       REL-V3R7M0  5716-PW1
000930990121     A            RELREC         7Y 0H
000940990121     A            RELVID         5Y 0H
000950990121     A            MMPDMV         8Y 0H
000960990121     A            MMPNMV         5Y 0H
000970990121     A            MMPDDC         8Y 0H
000980990121     A            MMPNDC         7Y 0H
000990990120     A            MMPOPC        15A  H
001000990121     A            MMPCDC         8A  H
001010990121     A            MMPPRZ        14Y 5H
001020990315     A            MMPVAL         4A  H
001030990120     A            SCELTW         1A  H
001040990121     A            MMPCRG         7Y 0H
001050990120     A            SCELTA         1A  B  5  3DSPATR(CS)
001060990120     A  32                                  DSPATR(RI)
001070990120     A                                      CHECK(ER)
001080990120     A                                      VALUES('X' 'A' ' ')
001090990120     A            DATMOV         8  0O  5  5
001100990120     A            ARTIC         12A  O  5 14
001110990120     A            DESART        23A  O  5 27
001120990120     A            MMPCAU         3A  O  5 51
001130990120     A            MMPUMA         3A  O  5 55
001140990120     A            MMPQTA         9Y 2O  5 60DSPATR(HI)
001150990120     A                                      EDTWRD('     0 ,  -')
001160990120     A            MMPMAG         7A  O  5 73
001170871209     A*            16:06:05    EDPGAI0001  REL-R08M00  5714-UT1
001180000000     A*--------------------------------------------------------
001190990409     A          R SFL1CTL                   SFLCTL(SFL1)
001200990409     A*%%TS  SD  19990409  114951  EDPMM       REL-V4R2M0  5769-PW1
001210990409     A                                      CF01
001220990409     A                                      CF12
001230990409     A  90                                  ALARM
001240990409     A                                      OVERLAY
001250990409     A  71                                  SFLDSP
001260990409     A N70                                  SFLDSPCTL
001270990409     A  70                                  SFLCLR
001280990409     A                                      SFLSIZ(0014)
001290990409     A                                      SFLPAG(0013)
001300990409     A            CURSOR         4S 0H      SFLRCDNBR
001310990409     A            RELRF          7S 0H
001320990409     A            RELVF          5S 0H
001330990409     A            QTAAF          9Y 2H
001340990409     A            AZF           15A  H
001350990409     A                                 18  3'x|DatMov.| Codice       Prodotto  -
001360990409     A                                                   |cau|um.|  Quantità  |-
001370990409     A                                      Magazz.|'
001380990409     A                                      DSPATR(UL)
001390990409     A                                      DSPATR(RI)
001400990409     A            SCEF           1A  O 19  3
001410990409     A            DMVF           8Y 0O 19  5EDTCDE(Z)
001420990409     A            ARTF          12A  O 19 14DSPATR(HI)
001430990409     A            DESART        23A  O 19 27
001440990409     A            CAUF           3A  O 19 51
001450990409     A            UMAF           3A  O 19 55
001460990409     A            QTAF           9Y 2B 19 60EDTWRD('     0 ,  -')
001470990409     A                                      DSPATR(HI)
001480990409     A  91 90                               DSPATR(RI)
001490990409     A  40
001500990409     AO 91                                  DSPATR(PC)
001510990409     A                                      DSPATR(CS)
001520990409     A                                      CHECK(RB)
001530990409     A  43                                  ERRMSG('MANCA DISPONIBILITA' 43)
001540990409     A            MAGF           7A  O 19 73
001550990409     A                                 20 39'|N.doc.    del    |       Prezzo  -
001560990409     A                                            |'
001570990409     A                                      DSPATR(UL)
001580990409     A                                      DSPATR(RI)
001590990409     A            PRZVEN        14Y 5B 21 61CHECK(RB)
001600990409     A                                      DSPATR(UL)
001610990409     A                                      EDTWRD('       0 ,     -')
001620990409     A            TIPAF          1A  B 23 75DSPATR(UL)
001630990409     A                                 21  3'X = Variaz. ,  A = Annull.'
001640990409     A            NDOCF          7Y 0B 21 39
001650990409     A  92 90                               DSPATR(RI)
001660990409     A  92                                  DSPATR(PC)
001670990409     A                                      EDTWRD('     0 ')
001680990409     A                                      CHECK(RB)
001690990409     A                                      DSPATR(UL)
001700990409     A            DDOCF          8Y 0B 21 47
001710990409     A  92 90                               DSPATR(RI)
001720990409     A                                      DSPATR(UL)
001730990409     A                                      EDTWRD('  /  /    ')
001740990409     A                                      EDTMSK('  &  &    ')
001750990409     A            PRZF          14Y 5B 23 44DSPATR(UL)
001760990409     A                                      CHECK(RB)
001770990409     A  36                                  ERRMSG('COSTO NON VALIDO' 36)
001780990409     A                                      EDTWRD('       0 ,     -')
001790990409     A            CDCF           8A  B 23 61CHECK(RZ)
001800990409     A  93 90                               DSPATR(RI)
001810990409     A  93                                  DSPATR(PC)
001820990409     A                                      DSPATR(UL)
001830990409     A  90        ERRORE        30A  O 23  2DSPATR(RI)
001840990409     A                                 22 36'Valuta|    C o s t o    | C/costo -
001850990409     A                                       |Attr.C.|'
001860990409     A                                      DSPATR(RI)
001870990409     A                                      DSPATR(UL)
001880990409     A                                 24  3'F01= Annulla scelta'
001890990409     A            VALF           4A  O 23 37
001900990409     A                                 24 65'F12=Ritorno'
001910871209     A*            18:57:59    EDPGAI0001  REL-R08M00  5714-UT1
001920871209     A*--------------------------------------------------------
001930990409     A          R MPH110P2
001940990409     A*%%TS  SD  19990409  114951  EDPMM       REL-V4R2M0  5769-PW1
001950990409     A                                      CF12
001960990409     A            DESDIT        20A  O  1  3
001970990409     A                                  1 35'*-MPH/110-*'
001980990409     A                                      DSPATR(UL)
001990990409     A            KNMUS         10A  O  1 70
002000990409     A                                  2 19'*--> Immissione Movimenti MAGAZZIN-
002010990409     A                                      O M.P. <--*'
002020990409     A                                      DSPATR(UL)
002030990409     A                                      DSPATR(RI)
002040990409     A                                  2 72DATE
002050990409     A                                      EDTCDE(Y)
002060990409     A                                  3  2'Data e Numero Movimento...:'
002070990409     A                                      DSPATR(UL)
002080990409     A            MMPDMV         8Y 0O  3 31DSPATR(HI)
002090990409     A                                      EDTWRD('  /  /    ')
002100990409     A            MMPNMV         5Y 0O  3 42EDTCDE(Z)
002110990409     A                                      DSPATR(HI)
002120990409     A            MMPMAG         7A  O  4 31TEXT('MAGAZZINO SCARICO')
002130990409     A                                      DSPATR(HI)
002140990409     A            MMPCAU         3A  O  6 21DSPATR(HI)
002150990409     A            NDOCF          7Y 0O  5 42DSPATR(HI)
002160990409     A                                      EDTCDE(Z)
002170990409     A            DDOCF          8Y 0O  5 31DSPATR(HI)
002180990409     A                                      EDTWRD('  /  /    ')
002190990409     A            ARTF          12A  O  7 31DSPATR(RI)
002200990409     A            QTAF           9Y 2O  9 21EDTCDE(4)
002210990409     A                                      DSPATR(RI)
002220990409     A            LISV           3A  B 17 17DSPATR(UL)
002230990409     A            COLV           1Y 0B 17 22EDTCDE(Z)
002240990409     A                                      RANGE(1 5)
002250990409     A                                      DSPATR(UL)
002260990409     A            PRZVEN        14Y 5B 17 30EDTCDE(4)
002270990409     A                                      CHECK(RB)
002280990409     A                                      DSPATR(UL)
002290990409     A N74                                  DSPATR(PC)
002300990409     A  74                                  ERRMSG('MANCA PREZZO VENDITA' 74)
002310990409     A            SC1            5Y 2B 17 50EDTCDE(2)
002320990409     A                                      CHECK(RB)
002330990409     A                                      DSPATR(UL)
002340990409     A            SC2            5Y 2B 17 61EDTCDE(2)
002350990409     A                                      CHECK(RB)
002360990409     A                                      DSPATR(UL)
002370990409     A            NPRTC          7Y 0B 20 52EDTCDE(Z)
002380990409     A                                      DSPATR(UL)
002390990409     A                                      CHECK(RB)
002400990409     A  77                                  ERRMSG('DATI ERRATI' 77)
002410990409     A            DPRTC          8Y 0B 20 60DSPATR(UL)
002420990409     A  77                                  ERRMSG('DATI ERRATI' 77)
002430990409     A                                      EDTWRD('  /  /    ')
002440990409     A                                      EDTMSK('  &  &    ')
002450990409     A            NPRTI          7Y 0B 20 72EDTCDE(Z)
002460990409     A                                      DSPATR(UL)
002470990409     A                                      CHECK(RB)
002480990409     A  77                                  ERRMSG('DATI ERRATI' 77)
002490990409     A            TSCCCL         8Y 0O 12 32EDTCDE(Z)
002500990409     A                                  4  2'Magazzino.................:'
002510990409     A                                      DSPATR(UL)
002520990409     A                                  6  2'Causale ........:'
002530990409     A                                      DSPATR(UL)
002540990409     A                                  5  2'Data e Numero Documento...:'
002550990409     A                                      DSPATR(UL)
002560990409     A                                  9  2'Quantità........:'
002570990409     A                                      DSPATR(UL)
002580990409     A                                  7  2'Materiale ................:'
002590990409     A                                      DSPATR(UL)
002600990409     A            DESART        23A  O  7 45DSPATR(RI)
002610990409     A                                 10  2'Costo...........:'
002620990409     A                                      DSPATR(UL)
002630990409     A            PRZF          14Y 5O 10 32EDTCDE(4)
002640990409     A                                      DSPATR(HI)
002650990409     A                                 20  3'Numero e data Protocollo per esenz-
002660990409     A                                      ione Iva ....:'
002670990409     A                                      DSPATR(UL)
002680990409     A                                 16 11'Listino Vendita        Prezzo     -
002690990409     A                                         Sconto 1   Sconto 2'
002700990409     A                                      DSPATR(RI)
002710990409     A                                      DSPATR(UL)
002720990409     A                                 12  2'Cliente ..................:'
002730990409     A            DESCLI        30A  O 12 42
002740990409     A                                 13  2'Attribuzione:'
002750990409     A                                      DSPATR(UL)
002760990409     A            TIPAF          1A  O 13 18DSPATR(HI)
002770990409     A            DESATC        25A  O 13 20
002780990409     A                                 24  2'Enter-Controlli'
002790990409     A                                      DSPATR(HI)
002800990409     A                                 24 60'F12-  Ritorno    '
002810990409     A                                      DSPATR(HI)
