000100000000             PGM        PARM(&KPJBA)
000200000000             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
000300990415CALL       PGM(*LIBL/TII324R) PARM(&KPJBA)
000400990415RGZPFM     FILE(*LIBL/TMSOC00F)
000500000000             ENDPGM
