000010990409     A*%%TS  SD  19990409  162315  EDPMM       REL-V4R2M0  5769-PW1
000020880628     A*            19:34:07    EDPGAI2131  REL-R08M00  5714-UT1
000030870514     A*** FILE : OCO150D ----------------------------------***
000040000000     A**         INTERROGAZIONE GENERALE PORTAFOGLIO        **
000050000000     A***--------------------------------------------------***
000060990409     A*%%EC
000070990409     A                                      DSPSIZ(24 80 *DS3)
000080990409     A                                      CHGINPDFT
000090990409     A                                      MSGLOC(24)
000100990409     A                                      PRINT
000110990409     A                                      CA03
000120871002     A          R OCO150T1
000130000000     A***-------------------------------------------------------------
000140871002     A                                      TEXT('TESTATE VARIE')
000150871002     A                                      BLINK
000160871002     A                                      OVERLAY
000170871002     A            DESDIT        20A  O  1  2TEXT('DESCRIZIONE DITTA')
000180871002     A                                  1 39'*-OF/N150-*'
000190871002     A                                      DSPATR(HI)
000200871002     A                                  1 72DATE
000210871002     A                                      EDTCDE(Y)
000220880915     A                                  2 25'* INTERROGAZIONE O.C. PER DATA ORD-
000230880915     A                                      INE * '
000240871002     A                                      DSPATR(UL)
000250871002     A                                      DSPATR(RI)
000260871002     A            KNMUS         10A  O  2 70TEXT('UTENTE')
000270000000     A***-------------------------------------------------------------
000280990409     A          R OCO150PT
000290990409     A*%%TS  SD  19990409  160647  EDPMM       REL-V4R2M0  5769-PW1
000300990409     A                                      TEXT('PROMPT PARZIALIZZAZIONI')
000310990409     A                                      BLINK
000320990409     A  90                                  ALARM
000330990409     A                                      OVERLAY
000340990409     A                                  4  2'Cliente ......?'
000350990409     A            FOR150         8A  B  4 18DSPATR(CS)
000360990409     A                                      DSPATR(HI)
000370990409     A  81 90                               DSPATR(RI)
000380990409     A  81                                  DSPATR(PC)
000390990409     A                                      CHECK(RZ)
000400990409     A            DESFOR        48A  B  4 30DSPATR(UL)
000410990409     A                                  5  2'oppure'
000420990409     A                                      DSPATR(BL)
000430990409     A                                  6  2'Articolo......?'
000440990409     A            DESMAT        30A  B  6 34DSPATR(UL)
000450990409     A                                 11  2'Ordini in Portafoglio dal.:'
000460990409     A            DAL            8Y 0B 11 30DSPATR(HI)
000470990409     A                                      DSPATR(CS)
000480990409     A  83 90                               DSPATR(RI)
000490990409     A  83                                  DSPATR(PC)
000500990409     A                                      EDTWRD('  /  /    ')
000510990409     A                                      EDTMSK('  &  &    ')
000520990409     A                                 11 41'al'
000530990409     A            AL             8Y 0B 11 44DSPATR(HI)
000540990409     A                                      DSPATR(CS)
000550990409     A  83 90                               DSPATR(RI)
000560990409     A                                      EDTWRD('  /  /    ')
000570990409     A                                      EDTMSK('  &  &    ')
000580990409     A            SNV150         1A  B 11 78DSPATR(CS)
000590990409     A                                      DSPATR(HI)
000600990409     A                                      VALUES('S' 'N')
000610990409     A                                      DSPATR(MDT)
000620990409     A                                 13 16'Selezione :                       -
000630990409     A                                            ( 9..9 = Tutto)    '
000640990409     A                                      DSPATR(UL)
000650990409     A                                      DSPATR(HI)
000660990409     A                                 14 16'Tipo Ordine...?'
000670990409     A            TOR150         2A  B 14 32DSPATR(CS)
000680990409     A                                      DSPATR(HI)
000690990409     A  84 90                               DSPATR(RI)
000700990409     A  84                                  DSPATR(PC)
000710990409     A            DESTOR        25A  O 14 44
000720990409     A                                 15 16'Tipo Righe....:'
000730990409     A            TR1150         1A  B 15 32DSPATR(HI)
000740990409     A                                      DSPATR(CS)
000750990409     A  85 90                               DSPATR(RI)
000760990409     A  85 90                               DSPATR(PC)
000770990409     A            TR2150         1A  B 15 35DSPATR(HI)
000780990409     A                                      DSPATR(CS)
000790990409     A            TR3150         1A  B 15 38DSPATR(HI)
000800990409     A                                      DSPATR(CS)
000810990409     A            TR4150         1A  B 15 41DSPATR(HI)
000820990409     A                                      DSPATR(CS)
000830990409     A            TR5150         1A  B 15 44DSPATR(HI)
000840990409     A                                      DSPATR(CS)
000850990409     A            TR6150         1A  B 15 47DSPATR(HI)
000860990409     A                                      DSPATR(CS)
000870990409     A            TR7150         1A  B 15 50DSPATR(HI)
000880990409     A                                      DSPATR(CS)
000890990409     A            TR8150         1A  B 15 53DSPATR(HI)
000900990409     A                                      DSPATR(CS)
000910990409     A            TR9150         1A  B 15 56DSPATR(HI)
000920990409     A                                      DSPATR(CS)
000930990409     A                                 16 16'Gruppo   Merc.?'
000940990409     A            GRM150         2A  B 16 32DSPATR(CS)
000950990409     A                                      DSPATR(HI)
000960990409     A  86 90                               DSPATR(RI)
000970990409     A  86                                  DSPATR(PC)
000980990409     A            DESGRM        25A  O 16 44
000990990409     A                                 17 16'Settore  Merc.?'
001000990409     A            SEM150         2A  B 17 32DSPATR(HI)
001010990409     A                                      DSPATR(CS)
001020990409     A  87 90                               DSPATR(RI)
001030990409     A  87                                  DSPATR(PC)
001040990409     A            DESSEM        25A  O 17 44
001050990409     A                                 18 16'Classe   Merc.?'
001060990409     A            CLM150         3A  B 18 32DSPATR(CS)
001070990409     A                                      DSPATR(HI)
001080990409     A  88 90                               DSPATR(RI)
001090990409     A  88                                  DSPATR(PC)
001100990409     A            DESCLM        25A  O 18 44
001110990409     A                                 19 16'S/Classe Merc.?'
001120990409     A            SCM150         5A  B 19 32DSPATR(CS)
001130990409     A                                      DSPATR(HI)
001140990409     A  89 90                               DSPATR(RI)
001150990409     A  89                                  DSPATR(PC)
001160990409     A            DESSCM        25A  O 19 44
001170990409     A                                 20 16'Fase Righe....:'
001180990409     A            FA1150         2A  B 20 32DSPATR(HI)
001190990409     A                                      DSPATR(CS)
001200990409     A  91 90                               DSPATR(RI)
001210990409     A  91 90                               DSPATR(PC)
001220990409     A            FA2150         2A  B 20 36DSPATR(HI)
001230990409     A                                      DSPATR(CS)
001240990409     A            FA3150         2A  B 20 40DSPATR(HI)
001250990409     A                                      DSPATR(CS)
001260990409     A            FA4150         2A  B 20 44DSPATR(CS)
001270990409     A                                      DSPATR(HI)
001280990409     A            FA5150         2A  B 20 48DSPATR(CS)
001290990409     A                                      DSPATR(HI)
001300990409     A                                 21 16'Magazzino.....?'
001310990409     A            MAG150         7A  B 21 32DSPATR(HI)
001320990409     A                                      DSPATR(CS)
001330990409     A  92 90                               DSPATR(RI)
001340990409     A  92                                  DSPATR(PC)
001350990409     A            DESMAG        30A  O 21 44
001360990409     A  90        ERRORE        40A  O 23 23DSPATR(RI)
001370990409     A            MAT150        12A  B  6 18DSPATR(HI)
001380990409     A                                      DSPATR(CS)
001390990409     A  82 90                               DSPATR(RI)
001400990409     A  82                                  DSPATR(PC)
001410990409     A                                 24 59'F03= Fine lavoro'
001420990409     A                                 11 56'Valorizzati..(S/N)..'
001430000000     A***-------------------------------------------------------------
001440990126     A          R SFL1                      SFL
001450990126     A*%%TS  SD  19990126  113402  EDPMM       REL-V3R7M0  5716-PW1
001460990126     A                                      TEXT('INTERROGAZIONE X ARTICOLO')
001470990126     A            MOCFOR         8A  H
001480990126     A            FOPRSI        30A  H
001490990126     A            MOCDOR         8S 0H
001500990126     A            IMPMER        14S 5H
001510990126     A            SCELTA         1A  I  5  2DSPATR(CS)
001520990126     A                                      DSPATR(HI)
001530990126     A                                      VALUES(' ' 'F' 'O' 'I')
001540990126     A                                      CHECK(ER)
001550990126     A            DESFFF        20A  O  5  4
001560990126     A            MOCNOR         5Y 0O  5 25EDTCDE(4)
001570990126     A            MOCTOR         2A  O  5 31
001580990126     A            MOCUMQ         3A  O  5 34
001590990126     A            QTAMOC         8Y 2O  5 38DSPATR(HI)
001600990126     A                                      EDTWRD('      ,  ')
001610990126     A            MOCFAS         2A  O  5 48
001620990126     A  93                                  DSPATR(HI)
001630990126     A            MOCMAG         7A  O  5 51
001640990126     A            MOCVAL         4A  O  5 59
001650990126     A            PRZMOC        13Y 4O  5 64EDTWRD('         ,    ')
001660990126     A            MOCTRG         1A  O  5 79
001670000000     A***-------------------------------------------------------------
001680880628     A*            19:34:07    EDPGAI2131  REL-R08M00  5714-UT1
001690000000     A***-------------------------------------------------------------
001700990409     A          R SFL1CT                    SFLCTL(SFL1)
001710990409     A*%%TS  SD  19990409  162315  EDPMM       REL-V4R2M0  5769-PW1
001720990409     A                                      CF08
001730990409     A                                      CF12
001740990409     A                                      BLINK
001750990409     A                                      OVERLAY
001760990409     A  71                                  SFLDSP
001770990409     A N70                                  SFLDSPCTL
001780990409     A  70                                  SFLCLR
001790990409     A                                      SFLSIZ(0017)
001800990409     A                                      SFLPAG(0016)
001810990409     A                                  3  2'Articolo ..:'
001820990409     A            MAT150        12A  O  3 15DSPATR(HI)
001830990409     A            DESKK1        28A  O  3 28
001840990409     A                                  3 57'dal'
001850990409     A            DAL            8Y 0O  3 61DSPATR(HI)
001860990409     A                                  3 70'al'
001870990409     A            AL             8Y 0O  3 73DSPATR(HI)
001880990409     A                                  4  2'X| Cliente            |Ordine  |U.-
001890990409     A                                      M|   Qta.  |Fa|Magazz.|Div.|    Pre-
001900990409     A                                      zzo    |T'
001910990409     A                                      DSPATR(UL)
001920990409     A                                      DSPATR(HI)
001930000000     A***-------------------------------------------------------------
001940990126     A          R SFL2                      SFL
001950990126     A*%%TS  SD  19990126  113402  EDPMM       REL-V3R7M0  5716-PW1
001960990126     A                                      TEXT('INTERROGAZIONE X cliente')
001970990126     A            MOCMAT        12A  O  5  4
001980990126     A            MOCDMT        30A  H
001990990126     A            MOCDOR         8S 0H
002000990126     A            IMPMER        14S 5H
002010990126     A            SCELTA         1A  I  5  2DSPATR(CS)
002020990126     A                                      DSPATR(HI)
002030990126     A                                      VALUES(' ' 'A' 'O' 'I')
002040990126     A                                      CHECK(ER)
002050990126     A            DESAAA        24A  O  5 17
002060990126     A            MOCNOR         5Y 0O  5 42EDTCDE(4)
002070990126     A            MOCTOR         2A  O  5 48
002080990126     A            MOCUMQ         3A  H
002090990126     A            QTAMOC         8Y 2O  5 51DSPATR(HI)
002100990126     A                                      EDTWRD('      ,  ')
002110990126     A            MOCFAS         2A  O  5 61
002120990126     A  93                                  DSPATR(HI)
002130990126     A            MOCMAG         7A  H
002140990126     A            MOCVAL         4A  H
002150990126     A            PRZMOC        13Y 4O  5 64EDTWRD('         ,    ')
002160990126     A            MOCTRG         1A  O  5 79
002170000000     A***-------------------------------------------------------------
002180880628     A*            19:34:07    EDPGAI2131  REL-R08M00  5714-UT1
002190000000     A*-------------------------------------
002200990409     A          R SFL2CT                    SFLCTL(SFL2)
002210990409     A*%%TS  SD  19990409  162315  EDPMM       REL-V4R2M0  5769-PW1
002220990409     A                                      CF08
002230990409     A                                      CF12
002240990409     A                                      BLINK
002250990409     A                                      OVERLAY
002260990409     A  71                                  SFLDSP
002270990409     A N70                                  SFLDSPCTL
002280990409     A  70                                  SFLCLR
002290990409     A                                      SFLSIZ(0017)
002300990409     A                                      SFLPAG(0016)
002310990409     A                                  3  2'Cliente ....:'
002320990409     A            FOR150         8A  O  3 16DSPATR(HI)
002330990409     A            DESKK2        30A  O  3 25
002340990409     A                                  3 56'dal'
002350990409     A            DAL            8Y 0O  3 60DSPATR(HI)
002360990409     A                                  3 69'al'
002370990409     A            AL             8Y 0O  3 72DSPATR(HI)
002380990409     A                                  4  2'X|Materiale                       -
002390990409     A                                              Ordine   Quantita''      Pr-
002400990409     A                                      ezzo    |T'
002410990409     A                                      DSPATR(UL)
002420990409     A                                      DSPATR(HI)
002430000000     A***-------------------------------------------------------------
002440990409     A          R OCO150FD
002450990409     A*%%TS  SD  19990409  162315  EDPMM       REL-V4R2M0  5769-PW1
002460990409     A                                      TEXT('TOTALI DI FONDO')
002470990409     A                                      CF12
002480990409     A                                      CF08
002490990409     A                                      OVERLAY
002500990409     A  01                             22  2'F'
002510990409     A                                      DSPATR(HI)
002520990409     A  02                             22  2'A'
002530990409     A                                      DSPATR(HI)
002540990409     A  01                             22  4'= Interr. Cliente '
002550990409     A                                      DSPATR(UL)
002560990409     A  02                             22  4'= Interr. ARTICOLO'
002570990409     A                                      DSPATR(UL)
002580990409     A                                 22 28'I'
002590990409     A                                      DSPATR(HI)
002600990409     A                                 22 30'= Interrog. ORDINI'
002610990409     A                                      DSPATR(UL)
002620990409     A                                 22 54'O'
002630990409     A                                      DSPATR(HI)
002640990409     A                                 22 56'= Revisione ORDINE'
002650990409     A                                      DSPATR(UL)
002660990409     A  01                             23 25'Quantità..:'
002670990409     A                                      DSPATR(HI)
002680990409     A  01        TOTQTA        11Y 2O 23 37DSPATR(UL)
002690990409     A                                      DSPATR(HI)
002700990409     A                                      DSPATR(BL)
002710990409     A                                      EDTWRD('         ,  ')
002720990409     A  03                             23 51'Valore...:'
002730990409     A                                      DSPATR(HI)
002740990409     A  03        TOTVAL        14Y 5O 23 62DSPATR(UL)
002750990409     A                                      DSPATR(HI)
002760990409     A                                      DSPATR(BL)
002770990409     A                                      EDTCDE(2)
002780990409     A                                 24  3'F08= Stampa'
002790990409     A                                 24 60'F12= Ritorno'
