000010990409     A*%%TS  SD  19990409  142829  EDPMM       REL-V4R2M0  5769-PW1
000020860401     A*** FILE : OFN170D ----------------------------------***
000030860401     A**         INTERROG. ARCHIVIO STORICO ORDINI FORNIT.  **
000040851113     A***--------------------------------------------------***
000050990409     A*%%EC
000060990409     A                                      DSPSIZ(24 80 *DS3)
000070990409     A                                      CHGINPDFT
000080990409     A                                      MSGLOC(24)
000090990409     A                                      PRINT
000100990409     A                                      CA03
000110851105     A*----------------------------------------------------------------
000120990409     A          R OFN170PT
000130990409     A*%%TS  SD  19990409  142829  EDPMM       REL-V4R2M0  5769-PW1
000140990409     A                                      BLINK
000150990409     A  90                                  ALARM
000160990409     A                                      OVERLAY
000170990409     A            DESDIT        20A  O  1  2TEXT('DESCRIZIONE DITTA')
000180990409     A                                  1 24'              *-OF/N170-*         -
000190990409     A                                             '
000200990409     A                                      DSPATR(HI)
000210990409     A                                      DSPATR(UL)
000220990409     A                                  1 72DATE
000230990409     A                                      EDTCDE(Y)
000240990409     A                                  2 22'INTERROGAZIONE ORDINI FORNITORI X -
000250990409     A                                      DATA BOLLA*'
000260990409     A                                      DSPATR(UL)
000270990409     A                                      DSPATR(RI)
000280990409     A            KNMUS         10A  O  2 70TEXT('UTENTE')
000290990409     A                                  6  2'Ordinamento ....................:'
000300990409     A                                      DSPATR(UL)
000310990409     A                                      DSPATR(HI)
000320990409     A            ORD170         1A  B  6 36DSPATR(HI)
000330990409     A                                      DSPATR(CS)
000340990409     A                                      DSPATR(MDT)
000350990409     A                                      VALUES('1' '2' ' ')
000360990409     A  60 90                               DSPATR(RI)
000370990409     A  60                                  DSPATR(PC)
000380990409     A                                  6 45'( Fornit. = 1,  Prodotto = 2 )'
000390990409     A                                      DSPATR(HI)
000400990409     A                                      DSPATR(UL)
000410990409     A                                  7  6'1)'
000420990409     A                                      DSPATR(HI)
000430990409     A                                  7 10'Fornitore.....?'
000440990409     A            FOR170         8A  B  7 26DSPATR(CS)
000450990409     A                                      DSPATR(HI)
000460990409     A                                      CHECK(RZ)
000470990409     A  61 90                               DSPATR(RI)
000480990409     A  61                                  DSPATR(PC)
000490990409     A            DESFOR        30A  B  7 45DSPATR(UL)
000500990409     A                                  8 10'Settore.Merc..?'
000510990409     A            STM170         2A  B  8 32DSPATR(CS)
000520990409     A                                      DSPATR(HI)
000530990409     A  62 90                               DSPATR(RI)
000540990409     A  62                                  DSPATR(PC)
000550990409     A            DESSTM        25A  O  8 45
000560990409     A                                  9 10'Gruppo..Merc..?'
000570990409     A            GPM170         2A  B  9 32DSPATR(HI)
000580990409     A                                      DSPATR(CS)
000590990409     A                                      CHECK(RZ)
000600990409     A  63 90                               DSPATR(RI)
000610990409     A  63                                  DSPATR(PC)
000620990409     A            DESGPM        25A  O  9 45
000630990409     A                                 13  6'2)'
000640990409     A                                      DSPATR(HI)
000650990409     A                                 13 10'Prodotto......?'
000660990409     A            ART170        12A  B 13 27DSPATR(HI)
000670990409     A                                      DSPATR(CS)
000680990409     A  65 90                               DSPATR(RI)
000690990409     A  65                                  DSPATR(PC)
000700990409     A            DESART        30A  B 13 45DSPATR(UL)
000710990409     A                                 14 10'S/Classe.Merc.?'
000720990409     A            SCM170         5A  B 14 29DSPATR(HI)
000730990409     A                                      DSPATR(CS)
000740990409     A  66 90                               DSPATR(RI)
000750990409     A  66                                  DSPATR(PC)
000760990409     A            DESSCM        25A  O 14 45
000770990409     A                                 15 10'Classe...Merc.?'
000780990409     A            CLM170         3A  B 15 31DSPATR(CS)
000790990409     A                                      DSPATR(HI)
000800990409     A  67 90                               DSPATR(RI)
000810990409     A  67                                  DSPATR(PC)
000820990409     A            DESCLM        25A  O 15 45
000830990409     A                                 20  2'Selezione     :                   -
000840990409     A                                                                    (9.9 -
000850990409     A                                      = Tutto) '
000860990409     A                                      DSPATR(UL)
000870990409     A                                      DSPATR(HI)
000880990409     A            DAL            8Y 0B 21 16DSPATR(HI)
000890990409     A                                      DSPATR(CS)
000900990409     A  74 90                               DSPATR(RI)
000910990409     A  74                                  DSPATR(PC)
000920990409     A                                      EDTWRD('  /  /    ')
000930990409     A                                      EDTMSK('  &  &    ')
000940990409     A                                 21 27'al'
000950990409     A            AL             8Y 0B 21 30DSPATR(HI)
000960990409     A                                      DSPATR(CS)
000970990409     A  74 90                               DSPATR(RI)
000980990409     A                                      EDTWRD('  /  /    ')
000990990409     A                                      EDTMSK('  &  &    ')
001000990409     A            TIP170         2A  B 21 55DSPATR(CS)
001010990409     A                                      DSPATR(HI)
001020990409     A  75 90                               DSPATR(RI)
001030990409     A  75                                  DSPATR(PC)
001040990409     A                                 21 60'Fase Righe....:'
001050990409     A            FAS170         2A  B 21 77DSPATR(MDT)
001060990409     A                                      VALUES('BB' 'FA' '99')
001070990409     A                                      DSPATR(CS)
001080990409     A                                      DSPATR(HI)
001090990409     A                                 22  2'Unità di Misura :'
001100990409     A                                 22 20'AQ'
001110990409     A                                      DSPATR(HI)
001120990409     A            TG1170         1A  B 22 55DSPATR(HI)
001130990409     A                                      DSPATR(MDT)
001140990409     A                                      VALUES('1' '2' '3' 'C' 'D' 'I' 'S' -
001150990409     A                                      ' ')
001160990409     A                                      DSPATR(CS)
001170990409     A            TG2170         1A  B 22 58DSPATR(HI)
001180990409     A                                      DSPATR(CS)
001190990409     A                                      DSPATR(MDT)
001200990409     A                                      VALUES('1' '2' '3' 'C' 'D' 'I' 'S' -
001210990409     A                                      ' ')
001220990409     A            TG3170         1A  B 22 61DSPATR(HI)
001230990409     A                                      DSPATR(CS)
001240990409     A                                      DSPATR(MDT)
001250990409     A                                      VALUES('1' '2' '3' 'C' 'D' 'I' 'S' -
001260990409     A                                      ' ')
001270990409     A            TG4170         1A  B 22 64DSPATR(HI)
001280990409     A                                      DSPATR(CS)
001290990409     A                                      DSPATR(MDT)
001300990409     A                                      VALUES('1' '2' '3' 'C' 'D' 'I' 'S' -
001310990409     A                                      ' ')
001320990409     A            TG5170         1A  B 22 67DSPATR(HI)
001330990409     A                                      DSPATR(CS)
001340990409     A                                      DSPATR(MDT)
001350990409     A                                      VALUES('1' '2' '3' 'C' 'D' 'I' 'S' -
001360990409     A                                      ' ')
001370990409     A            TG6170         1A  B 22 70DSPATR(HI)
001380990409     A                                      DSPATR(CS)
001390990409     A                                      DSPATR(MDT)
001400990409     A                                      VALUES('1' '2' '3' 'C' 'D' 'I' 'S' -
001410990409     A                                      ' ')
001420990409     A            TG7170         1A  B 22 73DSPATR(HI)
001430990409     A                                      DSPATR(CS)
001440990409     A                                      DSPATR(MDT)
001450990409     A                                      VALUES('1' '2' '3' 'C' 'D' 'I' 'S' -
001460990409     A                                      ' ')
001470990409     A  90        ERRORE        30A  O 24 27DSPATR(RI)
001480990409     A                                 24 59'F03= Fine Lavoro'
001490990409     A                                 21  2'Movimenti dal'
001500990409     A                                 21 42'Tipo ordine'
001510990409     A                                 22 42'Tipo Riga'
001520851111     A*----------------------------------------------------------------
001530990204     A          R OFN170TS
001540990204     A*%%TS  SD  19990204  144927  EDPMM       REL-V3R7M0  5716-PW1
001550990204     A                                      OVERLAY
001560990204     A            DESDIT        20A  O  1  2TEXT('DESCRIZIONE DITTA')
001570990204     A                                  1 24'              *-OF/N170-*         -
001580990204     A                                              '
001590990204     A                                      DSPATR(HI)
001600990204     A                                      DSPATR(UL)
001610990204     A                                  1 72DATE
001620990204     A                                      EDTCDE(Y)
001630990204     A  01                              2 21'*--> Interr.  ORDINI  FORNITORI   -
001640990204     A                                      x Fornit. <--*'
001650990204     A                                      DSPATR(UL)
001660990204     A                                      DSPATR(RI)
001670990204     A  02                              2 21'*--> Interr.  ORDINI  FORNITORI   -
001680990204     A                                      x Prodotto<--*'
001690990204     A                                      DSPATR(UL)
001700990204     A                                      DSPATR(RI)
001710990204     A            KNMUS         10A  O  2 70TEXT('UTENTE')
001720990204     A            DESORD        15A  O  4  1
001730990204     A            CODORD        12A  O  4 17DSPATR(HI)
001740990204     A            DES170        30A  O  4 30
001750990204     A                                  5 30'dal'
001760990204     A            DAL            8Y 0O  5 34DSPATR(HI)
001770990204     A                                      EDTWRD('  /  /    ')
001780990204     A                                  5 47'al'
001790990204     A            AL             8Y 0O  5 51DSPATR(HI)
001800990204     A                                      EDTWRD('  /  /    ')
001810990204     A                                  5 66'Pagine :'
001820990204     A                                      DSPATR(UL)
001830990204     A            PAGINE         4Y 0O  5 76DSPATR(HI)
001840990204     A                                      EDTCDE(Z)
001850990204     A                                      DSPATR(UL)
001860990204     A                                  6  2'V| Prodotto                       -
001870990204     A                                      Quantita    FA Fornitore         Pr-
001880990204     A                                      ez.Netto'
001890990204     A                                      DSPATR(UL)
001900990204     A                                      DSPATR(RI)
001910851112     A*----------------------------------------------------------------
001920990315     A          R SFL1                      SFL
001930990315     A*%%TS  SD  19990315  182105  EDPMM       REL-V3R7M0  5716-PW1
001940990315     A            NRELV          5S 0H
001950990315     A            MOFFOR         8A  H
001960990315     A            MOFNOR         5S 0H
001970990315     A            MOFDOR         8S 0H
001980990315     A            MOFTOR         2A  H
001990990315     A            MOFDCN         8S 0H
002000990315     A            MOFLIS         3A  H
002010990315     A            MOFCPG         3A  H
002020990315     A            MOFNBL         7S 0H
002030990315     A            MOFDBL         8S 0H
002040990315     A            MOFNFT         9S 0H
002050990315     A            MOFDFT         8S 0H
002060990315     A            MOFGPM         2A  H
002070990315     A            MOFSTM         2A  H
002080990315     A            MOFCMB        13S 6H
002090990315     A            MOFPRZ        14S 5H
002100990315     A            MOFDPT         8S 0H
002110990315     A            MOFNPT         9S 0H
002120990315     A            MOFTRG         1A  H
002130990315     A            MOFUMQ         3A  H
002140990315     A            MOFVAL         4A  H
002150990315     A            VISUAL         1A  I  7  2DSPATR(CS)
002160990315     A                                      DSPATR(HI)
002170990315     A                                      VALUES(' ' 'V')
002180990315     A                                      CHECK(ER)
002190990315     A            MOFMAT        12A  O  7  4
002200990315     A            DESAR1        18A  O  7 17
002210990315     A  91                                  DSPATR(HI)
002220990315     A  91                                  DSPATR(BL)
002230990315     A            MOFQTA         9Y 2O  7 36EDTWRD('     0 ,  -')
002240990315     A            MOFFAS         2A  O  7 48
002250990315     A            DESFO1        15A  O  7 51
002260990315     A            PRZMOF        12Y 3O  7 67EDTCDE(4)
002270851112     A*----------------------------------------------------------------
002280990409     A          R SFL1CT                    SFLCTL(SFL1)
002290990409     A*%%TS  SD  19990409  142829  EDPMM       REL-V4R2M0  5769-PW1
002300990409     A N91                                  CF08
002310990409     A                                      CF12
002320990409     A                                      BLINK
002330990409     A                                      OVERLAY
002340990409     A  81                                  SFLDSP
002350990409     A N80                                  SFLDSPCTL
002360990409     A  80                                  SFLCLR
002370990409     A  81                                  SFLEND
002380990409     A                                      SFLSIZ(0013)
002390990409     A                                      SFLPAG(0012)
002400990409     A            CURSOR         4S 0H      SFLRCDNBR
002410990409     A  91                             19  3'FORNIT.|Ordine  del   | Bolla     -
002420990409     A                                      del  | Fattura     Del  |Protoc.   -
002430990409     A                                       del  |'
002440990409     A                                      DSPATR(UL)
002450990409     A                                      DSPATR(HI)
002460990409     A  91        MOFFOR         8A  O 20  2
002470990409     A  91        MOFNOR         5Y 0O 20 11EDTCDE(Z)
002480990409     A  91        DORMOF         8Y 0O 20 17EDTCDE(Z)
002490990409     A  91        MOFTOR         2A  O 22  3
002500990409     A  91        MOFCPG         3A  O 22 33
002510990409     A  91        MOFNBL         7Y 0O 20 26EDTCDE(Z)
002520990409     A  91        DBLMOF         8Y 0O 20 34EDTCDE(Z)
002530990409     A  91        MOFNFT         9Y 0O 20 43EDTCDE(Z)
002540990409     A  91        DFTMOF         8Y 0O 20 53EDTCDE(Z)
002550990409     A  91        MOFNPT         9Y 0O 20 62EDTCDE(Z)
002560990409     A  91        DPTMOF         8Y 0O 20 72EDTCDE(Z)
002570990409     A  91                             21  3' |Tr|FA| Prodotto   |Consegn.|Pag|-
002580990409     A                                         Valuta      Cambio         Prezz-
002590990409     A                                      o     |'
002600990409     A                                      DSPATR(UL)
002610990409     A                                      DSPATR(HI)
002620990409     A N91 02                          21 39'Quantità Ordini..:'
002630990409     A                                      DSPATR(UL)
002640990409     A N91 02     TOTQTA        12Y 2O 21 63DSPATR(UL)
002650990409     A                                      DSPATR(HI)
002660990409     A                                      EDTWRD(' .   .   . 0 ,  -')
002670990409     A  91        MOFTRG         1A  O 22  6
002680990409     A  91        MOFFAS         2A  O 22  8
002690990409     A  91        MOFMAT        12A  O 22 11DSPATR(HI)
002700990409     A  91        DCNMOF         8Y 0O 22 24
002710990409     A N91        TOTVAL        13Y 3O 22 62DSPATR(UL)
002720990409     A                                      DSPATR(HI)
002730990409     A                                      EDTWRD(' .   .   . 0 ,   -')
002740990409     A  91        MOFVAL         4A  O 22 41
002750990409     A  91        MOFCMB        13Y 6O 22 48EDTCDE(4)
002760990409     A  91        MOFPRZ        14Y 5O 22 64EDTWRD('       0 ,     -')
002770990409     A  91                             23 46'List.:'
002780990409     A  91        MOFLIS         3A  O 23 53
002790990409     A  91                             23 57'Gruppo:'
002800990409     A  91        MOFGPM         2A  O 23 65
002810990409     A  91                             23 68'Settore:'
002820990409     A  91        MOFSTM         2A  O 23 77
002830990409     A                                 24  2'V-Visualiz.Riga'
002840990409     A                                 24 30'F08= Stampa'
002850990409     A                                      DSPATR(HI)
002860990409     A                                 24 59'F12= Ritorno'
002870990409     A                                      DSPATR(HI)
