000100870126     A**         ARCHIVIO CONFERME ORDINI FORNITORI       **
000200000000     A*                                                    *
000300000000     A***------------------------------------------------***
000400000000     A**
000500990112     A          R TMCNF000                  TEXT('CONFERME ORDINI  FORNITORE  ')
000600870126     A            CNFUTE         3P 0       TEXT('CODICE UTENTE/PROFIL.DI MAN.')
000700990112     A            CNFDOR         8P 0       TEXT('DATA ORDINE          AAMMGG ')
000800870126     A            CNFNOR         5P 0       TEXT('NUMERO ORDINE               ')
000900870126     A            CNFC01         5P 0       TEXT('CONF.1')
001000870126     A            CNFC02         5P 0       TEXT('CONF.2')
001100870126     A            CNFC03         5P 0       TEXT('CONF.3')
001200870126     A            CNFC04         5P 0       TEXT('CONF.4')
001300870126     A            CNFC05         5P 0       TEXT('CONF.5')
