000100970526     A*--------------------------------------------------------------------------------------------*
000200991001     A* GESTIONE CODICI CLIENTI UNIFICANTI                                                         *
000300970526     A*--------------------------------------------------------------------------------------------*
000400970526     A* NOTE:
000500970526     A* - TUTTE LE DATE DEVONO ESSERE IMPOSTATE IN AAAA/MM/GG
000600970526     A*--------------------------------------------------------------------------------------------*
000700991001     A          R K12REC                    TEXT('GESTIONE COD.CLIENTI UNIFIC.')
000800970526    ?A*-------------------
000900970526    ?A* Parametri informativi
001000970526    ?A*-------------------
001100991001     A            K12OP0         3          TEXT('LIV PROCEDURA MENU CHIAMANTE')
001200970526     A                                      COLHDG('C01,C02,C05' 'L01,L02,L05')
001300991001     A            K12OP1         3          TEXT('LIVELLO PGM  -PGM  CHIAMANTE')
001400970526     A                                      COLHDG('Fxx')
001500991001     A            K12F03         1          TEXT('1=PREMUTO F03-FINE')
001600991001     A            K12F12         1          TEXT('1=PREMUTO F12-RITORNO')
001700991001     A            K12ERR         1          TEXT('1=ERRORE')
001800991001     A            K12MSG        78          TEXT('MESSAGGIO DI RITORNO')
001900970526     A
002000991001     A            K12TLE         2A
002100991001     A                                      TEXT('TIPO LEGAME')
002200991001     A            K12AZP         3A
002300991001     A                                      TEXT('AZIENDA PADRE')
002400991028     A            K12COP        11S 0
002500991001     A                                      TEXT('CODICE PADRE')
002600991001     A            K12AZF         3A
002700991001     A                                      TEXT('AZIENDA FIGLIO')
002800991028     A            K12COF        11S 0
002900991001     A                                      TEXT('CODICE FIGLIO')
003000991028     A            K12DDE         8S 0
003100991001     A                                      TEXT('DATA DECORRENZA')
003200991028     A            K12DSC         8S 0
003300991001     A                                      TEXT('DATA SCADENZA')
