000100971021     A*--------------------------------------------------------------*
000200991229     A*  DS PER PGM DI STAMPA TABELLE
000300971021     A*--------------------------------------------------------------*
000400971021     A                                      REF(CNDIZION)
000500991229     A          R T06REC                    TEXT('DS DI STAMPA TABELLE')
000600981029      *
000700991230     A            T06TLA         1          TEXT('TIPO LANCIO: C=CHIUDE    -
000800981029                                             = ELABORA+RT L=ELABORA+LR')
000900991230     A            T06SIF    R               REFFLD($SIF)
001000980522     A                                      TEXT('SISTEMA INFORMATIVO')
001100991230     A            T06LIN    R               REFFLD($CDLINGUA)
001200980522     A                                      TEXT('CODICE LINGUA')
001300991230     A            T06COD         3          TEXT('CODICE TABELLA')
