000010130108     A*%%TS  SD  20130108  120601  EDPRM       REL-V6R1M0  5761-WDS
000020090116     A*---FILE : TIBS91R  ------------------------------------------------------
000030090116     A*          DUPLICA DATI FISGN PER ALTRO P.O.
000040000000     A*-------------------------------------------------------------------------
000050130108     A*%%EC
000060130108     A                                      DSPSIZ(24 80 *DS3)
000070130108     A                                      CHGINPDFT(HI UL)
000080130108     A                                      PRINT
000090000000     A**************************************************************************
000100130108     A          R BS91D01
000110130108     A*%%TS  SD  20130108  120601  EDPRM       REL-V6R1M0  5761-WDS
000120130108     A                                      CF06
000130130108     A                                      CA03
000140130108     A  01
000150130108     AO 02                                  CF14
000160130108     A                                      CF07
000161130108     A                                      CSRLOC(H1RIGA     H1COLO)
000162130108     A            H1RIGA         3S 0H
000163130108     A            H1COLO         3S 0H
000170130108     A  28        V1CMSG        78   M
000180130108     A            VIDRSU        20A  O  1  2
000190130108     A                                  1 25'* DUPLICA DATI DI  FISGN00F  PER *'
000200130108     A                                      DSPATR(RI)
000210130108     A                                  1 62'TIBS91R'
000220130108     A                                  1 72DATE
000230130108     A                                      EDTCDE(Y)
000240130108     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000250130108     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000260130108     A                                  2 25'* ETICHETTARE IN ALTRO  TERMINAL *'
000270130108     A                                      DSPATR(RI)
000280130108     A                                      DSPATR(UL)
000290130108     A                                  2 72TIME
000300130108     A                                  8  2'Duplica dati di FISGN00F DALLA'
000310130108     A                                  8 34'filiale :'
000320130108     A            V1CPODA        3Y 0B  8 45CHECK(RB)
000330130108     A  50                                  DSPATR(PC)
000340130108     A                                      EDTCDE(Z)
000350130108     A            V1DPODA       25A  O  8 50DSPATR(HI)
000360130108     A                                 11 27'PER il terminal:'
000370130108     A            V1CPOA         3Y 0B 11 45
000380130108     A  51                                  DSPATR(PC)
000390130108     A                                      EDTCDE(Z)
000400130108     A                                      DSPATR(HI)
000410130108     A                                      CHECK(RB)
000420130108     A            V1DPOA        25A  O 11 50DSPATR(HI)
000430130108     A                                 24  2'F3=Fine'
000440130108     A                                 24 61'F6=Conferma'
000450130108     A                                 16  3'Parzializzazione per Codice Client-
000460130108     A                                      e (?):'
000470130108     A            V1CKS1         7   B 16 45
000490130108     A            V1CKS3         7   B 18 45
000510130108     A            V1CKS2         7   B 17 45
000530130108     A            V1CKS4         7   B 19 45
000550130108     A            V1CKS5         7   B 20 45
000570130108     A            V1DKS1        20   O 16 55DSPATR(HI)
000580130108     A            V1DKS2        20   O 17 55DSPATR(HI)
000590130108     A            V1DKS3        20   O 18 55DSPATR(HI)
000600130108     A            V1DKS4        20   O 19 55DSPATR(HI)
000610130108     A            V1DKS5        20   O 20 55DSPATR(HI)
