000010170711     A*%%TS  SD  20170711  150145  EDPRM       REL-V7R2M0  5770-WDS
000020100916     A*/*PRM RSTDSP(*YES) DFRWRT(*YES) DECFMT(*JOB)
000030100916     A*/*END
000040100916     A** FILE : TIBS31D *--------------------------------------------**
000050100916     A*  GESTIONE SINGOLO PROFILO UTENTE                              *
000060100916     A**-------------------------------------------------------------**
000070170711     A*%%EC
000080170711     A                                      DSPSIZ(24 80 *DS3)
000090170711     A                                      REF(*LIBL/DUTE01)
000100170711     A                                      CHGINPDFT(HI UL)
000110170711     A                                      PRINT
000120170711     A                                      CA03
000130170711     A                                      CA12
000140080218      *---------------------------------------------------------------*
000150011126     A          R BS31T01
000160011126     A                                      OVERLAY
000170020516     A            RSUT          20A  O  1  2
000180011129     A                                  1 30'** Profili Utente **'
000190011126     A                                      DSPATR(RI)
000200011129     A                                  1 61'TIBS31R'
000210011129     A                                  1 72DATE
000220011126     A                                      EDTCDE(Y)
000230011129     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000240011129     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000250011129     A            VTCOPZ        15A  O  2 33
000260100115     A                                      DSPATR(HI)
000270011129     A                                  2 72TIME
000280080218     A*---------------------------------------------------------------*
000290130717     A          R BS31T02
000300130717     A*%%TS  SD  20130717  133855  EDPMB       REL-V7R1M0  5770-WDS
000310130717     A                                      OVERLAY
000320130717     A            RICAUT         1A  P
000330130717     A                                  3  2' '
000340130717     A                                  4  2'Profilo:'
000350130717     A            V1CUTE    R        O  4 11REFFLD(UTEUTE AZUTE00F)
000360130717     A                                      DSPATR(HI)
000370130717     A                                  4 24'Fil.:'
000380130717     A            V1CFIL    R     A  O  4 30REFFLD(UTEFIL AZUTE00F)
000390130717     A                                      DSPATR(HI)
000400130717     A                                  4 35'Funzione:'
000410130717     A            V1CFUN    R        O  4 45REFFLD(UTEFUN AZUTE00F)
000420130717     A                                      DSPATR(HI)
000430130717     A                                  4 53'Livello Autorità:'
000440130717     A            V1CAUT    R        O  4 71REFFLD(UTEAUT AZUTE00F)
000450130717     A                                      DSPATR(HI)
000460130717     A                                      DSPATR(&RICAUT)
000470130717     A            V1SAUT         2   O  4 75COLOR(RED)
000480100916     A*---------------------------------------------------------------*
000490150212     A          R BS31D01
000500150212     A*%%TS  SD  20150212  135351  EDPBA       REL-V7R1M0  5770-WDS
000510150212     A                                      OVERLAY
000520161006     A                                      CF18
000530100916     A*
000540150212     A  28        V1DMSG        78   M
000550150212     A            RICFUN         1A  P
000560150212     A            RICAUT         1A  P
000570100916     A*
000580150212     A                                  3  2' '
000590150212     A                                  4  2' '
000600150212     A                                  4 56'Proj:'
000610150212     A            V1DPROJ        1A  O  4 62DSPATR(HI)
000620150212     A                                  4 67'Abil.AUT:'
000630150212     A            V1DABAUT       1A  O  4 77DSPATR(HI)
000640100916     A*
000650150212     A                                  5  2'Profilo ................:'
000660150212     A            V1CUTE    R        B  5 28REFFLD(UTEUTE AZUTE00F)
000670150212     A  02                                  DSPATR(PR)
000680150212     A  41                                  DSPATR(PC)
000690150212     A                                  7  2'Modulo Profilo .........:'
000700150212     A            V1CMOPR   R        B  7 28REFFLD(§UT2MOPR DUTE02)
000710150212     A            V1DMOPR       35A  O  7 43
000720150212     A  02
000730150212     AO 03                              8  2'Fil. di appartenenza ..?:'
000740150212     A N02N03                           8  2'Fil. di appartenenza ...:'
000750150212     A            V1CFIL    R     A  B  8 28REFFLD(UTEFIL AZUTE00F)
000760150212     A                                      CHECK(RB)
000770150212     A  02                                  DSPATR(PR)
000780150212     A  42
000790150212     AO 44                                  DSPATR(PC)
000800150212     A            V1DFIL    R   20   O  8 43REFFLD(ORGDES AZORG00F)
000810150212     A                                  9  2'Codice utente ..........:'
000820150212     A            V1CCDU    R     Y  B  9 28REFFLD(UTECDU AZUTE00F)
000830150212     A  02                                  DSPATR(PR)
000840150212     A  43
000850150212     AO 44                                  DSPATR(PC)
000860150212     A                                 11  2'Data scadenza validità .:'
000870150212     A            V1CDSC    R     Y  B 11 28REFFLD(UTEDSC AZUTE00F)
000880150212     A                                      EDTWRD('  /  /    ')
000890150212     A                                      CHECK(RB)
000900150212     A  45                                  DSPATR(PC)
000910150212     A  02
000920150212     AO 03                             13  2'Funzione aziendale ....?:'
000930150212     A N02N03                          13  2'Funzione aziendale .....:'
000940150212     A            V1CFUN    R        B 13 28REFFLD(UTEFUN AZUTE00F)
000950150212     A  46                                  DSPATR(PC)
000960150212     A                                      DSPATR(&RICFUN)
000970150212     A            V1SFUN         5A  O 13 35COLOR(RED)
000980150212     A            V1DFUN        35A  O 13 43
000990150212     A  02
001000150212     AO 03                             14  2'Livello di autorità ...?:'
001010150212     A N02N03                          14  2'Livello di autorità ....:'
001020150212     A            V1CAUT    R        B 14 28REFFLD(UTEAUT AZUTE00F)
001030150212     A  47                                  DSPATR(PC)
001040150212     A                                      DSPATR(&RICAUT)
001050150212     A            V1SAUT         2A  O 14 35COLOR(RED)
001060150212     A            V1DAUT        25A  O 14 43
001070150212     A  02
001080150212     AO 03                             16  2'Profilo posta AS/400 ..?:'
001090150212     A N02N03                          16  2'Profilo posta AS/400 ...:'
001100150212     A            V1CPAS    R        B 16 28REFFLD(UTEPAS AZUTE00F)
001110150212     A  49                                  DSPATR(PC)
001120150212     A            V1DPAS        20A  O 16 43
001130150212     A                                 17  2'Indirizzo e-mail .......:'
001140150212     A            V1CEMA    R   50   B 17 28REFFLD(UTEEMA AZUTE00F)
001150150212     A                                      CHECK(LC)
001160150212     A            V1CEM2    R   50   B 18 28REFFLD(UTEEMA AZUTE00F)
001170150212     A                                      CHECK(LC)
001180100916     A*
001190150212     A                                 20  2'Programma iniziale .....:'
001200150212     A            V1CPGM    R        B 20 28REFFLD(UTEPGM AZUTE00F)
001210150212     A  48                                  DSPATR(PC)
001220150212     A                                 20 43'Libreria programma iniz.:'
001230150212     A            V1CLIB    R        B 20 69REFFLD(UTELIB AZUTE00F)
001240150212     A  48                                  DSPATR(PC)
001250100916     A*
001260150212     A                                 22  2'Legame persona fisica ..:'
001270150212     A            V1CKDC    R    3   B 22 28REFFLD(UTEKCD AZUTE00F)
001280150212     A            V1CKCD    R   10   B 22 32REFFLD(UTEKCD AZUTE00F)
001290100916     A*
001300150212     A                                 23 71'Segue...'
001310150212     A                                      DSPATR(HI)
001320100916     A*
001330150212     A                                 24  2'F3=Fine'
001340150212     A                                      COLOR(BLU)
001350150212     A  05                             24 12'F8=Visualizza MB/AS'
001360150212     A                                      COLOR(BLU)
001370150212     A                                 24 34'F12=Ritorno'
001380150212     A                                      COLOR(BLU)
001390161006     A                                   + 3'F18=Note'
001400161006     A                                      COLOR(BLU)
001410080530      *---------------------------------------------------------------*
001420080530     A          R BS31W01                   TEXT('WINDOW ELENCO FUNZ. -
001430080530     A                                      RELATIVE ALLA GEST. PASSWO-
001440080530     A                                      RD')
001450080530     A                                      WINDOW(12 30 08 35 +
001460080530     A                                             *NOMSGLIN +
001470080530     A                                             *NORSTCSR)
001480080530     A                                      OVERLAY
001490080530     A                                      PUTOVR
001500080530     A                                      OVRDTA
001510080530     A                                      OVRATR
001520080530     A  28        V1DMSG        78   M
001530080530     A                                  1  3'GESTIONE PASSWORD'
001540080530     A                                      DSPATR(HI UL)
001550080530     A                                  3  1'- SPC per gestione PDA'
001560080530     A                                  4  1'- Ristampa segnacolli in -
001570080530     A                                      arrivo'
001580080530     A                                  5  1'- Gestione tariffe client-
001590080530     A                                      i'
001600080530     A                                  6  1'- Sblocco distinte ORM pe-
001610080530     A                                      r PDA'
001620080530     A                                  8  1'F12=Ritorno'
001630080530     A                                      COLOR(BLU)
001640100114      *---------------------------------------------------------------*
001650100114     A          R BS31W02                   TEXT('Finestra per la gest-
001660100114     A                                      ione del "modulo profilo"')
001670100115     A                                      WINDOW(7 2 9 74 *NOMSGLIN)
001680100114     A                                      USRRSTDSP
001690100114     A                                      CF06
001700100114     A                                      OVERLAY
001710100115      *
001720100115     A            RSUT      R           1  1REFFLD(RSUT       DDATIUTE)
001730100115     A                                  1 27'** Profili Utente **'
001740100115     A                                      DSPATR(RI)
001750100115     A                                  1 54'TIBS31R   '
001760100115     A                                   + 1DATE(*JOB *YY)
001770100115     A                                      EDTCDE(Y)
001780100115     A            KNSIF     R        O  2  1REFFLD(KNSIF      KPJBA)
001790100115     A                                   + 1USER
001800100115     A                                  2 65TIME
001810100114      *
001820100114     A  28        V1CMSG        78   M
001830100114      *
001840100115     A                                  4  1'MODIFICA MODULO PROFILO -
001850100115     A                                      UTENTE'
001860100115     A                                      DSPATR(HI)
001870100115     A            W2CUTE    R            + 1REFFLD(UTEUTE       AZUTE00F)
001880100115     A                                      DSPATR(HI)
001890161018      *
001900100115     A                                  6  1'Modulo Profilo ......:'
001910100114     A            W2CMOPR   R        B   + 1REFFLD(§UT2MOPR     DUTE02)
001920100114      *
001930100115     A                                  7  1'Descriz. MB/AS (TEXT):'
001940100114     A            W2CTXT    R        B   + 1REFFLD(PRFTXT       KPPRF00F)
001950100114     A                                      CHECK(LC)
001960100114     A  68                                  DSPATR(PC)
001970100114      *
001980100115     A                                  9  1'F3=Fine'
001990100115     A                                      COLOR(BLU)
002000100115     A                                   + 3'F6=Conferma'
002010100114     A                                      COLOR(BLU)
002020100114     A                                   + 3'F12=Ritorno'
002030100114     A                                      COLOR(BLU)
002040161006      *---------------------------------------------------------------*
002050131021     A          R BS31D06
002060131021     A*%%TS  SD  20131021  154700  EDPMM       REL-V7R1M0  5770-WDS
002070131021     A                                      CF06
002080131021     A                                      OVERLAY
002090130926     A*
002100131021     A  28        V1DMSG        78   M
002110161006     A*
002120161006     A                                  5 24'Livello Autorità autorizzazioni sp-
002130161006     A                                      eciali....?:'
002140131021     A            V6AUTAUTOR     2A  B  5 71
002150131021     A  05                                  DSPATR(PR)
002160131021     A                                  6  2' Autisti di città                 -
002170131021     A                                       '
002180131021     A                                      DSPATR(UL)
002190131021     A                                      DSPATR(HI)
002200131021     A                                  6 42' Affluenze/defluenze              -
002210131021     A                                       '
002220131021     A                                      DSPATR(UL)
002230131021     A                                      DSPATR(HI)
002240131021     A                                  7  2'A1 gestione/convalida tariffe'
002250131021     A            V6AUTMTC       1A  B  7 38
002260131021     A  05                                  DSPATR(PR)
002270131021     A                                      VALUES('S' 'N' ' ')
002280131021     A                                  7 42'B1 gestione/convalida tariffe'
002290131021     A            V6AFFMTC       1A  B  7 78
002300131021     A  05                                  DSPATR(PR)
002310131021     A                                      VALUES('S' 'N' ' ')
002320131021     A                                  8  2'A2 inser/stamp variaz.corrispettiv-
002330131021     A                                      i'
002340131021     A            V6AUTRET       1A  B  8 38
002350131021     A  05                                  DSPATR(PR)
002360131021     A                                      VALUES('S' 'N' ' ')
002370131021     A                                  8 42'B2 gestione viaggi standard'
002380131021     A            V6AFFGVSTD     1A  B  8 78
002390131021     A  05                                  DSPATR(PR)
002400131021     A                                      VALUES('S' 'N' ' ')
002410131021     A                                  9  2'A3 Valorizzazione e Conferma'
002420131021     A            V6AUTCON       1A  B  9 38
002430131021     A  05                                  DSPATR(PR)
002440131021     A                                      VALUES('S' 'N' ' ')
002450131021     A                                  9 42'B3 apertura giornaliera viaggi'
002460131021     A            V6AFFAGV       1A  B  9 78
002470131021     A  05                                  DSPATR(PR)
002480131021     A                                      VALUES('S' 'N' ' ')
002490131021     A                                 10  2'A4 ristampa riepilog.variaz.corris-
002500131021     A                                      p'
002510131021     A            V6AUTCRS       1A  B 10 38
002520131021     A  05                                  DSPATR(PR)
002530131021     A                                      VALUES('S' 'N' ' ')
002540131021     A                                 10 42'B4 conf.stampa doc. di trasporto'
002550131021     A            V6AFFCPSTD     1A  B 10 78
002560131021     A  05                                  DSPATR(PR)
002570131021     A                                      VALUES('S' 'N' ' ')
002580131021     A                                 11  2'A5 stampa dettaglio costi/compet.'
002590131021     A            V6AUTSTDCC     1A  B 11 38
002600131021     A  05                                  DSPATR(PR)
002610131021     A                                      VALUES('S' 'N' ' ')
002620131021     A                                 11 42'B5 conferma arrivo mezzo'
002630131021     A            V6AFFARRM      1A  B 11 78
002640131021     A  05                                  DSPATR(PR)
002650131021     A                                      VALUES('S' 'N' ' ')
002660131021     A                                 12  2'A6 Riep. Servizi Prese e Consegne'
002670131021     A            V6RIEABI       1A  B 12 38
002680131021     A  05                                  DSPATR(PR)
002690131021     A                                      VALUES('S' 'N' ' ')
002700131021     A                                 12 42'B6 conf.giornal.viaggi e stp riepi-
002710131021     A                                      l'
002720131021     A            V6AFFCON       1A  B 12 78
002730131021     A  05                                  DSPATR(PR)
002740131021     A                                      VALUES('S' 'N' ' ')
002750130926     A*--
002760131021     A                                 13  2'A7 Gest.Firma Valor.x Autofatturaz-
002770131021     A                                      .'
002780131021     A            V6AUTRFCIT     1A  B 13 38
002790131021     A  05                                  DSPATR(PR)
002800131021     A                                      VALUES('S' 'N' ' ')
002810131021     A                                 13 42'B7 Gest.Firma Valor.x Autofatturaz-
002820131021     A                                      .'
002830131021     A            V6AUTRFCOP     1A  B 13 78
002840131021     A  05                                  DSPATR(PR)
002850131021     A                                      VALUES('S' 'N' ' ')
002860130926     A*--
002870131021     A                                 14  2' Coop                             -
002880131021     A                                       '
002890131021     A                                      DSPATR(UL)
002900131021     A                                      DSPATR(HI)
002910131021     A                                 14 42'                                  -
002920131021     A                                       '
002930131021     A                                      DSPATR(UL)
002940131021     A                                      DSPATR(HI)
002950131021     A                                 15  2'D1 Gestione delle tariffe'
002960131021     A            V6AUTMTCC      1A  B 15 38
002970131021     A  05                                  DSPATR(PR)
002980131021     A                                      VALUES('S' 'N' ' ')
002990131021     A                                 16  2'D2 visualizzazione tariffe'
003000131021     A            V6AUTVTCC      1A  B 16 38
003010131021     A  05                                  DSPATR(PR)
003020131021     A                                      VALUES('S' 'N' ' ')
003030131021     A                                 15 42'C1 Autofatt.prestazioni Residuali'
003040131021     A            V6AUTCPRRE     1A  B 15 78
003050131021     A  05                                  DSPATR(PR)
003060131021     A                                      VALUES('S' 'N' ' ')
003070131021     A                                 17  2'D3 stampa/convalida della tariffa'
003080131021     A            V6AUTSDTC      1A  B 17 38
003090131021     A  05                                  DSPATR(PR)
003100131021     A                                      VALUES('S' 'N' ' ')
003110131021     A                                 16 42'C2 Gest.Firma Prest.Res.da Autoriz'
003120131021     A                                      DSPATR(ND)
003130131021     A            V6AUTRFPRE     1A  B 16 78CHGINPDFT
003140131021     A                                      DSPATR(PR)
003150131021     A                                      VALUES('S' 'N' ' ')
003160131021     A                                      DSPATR(ND)
003170161006     A                                 17 42' Sede                             -
003180161006     A                                       '
003190161006     A                                      DSPATR(HI)
003200161006     A                                      DSPATR(UL)
003210131021     A                                 18  2'D4 inser/stampa rettifiche contegg-
003220131021     A                                      i'
003230131021     A            V6AUTRETC      1A  B 18 38
003240131021     A  05                                  DSPATR(PR)
003250131021     A                                      VALUES('S' 'N' ' ')
003260161006     A                                 18 42'AUT ricez.tar.firmata    (Uff.SEDE-
003270161006     A                                      )'
003280161006     A            V6AUTSDT       1A  B 18 78
003290161006     A  05                                  DSPATR(PR)
003300161006     A                                      VALUES('S' 'N' ' ')
003310131021     A                                 19  2'D5 conferma valorizzazioni'
003320131021     A            V6AUTCONC      1A  B 19 38
003330131021     A  05                                  DSPATR(PR)
003340131021     A                                      VALUES('S' 'N' ' ')
003350161006     A                                 19 42'A/D ricez.tar.firmata    (Uff.SEDE-
003360161006     A                                      )'
003370161006     A            V6AFFCRS       1A  B 19 78
003380161006     A  05                                  DSPATR(PR)
003390161006     A                                      VALUES('S' 'N' ' ')
003400161006     A                                 20  2'D6 gestione stime ore lavorate'
003410161006     A                                      DSPATR(ND)
003420161006     A                                 20 42'COP conf/ricez.stampa tar(Uff.SEDE-
003430161006     A                                      )'
003440161006     A            V6AUTCRSC      1A  B 20 78
003450161006     A  05                                  DSPATR(PR)
003460161006     A                                      VALUES('S' 'N' ' ')
003470131021     A                                 21  2'D7 Gest.Firma Valor.da Autorizzare'
003480131021     A            V6AUTRFAFD     1A  B 21 38
003490131021     A  05                                  DSPATR(PR)
003500131021     A                                      VALUES('S' 'N' ' ')
003510161006      *
003520161006     A                                 23  1'F3=Fine'
003530161006     A                                      COLOR(BLU)
003540161006     A                                 23 11'F6=Conferma'
003550161006     A                                      COLOR(BLU)
003560161006     A                                 23 25'F12=Ritorno'
003570161006     A                                      COLOR(BLU)
003580080218      *---------------------------------------------------------------*
003590080218     A          R PROTECT
003600080218     A                                      TEXT('Serve x inibire tutt-
003610080218     A                                      o il video')
003620080218     A                                      PROTECT
003630080218     A                                      OVERLAY
003640080218     A                                      CLRL(*NO)
003650080218     A  05                                  CF08
003660161006     A                                      CF18
003670100115      *---------------------------------------------------------------*
003680100115     A          R ASSUME
003690100115     A                                      TEXT('Serve a mantenere in-
003700100115     A                                       sottofondo la videata del-
003710100115     A                                       chiamante')
003720100115     A                                       ASSUME
003730100115     A                                  3  2' '
003740170707     A          R BS31D02_BO
003750170707     A*%%TS  SD  20170707  093852  EDPRM       REL-V7R2M0  5770-WDS
003760170707     A                                      OVERLAY
003770170707     A                                      CF18
003780170707     A  28        V1DMSG        78   M
003790170707     A            RICIBS         1A  P
003800170707     A            RICMBS         1A  P
003810170707     A            RICIAS         1A  P
003820170707     A            RICMBF         1A  P
003830170707     A            RICMTF         1A  P
003840170707     A            RICMFCP        1A  P
003850170707     A            RICORM         1A  P
003860170707     A                                 16  2'BOLLE SEDE ....:'
003870170707     A                                 16 20'Interrogazione ...?:'
003880170707     A            V2CIBS    R        B 16 41REFFLD(§UTEIBS)
003890170707     A  05                                  DSPATR(PR)
003900170707     A  42                                  DSPATR(PC)
003910170707     A                                      DSPATR(&RICIBS)
003920170707     A            V2SIBS         2A  O 16 45COLOR(RED)
003930170707     A            V2DIBS        25A  O 16 50
003940170707     A                                 17 20'Manutenzione .....?:'
003950170707     A            V2CAUB    R        B 17 41REFFLD(§UTEMBS)
003960170707     A  05                                  DSPATR(PR)
003970170707     A  40                                  DSPATR(PC)
003980170707     A                                      DSPATR(&RICMBS)
003990170707     A            V2SAUB         2A  O 17 45COLOR(RED)
004000170707     A            V2DAUB        25A  O 17 50
004010170707     A                                 18  2'Importo da ASS.:'
004020170707     A                                 18 20'Modifica ..........:'
004030170707     A            V2CIAS    R        B 18 41REFFLD(§UTEIAS)
004040170707     A                                      VALUES(' ' 'S')
004050170707     A                                      DSPATR(&RICIAS)
004060170707     A            V2SIAS         1A  O 18 45COLOR(RED)
004070170707     A                                 18 50'("S"=SI)'
004080080218     A*
004090170707     A                                 23 71'Segue.. '
004100170707     A                                      DSPATR(HI)
004110080218     A*
004120170707     A                                 24  2'F3=Fine'
004130170707     A                                      COLOR(BLU)
004140170707     A  05                             24 12'F8=Visualiza MB/AS '
004150170707     A                                      COLOR(BLU)
004160170707     A                                 24 34'F12=Ritorno'
004170170707     A                                      COLOR(BLU)
004180170707     A                                 24 48'F18=Note'
004190170707     A                                      COLOR(BLU)
004200170707     A                                  9  2'BOLLE FILIALE MANUTENZIONE .......-
004210170707     A                                      ..?:'
004220170707     A            V3CMBF    R        B  9 41REFFLD(§UTEMBF)
004230170707     A  05                                  DSPATR(PR)
004240170707     A  56                                  DSPATR(PC)
004250170707     A                                      DSPATR(&RICMBF)
004260170707     A            V3SMBF         2A  O  9 45COLOR(RED)
004270170707     A            V3DMBF        25A  O  9 50
004280170707     A                                 10 16'Tassazione Bolle ......:'
004290170707     A            V3CMTF    R        B 10 41REFFLD(§UTEMTF)
004300170707     A                                      VALUES(' ' 'I' 'E' 'N')
004310170707     A  05                                  DSPATR(PR)
004320170707     A                                      DSPATR(&RICMTF)
004330170707     A            V3SMTF         1A  O 10 45COLOR(RED)
004340170707     A                                 10 50'(" "=Tassaz+ImpAssic. x 2gg.'
004350170707     A                                 11 50' "I"=       ImpAssic. sempre'
004360170707     A                                 12 50' "E"=Tassaz+ImpAssic. sempre'
004370170707     A                                 13 16'Consegne Particolari    '
004380170707     A                                 13 50' "N"=Nulla)'
004390170707     A                                 14 16' abilitate da tab. "SP":'
004400170707     A            V3CMFCP   R        B 14 41REFFLD(§UTEMFCP)
004410170707     A                                      VALUES(' ' 'S')
004420170707     A  05                                  DSPATR(PR)
004430170707     A                                      DSPATR(&RICMFCP)
004440170707     A            V3SMFCP        1A  O 14 45COLOR(RED)
004450170707     A                                 14 50'("S"=SI)'
004460170707     A                                  7  2'ORM: Manutenzione/Interrogazione .-
004470170707     A                                      ..?:'
004480170707     A            V3CORM    R        B  7 41REFFLD(§UTEORM)
004490170707     A  05                                  DSPATR(PR)
004500170707     A  39                                  DSPATR(PC)
004510170707     A                                      DSPATR(&RICORM)
004520170707     A            V3SORM         2A  O  7 45COLOR(RED)
004530170707     A            V3DORM        25A  O  7 50
004540170707     A                                  6  2'GESTIONE BOLLE E ORM'
004550170707     A                                      COLOR(BLU)
004560170707     A                                      DSPATR(UL)
004570170711     A          R BS31D02_V1
004580170711     A*%%TS  SD  20170711  150145  EDPRM       REL-V7R2M0  5770-WDS
004590170711     A                                      OVERLAY
004600170711     A                                      CF18
004610170711     A  28        V1DMSG        78   M
004620170711     A            RICFGIA        1A  P
004630170711     A            RICECA         1A  P
004640170711     A            RICMRESCA      1A  P
004650170711     A            RICMDPPCA      1A  P
004660170711     A            RICIUN         1A  P
004670170711     A            RICCUN         1A  P
004680170711     A            RICVADD        1A  P
004690170711     A            RICADD         1A  P
004700170711     A            RICSTMO        1A  P
004710170711     A            RICSTP         1A  P
004720080218     A*
004730170711     A                                 23 71'Segue.. '
004740170711     A                                      DSPATR(HI)
004750080218     A*
004760170711     A                                 24  2'F3=Fine'
004770170711     A                                      COLOR(BLU)
004780170711     A  05                             24 12'F8=Visualiza MB/AS '
004790170711     A                                      COLOR(BLU)
004800170711     A                                 24 34'F12=Ritorno'
004810170711     A                                      COLOR(BLU)
004820170711     A                                 24 48'F18=Note'
004830170711     A                                      COLOR(BLU)
004840170711     A                                  7  2'GIACENZE:'
004850170711     A                                  7 12'Forzatura Diposizioni .....:'
004860170711     A            V3CFGIA   R        B  7 41REFFLD(§UTEFGIA)
004870170711     A                                      VALUES(' ' 'S')
004880170711     A  05                                  DSPATR(PR)
004890170711     A                                      DSPATR(&RICFGIA)
004900170711     A            V3SFGIA        1A  O  7 45COLOR(RED)
004910170711     A                                  7 50'("S"=SI)'
004920170711     A                                  8  2'DANNI:'
004930170711     A                                  9  6'Elenco C.A. ....................?:'
004940170711     A            V3CECA    R        B  9 41REFFLD(§UTEECA)
004950170711     A  05                                  DSPATR(PR)
004960170711     A  55                                  DSPATR(PC)
004970170711     A                                      DSPATR(&RICECA)
004980170711     A            V3SECA         2A  O  9 45COLOR(RED)
004990170711     A            V3DECA        25A  O  9 50
005000170711     A                                 10  6'Manutenzione Responsabilità .....:'
005010170711     A            V5CMRESCA      1A  B 10 41DSPATR(UL)
005020170711     A                                      DSPATR(HI)
005030170711     A                                      VALUES(' ' 'S')
005040170711     A                                      DSPATR(&RICMRESCA)
005050170711     A            V5SMRESCA      1A  O 10 45COLOR(RED)
005060170711     A                                 10 50'("S"=SI)'
005070170711     A                                 11  6'Apertura in part. C.A. Import DPD:'
005080170711     A            V5CMDPPCA      1A  B 11 41DSPATR(UL)
005090170711     A                                      DSPATR(HI)
005100170711     A                                      VALUES(' ' 'S')
005110170711     A                                      DSPATR(&RICMDPPCA)
005120170711     A            V5SMDPPCA      1A  O 11 45COLOR(RED)
005130170711     A                                 11 50'("S"=SI)'
005140170711     A                                 13  2'GESTIONE UNITA'':'
005150170711     A                                 14  6'Interrogazione .................?:'
005160170711     A            V2CIUN    R        B 14 41REFFLD(§UTEIUN)
005170170711     A  05                                  DSPATR(PR)
005180170711     A  41                                  DSPATR(PC)
005190170711     A                                      DSPATR(&RICIUN)
005200170711     A            V2SIUN         2A  O 14 45COLOR(RED)
005210170711     A            V2DIUN        25A  O 14 50
005220170711     A                                 15  6'Cancellazione ...................:'
005230170711     A            V2CCUN    R        B 15 41REFFLD(§UTECUN)
005240170711     A                                      VALUES(' ' 'S')
005250170711     A                                      DSPATR(&RICCUN)
005260170711     A            V2SCUN         1A  O 15 45COLOR(RED)
005270170711     A                                 15 50'("S"=SI)'
005280170711     A                                 17  2'GESTIONE NOTE ADDEBITO IN C.E.'
005290170711     A                                 21  2'STATISTICA MOVIMENTO .........(SE4-
005300170711     A                                      B)?:'
005310170711     A            V3CSTMO   R        B 21 41REFFLD(§UTEISTMO)
005320170711     A  05                                  DSPATR(PR)
005330170711     A  38                                  DSPATR(PC)
005340170711     A                                      DSPATR(&RICSTMO)
005350170711     A            V3SSTMO        2A  O 21 45COLOR(RED)
005360170711     A            V3DSTMO       25A  O 21 50
005370170711     A                                 22  2'STAMPE PARTENZE PER AREA ..... (LS-
005380170711     A                                      33):'
005390170711     A            V3CSTP    R        B 22 41REFFLD(§UTESTP)
005400170711     A                                      VALUES(' ' 'S')
005410170711     A  05                                  DSPATR(PR)
005420170711     A                                      DSPATR(&RICSTP)
005430170711     A            V3SSTP         1A  O 22 45COLOR(RED)
005440170711     A                                      TEXT('S=ABILITATO ALle stampe parte-
005450170711     A                                      nze per area')
005460170711     A                                 22 50'("S"=SI)'
005470170711     A                                 18  6'Utente abilitato a ..............:'
005480170711     A            V5CVADD        1A  B 18 41DSPATR(UL)
005490170711     A                                      DSPATR(HI)
005500170711     A                                      DSPATR(&RICVADD)
005510170711     A                                      VALUES(' ' 'I' 'G')
005520170711     A            V5SVADD        1A  O 18 45COLOR(RED)
005530170711     A                                 18 50'("I"=Inserire "G"=Gestire)'
005540170711     A                                 19  6'Abilitazione Manutenzione ......?:'
005550170711     A            V5CADD    R        B 19 41REFFLD(§UTEADD)
005560170711     A  05                                  DSPATR(PR)
005570170711     A  78                                  DSPATR(PC)
005580170711     A                                      DSPATR(&RICADD)
005590170711     A            V5SADD         2A  O 19 45COLOR(RED)
005600170711     A            V5DADD        20A  O 19 50
005610170711     A                                  6  2'GESTIONI VARIE (1)'
005620170711     A                                      DSPATR(UL)
005630170711     A                                      COLOR(BLU)
005640170706     A          R BS31D02_C
005650170706     A*%%TS  SD  20170706  114034  EDPRM       REL-V7R2M0  5770-WDS
005660170706     A                                      OVERLAY
005670170706     A                                      CF18
005680170706     A  28        V1DMSG        78   M
005690170706     A            RICGTC         1A  P
005700170706     A            RICMODTAR      1A  P
005710170706     A            RICCAR         1A  P
005720170706     A            RICCTC         1A  P
005730170706     A            RICDUPCLI      1A  P
005740170706     A            RICPOT         1A  P
005750170706     A            RICPOTMSF      1A  P
005760170706     A            RICPOTST       1A  P
005770170706     A            RICCLI         1A  P
005780170706     A            RICCLPFFT      1A  P
005790170706     A            RICKSCLOG      1A  P
005800170706     A            RICCHGCMM      1A  P
005810170706     A            RICIST         1A  P
005820170706     A            RICMNTSP       1A  P
005830170706     A                                 13  2'TARIFFE CLIENTI:'
005840170706     A                                 13 20'Gestione .............?:'
005850170706     A            V3CGTC    R        B 13 45REFFLD(§UTEGTC)
005860170706     A  05                                  DSPATR(PR)
005870170706     A  51                                  DSPATR(PC)
005880170706     A                                      DSPATR(&RICGTC)
005890170706     A            V3SGTC         2A  O 13 49COLOR(RED)
005900170706     A            V3DGTC        25A  O 13 52
005910170706     A                                 14 20'Modifica ..............:'
005920170706     A            V3MODTAR  R        B 14 45REFFLD(§UTECAR)
005930170706     A                                      VALUES(' ' 'S')
005940170706     A  05                                  DSPATR(PR)
005950170706     A                                      DSPATR(&RICMODTAR)
005960170706     A            V3SMODTAR      1A  O 14 49COLOR(RED)
005970170706     A                                 14 52'("S"=SI)'
005980170706     A                                 15 20'Cartello ..............:'
005990170706     A            V3CCAR    R        B 15 45REFFLD(§UTECAR)
006000170706     A                                      VALUES(' ' 'S')
006010170706     A  05                                  DSPATR(PR)
006020170706     A                                      DSPATR(&RICCAR)
006030170706     A            V3SCAR         1A  O 15 49COLOR(RED)
006040170706     A                                 15 52'("S"=SI)'
006050170706     A                                 16 20'Codice da cui copiare ?:'
006060170706     A            V3CCTC    R        B 16 45REFFLD(§UTECTC)
006070170706     A  05                                  DSPATR(PR)
006080170706     A  52                                  DSPATR(PC)
006090170706     A                                      DSPATR(&RICCTC)
006100170706     A            V3SCTC         2A  O 16 49COLOR(RED)
006110170706     A            V3DCTC        25A  O 16 52
006120170706     A                                 17  9'Duplica su clienti non in gestione-
006130170706     A                                      :'
006140170706     A            V3CDUPCLI R        B 17 45REFFLD(§UTEDUPCLI)
006150170706     A  05                                  DSPATR(PR)
006160170706     A                                      VALUES(' ' 'S')
006170170706     A                                      DSPATR(&RICDUPCLI)
006180170706     A            V3SDUPCLI      1A  O 17 49COLOR(RED)
006190170706     A                                 17 52'("S"=SI)'
006200170706     A                                  7  2'CLI. POTENZIALI:'
006210170706     A                                  7 20'Gestione .............?:'
006220170706     A            V3CPOT    R        B  7 45REFFLD(§UTEPOT)
006230170706     A  05                                  DSPATR(PR)
006240170706     A  53                                  DSPATR(PC)
006250170706     A                                      DSPATR(&RICPOT)
006260170706     A            V3SPOT         2A  O  7 49COLOR(RED)
006270170706     A            V3DPOT        25A  O  7 52
006280170706     A                                  8 20'Modifica Sede/Filiale .:'
006290170706     A            V3CPOTMSF R        B  8 45REFFLD(§UTEPOTMSF)
006300170706     A  05                                  DSPATR(PR)
006310170706     A                                      VALUES(' ' 'S')
006320170706     A                                      DSPATR(&RICPOTMSF)
006330170706     A            V3SPOTMSF      1A  O  8 49COLOR(RED)
006340170706     A                                  8 52'("S"=SI)'
006350170706     A                                  9 20'Stampa Info Commerciali:'
006360170706     A            V3CPOTST  R        B  9 45REFFLD(§UTEDUPCLI)
006370170706     A  05                                  DSPATR(PR)
006380170706     A                                      VALUES(' ' 'S')
006390170706     A                                      DSPATR(&RICPOTST)
006400170706     A            V3SPOTST       1A  O  9 49COLOR(RED)
006410170706     A                                  9 52'("S"=SI)'
006420170706     A                                 10  2'ANAGR. CLIENTI :'
006430170706     A                                 10 20'Gestione .............?:'
006440170706     A            V3CCLI    R        B 10 45REFFLD(§UTECLI)
006450170706     A  05                                  DSPATR(PR)
006460170706     A  54                                  DSPATR(PC)
006470170706     A                                      DSPATR(&RICCLI)
006480170706     A            V3SCLI         2A  O 10 49COLOR(RED)
006490170706     A            V3DCLI        25A  O 10 52
006500170706     A                                 11 20'Modifica Freq.Fattura..:'
006510170706     A            V3CLPFFT  R        B 11 45REFFLD(§UTECLPFFT)
006520170706     A  05                                  DSPATR(PR)
006530170706     A                                      DSPATR(&RICCLPFFT)
006540170706     A                                      VALUES(' ' 'S')
006550170706     A            V3SCLPFFT      1A  O 11 49COLOR(RED)
006560170706     A                                 11 52'("S"=SI)'
006570170706     A                                 12 20'Gest.Cli.Logistica ....:'
006580170706     A            V3CKSCLOG R        B 12 45REFFLD(§UTEKSCLOG)
006590170706     A  05                                  DSPATR(PR)
006600170706     A                                      DSPATR(&RICKSCLOG)
006610170706     A                                      VALUES(' ' 'S')
006620170706     A            V3SKSCLOG      1A  O 12 49COLOR(RED)
006630170706     A                                 12 52'("S"=SI)'
006640170706     A                                 20  2'STATISTICA CLIENTE ............ (S-
006650170706     A                                      E60) .?:'
006660170706     A            V2CIST    R        B 20 45REFFLD(§UTEIST)
006670170706     A  05                                  DSPATR(PR)
006680170706     A  50                                  DSPATR(PC)
006690170706     A                                      DSPATR(&RICIST)
006700170706     A            V2SIST         2A  O 20 49COLOR(RED)
006710170706     A            V2DIST        25A  O 20 52
006720170706     A                                 21  2'ANALISI CLIENTI D-T-A-B ..........-
006730170706     A                                      .......:'
006740170706     A            V3CMNTSP  R        B 21 45REFFLD(§UTEMNTSP)
006750170706     A                                      VALUES(' ' 'S')
006760170706     A  05                                  DSPATR(PR)
006770170706     A                                      DSPATR(&RICMNTSP)
006780170706     A            V3SMNTSP       1A  O 21 49COLOR(RED)
006790170706     A                                 21 52'("S"=SI)'
006800080218     A*
006810170706     A                                 23 71'Segue.. '
006820170706     A                                      DSPATR(HI)
006830080218     A*
006840170706     A                                 24  2'F3=Fine'
006850170706     A                                      COLOR(BLU)
006860170706     A  05                             24 12'F8=Visualiza MB/AS '
006870170706     A                                      COLOR(BLU)
006880170706     A                                 24 34'F12=Ritorno'
006890170706     A                                      COLOR(BLU)
006900170706     A                                 24 48'F18=Note'
006910170706     A                                      COLOR(BLU)
006920170706     A                                 19  2'MODIFICA COMM.LE SU ANAGRAFICHE (M-
006930170706     A                                      K44) ..:'
006940170706     A            V3CCHGCMM R        B 19 45REFFLD(§UTECHGCMM)
006950170706     A                                      VALUES(' ' 'S')
006960170706     A  05                                  DSPATR(PR)
006970170706     A                                      DSPATR(&RICCHGCMM)
006980170706     A            V3SCHGCMM      1A  O 19 49COLOR(RED)
006990170706     A                                 19 52'("S"=SI)'
007000170706     A                                  6  2'GESTIONE CLIENTI'
007010170706     A                                      DSPATR(UL)
007020170706     A                                      COLOR(BLU)
007030170706     A          R BS31D02_V2
007040170706     A*%%TS  SD  20170706  130755  EDPRM       REL-V7R2M0  5770-WDS
007050170706     A                                      OVERLAY
007060170706     A                                      CF18
007070170706     A            RICVRAC        1A  P
007080170706     A            RICRAC         1A  P
007090170706     A            RICCGB         1A  P
007100170706     A            RICMGB         1A  P
007110170706     A            RICCANC        1A  P
007120170706     A  28        V1DMSG        78   M
007130080218     A*
007140170706     A                                  7  2'GESTIONE RICHIESTA ASSISTENZA CLIE-
007150170706     A                                      NTI'
007160170706     A                                  8 11'Utente abilitato alla variazione:'
007170170706     A            V5CVRAC        1A  B  8 45DSPATR(UL)
007180170706     A                                      DSPATR(HI)
007190170706     A                                      VALUES(' ' 'S')
007200170706     A                                      DSPATR(&RICVRAC)
007210170706     A            V5SVRAC        1A  O  8 49COLOR(RED)
007220170706     A                                  8 53'("S"=SI)'
007230170706     A                                  9 11'Abilitazione Manutenzione .....?:'
007240170706     A            V5CRAC    R        B  9 45REFFLD(§UTERAC)
007250170706     A  05                                  DSPATR(PR)
007260170706     A  76                                  DSPATR(PC)
007270170706     A                                      DSPATR(&RICRAC)
007280170706     A            V5SRAC         2A  O  9 49COLOR(RED)
007290170706     A            V5DRAC        20A  O  9 53
007300170706     A                                 11  2'BANCALI CLIENTE   Anagrafico .....-
007310170706     A                                      ......?:'
007320170706     A            V4CCGB    R        B 11 45REFFLD(§UTECGB)
007330170706     A  05                                  DSPATR(PR)
007340170706     A  73                                  DSPATR(PC)
007350170706     A                                      DSPATR(&RICCGB)
007360170706     A            V4SCGB         2A  O 11 49COLOR(RED)
007370170706     A            V4DCGB        25A  O 11 53
007380170706     A                                 12 20'Movimenti.............?:'
007390170706     A            V4CMGB    R        B 12 45REFFLD(§UTEMGB)
007400170706     A  05                                  DSPATR(PR)
007410170706     A  74                                  DSPATR(PC)
007420170706     A                                      DSPATR(&RICMGB)
007430170706     A            V4SMGB         2A  O 12 49COLOR(RED)
007440170706     A            V4DMGB        25A  O 12 53
007450170706     A                                 13 20'Cancellazione movimenti:'
007460170706     A            V4CCANC   R        B 13 45REFFLD(§UTEMPS)
007470170706     A                                      VALUES(' ' 'S')
007480170706     A                                      DSPATR(&RICCANC)
007490170706     A            V4SCANC        1A  O 13 49COLOR(RED)
007500170706     A                                 13 53'("S"=SI)'
007510170706     A                                 23 71'Segue.. '
007520170706     A                                      DSPATR(HI)
007530080218     A*
007540170706     A                                 24  2'F3=Fine'
007550170706     A                                      COLOR(BLU)
007560170706     A  05                             24 12'F8=Visualiza MB/AS '
007570170706     A                                      COLOR(BLU)
007580170706     A                                 24 34'F12=Ritorno'
007590170706     A                                      COLOR(BLU)
007600170706     A                                 24 48'F18=Note'
007610170706     A                                      COLOR(BLU)
007620170706     A                                  6  2'GESTIONI VARIE (2)'
007630170706     A                                      DSPATR(UL)
007640170706     A                                      COLOR(BLU)
007650170706     A          R BS31D02_B
007660170706     A*%%TS  SD  20170706  130755  EDPRM       REL-V7R2M0  5770-WDS
007670170706     A                                      OVERLAY
007680170706     A                                      CF18
007690170706     A  28        V1DMSG        78   M
007700170706     A            RICDST         1A  P
007710170706     A            RICDSS         1A  P
007720170706     A            RICPRO         1A  P
007730170706     A            RICCAP         1A  P
007740170706     A            RICCEP         1A  P
007750170706     A            RICGORG        1A  P
007760170706     A            RICFLNA        1A  P
007770170706     A            RICABRES       1A  P
007780170706     A            RICMPS         1A  P
007790170706     A                                 12  2'DESTINATARI ...:'
007800170706     A                                 12 20'Livello autorizzaz.:'
007810170706     A            V2CDST    R        B 12 41REFFLD(§UTEDST)
007820170706     A                                      VALUES(' ' '3' '7' '9')
007830170706     A  70                                  DSPATR(PC)
007840170706     A                                      DSPATR(&RICDST)
007850170706     A            V2SDST         1A  O 12 45COLOR(RED)
007860170706     A                                 12 50'(" "=Interr.   "3"=Gest.Parz.'
007870170706     A                                 13 50' "7"=Gest. completa Fil.'
007880170706     A                                 14 50' "9"=Gest. completa Sede)'
007890170706     A                                 15  2'SINONIMI DEST. :'
007900170706     A                                 15 20'Manutenzione ......:'
007910170706     A            V2CDSS    R        B 15 41REFFLD(§UTEDSS)
007920170706     A                                      VALUES(' ' 'S')
007930170706     A                                      DSPATR(&RICDSS)
007940170706     A            V2SDSS         1A  O 15 45COLOR(RED)
007950170706     A                                 15 50'("S"=SI)'
007960170706     A                                 16  2'PROPOSTE DEST. :'
007970170706     A                                 16 20'Gestione ..........:'
007980170706     A            V2CPRO    R        B 16 41REFFLD(§UTEPRO)
007990170706     A                                      VALUES(' ' 'S')
008000170706     A                                      DSPATR(&RICPRO)
008010170706     A            V2SPRO         1A  O 16 45COLOR(RED)
008020170706     A                                 16 50'(" "=Interr. + gest. appunt.'
008030170706     A                                 17 50' "S"=Gestione completa)'
008040170706     A                                 10  2'CAPPARIO ......:'
008050170706     A                                 10 20'Livelli di gestione:'
008060170706     A            V2CCAP    R        B 10 41REFFLD(§UTECAP)
008070170706     A                                      CHECK(ME)
008080170706     A                                      DSPATR(&RICCAP)
008090170706     A                                      DSPATR(MDT)
008100170706     A                                      VALUES('C' 'I' 'O' 'M' 'V')
008110170706     A            V2SCAP         1A  O 10 45COLOR(RED)
008120170706     A                                 10 50'("I"=Interr. "C"=ManutCompleta '
008130170706     A                                 11 50' "O"=SoloOrari "M"=ManutParzial'
008140170706     A                                 18  2'CALENDARIO EVENTI PARTICOL.: Gesti-
008150170706     A                                      one:'
008160170706     A            V3CCEP    R        B 18 41REFFLD(§UTECEP)
008170170706     A                                      VALUES(' ' 'S')
008180170706     A  05                                  DSPATR(PR)
008190170706     A                                      DSPATR(&RICCEP)
008200170706     A            V3SCEP         1A  O 18 45COLOR(RED)
008210170706     A                                 18 50'("S"=SI)'
008220170706     A                                 18 65'"V"=ManutdaDecor'
008230170706     A                                 21  2'LUOGO 300 forzature LNA e Giri ...-
008240170706     A                                      ...:'
008250170706     A            V3CFLNA   R        B 21 41REFFLD(§UTEFLNA)
008260170706     A                                      VALUES(' ' 'S')
008270170706     A  05                                  DSPATR(PR)
008280170706     A                                      DSPATR(&RICFLNA)
008290170706     A            V3SFLNA        1A  O 21 45COLOR(RED)
008300170706     A                                 21 50'("S"=SI)'
008310170706     A                                 22  2'GEST. ABIL.RESI periodi traz.ridot-
008320170706     A                                      te?:'
008330170706     A            V3CABRES  R        B 22 41REFFLD(§UTEABRES)
008340170706     A  05                                  DSPATR(PR)
008350170706     A                                      TEXT('abilitazione resi in periodi -
008360170706     A                                      trazioni ridotte')
008370170706     A                                      DSPATR(&RICABRES)
008380170706     A            V3SABRES       2A  O 22 45COLOR(RED)
008390170706     A            V3DABRES      25A  O 22 50
008400080218     A*
008410170706     A                                 23 71'Segue...'
008420170706     A                                      DSPATR(HI)
008430080218     A*
008440170706     A                                 24  2'F3=Fine'
008450170706     A                                      COLOR(BLU)
008460170706     A  05                             24 12'F8=Visualizza MB/AS'
008470170706     A                                      COLOR(BLU)
008480170706     A                                 24 34'F12=Ritorno'
008490170706     A                                      COLOR(BLU)
008500170706     A                                 24 48'F18=Note'
008510170706     A                                      COLOR(BLU)
008520170706     A                                  7  2'ORGANIGRAMMA ..:'
008530170706     A                                  7 20'Gestione ..........:'
008540170706     A            V4CGORG   R        B  7 41REFFLD(§UTEGORG)
008550170706     A                                      VALUES(' ' 'C' 'P')
008560170706     A                                      DSPATR(&RICGORG)
008570170706     A            V4SGORG        1A  O  7 45COLOR(RED)
008580170706     A                                  7 50'(" "=Nulla   "P"=Parzial'
008590170706     A                                  8 51'"C"=Completa)'
008600170706     A                                 20  2'VANDERLANDE ...:'
008610170706     A                                 20 20'Piani Smistamento .:'
008620170706     A            V4CMPS    R        B 20 41REFFLD(§UTEMPS)
008630170706     A                                      VALUES(' ' 'S')
008640170706     A                                      DSPATR(&RICMPS)
008650170706     A            V4SMPS         1A  O 20 45COLOR(RED)
008660170706     A                                 20 50'("S"=SI)'
008670170706     A                                  6  2'ARCHIVI DI BASE'
008680170706     A                                      DSPATR(UL)
008690170706     A                                      COLOR(BLU)
008700170703     A*         R BS31D04
008710170706     A          R BS31D02_T
008720170706     A*%%TS  SD  20170706  130755  EDPRM       REL-V7R2M0  5770-WDS
008730170706     A                                      OVERLAY
008740170706     A                                      CF18
008750150618     A*
008760170706     A  28        V1DMSG        78   M
008770170706     A            RICMAZ         1A  P
008780170706     A            RICIPT         1A  P
008790170706     A            RICFUF         1A  P
008800170706     A            RICPWD         1A  P
008810170706     A            RICINVPWD      1A  P
008820170706     A            RICPSWAUT      1A  P
008830170706     A            RICPSWMAG      1A  P
008840170706     A            RICPSWR        1A  P
008850150618     A*
008860170706     A                                  7  2'AZIONI ........:'
008870170706     A                                  7 20'Gestione ..............:'
008880170706     A            V4CMAZ    R        B  7 45REFFLD(§UTEMAZ)
008890170706     A                                      VALUES(' ' 'S')
008900170706     A                                      DSPATR(&RICMAZ)
008910170706     A            V4SMAZ         1A  O  7 49COLOR(RED)
008920170706     A                                  7 53'("S"=SI)'
008930170706     A                                  9  2'IP terminale .....................-
008940170706     A                                      ......?:'
008950170706     A            V4CIPT    R        B  9 45REFFLD(§UTEIPT)
008960170706     A                                      CHECK(RZ)
008970170706     A  05                                  DSPATR(PR)
008980170706     A  75                                  DSPATR(PC)
008990170706     A                                      DSPATR(&RICIPT)
009000170706     A            V4SIPT         2A  O  9 49COLOR(RED)
009010170706     A            V4DIPT        25A  O  9 53
009020170706     A                                 10 20'Filiale Ufficio ......?:'
009030170706     A            V4CFUF    R        B 10 45REFFLD(§UTEFUF)
009040170706     A                                      CHECK(RZ)
009050170706     A  77                                  DSPATR(PC)
009060170706     A                                      DSPATR(&RICFUF)
009070170706     A            V4SFUF         3A  O 10 49COLOR(RED)
009080170706     A            V4DFUF        25A  O 10 53
009090150618     A*
009100170706     A                                 12  2'PASSWORD OPERATIVE:'
009110170706     A                                 12 22'Gestione ......(?)'
009120170706     A            V4CPWDINT      1A  B 12 41CHGINPDFT(UL)
009130170706     A                                      VALUES(' ' '?')
009140170706     A                                 12 43':'
009150170706     A            V4CPWD    R        B 12 45REFFLD(§UTEPWD)
009160170706     A                                      VALUES(' ' 'S')
009170170706     A                                      DSPATR(&RICPWD)
009180170706     A            V4SPWD         1A  O 12 49COLOR(RED)
009190170706     A                                 12 53'("S"=SI)'
009200170706     A                                 13  2'REINVIO PASSWORD T&T .............-
009210170706     A                                      .......:'
009220170706     A            V4CINVPWD R        B 13 45REFFLD(§UTEINVPWD)
009230170706     A                                      VALUES(' ' 'S')
009240170706     A  05                                  DSPATR(PR)
009250170706     A                                      DSPATR(&RICINVPWD)
009260170706     A            V4SINVPWD      1A  O 13 49COLOR(RED)
009270170706     A                                 13 53'("S"=SI)'
009280170706     A                                 14  2'MODIFICA PASSWORD UTENTI DI RETE:'
009290170706     A                                 15 27'Utenti BartAut ?:'
009300170706     A            V4CPSWAUT R        B 15 45REFFLD(§UTEPSWAUT)
009310170706     A  05                                  DSPATR(PR)
009320170706     A  57                                  DSPATR(PC)
009330170706     A                                      DSPATR(&RICPSWAUT)
009340170706     A            V4SPSWAUT      2A  O 15 49COLOR(RED)
009350170706     A            V4DPSWAUT     20A  O 15 53
009360170706     A                                 16 27'Utenti BartMag ?:'
009370170706     A            V4CPSWMAG R        B 16 45REFFLD(§UTEPSWMAG)
009380170706     A  05                                  DSPATR(PR)
009390170706     A  58                                  DSPATR(PC)
009400170706     A                                      DSPATR(&RICPSWMAG)
009410170706     A            V4SPSWMAG      2A  O 16 49COLOR(RED)
009420170706     A            V4DPSWMAG     20A  O 16 53
009430170706     A                                 17 27'Altri Utenti   ?:'
009440170706     A            V4CPSWR   R        B 17 45REFFLD(§UTEPSWR)
009450170706     A  05                                  DSPATR(PR)
009460170706     A  59                                  DSPATR(PC)
009470170706     A                                      DSPATR(&RICPSWR)
009480170706     A            V4SPSWR        2A  O 17 49COLOR(RED)
009490170706     A            V4DPSWR       20A  O 17 53
009500161006     A*
009510170706     A                                 24  2'F3=Fine'
009520170706     A                                      COLOR(BLU)
009530170706     A  05                             24 12'F8=Visualizza MB/AS'
009540170706     A                                      COLOR(BLU)
009550170706     A                                 24 34'F12=Ritorno'
009560170706     A                                      COLOR(BLU)
009570170706     A                                 24 48'F18=Note'
009580170706     A                                      COLOR(BLU)
009590170706     A                                  6  2'ABILITAZIONI TECNICHE'
009600170706     A                                      DSPATR(UL)
009610170706     A                                      COLOR(BLU)
