000100090313     ***************************************************************************
000200090313     **
000300090313     ** Qualsiasi modifica al formato di questa struttura (p.e. aggiunta di
000400090313     ** campi) deve essere fatta creando una nuova struttura (p.e. TIBSSOC1I).
000500090313     ** In questo modo tutti i programmi che chiamano TIBSSOC00 passando questa
000600090313     ** struttura continuano a funzionare.
000700090313     **
000800090313     ***************************************************************************
000900090313     A          R TIBSSOC0I
001000090313     A                                      TEXT('Anagrafico società: -
001100090313     A                                      dati input.')
001200090313     A            IDSOCIETA      3A
001300090313     A                                      TEXT('Id società.')
001400090313     A            DTVALIDITA      L
001500090313     A                                      TEXT('Data validità anagrafica.')
