000010151201     A*%%TS  SD  20151201  113811  EDPES       REL-V7R1M0  5770-WDS
000020090116     A*---FILE : TIBS91R  ------------------------------------------------------
000030090116     A*          DUPLICA DATI FISGN PER ALTRO P.O.
000040000000     A*-------------------------------------------------------------------------
000050151201     A*%%EC
000060151201     A                                      DSPSIZ(24 80 *DS3)
000070151201     A                                      CHGINPDFT(HI UL)
000080151201     A                                      PRINT
000090000000     A**************************************************************************
000100151201     A          R BS89D01
000110151201     A*%%TS  SD  20151201  113811  EDPES       REL-V7R1M0  5770-WDS
000120151201     A                                      CF06
000130151201     A                                      CA03
000140151201     A  01
000150151201     AO 02                                  CF14
000160151201     A                                      CF07
000170151201     A                                      CSRLOC(H1RIGA     H1COLO)
000180151201     A            H1RIGA         3S 0H
000190151201     A            H1COLO         3S 0H
000200151201     A  28        V1CMSG        78   M
000210151201     A            VIDRSU        20A  O  1  2
000220151201     A                                  1 25'* DUPLICA DATI DI  FISGN00F  PER *'
000230151201     A                                      DSPATR(RI)
000240151201     A                                  1 62'TIBS91R'
000250151201     A                                  1 72DATE
000260151201     A                                      EDTCDE(Y)
000270151201     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000280151201     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000290151201     A                                  2 25'* ETICHETTARE IN ALTRO  TERMINAL *'
000300151201     A                                      DSPATR(RI)
000310151201     A                                      DSPATR(UL)
000320151201     A                                  2 72TIME
000330151201     A                                  6  3'Filiali interessate :'
000340151201     A            V1CPODA1       3Y 0B  6 26CHECK(RB)
000350151201     A  50                                  DSPATR(PC)
000360151201     A                                      EDTCDE(Z)
000370151201     A            V1CPODA2       3Y 0B  6 32CHECK(RB)
000380151201     A  51                                  DSPATR(PC)
000390151201     A                                      EDTCDE(Z)
000400151201     A            V1CPODA3       3Y 0B  6 38CHECK(RB)
000410151201     A  52                                  DSPATR(PC)
000420151201     A                                      EDTCDE(Z)
000430151201     A            V1CPODA4       3Y 0B  6 44CHECK(RB)
000440151201     A  53                                  DSPATR(PC)
000450151201     A                                      EDTCDE(Z)
000460151201     A            V1CPODA5       3Y 0B  6 50CHECK(RB)
000470151201     A  54                                  DSPATR(PC)
000480151201     A                                      EDTCDE(Z)
000490151201     A            V1CPODA6       3Y 0B  6 56CHECK(RB)
000500151201     A  55                                  DSPATR(PC)
000510151201     A                                      EDTCDE(Z)
000520151201     A            V1CPODA7       3Y 0B  7 26CHECK(RB)
000530151201     A  56                                  DSPATR(PC)
000540151201     A                                      EDTCDE(Z)
000550151201     A            V1CPODA8       3Y 0B  7 32CHECK(RB)
000560151201     A  57                                  DSPATR(PC)
000570151201     A                                      EDTCDE(Z)
000580151201     A            V1CPODA9       3Y 0B  7 38CHECK(RB)
000590151201     A  58                                  DSPATR(PC)
000600151201     A                                      EDTCDE(Z)
000610151201     A            V1CPODA10      3Y 0B  7 44CHECK(RB)
000620151201     A  58                                  DSPATR(PC)
000630151201     A                                      EDTCDE(Z)
000640151201     A            V1CPODA11      3Y 0B  7 50CHECK(RB)
000650151201     A  60                                  DSPATR(PC)
000660151201     A                                      EDTCDE(Z)
000670151201     A            V1CPODA12      3Y 0B  7 56CHECK(RB)
000680151201     A  61                                  DSPATR(PC)
000690151201     A                                      EDTCDE(Z)
000700151201     A                                 16  3'Parzializzazione per Codice Client-
000710151201     A                                      e (?):'
000720151201     A            V1CKS1         7A  B 16 45
000730151201     A            V1DKS1        20A  O 16 55DSPATR(HI)
000740151201     A            V1CKS2         7A  B 17 45
000750151201     A            V1DKS2        20A  O 17 55DSPATR(HI)
000760151201     A            V1CKS3         7A  B 18 45
000770151201     A            V1DKS3        20A  O 18 55DSPATR(HI)
000780151201     A            V1CKS4         7A  B 19 45
000790151201     A            V1DKS4        20A  O 19 55DSPATR(HI)
000800151201     A            V1CKS5         7A  B 20 45
000810151201     A            V1DKS5        20A  O 20 55DSPATR(HI)
000820151201     A                                 24  2'F3=Fine'
000830151201     A                                 24 61'F6=Conferma'
