000100120217     A          R TIBSSOF1I                 TEXT('ID filiali by ID società: -
000200120217     A                                      input.')
000300120217     A            FORMATO       10A         TEXT('Nome formato "TIBSSOF1I".')
000400120217     A                                      DFT('TIBSSOF1I')
000500120217     A            VERSIONE       1A         TEXT('Versione formato "A".')
000600120217     A                                      DFT('A')
000700120217     A            IDSOCIETA      3A         TEXT('ID società.')
000800120217     A            DTVALIDITA      L         TEXT('Data validità anagrafica.')
000900120217     A            TPSOCIETA      1A         TEXT('Tipo società.')
