000100060421     A                                      REF(CNDIZION)
000200060914     A          R TIBS2620S
000300060914     A                                      TEXT('Numeratori: -
000400060914     A                                      ricerca e scelta regole.')
000500060914     A            CODICE        10
000600060914     A                                      TEXT('Codice numeratore.')
000700060914     A            RRNAZNMRR     10S 0
000800060914     A                                      TEXT('RRN AZNMRR00F.')
