000100931108      *-------------------------------------------------------------------------
000200020318      *    A B I L I T A Z I O N I   P A D R O N C I N I :
000300931108      *------------------------------------------------------------------------
000400130930     A          R FICN701
000500931108     A*
000800080919     A            I70PGE         3S 0       TEXT('P.O. DA GESTIRE')
001100130930     A            O70UNI        35          TEXT('FLAG ABILITAZIONI')
