000100020419      *--------------------------------------------------------------------------------------------*
000200020809      * REPERIMENTO DATI UTENTE                                                                    *
000300020419      *--------------------------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500020809     A          R BS67000                   TEXT('REPERIMENTO DATI UTENTE')
000600020809     A*=========
000700020809     A* DATI DI WRK
000800020809     A*=========
000900020809     A            W67USR        10          TEXT('PROFILO UTENTE INGRESSO')
001000020809     A            W67UTE        10          TEXT('PROFILO UTENTE RICHIESTO')
001100020809     A            W67SIF        10          TEXT('SIST. INFORMATIVO RICHIESTO')
001200020809     A            W67ERR         1          TEXT('ERRORE')
001300020809     A*=========
001400020809     A* DATI DA TIBS34DS
001500020809     A*=========
001600020419     A            I34TLA         1          TEXT('TIPO ELABORAZIONE')
001700020419     A            I34DTA         1          TEXT('OUTPUT:" "=DATA AREA;"S"= DS')
001800020419     A            I34UTE        10          TEXT('PROFILO UTENTE')
001900020419     A            I34POU         3  0       TEXT('P.O. UTENTE')
002000020402     A            I34COU         3  0       TEXT('CODICE UTENTE')
002100020507     A            I34XXX         1          TEXT('USI FUTURI')
002200020419     A            O34UTE        10          TEXT('PROFILO UTENTE')
002300020419     A            O34POU         3  0       TEXT('P.O. UTENTE')
002400020403     A            O34COU         3  0       TEXT('CODICE UTENTE')
002500020403     A            O34DPO        20          TEXT('DESCRIZIONE P.O')
002600020402     A            O34DIS         1          TEXT('DISTRETTO')
002700020402     A            O34CAR         3  0       TEXT('AREA')
002800020419     A            O34FEL         3  0       TEXT('P.O. ELABORATORE')
002900020417     A            O34ASI         3  0       TEXT('AS+S.I. PER NUOVE TRASMISS-
003000020417     A                                      IONI')
003100020402     A            O34NTW         3          TEXT('NETWORK')
003200020419     A            O34DE3        25          TEXT('DATI DPD E POSTE - ORGDE3')
003300020419     A            O34RUT      1500          TEXT('RECORD AZUTE00F')
003400020402     A            O34FLO        20          TEXT('USI FUTURI')
003500020403     A            O34ERR         1          TEXT('ERRORE')
003600020402     A            O34MSG        78          TEXT('MESSAGGIO')
003700020809     A*=========
003800020809     A* DATI DA DDATIUTE
003900020809     A*=========
004000020809     A            DUTKCI         4S 0       TEXT('CAPOCONTO CLIENTI')
004100020809     A            DUTUTE        10          TEXT('PROFILO UTENTE')
004200020809     A            DUTPOU         3S 0       TEXT('P.O. UTENTE')
004300020809     A            DUTCOU         3S 0       TEXT('CODICE UTENTE')
004400020809     A            DUTLPO         1          TEXT('LIVELLO P.O."S"=SEDE; "1"=1°L-
004500020809     A                                      IVELLO; "2"=2°LIVELLO')
004600020809     A            DUTDPO        20          TEXT('DESCRIZIONE P.O')
004700020809     A            RSUT          20          TEXT('RAGIONE SOCIALE/P.O. UTENTE')
004800020809     A            DUTNTW         3          TEXT('NETWORK')
004900020809     A            DUTDIS         1          TEXT('DISTRETTO')
005000020809     A            DUTARE         3S 0       TEXT('AREA')
005100020809     A            DUTFEL         3S 0       TEXT('CODICE P.O. ELABORATORE')
005200020809     A            DUTASI         3S 0       TEXT('AS+S.I. PER NUOVE TRASMISSI+
005300020809     A                                      ONI')
005400020809     A            DUTDE3        25          TEXT('CAMPO ORGDE3 DI AZORG00F')
005500020809     A            SIMFEL         3S 0       TEXT('TERMINAL PARTENZA')
005600020809     A            DUTTFP         3S 0       TEXT('TERMINAL PARTENZA')
005700020809     A            DUTTFA         3S 0       TEXT('TERMINAL ARRIVO')
005800020809     A            DUTDTE         8S 0       TEXT('DATA PER CALCOLO TERMINAL')
005900020809     A            RSUTOLD       20          TEXT('RAGIONE SOCIALE UTENTE')
006000020809     A            DUTXXX       784          TEXT('LIBERO')
006100020809     A            DUTERR         1          TEXT('E=ERRORE')
006200020809     A            DUTMSG        78          TEXT('MESSAGGIO DI RITORNO')
006300020809     A*=========
006400020809     A* DATI DA AZUTE
006500020809     A*=========
006600020809     A            UTEFAF       500          TEXT('FLAGS ABILITAZIONI')
006700020809     A                                      COLHDG('FLAGS')
006800020809     A            UTEDSC         8S 0       TEXT('DATA SCADENZA VALIDITA''')
006900020809     A                                      COLHDG('DATA SCAD.VAL')
007000020809     A                                      EDTWRD('    /  /  ')
007100020809     A            UTEUTE        10          TEXT('PROFILO')
007200020809     A                                      COLHDG('PROFILO')
007300020809     A            UTECDU         3S 0       TEXT('COD.UTENTE (EX UTENT00F)')
007400020809     A                                      COLHDG('COD.UTENTE')
007500020809     A                                      EDTCDE(2)
007600020809     A            UTEFIL         3S 0       TEXT('PO APPARTENENZA')
007700020809     A                                      COLHDG('PO UTENTE')
007800020809     A                                      EDTCDE(2)
007900020809     A            UTEFUN         5          TEXT('FUNZIONE AZIENDALE - tabella -
008000020809     A                                      FUN')
008100020809     A                                      COLHDG('SIGLA FUNZ.')
008200020809     A            UTEPGM        10          TEXT('NOME PGM INIZIALE')
008300020809     A                                      COLHDG('PGM INIZIALE')
008400020809     A            UTELIB        10          TEXT('LIBRERIA PGM INIZIALE')
008500020809     A                                      COLHDG('LIBRERIA')
008600020809     A            UTEAUT         2          TEXT('LIV.AUTORITA'' - tabella LAT')
008700020809     A                                      COLHDG('LIV.AUTORITA''')
008800020809     A            UTEPAS        10          TEXT('PROFILO POSTA AS')
008900020809     A                                      COLHDG('PRF.POSTA AS')
009000020809     A            UTEEMA       100          TEXT('INDIRIZZO EMAIL')
009100020809     A                                      COLHDG('EMAIL')
009200020809     A            UTEKDT         3          TEXT('LEGAME CON PERSONA FISICA: +
009300020809     A                                      AZIENDA')
009400020809     A                                      COLHDG('AZIENDA')
009500020809     A            UTEKCD        10          TEXT('LEGAME CON PERSONA FISICA: +
009600020809     A                                      CODICE')
009700020809     A                                      COLHDG('AZIENDA')
009800020809     A            UTEFA1        10          TEXT('USI FUTURI')
009900020809     A                                      COLHDG('FILLER')
010000020809     A            UTEFA2        10          TEXT('USI FUTURI')
010100020809     A                                      COLHDG('FILLER')
010200020809     A            UTEFA3        10          TEXT('USI FUTURI')
010300020809     A                                      COLHDG('FILLER')
010400020809     A            UTEFN1         8S 0       TEXT('USI FUTURI')
010500020809     A                                      COLHDG('FILLER')
010600020809     A            UTEFN2         8S 0       TEXT('USI FUTURI')
010700020809     A                                      COLHDG('FILLER')
010800020809     A            UTEFN3         8S 0       TEXT('USI FUTURI')
010900020809     A                                      COLHDG('FILLER')
011000020809     A            UTEFLL       271          TEXT('USI FUTURI')
011100020809     A                                      COLHDG('FILLER')
