000100890918     A*--------------------------------------------------------------*
000200971103     A*  DS REPERIMENTO LIBRERIE E S.I. P.O.
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500971103     A          R D50REC                    TEXT('DS REPERIMENTO DATI SIST.INFO-
000600971103     A                                      RMATIVI')
000700971103     A            I50TLA         1A         TEXT('TIPO LANCIO PROGRAMMA')
000800961016     A*  CAMPI DI INPUT
000900020529     A*  SE NON IMMESSO SARA' DESUNTO DALLA LISTA DI LIBRERIE
001000971103     A***
001100971103     A            I50PSI        10A         TEXT('SISTEMA INFORMATIVO PARTENZA')
001200971103     A            I50PPO         3S 0       TEXT('P.OPERATIVO PARTENZA')
001300971103     A***
001400971103     A* SISTEMA INFORMATIVO E P.O. ARRIVO SONO IN ALTERNATIVA
001500971103     A* SE S.I. PARTENZA E' DI PROVA ANCHE L'ARRIVO SARA' DI PROVA
001600971103     A* SE SONO PRESENTI ENTRAMBI IL P.O. MI SERVE SOLO PER DETERMINARE
001700971103     A*  SE E' LOCALE MA IL PGM NON CONTROLLO SE IL P.O. FA PARTE DI
001800971103     A*  QUEL S.I. (CIO' E' A CURA DEL CHIAMANTE): VINCE SEMPRE IL S.I.
001900971103     A***
002000971103     A            I50ASI        10A         TEXT('SISTEMA INFORMATIVO ARRIVO')
002100971103     A            I50APO         3S 0       TEXT('P.OPERATIVO ARRIVO')
002200970902     A*
002300971103     A* OUTPUT
002400971103     A* SOLO SE PRESENTI SIA P.O. PART CHE P.O. ARRIVO
002500971104     A            O50LCL         1A         TEXT('S=PUNTI OPERATIVI LOCALI -PRE-
002600971104                                            SENTI SULLO STESSO AS-')
002700020715     A            O50SAS         1A         TEXT('S=PUNTI OPERATIVI STESSO -
002800020715                                            §OGAS')
002900971103     A* OUTPUT PARTENZA
003000020529     A            O50PNT         3A         TEXT('PARTENZA: NETWORK')
003100971104     A            O50PSI        10A         TEXT('PARTENZA: SISTEMA INFORMATIVO-
003200971104                                            ')
003300020529     A            O50PLU        10A         TEXT('PARTENZA: LIBRERIA UNICA')
003400020529     A            O50PLG        10A         TEXT('PARTENZA: LIBRERIA DI GRUPPO')
003500971104     A            O50PLR        10A         TEXT('PARTENZA: LIBRERIA RAMO AZIEN-
003600971103                                            DALE')
003700971111     A            O50PLA        10A         TEXT('PARTENZA: LIBRERIA AZIENDA')
003800971103     A* OUTPUT ARRIVO
003900020715     A            O50ANT         3A         TEXT('ARRIVO  : NETWORK')
004000971106     A            O50ASI        10A         TEXT('ARRIVO  : SISTEMA INFORMATIVO-
004100971104                                            ')
004200020529     A            O50ALU        10A         TEXT('ARRIVO  : LIBRERIA UNICA')
004300020529     A            O50ALG        10A         TEXT('ARRIVO  : LIBRERIA DI GRUPPO')
004400971104     A            O50ALR        10A         TEXT('ARRIVO  : LIBRERIA RAMO AZIEN-
004500971103                                            DALE')
004600971104     A            O50ALA        10A         TEXT('ARRIVO  : LIBRERIA AZIENDA')
004700970902     A**
004800971103     A            O50ERR         1A         TEXT('ERRORE')
004900971104     A            O50MSG        78A         TEXT('MESSAGGIO DI ERRORE')
