000100120217     A          R TIBSSOF1O                 TEXT('ID filiali by ID società: -
000200120217     A                                      output.')
000300120217     A            FORMATO       10A         TEXT('Nome formato "TIBSSOF1O".')
000400120217     A                                      DFT('TIBSSOF1O')
000500120217     A            VERSIONE       1A         TEXT('Versione formato "A".')
000600120217     A                                      DFT('A')
000700120217     A            IDFILIALI   1998A         TEXT('ID filiali (999 * 2).')
