000100160628      *PARM devtype(*AFPDS) pagesize(2.9134 4.1339 *UOM)
000200160720      *PARM OVRFLW(8) FORMTYPE(ETIC_BRT) drawer(*FORMDF) pagrtt(0)
000300160630      */*PRM devtype(*AFPDS) pagesize(2.9134 4.1339 *UOM)
000400160720      */*PRM OVRFLW(8) FORMTYPE(ETIC_BRT) drawer(*FORMDF) pagrtt(0)
000500160630      */*END
000600160614      *---------------------------------------------------------------*
000700160616      * ETICHETTA BRT
000800160614      *---------------------------------------------------------------*
000900160706      ******/*PRM OVRFLW(8) FORMTYPE(ETIC_BRT)
001000160614
001100160617      * cose che serve sapere:
001200160617      * - lo spessore delle linee viene creato verso il basso
001300160617      * - la key POSITION identifica per i testi il punto a sx alla base del
001400160617      *   carattere
001500160617
001600160704     A          R BRTETI01
001700160616     A                                      TEXT('Margini esterni')
001800160614      *
001900160614      * Use BOX record-level keyword to print a rectangle.
002000160614      *
002100160614      * The format of the keyword is:
002200160614      * BOX(first-corner-down | &first-corner-down-field
002300160614      * first-corner-across | &first-corner-across-field
002400160614      * diagonal-corner-down | &diagonal-corner-down-field
002500160614      * diagonal-corner-across | &diagonal-corner-across-field
002600160614      * line-width | &line-width-field
002700160614      * [color value]
002800160614      * [shading])
002900160614      *   1 - Distanza del 1° bordo orizzontale (dal lato superiore del foglio)
003000160614      *   2 - Distanza del 1° bordo verticale   (dal lato sinistro  del foglio)
003100160614      *   3 - Distanza del 2° bordo orizzontale (dal lato superiore del foglio)
003200160614      *   4 - Distanza del 2° bordo verticale   (dal lato sinistro  del foglio)
003300160614      *   5 - Spessore della riga: in inches - da .001 a 22.750,
003400160614      *                            *NARROW   - .008 in.,
003500160614      *                            *MEDIUM   - .017 in.,
003600160614      *                            *WIDE     - .025 in.
003700160614      *
003800160616      * Box Margini
003900160704     A  01                                  BOX(&§FCD    &§FCA +
004000160617     A                                          &§DCD    &§DCA +
004100160617     A                                          &§LW)
004200160616      *
004300170525      * Box Terminal arrivo
004400160616     A                                      BOX(&§FCD_TMA &§FCA_TMA +
004500160616     A                                          &§DCD_TMA &§DCA_TMA +
004600160616     A                                          &§LW_TMA)
004700160620      *
004800160620      * Box Tipo servizio
004900160704     A N02N03                               BOX(&§FCD_TSP &§FCA_TSP +
005000160620     A                                          &§DCD_TSP &§DCA_TSP +
005100160621     A                                          &§LW_TSP)
005200160615      *
005300160615      * » LINE(position-down position-across line-lenght line-direction
005400160615      *        line-width)
005500160615      *   1 - Distanza della linea dal lato superiore del foglio
005600160615      *   2 - Distanza della linea dal lato sinistro  del foglio
005700160615      *   3 - Lunghezza della riga
005800160615      *   4 - Tipo riga (*HRZ = orizzontale, *VRT = verticale)
005900160615      *   5 - Spessore della riga: in inches - da .001 a 22.750,
006000160615      *                            *NARROW   - .008 in.,
006100170525
006200160615      *                            *WIDE     - .025 in.
006300160615      *
006400160630
006500160630      * Linea separazione mittente/destinatario
006600160615     A                                      LINE(&§PD    &§PA +
006700160615     A                                          &§LL     *VRT  +
006800160620     A                                          &§LW)
006900160620
007000160620      * Linea (spessa) separazione serie segnacollo
007100161006     A N06                                  LINE(&§PD_L01 &§PA_L01 +
007200160620     A                                           &§LL_L01 +
007300160620     A                                           *HRZ  &§LW_L01)
007400160630
007500160630      * Linea (spessa) sopra al codice a barre
007600160704     A  04                                  LINE(&§PD_L02 &§PA_L02 +
007700160630     A                                           &§LL_L02 +
007800160630     A                                           *HRZ  &§LW_L02)
007900160620
008000160615      *
008100160615      * Codice a Barre
008200160615      *
008300160615      * » BARCODE(type height +6parms)
008400160615      *   1 - Tipo: CODE128 / EAN13 / CODEABAR / CODE3OF9 / MSI / UPCA
008500160615      *             INTERL2OF5 / MATRIX2OF5 / INDUST2OF5 / POSTNET / ...
008600160615      *   2 - Altezza (espressa in LPI)
008700160615      *   Altri parametri:
008800160615      *   3 - Direzione .........: *HRZ = horizontal, *VRT = vertical
008900160615      *   4 - Human Readable ....: *HRI, *HRITOP, *NOHRI
009000160615      *   5 - Asterist (per 3OF9): *AST, *NOAST
009100160615      *   6 - Check digit .......: type
009200160615      *   7 - Unit Width ........: width of narrow bar/space
009300160615      *   8 - Wide/Narrow Ratio .: value from 2.00-3.00
009400160615      *
009500160615      * - CODE128
009600160615     A            BCD           18A         BARCODE(CODE128 +
009700160627     A***                                   6 +
009800160627     A                                      (1.10 *UOM) +
009900160615     A                                      *HRZ *NOHRI +
010000160627     A                                      (*WIDTH 0.015))
010100160704     A                                      POSITION(&§PD_BCD &§PA_BCD)
010200160615      *
010300160615      * IL TESTO VA DOPO LA KEYWORD BOX
010400160615      *
010500160615     A* Font (alcuni)
010600160615      *
010700160615      * » FONT(font-identifier point-size)
010800160615      *
010900160615      * - Courier CPI(17.5) ..............: FONT(00248)
011000160615      * - Courier CPI(15) ................: FONT(00222)
011100160615      * - Courier CPI(13.3) ..............: FONT(00204)
011200160615      * - Courier CPI(12) ................: FONT(00085)
011300160615      * - Courier CPI(10) ................: FONT(00011)
011400160615      * - Gothic  CPI(17.5) ..............: FONT(00400)
011500160615      * - Gothic  CPI(15) ................: FONT(00230)
011600160615      * - Gothic  CPI(12) ................: FONT(00066)
011700160615      * - Gothic  CPI(10) ................: FONT(00040)
011800160615      *
011900160617      * - Helvetica ......................: FONT(34103)
012000160617      * - Helvetica Bold .................: FONT(34123)
012100160615      * il Point Size lo dò io
012200160616      * 1 Point Size = 1/72 inch
012300160616      * quindi per trovare i PS devo fare l'equazione
012400160616      * 1 : 72 = <inch del dato> : X
012500160616      * X = 72 * <inch del dato>
012600160616
012700160616      * con questo font i point size li trovo provando
012800160616     A* Testo terminal arrivo
012900160617     A            TMA            3A
013000170626     A                                      FONT(34103 (*POINTSIZE 28))
013100160617     A                                      HIGHLIGHT
013200160617     A                                      TXTRTT(0)
013300160617     A                                      POSITION(&§PD_TMA &§PA_TMA)
013400160616
013500160616      * con questo font i point size li trovo provando
013600160616     A* Testo linea di arrivo
013700160616     A            LNA            3A
013800160617     A                                      FONT(34103 (*POINTSIZE 22.0))
013900160616     A                                      HIGHLIGHT
014000160616     A                                      TXTRTT(0)
014100160616     A                                      POSITION(&§PD_LNA &§PA_LNA)
014200160620
014300160620      * con questo font i point size li trovo provando
014400160621     A* Testo tipo servizio
014500170525     A N02N03     TSP            1A
014600170525     A* il carattere in RI non funziona sul nostro IBMi
014700170524     ***GOTHIC REVERSE ROMAN 10-P
014800170525     A*                                     FNTCHRSET(QFNTCPL/C0D0GR10 +
014900170525     A*                                               QFNTCPL/T1V10037 +
015000170525     A*                                     (*POINTSIZE 25.0) +
015100170525     A*                                     )
015200170525     A                                      FONT(34103 (*POINTSIZE 25.0))
015300160620     A                                      TXTRTT(0)
015400160621     A                                      POSITION(&§PD_TSP &§PA_TSP)
015500170525
015600160621      * con questo font i point size li trovo provando
015700160621     A* Testo linea di partenza
015800160621     A            LNP            3A
015900160621     A                                      FONT(34103 (*POINTSIZE 15.5))
016000160621     A                                      TXTRTT(0)
016100160621     A                                      POSITION(&§PD_LNP &§PA_LNP)
016200160620
016300160620      * con questo font i point size li trovo provando
016400160620     A* Testo nr. serie
016500161006     A N06        NRS            2A
016600160620     A                                      FONT(34103 (*POINTSIZE 28.0))
016700160620     A                                      HIGHLIGHT
016800160620     A                                      TXTRTT(0)
016900160620     A                                      POSITION(&§PD_NRS &§PA_NRS)
017000160622
017100160622      * con questo font i point size li trovo provando
017200160622     A* Testo Riferimento (RMA)
017300160622     A            RIF_RMA       21A
017400160630     A                                      FONT(34103 (*POINTSIZE 6.5))
017500160622     A                                      TXTRTT(0)
017600160622     A                                      POSITION(&§PD_RMA &§PA_RMA)
017700160622
017800160622      * con questo font i point size li trovo provando
017900160622     A* Testo DATA SPEDIZIONE (AAS + MGS)
018000160622     A            MGS_AAS       10A
018100160630     A                                      FONT(34103 (*POINTSIZE 6.5))
018200160622     A                                      TXTRTT(0)
018300160622     A                                      POSITION(&§PD_DTS &§PA_DTS)
018400160705
018500161005     A* Ristampa
018600160705     A  05        RST            1A
018700160705     A                                      FONT(34103 (*POINTSIZE 6.5))
018800160705     A                                      POSITION(&§PD_RST &§PA_RST)
018900161005
019000161005     A* Merce a valore
019100161005     A  05        VAL            1A
019200161005     A                                      FONT(34103 (*POINTSIZE 16.5))
019300161005     A                                      POSITION(&§PD_VAL &§PA_VAL)
019400160620
019500160620      * con questo font i point size li trovo provando
019600160620     A* Testo segnacollo (si divide in 2 parti)
019700160620     A            NCX1           4A
019800160620     A                                      FONT(34103 (*POINTSIZE 28.0))
019900160620     A                                      HIGHLIGHT
020000160620     A                                      TXTRTT(0)
020100160620     A                                      POSITION(&§PD_NCX1 &§PA_NCX1)
020200160620     A            NCX2           4A
020300160620     A                                      FONT(34103 (*POINTSIZE 40.0))
020400160620     A                                      HIGHLIGHT
020500160620     A                                      TXTRTT(0)
020600160620     A                                      POSITION(&§PD_NCX2 &§PA_NCX2)
020700160620
020800160707     A* Testo mittente non EEX (ragione sociale + provincia)
020900160707     A            MITTENTE      31A
021000160630     A***                                   FONT(34123 (*POINTSIZE 6.5))
021100160707     A                                      FONT(34103 (*POINTSIZE 6.5))
021200160616     A                                      TXTRTT(270)
021300160616     A                                      POSITION(&§PD_01 &§PA_01)
021400160707     A* Testo mittente EEX (ragione sociale + provincia)
021500160707     A            MITT_EEX      27A
021600160707     A***                                   FONT(34123 (*POINTSIZE 6.5))
021700160707     A                                      FONT(34103 (*POINTSIZE 5.5))
021800160707     A                                      TXTRTT(270)
021900160707     A                                      POSITION(&§PD_01 &§PA_01)
022000160616     A* Testo destinatario 1 (ragione sociale + provincia)
022100160706     A            DEST_01       31A
022200160630     A***                                   FONT(34123 (*POINTSIZE 6.5))
022300161010     A                                      FONT(34103 (*POINTSIZE 6.5))
022400160616     A                                      TXTRTT(270)
022500160616     A                                      POSITION(&§PD_D01 &§PA_D01)
022600160706     A* Testo destinatario 2 (indirizzo + località)
022700160706     A            DEST_02       34A
022800160630     A***                                   FONT(34123 (*POINTSIZE 6.5))
022900160706     A                                      FONT(34103 (*POINTSIZE 5.5))
023000160616     A                                      TXTRTT(270)
023100160616     A                                      POSITION(&§PD_D02 &§PA_D02)
023200160616     A* Testo spedizione (volume + colli + peso)
023300160621     A            SPEDIZIONE    60A
023400160706     A***                                   FONT(00253 (*POINTSIZE 6.5))
023500160706     A                                      FONT(34103 (*POINTSIZE 5.5))
023600160616     A                                      TXTRTT(270)
023700160622     A                                      POSITION(&§PD_S01 &§PA_S01)
023800160614      *
023900160615      * campi programma-a-sistema
024000160617     A            §FCD           5S 3P
024100160617     A            §FCA           5S 3P
024200160617     A            §DCD           5S 3P
024300160617     A            §DCA           5S 3P
024400160615     A            §LW            5S 3P
024500160616     A            §FCD_TMA       5S 3P
024600160616     A            §FCA_TMA       5S 3P
024700160616     A            §DCD_TMA       5S 3P
024800160616     A            §DCA_TMA       5S 3P
024900160616     A            §LW_TMA        5S 3P
025000160620     A            §FCD_TSP       5S 3P
025100160620     A            §FCA_TSP       5S 3P
025200160620     A            §DCD_TSP       5S 3P
025300160620     A            §DCA_TSP       5S 3P
025400160620     A            §LW_TSP        5S 3P
025500160616     A            §PD_TMA        5S 3P
025600160617     A            §PA_TMA        5S 3P
025700160621     A            §PD_TSP        5S 3P
025800160621     A            §PA_TSP        5S 3P
025900160616     A            §PD_LNA        5S 3P
026000160616     A            §PA_LNA        5S 3P
026100160620     A            §PD_LNP        5S 3P
026200160620     A            §PA_LNP        5S 3P
026300160620     A            §PD_NRS        5S 3P
026400160620     A            §PA_NRS        5S 3P
026500160620     A            §PD_NCX1       5S 3P
026600160620     A            §PA_NCX1       5S 3P
026700160620     A            §PD_NCX2       5S 3P
026800160620     A            §PA_NCX2       5S 3P
026900160622     A            §PD_RMA        5S 3P
027000160622     A            §PA_RMA        5S 3P
027100160622     A            §PD_DTS        5S 3P
027200160622     A            §PA_DTS        5S 3P
027300160705     A            §PD_RST        5S 3P
027400160705     A            §PA_RST        5S 3P
027500161005     A            §PD_VAL        5S 3P
027600161005     A            §PA_VAL        5S 3P
027700160615     A            §PD            5S 3P
027800160615     A            §PA            5S 3P
027900160615     A            §LL            5S 3P
028000160620     A            §PD_L01        5S 3P
028100160620     A            §PA_L01        5S 3P
028200160620     A            §LL_L01        5S 3P
028300160620     A            §LW_L01        5S 3P
028400160630     A            §PD_L02        5S 3P
028500160630     A            §PA_L02        5S 3P
028600160630     A            §LL_L02        5S 3P
028700160630     A            §LW_L02        5S 3P
028800160630     A            §PD_01         5S 3P
028900160615     A            §PA_01         5S 3P
029000160704     A            §PD_BCD        5S 3P
029100160704     A            §PA_BCD        5S 3P
029200160616     A*           §PD_03         5S 3P
029300160616     A*           §PA_03         5S 3P
029400160616     A            §PD_D01        5S 3P
029500160616     A            §PA_D01        5S 3P
029600160616     A            §PD_D02        5S 3P
029700160616     A            §PA_D02        5S 3P
029800160616     A            §PD_S01        5S 3P
029900160616     A            §PA_S01        5S 3P
030000160616
030100160616      *---------------------------------------------------------------*
030200160704      *?Logo BRT costruito a pgm                                     ?*
030300160616      *---------------------------------------------------------------*
030400160616
030500160623     A          R LOGOBRT_SM
030600160616     A                                      TEXT('Logo BRT')
030700160616      *
030800160616      *?Box BRT?
030900160616     A                                      BOX(&§PLBLS  &§PLBLVS +
031000160616     A                                          &§PLBLI  &§PLBLVD +
031100160616     A                                          0.015)
031200160616      *
031300160616      *?Linea (spessa) sottostante?
031400160616     A                                      LINE(&§PLOI  &§PLBLVS +
031500160616     A                                           &§PLUL +
031600160616     A                                           *HRZ    0.030)
031700160616      *
031800160616      *?"BRT"?
031900160623      *                                                _R2
032000160616      *?-B-?
032100160616     A                                      LINE(&§PLBVA &§PLBL1A +
032200160616     A                                           &§PSPE  *HRZ  &§PLU1)
032300160616     A                                      LINE(&§PLBVB &§PLBL1B +
032400160616     A                                           &§PSPE  *HRZ  &§PLU2)
032500160616     A                                      LINE(&§PLBVC &§PLBL1B +
032600160616     A                                           &§PSPE  *HRZ  &§PLU2)
032700160616     A                                      LINE(&§PLBOA &§PLBL1C +
032800160616     A                                           &§PLU3  *HRZ  &§PSPE)
032900160616     A                                      LINE(&§PLBOB &§PLBL1C +
033000160616     A                                           &§PLU3  *HRZ  &§PSPE)
033100160616     A                                      LINE(&§PLBOC &§PLBL1C +
033200160616     A                                           &§PLU3  *HRZ  &§PSPE)
033300160616      *?-R-?
033400160616     A                                      LINE(&§PLBVA &§PLBL3A +
033500160616     A                                           &§PSPE  *HRZ  &§PLU1)
033600160616     A                                      LINE(&§PLBVB &§PLBL3B +
033700160616     A                                           &§PSPE  *HRZ  &§PLU2)
033800160616     A                                      LINE(&§PLBVC &§PLBL3B +
033900160616     A                                           &§PSPE  *HRZ  &§PLU7)
034000160616     A                                      LINE(&§PLBOA &§PLBL3C +
034100160616     A                                           &§PLU3  *HRZ  &§PSPE)
034200160616     A                                      LINE(&§PLBOB &§PLBL3C +
034300160616     A                                           &§PLU3  *HRZ  &§PSPE)
034400160616      *?-T-?
034500160616     A                                      LINE(&§PLBOA &§PLBL4A +
034600160616     A                                           &§PLU8  *HRZ  &§PSPE)
034700160616     A                                      LINE(&§PLBVB &§PLBL4B +
034800160616     A                                           &§PSPE  *HRZ  &§PLU4)
034900160616      *
035000160616      *?"CORRIERE" "ESPRESSO" di BRT?
035100160616      *
035200160616     A            *NONE                     'CORRIERE'
035300160616     A                                      FONT(02305 +
035400160623     A                                          (*POINTSIZE  5.8))
035500160623     A                                      POSITION(&§PCC   &§PLBLV2)
035600160616     A            *NONE                     'ESPRESSO'
035700160616     A                                      FONT(02305 +
035800160623     A                                          (*POINTSIZE  5.8))
035900160616     A                                      POSITION(&§PCE   &§PLBLVS)
036000160616      *
036100160616      *-------------------------------------*
036200160616      *
036300160616      *?Parametri logo "BRT"?
036400160616     A            §PLBLS         5S 3P
036500160616     A            §PLBLI         5S 3P
036600160623     A            §PLBLV2        5S 3P
036700160616     A            §PLBLVS        5S 3P
036800160616     A            §PLBLVD        5S 3P
036900160616     A            §PLUL          5S 3P
037000160616     A            §PLOI          5S 3P
037100160616     A            §PCC           5S 3P
037200160616     A            §PCE           5S 3P
037300160616     A            §PSPE          5S 3P
037400160616     A            §PLU1          5S 3P
037500160616     A            §PLU2          5S 3P
037600160616     A            §PLU3          5S 3P
037700160616     A            §PLU4          5S 3P
037800160616     A            §PLU7          5S 3P
037900160616     A            §PLU8          5S 3P
038000160616      *
038100160616     A            §PLBVA         5S 3P
038200160616     A            §PLBVB         5S 3P
038300160616     A            §PLBVC         5S 3P
038400160616     A            §PLBOA         5S 3P
038500160616     A            §PLBOB         5S 3P
038600160616     A            §PLBOC         5S 3P
038700160616      *
038800160616     A            §PLBL1A        5S 3P
038900160616     A            §PLBL1B        5S 3P
039000160616     A            §PLBL1C        5S 3P
039100160616     A            §PLBL3A        5S 3P
039200160616     A            §PLBL3B        5S 3P
039300160616     A            §PLBL3C        5S 3P
039400160616     A            §PLBL4A        5S 3P
039500160616     A            §PLBL4B        5S 3P
039600160623
039700160623      *---------------------------------------------------------------*
039800160623      *?TIPO SPEDIZIONE E
039900160623      *---------------------------------------------------------------*
040000160623
040100170526     A          R TSP_RI
040200170526
040300170526      * Linea che simula uno sfondo nero
040400170526     A                                      LINE(&§FCD_TSP &§FCA_TSP +
040500170526     A                                           &§LW_TSP  *HRZ  +
040600170526     A                                           &§LW_TSP)
040700170526
040800170526     A* Testo tipo servizio IN RI
040900170526     A            TSP_REV        1A
041000170526     A                                      FONT(34103 (*POINTSIZE 25.0))
041100170526     A*** TESTO IN BIANCO!
041200170526     A                                      COLOR(*RGB 100 100 100)
041300170526     A                                      TXTRTT(0)
041400170526     A                                      POSITION(&§PD_TSP &§PA_TSP)
041500170526
041600170526     A            §FCD_TSP       5S 3P
041700170526     A            §FCA_TSP       5S 3P
041800170526     A            §LW_TSP        5S 3P
041900170526     A            §PD_TSP        5S 3P
042000170526     A            §PA_TSP        5S 3P
042100170526
042200170526      *---------------------------------------------------------------*
042300170526      *?TIPO SPEDIZIONE E con PAGSEG
042400170526      *---------------------------------------------------------------*
042500170526
042600170526     A          R TSP_E_PAGS
042700170526     A                                      FONT(00222)
042800170526      *
042900170526      * » PAGSEG([library-name/]page-segment-name
043000170526      *          position-down position-across
043100170526      *          (*SIZE width|&width-field height|&height-field)
043200170526      *          (*ROTATION rotation|&rotation))
043300170526      *   1 - Nome dell'oggetto contenente l'immagine
043400170526      *       (con eventuale libreria)
043500170526      *   2 - Distanza dell'immagine dal lato superiore del foglio
043600170526      *   3 - Distanza dell'immagine dal lato sinistro  del foglio
043700170526      *   Parametri facoltativi:
043800170526      *   4 - Dimensione .........: altezza + lunghezza
043900170526      *   5 - Rotazione (in gradi): 0, 90, 180, 270.
044000170526      *   N.B.1: per mantenere il logo anche DOPO aver trasferito una
044100170526      *          stampa di codesto prtf in altro AS/400
044200170526      *          - vedi OUTQ(EDP888) da AS888 o OUTQ(SETRAS) da fil. -
044300170526      *          pare NECESSARIO aver specificato il nome della
044400170526      *          libreria relativa al logo. Incredibile ma vero !!!
044500170526      *   N.B.2: il nome del logo sarebbe "parametrizzabile", ma tale
044600170526      *          parametro va definito lungo 8 char: non sarebbe quindi
044700170526      *          possibile specificare, in tale parametro, anche il
044800170526      *          il nome della libreria e il "/" separatore (comunque
044900170526      *          specificabili separatamente - vedi &§LOGO in LSB6DK0).
045000170526     A                                      PAGSEG(EDPLC/TSP_E +
045100170526     A                                             &§PD_TSP_E +
045200170526     A                                             &§PA_TSP_E)
045300170526     A            §PD_TSP_E      5S 3P
045400170526     A            §PA_TSP_E      5S 3P
045500160623
045600160623      *---------------------------------------------------------------*
045700170526      *?TIPO SPEDIZIONE H con PAGSEG
045800160623      *---------------------------------------------------------------*
045900160623
046000170526     A          R TSP_H_PAGS
046100160623     A                                      FONT(00222)
046200160623      *
046300160623      * » PAGSEG([library-name/]page-segment-name
046400160623      *          position-down position-across
046500160623      *          (*SIZE width|&width-field height|&height-field)
046600160623      *          (*ROTATION rotation|&rotation))
046700160623      *   1 - Nome dell'oggetto contenente l'immagine
046800160623      *       (con eventuale libreria)
046900160623      *   2 - Distanza dell'immagine dal lato superiore del foglio
047000160623      *   3 - Distanza dell'immagine dal lato sinistro  del foglio
047100160623      *   Parametri facoltativi:
047200160623      *   4 - Dimensione .........: altezza + lunghezza
047300160623      *   5 - Rotazione (in gradi): 0, 90, 180, 270.
047400160623      *   N.B.1: per mantenere il logo anche DOPO aver trasferito una
047500160623      *          stampa di codesto prtf in altro AS/400
047600160623      *          - vedi OUTQ(EDP888) da AS888 o OUTQ(SETRAS) da fil. -
047700160623      *          pare NECESSARIO aver specificato il nome della
047800160623      *          libreria relativa al logo. Incredibile ma vero !!!
047900160623      *   N.B.2: il nome del logo sarebbe "parametrizzabile", ma tale
048000160623      *          parametro va definito lungo 8 char: non sarebbe quindi
048100160623      *          possibile specificare, in tale parametro, anche il
048200160623      *          il nome della libreria e il "/" separatore (comunque
048300160623      *          specificabili separatamente - vedi &§LOGO in LSB6DK0).
048400160623     A                                      PAGSEG(EDPLC/TSP_H +
048500160623     A                                             &§PD_TSP_H +
048600160623     A                                             &§PA_TSP_H)
048700160623     A            §PD_TSP_H      5S 3P
048800160623     A            §PA_TSP_H      5S 3P
048900160623
049000160623      *---------------------------------------------------------------*
049100160704      *?Logo BRT mediante PAGSEG
049200160623      *---------------------------------------------------------------*
049300160623
049400160623     A          R LOGOBRT
049500160623      *
049600160623      * » PAGSEG([library-name/]page-segment-name
049700160623      *          position-down position-across
049800160623      *          (*SIZE width|&width-field height|&height-field)
049900160623      *          (*ROTATION rotation|&rotation))
050000160623      *   1 - Nome dell'oggetto contenente l'immagine
050100160623      *       (con eventuale libreria)
050200160623      *   2 - Distanza dell'immagine dal lato superiore del foglio
050300160623      *   3 - Distanza dell'immagine dal lato sinistro  del foglio
050400160623      *   Parametri facoltativi:
050500160623      *   4 - Dimensione .........: altezza + lunghezza
050600160623      *   5 - Rotazione (in gradi): 0, 90, 180, 270.
050700160623      *   N.B.1: per mantenere il logo anche DOPO aver trasferito una
050800160623      *          stampa di codesto prtf in altro AS/400
050900160623      *          - vedi OUTQ(EDP888) da AS888 o OUTQ(SETRAS) da fil. -
051000160623      *          pare NECESSARIO aver specificato il nome della
051100160623      *          libreria relativa al logo. Incredibile ma vero !!!
051200160623      *   N.B.2: il nome del logo sarebbe "parametrizzabile", ma tale
051300160623      *          parametro va definito lungo 8 char: non sarebbe quindi
051400160623      *          possibile specificare, in tale parametro, anche il
051500160623      *          il nome della libreria e il "/" separatore (comunque
051600160623      *          specificabili separatamente - vedi &§LOGO in LSB6DK0).
051700160623     A                                      PAGSEG(EDPLC/LOGOBRT +
051800160623     A                                             &§PD_BRT +
051900160623     A                                             &§PA_BRT)
052000160623     A            §PD_BRT        5S 3P
052100160623     A            §PA_BRT        5S 3P
052200160705
052300160705      *---------------------------------------------------------------*
052400160705      * Parte Zona consegna per network Italia
052500160705      *---------------------------------------------------------------*
052600160705
052700160705     A          R ZNCITA
052800160705     A                                      TEXT('Zona consegna Italia')
052900160705      *
053000160705      * Box Zona consegna
053100160705     A                                      BOX(&§FCD_ZNC &§FCA_ZNC +
053200160705     A                                          &§DCD_ZNC &§DCA_ZNC +
053300160705     A                                          &§LW_ZNC)
053400160705
053500160705      * con questo font i point size li trovo provando
053600160705     A* Testo zona consegna
053700160705     A            ZNC            2A
053800161010     A                                      FONT(34103 (*POINTSIZE 28))
053900160705     A                                      HIGHLIGHT
054000160705     A                                      TXTRTT(0)
054100160705     A                                      POSITION(&§PD_ZNC &§PA_ZNC)
054200160705      *
054300160705      * campi programma-a-sistema
054400160705     A            §FCD_ZNC       5S 3P
054500160705     A            §FCA_ZNC       5S 3P
054600160705     A            §DCD_ZNC       5S 3P
054700160705     A            §DCA_ZNC       5S 3P
054800160705     A            §LW_ZNC        5S 3P
054900160705     A            §PD_ZNC        5S 3P
055000160705     A            §PA_ZNC        5S 3P
055100160705
055200160705      *---------------------------------------------------------------*
055300160705      * Parte Zona consegna per network EuroExpress
055400160705      *---------------------------------------------------------------*
055500160705
055600160705     A          R ZNCEEX
055700160705     A                                      TEXT('Zona consegna EuroExpress')
055800160705      *
055900161010      * Box dati esteri consegna
056000161010     A                                      BOX(&§FCD_ZNCEX &§FCA_ZNCEX +
056100161010     A                                          &§DCD_ZNCEX &§DCA_ZNCEX +
056200161010     A                                          &§LW_ZNCEX)
056300161010      *
056400161010      * Box Zona consegna
056500161010     A                                      BOX(&§FCD_ZNC &§FCA_ZNC +
056600161010     A                                          &§DCD_ZNC &§DCA_ZNC +
056700161010     A                                          &§LW_ZNC)
056800160705
056900160705      * con questo font i point size li trovo provando
057000161010     A* Testo cod. ISO nazione
057100161010     A            ZNC_ISA        2A
057200161010     A                                      FONT(34103 (*POINTSIZE 16))
057300160705     A                                      TXTRTT(0)
057400161010     A                                      POSITION(&§PD_ISAEX &§PA_ISAEX)
057500161010
057600161010     A* Testo ZIP CODE
057700161010     A            ZNC_COD        9A
057800161010     A                                      FONT(34103 (*POINTSIZE 11))
057900161010     A                                      TXTRTT(0)
058000161010     A                                      POSITION(&§PD_CODEX &§PA_CODEX)
058100161010
058200161010      * con questo font i point size li trovo provando
058300161010     A* Testo zona consegna
058400161010     A            ZNC            2A
058500161010     A                                      FONT(34103 (*POINTSIZE 20))
058600161010     A                                      HIGHLIGHT
058700161010     A                                      TXTRTT(0)
058800161010     A                                      POSITION(&§PD_ZNC &§PA_ZNC)
058900160705      *
059000160705      * campi programma-a-sistema
059100161010     A            §FCD_ZNCEX     5S 3P
059200161010     A            §FCA_ZNCEX     5S 3P
059300161010     A            §DCD_ZNCEX     5S 3P
059400161010     A            §DCA_ZNCEX     5S 3P
059500161010     A            §LW_ZNCEX      5S 3P
059600161010     A            §PD_ISAEX      5S 3P
059700161010     A            §PA_ISAEX      5S 3P
059800161010     A            §PD_CODEX      5S 3P
059900161010     A            §PA_CODEX      5S 3P
060000161010     A            §FCD_ZNC       5S 3P
060100161010     A            §FCA_ZNC       5S 3P
060200161010     A            §DCD_ZNC       5S 3P
060300161010     A            §DCA_ZNC       5S 3P
060400161010     A            §LW_ZNC        5S 3P
060500161010     A            §PD_ZNC        5S 3P
060600161010     A            §PA_ZNC        5S 3P
060700170209
060800170209      *---------------------------------------------------------------*
060900170209      * Etichetta di avvertimento
061000170209      *---------------------------------------------------------------*
061100170209
061200170209     A          R MSGERR
061300170209     A                                      TEXT('Msg di errore/avvertimento')
061400170209
061500170209      * con questo font i point size li trovo provando
061600170209     A* Titolo
061700170209     A            MSG_TIT       10A
061800170214     A                                      FONT(34103 (*POINTSIZE 26))
061900170209     A                                      TXTRTT(0)
062000170209     A                                      POSITION(&§PD_MSGT &§PA_MSGT)
062100170209
062200170209     A* Testo 1
062300170209     A            MSG_ER1       20A
062400170209     A                                      FONT(34103 (*POINTSIZE 16))
062500170209     A                                      TXTRTT(0)
062600170209     A                                      POSITION(&§PD_MSGE1 &§PA_MSGE1)
062700170209
062800170209     A* Testo 2
062900170209     A            MSG_ER2       20A
063000170209     A                                      FONT(34103 (*POINTSIZE 16))
063100170209     A                                      TXTRTT(0)
063200170209     A                                      POSITION(&§PD_MSGE2 &§PA_MSGE2)
063300170209
063400170209     A* Testo 3
063500170209     A            MSG_ER3       20A
063600170209     A                                      FONT(34103 (*POINTSIZE 16))
063700170209     A                                      TXTRTT(0)
063800170209     A                                      POSITION(&§PD_MSGE3 &§PA_MSGE3)
063900170209
064000170209     A* Testo 4
064100170209     A            MSG_ER4       40A
064200170214     A                                      FONT(34103 (*POINTSIZE 9))
064300170209     A                                      TXTRTT(0)
064400170209     A                                      POSITION(&§PD_MSGE4 &§PA_MSGE4)
064500170209
064600170209     A* Testo 5
064700170209     A            MSG_ER5       40A
064800170214     A                                      FONT(34103 (*POINTSIZE 9))
064900170209     A                                      TXTRTT(0)
065000170209     A                                      POSITION(&§PD_MSGE5 &§PA_MSGE5)
065100170209
065200170209     A* Testo 6
065300170209     A            MSG_ER6       40A
065400170214     A                                      FONT(34103 (*POINTSIZE 9))
065500170209     A                                      TXTRTT(0)
065600170209     A                                      POSITION(&§PD_MSGE6 &§PA_MSGE6)
065700170209
065800170209     A* Testo 7
065900170209     A            MSG_ER7       40A
066000170214     A                                      FONT(34103 (*POINTSIZE 9))
066100170209     A                                      TXTRTT(0)
066200170209     A                                      POSITION(&§PD_MSGE7 &§PA_MSGE7)
066300170209      *
066400170209      * campi programma-a-sistema
066500170209     A            §PD_MSGT       5S 3P
066600170209     A            §PA_MSGT       5S 3P
066700170209     A            §PD_MSGE1      5S 3P
066800170209     A            §PA_MSGE1      5S 3P
066900170209     A            §PD_MSGE2      5S 3P
067000170209     A            §PA_MSGE2      5S 3P
067100170209     A            §PD_MSGE3      5S 3P
067200170209     A            §PA_MSGE3      5S 3P
067300170209     A            §PD_MSGE4      5S 3P
067400170209     A            §PA_MSGE4      5S 3P
067500170209     A            §PD_MSGE5      5S 3P
067600170209     A            §PA_MSGE5      5S 3P
067700170209     A            §PD_MSGE6      5S 3P
067800170209     A            §PA_MSGE6      5S 3P
067900170209     A            §PD_MSGE7      5S 3P
068000170209     A            §PA_MSGE7      5S 3P
068100161010
068200160706      *---------------------------------------------------------------*
068300160706      * Fine pagina
068400160706      *---------------------------------------------------------------*
068500160706
068600160706     A          R ENDPAGE                   ENDPAGE
