000010150915     A*%%TS  SD  20150915  174415  EDPLC       REL-V7R1M0  5770-WDS
000020970526     A*-------------------------------------------------------------------------
000030150915     A*%%EC
000040150915     A                                      DSPSIZ(24 80 *DS3)
000050150915     A                                      CHGINPDFT(HI CS)
000060150915     A                                      PRINT
000070150915     A                                      CF01
000080150915     A                                      CF02
000090150915     A                                      CF03
000100150915     A                                      CF04
000110150915     A                                      CF05
000120150915     A                                      CF06
000130150915     A                                      CF07
000140150915     A                                      CF08
000150150915     A                                      CF09
000160150915     A                                      CF10
000170150915     A                                      CF11
000180150915     A                                      CF12
000190150915     A                                      CF13
000200150915     A                                      CF14
000210150915     A                                      CF15
000220150915     A                                      CF16
000230150915     A                                      CF17
000240150915     A                                      CF18
000250150915     A                                      CF19
000260150915     A                                      CF20
000270150915     A                                      CF21
000280150915     A                                      CF22
000290150915     A                                      CF23
000300150915     A                                      CF24
000310150915     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330150915     A          R CTRDTD01
000340150915     A*%%TS  SD  20150915  150103  EDPLC       REL-V7R1M0  5770-WDS
000350150915     A                                      TEXT('Testata')
000360150915     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370150915     A                                  1 24'*  Tariffa decorrente alla data   -
000380150915     A                                      *'
000390150915     A                                      DSPATR(RI)
000400150915     A                                      DSPATR(UL)
000410150915     A                                  1 60'UBCTRDTR1'
000420150915     A                                  1 71DATE
000430150915     A                                      EDTCDE(Y)
000440150915     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000450150915     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000460150915     A                                  2 32'      LANCIO        '
000470150915     A                                      DSPATR(HI)
000480150915     A                                      DSPATR(RI)
000490150915     A                                  2 71TIME
000500970526     A*-------------------------------------------------------------------------
000510150915     A          R CTRDTD02
000520970526     A                                      OVERLAY
000530970526     A            FUN001        19A  O 22  2
000540970526     A            FUN002        19A  O 22 22
000550970526     A            FUN003        19A  O 22 42
000560970526     A            FUN004        19A  O 22 62
000570970526     A            FUN005        19A  O 23  2
000580970526     A            FUN006        19A  O 23 22
000590970526     A            FUN007        19A  O 23 42
000600970526     A            FUN008        19A  O 23 62
000610970526     A*-------------------------------------------------------------------------
000620150915     A          R CTRDTD03
000630150915     A*%%TS  SD  20150915  174415  EDPLC       REL-V7R1M0  5770-WDS
000640150915     A                                      OVERLAY
000650150915     A                                  4  2'INPUT                             -
000660150915     A                                                                         -
000670150915     A                                               '
000680150915     A                                      DSPATR(UL)
000690150915     A                                  5  2'Cliente/Tariffa/Riferimento:'
000700150915     A            D03KSC         7Y 0B  5 31
000710150915     A  50                                  DSPATR(PC)
000720150915     A  50                                  DSPATR(RI)
000730150915     A                                      CHECK(RZ)
000740150915     A                                  5 39'/'
000750150915     A            D03CTR         3Y 0B  5 41
000760150915     A  51                                  DSPATR(PC)
000770150915     A  51                                  DSPATR(RI)
000780150915     A                                      CHECK(RZ)
000790150915     A                                  5 45'/'
000800150915     A            D03DTR         8Y 0B  5 47
000810150915     A  52                                  DSPATR(PC)
000820150915     A  52                                  DSPATR(RI)
000830150915     A                                 11  2'OUTPUT                            -
000840150915     A                                                                         -
000850150915     A                                               '
000860150915     A                                      DSPATR(UL)
000870150915     A                                 12  2'Esito .................:'
000880150915     A            D03ESITO       2Y 0O 12 27EDTWRD('0 ')
000890150915     A            D03ESITOD     50A  O 12 30
000900150915     A                                 13  2'Dati significativi tariffa:'
000910150915     A                                 14  2'Progressivo:'
000920150915     A            D03PRG         3Y 0O 14 15EDTWRD('0  ')
000930150915     A                                 14 20'Decorrenza:'
000940150915     A            D03DDT         8S 0O 14 32
000950150915     A                                 14 42'Scadenza:'
000960150915     A            D03DST         8S 0O 14 52
000970150915     A                                 14 62'Tipo servizio:'
000980150915     A            D03TSP         1A  O 14 77
000990150915     A                                 15  2'Particolarità C/A-Giacenza-Consegn-
001000150915     A                                      a-Varie:'
001010150915     A            D03GCA         2A  O 15 45
001020150915     A                                 15 48'-'
001030150915     A            D03GGA         2A  O 15 50
001040150915     A                                 15 53'-'
001050150915     A            D03GMA         2A  O 15 55
001060150915     A                                 15 58'-'
001070150915     A            D03GVA         2A  O 15 60
001080150915     A                                 16  2'Italia/Estero/Altro:'
001090150915     A            D03FIE         1A  O 16 23
001100150915     A                                 16 26'Tipo calcolo volume:'
001110150915     A            D03TIN         1A  O 16 47
001120150915     A                                 16 50'Flag Blocco/Arr/Part:'
001130150915     A            D03BAP         1A  O 16 72
001140150915     A                                 17  2'Natura merce:'
001150150915     A            D03NAS        15A  O 17 16
001160150915     A                                 17 33'Note:'
001170150915     A            D03NOT        35A  O 17 39
001180150915     A            VIDMSG        76A  O 21  3DSPATR(HI)
001190970526     A*-------------------------------------------------------------------------
001200150915     A          R CTRDTDMS                  SFL
001210970526     A                                      SFLMSGRCD(24)
001220970526     A            MSGKEY                    SFLMSGKEY
001230970526     A            MSGQUE                    SFLPGMQ
001240970526     A*-------------------------------------------------------------------------
001250150915     A          R CTRDTDMC                  SFLCTL(CTRDTDMS)
001260970526     A                                      OVERLAY
001270970526     A                                      SFLDSP
001280970526     A  40                                  SFLCLR
001290970526     A                                      SFLSIZ(0002)
001300970526     A                                      SFLPAG(0001)
