000100141216     A*%%TS  SD  20141216  122249  EDPLC       REL-V7R1M0  5770-WDS
000200970526     A*-------------------------------------------------------------------------
000300141216     A*%%EC
000400141216     A                                      DSPSIZ(24 80 *DS3)
000500141216     A                                      CHGINPDFT(HI CS)
000600141216     A                                      PRINT
000700141216     A                                      CF01
000800141216     A                                      CF02
000900141216     A                                      CF03
001000141216     A                                      CF04
001100141216     A                                      CF05
001200141216     A                                      CF06
001300141216     A                                      CF07
001400141216     A                                      CF08
001500141216     A                                      CF09
001600141216     A                                      CF10
001700141216     A                                      CF11
001800141216     A                                      CF12
001900141216     A                                      CF13
002000141216     A                                      CF14
002100141216     A                                      CF15
002200141216     A                                      CF16
002300141216     A                                      CF17
002400141216     A                                      CF18
002500141216     A                                      CF19
002600141216     A                                      CF20
002700141216     A                                      CF21
002800141216     A                                      CF22
002900141216     A                                      CF23
003000141216     A                                      CF24
003100141216     A                                      HELP
003200970526     A*-------------------------------------------------------------------------
003300141216     A          R MACTLD01
003400141216     A*%%TS  SD  20141216  122249  EDPLC       REL-V7R1M0  5770-WDS
003500141216     A                                      TEXT('Testata')
003600141216     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
003700141216     A                                  1 24'*   Controllo Mailing Automatico  -
003800141216     A                                      *'
003900141216     A                                      DSPATR(RI)
004000141216     A                                      DSPATR(UL)
004100141216     A                                  1 60'UBMACTLR1'
004200141216     A                                  1 71DATE
004300141216     A                                      EDTCDE(Y)
004400141216     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004500141216     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004600141216     A                                  2 32'      LANCIO        '
004700141216     A                                      DSPATR(HI)
004800141216     A                                      DSPATR(RI)
004900141216     A                                  2 71TIME
005000970526     A*-------------------------------------------------------------------------
005100141216     A          R MACTLD02
005200970526     A                                      OVERLAY
005300970526     A            FUN001        19A  O 22  2
005400970526     A            FUN002        19A  O 22 22
005500970526     A            FUN003        19A  O 22 42
005600970526     A            FUN004        19A  O 22 62
005700970526     A            FUN005        19A  O 23  2
005800970526     A            FUN006        19A  O 23 22
005900970526     A            FUN007        19A  O 23 42
006000970526     A            FUN008        19A  O 23 62
006100970526     A*-------------------------------------------------------------------------
006200141216     A          R MACTLD03
006300141216     A*%%TS  SD  20141216  122249  EDPLC       REL-V7R1M0  5770-WDS
006400141216     A                                      OVERLAY
006500141216     A                                  4  2'INPUT                             -
006600141216     A                                                                         -
006700141216     A                                               '
006800141216     A                                      DSPATR(UL)
006900141216     A                                  5  2'Nr. giorni ritardo ....:'
007000141216     A            D03NRGG        3Y 0B  5 28EDTCDE(Z)
007100141217     A  50                                  DSPATR(PC)
007200141217     A  50                                  DSPATR(RI)
007300141216     A                                  6  2'Destinatario email ctrl:'
007400141216     A            D03DEST      126   B  6 28CHECK(LC)
007500141216     A            VIDMSG        76A  O 21  3DSPATR(HI)
007600970526     A*-------------------------------------------------------------------------
007700141216     A          R MACTLDMS                  SFL
007800970526     A                                      SFLMSGRCD(24)
007900970526     A            MSGKEY                    SFLMSGKEY
008000970526     A            MSGQUE                    SFLPGMQ
008100970526     A*-------------------------------------------------------------------------
008200141216     A          R MACTLDMC                  SFLCTL(MACTLDMS)
008300970526     A                                      OVERLAY
008400970526     A                                      SFLDSP
008500970526     A  40                                  SFLCLR
008600970526     A                                      SFLSIZ(0002)
008700970526     A                                      SFLPAG(0001)
