000100991201
000200081021             PGM
000300991201
000400081021             DCL        VAR(&IFSOBJ) TYPE(*CHAR) LEN(300) +
000500081021                          VALUE('/home/EDPFG/etich.pdf')
000600081021             DCL        VAR(&LCKSTS)  TYPE(*CHAR) LEN(4)
000700991201
000800081021             UBIFSLCK   IFSOBJ(&IFSOBJ) OUTPUT(*BATCH) LCKSTS(&LCKSTS)
000900081021
001000081021             ENDPGM
