000100110221     h decedit('0,') datedit(*dmy/) option(*nodebugio)
000200120521     h dftactgrp(*no) actgrp('QILE')
000300110221     h bnddir('UBBNDDIR')
000400170303
000500170303     d*wX              s              3s 0
000600120511
000700110221       //--------------------------------------------------------------
000800120511       // Definizione prototipi procedure.                             ?
000900110221       //--------------------------------------------------------------
001000170130
001100110221
001200110221       //--------------------------------------------------------------
001300120511       // Definizione key-list.                                        ?
001400110221       //--------------------------------------------------------------
001500110221
001600170306
001700170306       //--------------------------------------------------------------
001800170306       // Definizione prototipi procedure.                             ?
001900170306       //--------------------------------------------------------------
002000170306
002100170306      /copy gaitrasrc/srcProtoPR,UBLGOBR3
002200170306       // Parametri richiamo?
002300170306      /copy gaitrasrc/srcProtoPI,UBLGOBR3
002400110221
002500110221       //==============================================================
002600120511       // M A I N - L I N E                                            ?
002700170125       //==============================================================
002800110221
002900170306         LGOB3DS.iGestione  = *blank;
003000170306         LGOB3DS.iLib       = 'GAITRAOBJ';
003100170306         LGOB3DS.iFiltroObj = 'UB*';
003200170306         LGOB3DS.iObjT      = '*PGM';
003300170303       //wX = %elem(oObj);
003400170306         dou LGOB3DS.oObj(%elem(LGOB3DS.oObj)) = *blank;
003500170306           ublgobr3(LGOB3DS);
003600170306     c*                  call      'UBLGOBR3'
003700170306     c*                  parm                    iGestione
003800170306     c*                  parm                    iLib
003900170306     c*                  parm                    iFiltroObj
004000170306     c*                  parm                    iObjT
004100170306     c*                  parm                    oObj
004200170306     c*                  parm                    oError
004300170306     c*                  parm                    oErrorD
004400170306           if LGOB3DS.oObj(%elem(LGOB3DS.oObj)) <> *blank;
004500170306             LGOB3DS.iGestione = 'R';
004600170303           endif;
004700170303         enddo;
004800170303
004900110221         *inLR = *on;
