000100110221     h decedit('0,') datedit(*dmy/) option(*nodebugio)
000200120521     h dftactgrp(*no) actgrp('QILE')
000300110221     h bnddir('UBBNDDIR')
000400170125       // Parametri richiamo?
000500170125     d iLogica         s              2
000600170125     d iLib            s             10
000700170125     d iObj            s             10
000800170125     d iObjType        s             10
000900170125     d oError          s              2
001000170125     d oErrorD         s             70
001100120511
001200110221       //--------------------------------------------------------------
001300120511       // Definizione prototipi procedure.                             ?
001400110221       //--------------------------------------------------------------
001500170130
001600170130      /copy gaitrasrc/srcProtoPR,UBLGOBR
001700110221
001800110221       //--------------------------------------------------------------
001900120511       // Definizione key-list.                                        ?
002000110221       //--------------------------------------------------------------
002100110221
002200110221
002300110221       //==============================================================
002400120511       // M A I N - L I N E                                            ?
002500170125       //==============================================================
002600110221
002700170323         iLogica = '02';
002800170323         iLib = 'GAITRAFIL';
002900170323         iObj = '*ALL';
003000170323         iObjType = '*ALL';
003100170130         ublgobr_s(iLogica : iLib : iObj : iObjType : oError : oErrorD);
003200170130     c*                  parm                    iLogica
003300170130     c*                  parm                    iLib
003400170130     c*                  parm                    iObj
003500170130     c*                  parm                    iObjType
003600170130     c*                  parm                    oError
003700170130     c*                  parm                    oErrorD
003800110221
003900110221         *inLR = *on;
