000100170328     A*%%***********************************************************************
000200170328     A*%%TS  RD  20170328  144242  EDPLC       REL-V7R2M0  5770-WDS
000300170328     A*%%FI+10660100000000000000000000000000000000000000000000000000
000400170328     A*%%FI       0000000000000000000000000000000000000000000000000
000500170328     A*%%***********************************************************************
000600170328     A*---                                  PAGESIZE(66 132)
000700170328     A*---                                  OVRFLW(60)
000800170328     A*---                                  FOLD(*NO)
000900170328     A          R GOBBT01
001000170328     A*%%***********************************************************************
001100170328     A*%%RI 00000
001200170328     A*%%***********************************************************************
001300170328     A                                     1
001400170328     A                                      '* Utente:'
001500170328     A                                      SKIPB(001)
001600170328     A                                    11
001700170328     A                                      '*'
001800170328     A            KNMUS         10A  O    13
001900170328     A                                    24
002000170328     A                                      '*'
002100170328     A                                    28
002200170328     A                                      '***----- Stampa selezion'
002300170328     A                                    52
002400170328     A                                      'e Dati oggetto per Logic'
002500170328     A                                    76
002600170328     A                                      'a richiesta -----***'
002700170328     A                                    99
002800170328     A                                      'Data:'
002900170328     A                                   105
003000170328     A                                      DATE
003100170328     A                                      EDTCDE(Y)
003200170328     A                                   123
003300170328     A                                      'Pag.'
003400170328     A                                   128
003500170328     A                                      PAGNBR
003600170328     A                                      EDTCDE(Z)
003700170328     A                                    99
003800170328     A                                      'PGM :'
003900170328     A                                      SPACEB(001)
004000170328     A                                   105
004100170328     A                                      'UBLGOBBR'
004200170328     A          R GOBBT02
004300170328     A*%%***********************************************************************
004400170328     A*%%RI 00000
004500170328     A*%%***********************************************************************
004600170328     A                                      SPACEB(001)
004700170328     A                                     2
004800170328     A                                      'Primi 396 char -
004900170328     A                                      istruzione SQL usata'
005000170328     A                                      SPACEB(002)
005100170328     A            T02STMT1     132A  O     1
005200170328     A                                      SPACEB(001)
005300170328     A            T02STMT2     132A  O     1
005400170328     A                                      SPACEB(001)
005500170328     A            T02STMT3     132A  O     1
005600170328     A                                      SPACEB(001)
005700170328     A          R GOBBT03
005800170328     A                                     2'    Data estr.  Lg  Libreria    Og-
005900170328     A                                      getto     Tp Obj   Attributo   Uten-
006000170328     A                                      te Cr.                             -
006100170328     A                                                                '
006200170328     A                                      SPACEB(002)
006300170328     A*%%***********************************************************************
006400170328     A*%%SS
006500170328     A*%%***********************************************************************
006600170328     A          R GOBBP01
006700170328     A                                      SPACEB(001)
006800170328     A*
006900170328     A            P01DTESTR     10A  O     6
007000170328     A            P01LOGICA      2A  O    18
007100170328     A            P01LIB        10A  O    22
007200170328     A            P01OBJ        10A  O    34
007300170328     A            P01OBJT        7A  O    46
007400170328     A            P01ATTR       10A  O    55
007500170328     A            P01UTC        10   O    67
