000010170504     A*%%TS  SD  20170504  141631  EDPLC       REL-V7R2M0  5770-WDS
000020970526     A*-------------------------------------------------------------------------
000030170504     A*%%EC
000040170504     A                                      DSPSIZ(27 132 *DS4)
000050170504     A                                      CHGINPDFT(HI CS)
000060170504     A                                      PRINT
000070170504     A                                      CF01
000080170504     A                                      CF02
000090170504     A                                      CF03
000100170504     A                                      CF04
000110170504     A                                      CF05
000120170504     A                                      CF06
000130170504     A                                      CF07
000140170504     A                                      CF08
000150170504     A                                      CF09
000160170504     A                                      CF10
000170170504     A                                      CF11
000180170504     A                                      CF12
000190170504     A                                      CF13
000200170504     A                                      CF14
000210170504     A                                      CF15
000220170504     A                                      CF16
000230170504     A                                      CF17
000240170504     A                                      CF18
000250170504     A                                      CF19
000260170504     A                                      CF20
000270170504     A                                      CF21
000280170504     A                                      CF22
000290170504     A                                      CF23
000300170504     A                                      CF24
000310170504     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330170301     A          R BA01D01
000340170301     A*%%TS  SD  20170301  124048  EDPLC       REL-V7R2M0  5770-WDS
000350170301     A                                      TEXT('Testata')
000360170301     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370170301     A                                  1 50'*   Dati oggetto - Logica 01    *'
000380170301     A                                      DSPATR(RI)
000390170301     A                                      DSPATR(UL)
000400170301     A                                  1113'UBLGOBA01R'
000410170301     A                                  1124DATE
000420170301     A                                      EDTCDE(Y)
000430170301     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000440170301     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000450170301     A            VIDFUN        16A  O  2 59DSPATR(RI)
000460170301     A                                      DSPATR(HI)
000470170301     A                                  2124TIME
000480970526     A*-------------------------------------------------------------------------
000490170301     A          R BA01D02
000500160714     A*%%TS  SD  20160714  112435  EDPLC       REL-V7R1M0  5770-WDS
000510160714     A                                      OVERLAY
000520160714     A            FUN001        19A  O 25  2
000530160714     A            FUN002        19A  O 25 22
000540160714     A            FUN003        19A  O 25 42
000550160714     A            FUN004        19A  O 25 62
000560160714     A            FUN005        19A  O 25 82
000570160714     A            FUN006        19A  O 25102
000580160714     A            FUN007        19A  O 26  2
000590160714     A            FUN008        19A  O 26 22
000600970526     A*-------------------------------------------------------------------------
000610170504     A          R BA01D03
000620170504     A*%%TS  SD  20170504  141631  EDPLC       REL-V7R2M0  5770-WDS
000630170504     A                                      CHGINPDFT
000640170504     A                                      OVERLAY
000650170504     A                                  4  2'Data estrazione ...........:'
000660170504     A            D03DTESTR      8Y 0O  4 32DSPATR(HI)
000670170504     A                                      EDTCDE(8)
000680170504     A                                  4 44'(gg/mm/anno)'
000690170504     A                                  4 66'Libreria / oggetto ........:'
000700170504     A            D03LIB        10A  O  4 96DSPATR(HI)
000710170504     A                                  4107'/'
000720170504     A            D03OBJ        10A  O  4109DSPATR(HI)
000730170504     A                                  5  2'Logica ....................:'
000740170504     A            D03LOGICA      2A  O  5 32DSPATR(HI)
000750170504     A                                  5 66'Tipo oggetto ..............:'
000760170504     A            D03OBJT       10A  O  5 96DSPATR(HI)
000770170504     A                                  6 66'Attributo .................:'
000780170504     A            D03ATTR       10A  O  6 96DSPATR(HI)
000790170504     A                                  7 66'Descrizione oggetto .......:'
000800170504     A            D03OBJD       50   O  8 66DSPATR(HI)
000810170504     A                                  9  2'Dati                        '
000820170504     A                                 10  2'Creato da utente ..........:'
000830170504     A            D03CUP01      10A  O 10 32DSPATR(HI)
000840170504     A                                 11  2'Data di creazione .........:'
000850170504     A            D03CDT06       8Y 0O 11 32DSPATR(HI)
000860170504     A                                      EDTCDE(8)
000870170504     A                                 12  2'Data ultimo utilizzo ......:'
000880170504     A            D03LUDT        8Y 0O 12 32DSPATR(HI)
000890170504     A                                      EDTCDE(8)
000900170504     A                                 13  2'Numero giorni di utilizzo .:'
000910170504     A            D03DUC         4A  O 13 32DSPATR(HI)
000920170504     A                                 15  2'Dopo'
000930170504     A            D03NUM         3A  O 15  7
000940170504     A            D03COSA        6A  O 15 11
000950170504     A                                 15 18'dall''ultima data utilizzo, l''ogg-
000960170504     A                                      etto viene considerato anomalo da q-
000970170504     A                                      uesta logica'
000980970526     A*-------------------------------------------------------------------------
000990170301     A          R BA01DMS                   SFL
001000160831     A                                      SFLMSGRCD(27)
001010970526     A            MSGKEY                    SFLMSGKEY
001020160831     A            MSGQUE                    SFLPGMQ(10)
001030970526     A*-------------------------------------------------------------------------
001040170301     A          R BA01DMC                   SFLCTL(BA01DMS)
001050970526     A                                      OVERLAY
001060970526     A                                      SFLDSP
001070970526     A  40                                  SFLCLR
001080970526     A                                      SFLSIZ(0002)
001090970526     A                                      SFLPAG(0001)
