000100170710     A*%%TS  SD  20170710  211854  EDPFG       REL-V7R2M0  5770-WDS
000200970526     A*-------------------------------------------------------------------------
000300170710     A*%%EC
000400170710     A                                      DSPSIZ(27 132 *DS4)
000500170710     A                                      CHGINPDFT(HI CS)
000600170710     A                                      PRINT
000700170710     A                                      CF01
000800170710     A                                      CF02
000900170710     A                                      CF03
001000170710     A                                      CF04
001100170710     A                                      CF05
001200170710     A                                      CF06
001300170710     A                                      CF07
001400170710     A                                      CF08
001500170710     A                                      CF09
001600170710     A                                      CF10
001700170710     A                                      CF11
001800170710     A                                      CF12
001900170710     A                                      CF13
002000170710     A                                      CF14
002100170710     A                                      CF15
002200170710     A                                      CF16
002300170710     A                                      CF17
002400170710     A                                      CF18
002500170710     A                                      CF19
002600170710     A                                      CF20
002700170710     A                                      CF21
002800170710     A                                      CF22
002900170710     A                                      CF23
003000170710     A                                      CF24
003100170710     A                                      HELP
003200970526     A*-------------------------------------------------------------------------
003300170216     A          R RSMALD01
003400170216     A*%%TS  SD  20170216  110333  EDPLC       REL-V7R2M0  5770-WDS
003500170216     A                                      TEXT('Testata')
003600170216     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
003700170216     A                                  1 48'* TEST rep. ragione sociale mitt. -
003800170216     A                                       *'
003900170216     A                                      DSPATR(RI)
004000170216     A                                      DSPATR(UL)
004100170216     A                                  1113'UBRSMALR1'
004200170216     A                                  1124DATE
004300170216     A                                      EDTCDE(Y)
004400170216     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004500170216     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004600170216     A                                  2124TIME
004700970526     A*-------------------------------------------------------------------------
004800170216     A          R RSMALD02
004900150407     A*%%TS  SD  20150407  152656  EDPLC       REL-V7R1M0  5770-WDS
005000150407     A                                      OVERLAY
005100150407     A            FUN001        19A  O 25  2
005200150407     A            FUN002        19A  O 25 22
005300150407     A            FUN003        19A  O 25 42
005400150407     A            FUN004        19A  O 25 62
005500150407     A            FUN005        19A  O 25 82
005600150407     A            FUN006        19A  O 25102
005700150407     A            FUN007        19A  O 26  2
005800150407     A            FUN008        19A  O 26 22
005900970526     A*-------------------------------------------------------------------------
006000170710     A          R RSMALD03
006100170710     A*%%TS  SD  20170710  211854  EDPFG       REL-V7R2M0  5770-WDS
006200170710     A                                      OVERLAY
006300170710     A                                  3  2'INPUT                             -
006400170710     A                                                                         -
006500170710     A                                                                         -
006600170710     A                                                                '
006700170710     A                                      DSPATR(UL)
006800170710     A                                  4  2'Tipo richiesta:'
006900170710     A            D03TPRIC       1A  B  4 18VALUES('E' 'S' 'T' 'L')
007000170710     A                                  4 20'(E=Email / S=SMS / T=T&T / L=LDV)'
007100170710     A                                  4 56'Origine dati:'
007200170710     A            D03ORIGINE     1A  B  4 70VALUES('P' 'A' 'S')
007300170710     A                                  4 72'(P=Partenza / A=Arrivo / S=Sede)'
007400170710     A                                  5  2'Dati spedizione'
007500170710     A                                  5 20'Anno ...:'
007600170710     A            D03AAS         4Y 0B  5 31EDTCDE(Z)
007700170710     A                                  5 38'Linea di partenza ...:'
007800170710     A            D03LNP         3Y 0B  5 62EDTCDE(Z)
007900170710     A                                  5 68'Serie ...:'
008000170710     A            D03NRS         2Y 0B  5 80EDTCDE(Z)
008100170710     A                                  5 85'Spedizione ...:'
008200170710     A            D03NSP         7Y 0B  5102EDTCDE(Z)
008300170710     A                                  8  2'OUTPUT                            -
008400170710     A                                                                         -
008500170710     A                                                                         -
008600170710     A                                                                '
008700170710     A                                      DSPATR(UL)
008800170710     A                                  9  2'Esito:'
008900170710     A            D03ESITO       1Y 0O  9 10EDTCDE(N)
009000170710     A                                  9 14'(-1=errore generico -2=spedizione -
009100170710     A                                      non trovata -3=parametri input erra-
009200170710     A                                      ti o incompleti 0=OK)'
009300170710     A                                 10  2'Dati mittente'
009400170710     A                                 11  2'Ragione sociale'
009500170710     A            D03RAGSOC     60A  O 11 19
009600170710     A                                 12  2'Indirizzo'
009700170710     A            D03INM        35A  O 12 19
009800170710     A                                 12 57'CAP'
009900170710     A            D03CAM         9A  O 12 62
010000170710     A                                 12 74'Località'
010100170710     A            D03LOM        35A  O 12 84
010200170710     A                                 13  2'Provincia'
010300170710     A            D03PRM         2A  O 13 19
010400170710     A                                 13 24'Nazione'
010500170710     A            D03NZM         3A  O 13 33
010600170710     A            VIDMSG        76A  O 24  3DSPATR(HI)
010700970526     A*-------------------------------------------------------------------------
010800170216     A          R RSMALDMS                  SFL
010900150407     A                                      SFLMSGRCD(27)
011000970526     A            MSGKEY                    SFLMSGKEY
011100970526     A            MSGQUE                    SFLPGMQ
011200970526     A*-------------------------------------------------------------------------
011300170216     A          R RSMALDMC                  SFLCTL(RSMALDMS)
011400970526     A                                      OVERLAY
011500970526     A                                      SFLDSP
011600970526     A  40                                  SFLCLR
011700970526     A                                      SFLSIZ(0002)
011800970526     A                                      SFLPAG(0001)
