000010130920     A*%%TS  SD  20130920  143739  EDPLC       REL-V7R1M0  5770-WDS
000020970526     A*-------------------------------------------------------------------------
000030130920     A*%%EC
000040130920     A                                      DSPSIZ(24 80 *DS3)
000050130920     A                                      CHGINPDFT(HI CS)
000060130920     A                                      PRINT
000070130920     A                                      CF01
000080130920     A                                      CF02
000090130920     A                                      CF03
000100130920     A                                      CF04
000110130920     A                                      CF05
000120130920     A                                      CF06
000130130920     A                                      CF07
000140130920     A                                      CF08
000150130920     A                                      CF09
000160130920     A                                      CF10
000170130920     A                                      CF11
000180130920     A                                      CF12
000190130920     A                                      CF13
000200130920     A                                      CF14
000210130920     A                                      CF15
000220130920     A                                      CF16
000230130920     A                                      CF17
000240130920     A                                      CF18
000250130920     A                                      CF19
000260130920     A                                      CF20
000270130920     A                                      CF21
000280130920     A                                      CF22
000290130920     A                                      CF23
000300130920     A                                      CF24
000310130920     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330130920     A          R RTVSGND01
000340130920     A*%%TS  SD  20130920  113246  EDPLC       REL-V7R1M0  5770-WDS
000350130920     A                                      TEXT('Testata')
000360130920     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370130920     A                                  1 24'* Reperimento dettagli segnacollo -
000380130920     A                                      *'
000390130920     A                                      DSPATR(RI)
000400130920     A                                      DSPATR(UL)
000410130920     A                                  1 60'UBRTVSGNR1'
000420130920     A                                  1 71DATE
000430130920     A                                      EDTCDE(Y)
000440130920     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000450130920     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000460130920     A                                  2 32'      LANCIO        '
000470130920     A                                      DSPATR(HI)
000480130920     A                                      DSPATR(RI)
000490130920     A                                  2 71TIME
000500970526     A*-------------------------------------------------------------------------
000510130920     A          R RTVSGND02
000520970526     A                                      OVERLAY
000530970526     A            FUN001        19A  O 22  2
000540970526     A            FUN002        19A  O 22 22
000550970526     A            FUN003        19A  O 22 42
000560970526     A            FUN004        19A  O 22 62
000570970526     A            FUN005        19A  O 23  2
000580970526     A            FUN006        19A  O 23 22
000590970526     A            FUN007        19A  O 23 42
000600970526     A            FUN008        19A  O 23 62
000610970526     A*-------------------------------------------------------------------------
000620130920     A          R RTVSGND03
000630130920     A*%%TS  SD  20130920  143739  EDPLC       REL-V7R1M0  5770-WDS
000640130920     A                                      OVERLAY
000650130920     A                                  4  2'INPUT                             -
000660130920     A                                                                         -
000670130920     A                                               '
000680130920     A                                      DSPATR(UL)
000690130920     A                                  5  2'Anno ..................:'
000700130920     A            VIDAAS         4Y 0B  5 28CHECK(RB)
000710130920     A                                      EDTCDE(4)
000720130920     A                                  6  2'Linea di partenza .....:'
000730130920     A            VIDLNP         3Y 0B  6 28CHECK(RZ)
000740130920     A                                      EDTCDE(4)
000750130920     A                                  7  2'Numero serie ..........:'
000760130920     A            VIDNRS         2Y 0B  7 28CHECK(RZ)
000770130920     A                                      EDTCDE(4)
000780130920     A                                  8  2'Numero spedizione .....:'
000790130920     A            VIDNSP         7Y 0B  8 28CHECK(RB)
000800130920     A                                      EDTCDE(2)
000810130920     A                                  9  2'Numero colli ..........:'
000820130920     A            VIDNCL         5Y 0B  9 28CHECK(RB)
000830130920     A                                      EDTCDE(2)
000840130920     A                                 11  2'OUTPUT                            -
000850130920     A                                                                         -
000860130920     A                                               '
000870130920     A                                      DSPATR(UL)
000880130920     A                                 12  2'Esito .................:'
000890130920     A            VIDESITO       1A  O 12 28
000900130920     A                                 13  2'Numero segnacolli rep. :'
000910130920     A            VIDNRSGN       3Y 0O 13 28EDTCDE(1)
000920130920     A                                 14  2'Primi 24 segnacolli rep.'
000930130920     A            VIDSGN01      18A  O 15  2
000940130920     A            VIDSGN02      18A  O 15 22
000950130920     A            VIDSGN03      18A  O 15 42
000960130920     A            VIDSGN04      18A  O 15 62
000970130920     A            VIDSGN05      18A  O 16  2
000980130920     A            VIDSGN06      18A  O 16 22
000990130920     A            VIDSGN07      18A  O 16 42
001000130920     A            VIDSGN08      18A  O 16 62
001010130920     A            VIDSGN09      18A  O 17  2
001020130920     A            VIDSGN10      18A  O 17 22
001030130920     A            VIDSGN11      18A  O 17 42
001040130920     A            VIDSGN12      18A  O 17 62
001050130920     A            VIDSGN13      18A  O 18  2
001060130920     A            VIDSGN14      18A  O 18 22
001070130920     A            VIDSGN15      18A  O 18 42
001080130920     A            VIDSGN16      18A  O 18 62
001090130920     A            VIDSGN17      18A  O 19  2
001100130920     A            VIDSGN18      18A  O 19 22
001110130920     A            VIDSGN19      18A  O 19 42
001120130920     A            VIDSGN20      18A  O 19 62
001130130920     A            VIDSGN21      18A  O 20  2
001140130920     A            VIDSGN22      18A  O 20 22
001150130920     A            VIDSGN23      18A  O 20 42
001160130920     A            VIDSGN24      18A  O 20 62
001170970526     A*-------------------------------------------------------------------------
001180130920     A          R RTVSGNDMS                 SFL
001190970526     A                                      SFLMSGRCD(24)
001200970526     A            MSGKEY                    SFLMSGKEY
001210970526     A            MSGQUE                    SFLPGMQ
001220970526     A*-------------------------------------------------------------------------
001230130920     A          R RTVSGNDMC                 SFLCTL(RTVSGNDMS)
001240970526     A                                      OVERLAY
001250970526     A                                      SFLDSP
001260970526     A  40                                  SFLCLR
001270970526     A                                      SFLSIZ(0002)
001280970526     A                                      SFLPAG(0001)
