000100140416     A*%%TS  SD  20140214  112301  EDPFG       REL-V7R1M0  5770-WDS
000200970526     A*-------------------------------------------------------------------------
000300140214     A*%%EC
000400140214     A                                      DSPSIZ(24 80 *DS3)
000500140214     A                                      CHGINPDFT(HI CS)
000600140214     A                                      PRINT
000700140214     A                                      CF01
000800140214     A                                      CF02
000900140214     A                                      CF03
001000140214     A                                      CF04
001100140214     A                                      CF05
001200140214     A                                      CF06
001300140214     A                                      CF07
001400140214     A                                      CF08
001500140214     A                                      CF09
001600140214     A                                      CF10
001700140214     A                                      CF11
001800140214     A                                      CF12
001900140214     A                                      CF13
002000140214     A                                      CF14
002100140214     A                                      CF15
002200140214     A                                      CF16
002300140214     A                                      CF17
002400140214     A                                      CF18
002500140214     A                                      CF19
002600140214     A                                      CF20
002700140214     A                                      CF21
002800140214     A                                      CF22
002900140214     A                                      CF23
003000140214     A                                      CF24
003100140214     A                                      HELP
003200970526     A*-------------------------------------------------------------------------
003300140416     A          R TSTSAOD01
003400140416     A*%%TS  SD  20140214  100327  EDPFG       REL-V7R1M0  5770-WDS
003500140214     A                                      TEXT('Testata')
003600140214     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
003700140416     A                                  1 24'*   Scrittura FISAO00F per test   -
003800140214     A                                      *'
003900140214     A                                      DSPATR(RI)
004000140214     A                                      DSPATR(UL)
004100140416     A                                  1 60'UBTSTSAOR'
004200140214     A                                  1 71DATE
004300140214     A                                      EDTCDE(Y)
004400140214     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004500140214     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004600140214     A                                  2 71TIME
004700970526     A*-------------------------------------------------------------------------
004800140416     A          R TSTSAOD02
004900970526     A                                      OVERLAY
005000970526     A            FUN001        19A  O 22  2
005100970526     A            FUN002        19A  O 22 22
005200970526     A            FUN003        19A  O 22 42
005300970526     A            FUN004        19A  O 22 62
005400970526     A            FUN005        19A  O 23  2
005500970526     A            FUN006        19A  O 23 22
005600970526     A            FUN007        19A  O 23 42
005700970526     A            FUN008        19A  O 23 62
005800970526     A*-------------------------------------------------------------------------
005900140416     A          R TSTSAOD03
006000140416     A*%%TS  SD  20140214  112301  EDPFG       REL-V7R1M0  5770-WDS
006100140214     A                                      OVERLAY
006200140416     A                                  5  2'P.O. Emittente ........:'
006300140416     A            VIDPOE         3Y 0B  5 28CHECK(RB)
006400140214     A                                      EDTCDE(4)
006500140214     A  50                                  DSPATR(PC)
006600140214     A  50                                  DSPATR(RI)
006700140416     A                                  6  2'Numero serie ORM ......:'
006800140416     A            VIDNSR         2Y 0B  6 28CHECK(RZ)
006900140214     A                                      EDTCDE(4)
007000140416     A                                  7  2'Numero ritiro .........:'
007100140416     A            VIDNOR         7Y 0B  7 28CHECK(RZ)
007200140214     A                                      EDTCDE(4)
007300140416     A  50                                  DSPATR(PC)
007400140416     A  50                                  DSPATR(RI)
007500140416     A                                  8  2'Numero viaggio ........:'
007600140416     A            VIDNRV         2Y 0B  8 28CHECK(RB)
007700140214     A                                      EDTCDE(2)
007800140214     A                                  9  2'Tipo Alert ............:'
007900140214     A            VIDTIPA        3   B  9 28
008000140214     A  50                                  DSPATR(PC)
008100140214     A  50                                  DSPATR(RI)
008200140418     A                                  9 51'(AVV)'
008300140214     A                                 10  2'Indirizzo e-mail ......:'
008400140214     A            VIDEMAIL      70A  B 11  3
008500140214     A  50                                  DSPATR(PC)
008600140214     A  50                                  DSPATR(RI)
008700140214     A                                      CHECK(LC)
008800140214     A                                 12  2'Nr. cellulare .........:'
008900140214     A            VIDCEL        16A  B 12 28
009000140214     A  50                                  DSPATR(PC)
009100140214     A  50                                  DSPATR(RI)
009200140416     A                                 13  2'SAONOTE ...............:'
009300140214     A            VIDNOTE      256A  B 13 28
009400970526     A*-------------------------------------------------------------------------
009500140416     A          R TSTSAODMS                 SFL
009600970526     A                                      SFLMSGRCD(24)
009700970526     A            MSGKEY                    SFLMSGKEY
009800970526     A            MSGQUE                    SFLPGMQ
009900970526     A*-------------------------------------------------------------------------
010000140416     A          R TSTSAODMC                 SFLCTL(TSTSAODMS)
010100970526     A                                      OVERLAY
010200970526     A                                      SFLDSP
010300970526     A  40                                  SFLCLR
010400970526     A                                      SFLSIZ(0002)
010500970526     A                                      SFLPAG(0001)
