000100171012     H DFTACTGRP(*NO) ACTGRP(*CALLER)
000200171012
000300110719      //********************************************************************************************
000400110719      //
000500110719      // Definizione file.
000600110719      //
000700110719      //********************************************************************************************
000800171016     Fwas7ifs1i o    E             DISK
000900170413
001000170413
001100170413      //********************************************************************************************
001200170413      //
001300170413      // Definizione interfacce procedure.
001400170413      //
001500170413      //********************************************************************************************
001600170413     D/COPY GAITRASRC/SRCPROTOPI,UBWAS70R
001700170413
001800110719
001900071128      //********************************************************************************************
002000071128      //
002100071128      // Definizione variabili globali.
002200071128      //
002300071128      //********************************************************************************************
002400170413
002500170413
002600071127
002700071128      //********************************************************************************************
002800071128      //
002900071128      // Dichiarazione parametri.
003000071128      //
003100071128      //********************************************************************************************
003200110721     C     *ENTRY        PLIST
003300170413     C                   PARM                    IWAS7IFSDS
003400170413     C                   PARM                    OWAS7ESI
003500110719     C*
003600170413     C* Inizializzo esito a errore
003700170413     C                   eval      OWAS7ESI = 1
003800170413     C*
003900170413     C* Scrivo in output il buffer ricevuto "as is"
004000171016     C                   write(e)  was7ifs0
004100110719     C*
004200110719     C* Se qui tutto ok => allora transazione completata fully-correct
004300110719     C                   if        not %error
004400170413     C                   eval      OWAS7ESI = 0
004500110719     C                   endif
004600170413     C*
004700171016     C                   seton                                        lr
004800110719     C*
