000100030717     A          R TIO1G1OS                  TEXT('Rintraccia ORM x Riferimento-
000200030717     A                                      DS Output ')
000300030717     A            O1GORM        14S 0       TEXT('Numero ORM                  ')
