000100030620     D TIO1G3IDS     E DS
000200030620     D                                     PREFIX(Inp)
000300030620     D                                     INZ
000400030620     D TIO1G3ODS     E DS
000500030620     D                                     PREFIX(Out)
000600030620     D                                     INZ
000700030620     D Esito           S              1
000800041223     D PrmORM          S
000900041223     D                                     LIKE(InpORM)
001000030620
001100041223     ***********************************************************************************************
001200030620     **
001300030620     ** Main
001400030620     **
001500041223     ***********************************************************************************************
001600030620     C     *ENTRY        PLIST
001700041223     C     InpORM        PARM                    PrmORM
001800030620
001900041223     C                   CLEAR                   TIO1G3ODS
002000041223
002100030620     C                   CALL      'TIO7G31R'
002200041223     C                   PARM      *BLANK        Esito
002300030620     C                   PARM                    TIO1G3IDS
002400030620     C                   PARM                    TIO1G3ODS
002500030620
002600030620     C                   EVAL      *INLR = *ON
