000001080620     A*%%***********************************************************************
000002080620     A*%%TS  RD  20080620  112604  EDPMB       REL-V5R4M0  5722-WDS
000003080620     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004080620     A*%%FI       0000000000000000000000000000000000000000000000000
000005080620     A*%%***********************************************************************
000006080620      *PARMS DEVTYPE(*SCS) PAGESIZE(66 132 *ROWCOL) LPI(6) CPI(10)
000007080620      *PARMS OVRFLW(60) PRTQLTY(*DRAFT) FORMTYPE(*STD) SAVE(*NO)
000008080620      *PARMS USRDTA('VdLLetTest')
000009080620      *---------------------------------------------------------------*
000010080620      * Compilare --> Dimensione pagina : 198                         *
000011080620      *               CPI               : 15                          *
000012080620      *               PRTQLTY           : *DRAFT                      *
000013080620      *               SAVE              : *YES                        *
000014080620      *               USRDTA            : VdLLetTest                  *
000015080620      *---------------------------------------------------------------*
000016080620     A          R MS12PT
000017080620     A*%%***********************************************************************
000018080620     A*%%RI 00000
000019080620     A*%%FS 001
000020080620     A*%%***********************************************************************
000021080620     A                                      SKIPB(002)
000022080620     A                                      SPACEA(001)
000023080620     A            RSUT          20   O     1
000024080620     A                                   +10
000025080620     A                                      'FIMS12R'
000026080620     A                                   +10
000027080620     A                                      '* LETTURE TEST CML/VDL *'
000028080620     A                                   +10
000029080620     A                                      'DATA'
000030080620     A                                    +1
000031080620     A                                      DATE
000032080620     A                                      EDTCDE(Y)
000033080620     A                                    +5
000034080620     A                                      'ORA'
000035080620     A                                    +1
000036080620     A                                      TIME
000037080620     A                                      EDTWRD('  :  :  ')
000038080620     A                                    +5
000039080620     A                                      'PAG.'
000040080620     A                                    +0
000041080620     A                                      PAGNBR
000042080620     A                                      EDTCDE(Z)
000043080620     A*%%***********************************************************************
000044080620     A*%%SS
000045080620     A*%%CL 001
000046080620     A*%%***********************************************************************
000047080620      *---------------------------------------------------------------*
000048080620     A          R MS12PA
000049080620     A*%%***********************************************************************
000050080620     A*%%RI 00000
000051080620     A*%%FS 001
000052080620     A*%%***********************************************************************
000053080620     A                                      SPACEB(002)
000054080620     A                                    47
000055080620     A                                      '**  PARAMETRI DI  LANCIO  **'
000056080620     A                                      SPACEB(001)
000057080620     A                                    31
000058080620     A                                      'UTENTE ....................:'
000059080620     A                                      SPACEB(002)
000060080620     A            KNMUS         10A  O    +2
000061080620     A                                    31
000062080620     A                                      'FILIALE ...................:'
000063080620     A                                      SPACEB(001)
000064080620     A            PACFIL         3S 0O    +2
000065080620     A                                      EDTCDE(Z)
000066080620     A            PADFIL        20A  O    75
000067080620     A                                    31
000068080620     A                                      'DATA / ORA INIZIALE .......:'
000069080620     A                                      SPACEB(001)
000070080620     A            PACDLI         8S 0O    +2
000071080620     A                                      EDTCDE(8)
000072080620     A            PACOLI         6S 0O    75
000073080620     A                                      EDTWRD('0 :  :  ')
000074080620     A                                    31
000075080620     A                                      'DATA / ORA FINALE .........:'
000076080620     A                                      SPACEB(001)
000077080620     A            PACDLF         8S 0O    +2
000078080620     A                                      EDTCDE(8)
000079080620     A            PACOLF         6S 0O    75
000080080620     A                                      EDTWRD('0 :  :  ')
000081080620     A*%%***********************************************************************
000082080620     A*%%SS
000083080620     A*%%CL 001
000084080620     A*%%CL 002
000085080620     A*%%CL 001
000086080620     A*%%CL 001
000087080620     A*%%CL 001
000088080620     A*%%***********************************************************************
000089080620      *---------------------------------------------------------------*
000090080620     A          R MS12PI
000091080620     A*%%***********************************************************************
000092080620     A*%%RI 00000
000093080620     A*%%***********************************************************************
000094080620     A                                      SPACEB(001)
000095080620     A                                     1
000096080620     A                                      '+----------------------------------
000097080620     A                                      ------------------------------------
000098080620     A                                      ------------------------------------
000099080620     A                                      ---------------------------+'
000100080620     A                                     1
000101080620     A                                      '|'
000102080620     A                                      SPACEB(001)
000103080620     A                                   +66
000104080620     A                                      '___MISURATI___'
000105080620     A                                    87
000106080620     A                                      '__REALI__'
000107080620     A                                   132
000108080620     A                                      '|'
000109080620     A                                     1
000110080620     A                                      '|'
000111080620     A                                      SPACEB(001)
000112080620     A                                    +4
000113080620     A                                      'DATA'
000114080620     A                                    +5
000115080620     A                                      'ORA'
000116080620     A                                    +6
000117080620     A                                      'PACCO'
000118080620     A                                   +28
000119080620     A                                      'BANCO'
000120080620     A                                    +7
000121080620     A                                      'VOLUME'
000122080620     A                                    +3
000123080620     A                                      '% SC'
000124080620     A                                    +8
000125080620     A                                      'VOLUME'
000126080620     A                                   132
000127080620     A                                      '|'
000128080620     A                                     1
000129080620     A                                      '|----------------------------------
000130080620     A                                      ------------------------------------
000131080620     A                                      ------------------------------------
000132080620     A                                      ---------------------------|'
000133080620     A                                      SPACEB(001)
000134080620     A*%%***********************************************************************
000135080620     A*%%SS
000136080620     A*%%CL 001
000137080620     A*%%CL 001
000138080620     A*%%CL 001
000139080620     A*%%***********************************************************************
000140080620      *---------------------------------------------------------------*
000141080620     A          R MS12DE
000142080620     A*%%***********************************************************************
000143080620     A*%%RI 00000
000144080620     A*%%***********************************************************************
000145080620     A                                      SPACEB(001)
000146080620     A                                     1
000147080620     A                                      '|'
000148080620     A            DECDTL         8S 0O    +1
000149080620     A                                      EDTCDE(8)
000150080620     A            DECORL         6S 0O    +1
000151080620     A                                      EDTWRD('0 :  :  ')
000152080620     A            DECDES        30A  O    +2
000153080620     A            DECPEP         5A  O    +3
000154080620     A            DECVOL         7S 6O    +6
000155080620     A                                      EDTCDE(4)
000156080620     A            DECSVO         3S 0O    +2
000157080620     A                                      EDTCDE(Q)
000158080620     A            DECCVO         7S 6O    +6
000159080620     A                                      EDTCDE(4)
000160080620     A                                   132
000161080620     A                                      '|'
000162080620     A*%%***********************************************************************
000163080620     A*%%SS
000164080620     A*%%***********************************************************************
000165080620      *---------------------------------------------------------------*
000166080620     A          R MS12RI
000167080620     A*%%***********************************************************************
000168080620     A*%%RI 00000
000169080620     A*%%***********************************************************************
000170080620     A                                      SPACEB(001)
000171080620     A                                     1
000172080620     A                                      '+----------------------------------
000173080620     A                                      ------------------------------------
000174080620     A                                      ------------------------------------
000175080620     A                                      ---------------------------+'
000176080620     A*%%***********************************************************************
000177080620     A*%%SS
000178080620     A*%%***********************************************************************
000179080620      *---------------------------------------------------------------*
000180080620     A          R MS12FI
000181080620     A*%%***********************************************************************
000182080620     A*%%RI 00000
000183080620     A*%%FS 002
000184080620     A*%%***********************************************************************
000185080620     A                                      SPACEB(003)
000186080620     A                                    47
000187080620     A                                      '***  F I N E  PROSPETTO  ***'
000188080620     A*%%***********************************************************************
000189080620     A*%%SS
000190080620     A*%%CP+999CRTPRTF
000191080620     A*%%CP+    FILE(GAITRASRC/FIMS12P)
000192080620     A*%%CP+    DEVTYPE(*SCS)
000193080620     A*%%CP+    PAGESIZE(*N 132)
000194080620     A*%%CP+    PRTQLTY(*DRAFT)
000195080620     A*%%CP     USRDTA('VdLLetTest')
000196080620     A*%%***********************************************************************
