000100110712     H*PARMS MBR(*NONE)
000200130827     A                                      REF(*LIBL/SDGSCF00F)
000300130827     A          R SDG005TAS
000702130827     A            QUADRO05TAR               REFFLD(SCFQUADRO)
000703130827     A*
000704130827     A            NRCPFA05TAR               REFFLD(NR ANDIZ00F)
000705130827     A                                      TEXT('Numero contropart-
000706130827     A                                      i             FA')
000707130827     A*
000708130827     A            NRCLSA05TAR               REFFLD(NR ANDIZ00F)
000709130827     A                                      TEXT('Numero clienti   -
000710130827     A                                                    SA')
000711130827     A*
000712130827     A            NRBLBL05TAR               REFFLD(NR ANDIZ00F)
000713130827     A                                      TEXT('Numero contropart-
000714130827     A                                      i Black List  BL')
000715130827     A*
000716130827     A            NRNRBL05TAR               REFFLD(NR ANDIZ00F)
000717130827     A                                      TEXT('Numero contropart-
000718130827     A                                      i Non resid.  BL')
000719130827     A*
000720130827     A            NRSRBL05TAR               REFFLD(NR ANDIZ00F)
000721130827     A                                      TEXT('Numero contropart-
000722130827     A                                      i Acq.servizi BL')
000723130827     A*
000724130827     A            NRFEFE05TAR               REFFLD(NR ANDIZ00F)
000725130827     A                                      TEXT('Numero fatture em-
000726130827     A                                      esse          FE')
000727130827     A*
000728130827     A            NRRIFE05TAR               REFFLD(NR ANDIZ00F)
000729130827     A                                      TEXT('Numero documenti -
000730130827     A                                      riepilogativi FE')
000731130827     A*
000732130827     A            NRFRFR05TAR               REFFLD(NR ANDIZ00F)
000733130827     A                                      TEXT('Numero fatture ri-
000734130827     A                                      cevute        FR')
000735130827     A*
000736130827     A            NRRIFR05TAR               REFFLD(NR ANDIZ00F)
000737130827     A                                      TEXT('Numero documenti -
000738130827     A                                      riepilogativi FR')
000739130827     A*
000740130827     A            NRNONE05TAR               REFFLD(NR ANDIZ00F)
000741130827     A                                      TEXT('Numero note emess-
000742130827     A                                      e             NE')
000743130827     A*
000744130827     A            NRNONR05TAR               REFFLD(NR ANDIZ00F)
000745130827     A                                      TEXT('Numero note ricev-
000746130827     A                                      ute           NR')
000747130827     A*
000748131015R135 X****        NRCLDF05TAR               REFFLD(NR ANDIZ00F)
000749131015 "   X****                                  TEXT('Numero clienti   -
000750131015R135 X****                                                DF')
000751131015R135 A            NRRIDF05TAR               REFFLD(NR ANDIZ00F)
000752131015 "   A                                      TEXT('Numero righi     -
000753131015R135 A                                                    DF')
000754130827     A*
000755130903     A            NRRIFN05TAR               REFFLD(NR ANDIZ00F)
000756130903     A                                      TEXT('Numero righi     -
000757130903     A                                                    FN')
000758130827     A*
000759130903     A            NRRISE05TAR               REFFLD(NR ANDIZ00F)
000760130903     A                                      TEXT('Numero righi     -
000761130903     A                                                    SE')
000762130827     A*
000763130903     A            NRCLTU05TAR               REFFLD(NR ANDIZ00F)
000764130903     A                                      TEXT('Numero clienti   -
000765130903     A                                                    TU')
000800130827     A*
