000100170529     A*
000200170529R258 A* Questa VL è stata creata con il task R258 Comunicaz. Spesometro Trimestrale
000300170717     A          R SDGCSF000                 PFILE(SDGCSF00F)
000400100706     A*
000500170801     A          K CSFSOCIETA
000600170801     A          K CSFFILE
000700100706     A*
