000100110707     A                                      FIFO
000200170724     A          R SDGCSF000                 PFILE(SDGCSF00F)
000300100706     A*
000400170724     A          K CSFSOCIETA
000500170724     A          K CSFTPCOM
000600170724     A          K CSFTPREC
000700170724     A          K CSFANNO
000800170724     A          K CSFTRIM
000900170724     A          K CSFMESE
001000170724     A          K CSFPRGESTR
001100170720     A*
