000100150127     H*PARMS MAXMBRS(*NOMAX)
000200150127     A                                      REF(ANDIZ00F)
000300150127     A*
000400150127     A          R SDGCUW000                 TEXT('Formato record')
000500150127     A*
000600150127     A            CUWREC      1900A         TEXT('Record')
000700150127     A                                      COLHDG('Record')
000800150127     A*
