000100150120     A                                      UNIQUE
000200150120     A          R SDGDIF000                 PFILE(SDGDIF00F)
000300150120     A*
000400150120     A          K DIFSOCIETA
000500150120     A          K DIFCF
000600150120     A          K DIFDTINTER
000700150120     A          K DIFNRINTER
000800150120     A*
