000100141222     H*PARMS MAXMBRS(*NOMAX)
000200141222     A                                      REF(ANDIZ00F)
000300141222     A*
000400141222     A          R SDGDIW000                 TEXT('Formato record')
000500141222     A*
000600141222     A            DIWREC      1900A         TEXT('Record')
000700141222     A                                      COLHDG('Record')
000800141222     A*
