000100000000     A*---------------------------------------------------------------**
000200160615     A*  FILE MOVIMENTI PER MODELLO 770 QUADRO SY                      *
000300000000     A*---------------------------------------------------------------**
000400950921     A                                      REF(ANDIZ00F)
000500160615     A          R SDGN77000                 TEXT('FORMATO RECORD')
000600950921     A            N77SOCIETAR               REFFLD(SOCIETA   )
000700890113     A            N77ACF         5P 0       TEXT('ANNO COMPETENZA FISCALE')
000800000000     A            N77QUA         2          TEXT('QUADRO')
000900950921     A            N77KCC    R               TEXT('CAPO C. PERCIPIENTE')
001000950921     A                                      REFFLD(KCC)
001100950921     A            N77KSC    R               TEXT('SOTTOCONTO PERCIPIENTE')
001200950921     A                                      REFFLD(KSC)
001300950921     A            N77RGT    R               REFFLD(TRIRAGG)
001400950921     A            N77CDF    R               REFFLD(CDFISC)
001500000000     A            N77COG        48          TEXT('COGNOME')
001600000000     A            N77NOM        48          TEXT('NOME')
001700160616     A**          N77LNC    R               REFFLD(LOCALIT)
001800160616     A**                                    TEXT('COMUNE DI NASCITA')
001900950921     A            N77DNC    R               REFFLD(DATA      )
002000950921     A                                      TEXT('DATA DI NASCITA')
002100160616     A**          N77PNC    R               REFFLD(PROV)
002200160616     A**                                    TEXT('PROV.DI NASCITA')
002300000000     A            N77SES         1          TEXT('SESSO')
002400950921     A            N77CIT    R               REFFLD(LOCALIT)
002500950921     A                                      TEXT('COMUNE DI RESIDENZA')
002600950921     A            N77VIA    R               REFFLD(INDIRIZ)
002700950921     A                                      TEXT('VIA RESIDENZA')
002800160616     A**          N77NUM         3          TEXT('FLAG  * = ESTERO')
002900160616     A**          N77PRV    R               REFFLD(PROV)
003000160616     A**                                    TEXT('PROVINCIA RESIDENZA')
003100950921     A            N77C77    R               REFFLD(DESBREV)
003200950921     A                                      TEXT('DESCRIZIONE CAUSALE PER 770')
003300950921     A            N77ITC    R               REFFLD(IMPORTO)
003400950921     A                                      TEXT('IMP.TOTALE CORRISPOSTO')
003500950921     A            N77IMN    R               REFFLD(IMPORTO)
003600160616     A                                      TEXT('ALTRE SOMME NON SOGGETTE ')
003700950921     A            N77SNS    R               REFFLD(IMPORTO)
003800160616     A                                      TEXT('SOMME NON SOGGETTE       ')
003900950921     A            N77IMS    R               REFFLD(IMPORTO)
004000160616     A                                      TEXT('IMPONIBILE SOGGETTO')
004100950921     A            N77PRA    R               REFFLD(ALIQ)
004200950921     A                                      TEXT('ALIQUOTA RITENUTA')
004300950921     A            N77RAC    R               REFFLD(IMPORTO)
004400950921     A                                      TEXT('IMPORTO  RITENUTA')
004500950921     A            N77NET    R               REFFLD(IMPORTO)
004600950921     A                                      TEXT('NETTO CORRISPOSTO')
004700890320     A            N77PFG         1          TEXT('F=P.FISICA   G=P.GIURIDICA')
004800160616     A**          N77SER        35          TEXT('STATO ESTERO DI RESIDENZA ')
004900920508     A            N77CSE         9          TEXT('CODICE STATO ESTERO       ')
005000920508     A            N77CDE        25          TEXT('CODICE IDENTIFICAZIONE       -
005100920508     A                                      FISCALE ESTERO')
005200951130     A            N77PRG    R               REFFLD(TRIPROG)
005300010403     A*---
005400160616     A**          N77REG         2P 0       TEXT('REGIONE')
005500160616     A**          N77TIT         1          TEXT('TITOLO')
005600160616     A**          N77ANNO        4P 0       TEXT('ANNO')
005700160616     A**          N77ARG    R               REFFLD(IMPORTO)
005800160616     A**                                    TEXT('ADD.REGIONALE')
005900160616     A**          N77ARS    R               REFFLD(IMPORTO)
006000160616     A**                                    TEXT('ADD.REGIONALE SOSP.')
006100160616     A**          N77IMSAP  R               REFFLD(IMPORTO)
006200160616     A**                                    TEXT('IMPONIBILE ANNI PREC.')
006300160616     A**          N77RACAP  R               REFFLD(IMPORTO)
006400160616     A**                                    TEXT('RITENUTA ANNI PREC.')
006500160616     A**          N77PIN        16          TEXT('POSIZIONE INAIL')
006600160616     A**          N77DTIN        4P 0       TEXT('DATA INIZIO GG/MM')
006700160616     A**          N77DTFI        4P 0       TEXT('DATA FINE   GG/MM')
006800160616     A***         N77COM         4          TEXT('CODICE COMUNE')
006900010403     A*---
007000010403     A*--- RAPP.SOC.EST.
007100010403     A*---
007200160616     A**          N77RCDF   R               REFFLD(CDFISC)
007300160616     A**          N77RCOG       48          TEXT('COGNOME')
007400160616     A**          N77RNOM       48          TEXT('NOME')
007500160616     A**          N77RSES        1          TEXT('SESSO')
007600160616     A**          N77RLNC   R               REFFLD(LOCALIT)
007700160616     A**                                    TEXT('COMUNE DI NASCITA')
007800160616     A**          N77RDNC   R               REFFLD(DATA      )
007900160616     A**                                    TEXT('DATA DI NASCITA')
008000160616     A**          N77RPNC   R               REFFLD(PROV)
008100160616     A**                                    TEXT('PROV.DI NASCITA')
008200160616     A**          N77RCIT   R               REFFLD(LOCALIT)
008300160616     A**                                    TEXT('COMUNE DI RESIDENZA')
008400160616     A**          N77RVIA   R               REFFLD(INDIRIZ)
008500160616     A**                                    TEXT('VIA RESIDENZA')
008600160616     A**          N77RPRV   R               REFFLD(PROV)
008700160616     A**                                    TEXT('PROVINCIA RESIDENZA')
008800160616     A**          N77RCSE        3          TEXT('CODICE STATO ESTERO       ')
008900160615     A*---
009000160615     A*--- CAMPI AGGIUNTI PER IL MOD. 770/2004 RELATIVO AL 2003
009100160615     A*---
009200160615     A            N77RIM    R               REFFLD(IMPORTO)
009300160615     A                                      TEXT('IMPORTO RITENUTA A TITOLO -
009400160615     A                                      D''IMPOSTA')
009500160616     A**          N77ARI    R               REFFLD(IMPORTO)
009600160616     A**                                    TEXT('ADD.REGIONALE A TITOLO -
009700160616     A**                                    D''IMPOSTA')
009800160615     A*---
009900160615     A*--- CAMPI AGGIUNTI PER IL MOD. 770/2005 RELATIVO AL 2004
010000160615     A*---
010100160616     A**          N77CTBDL  R               REFFLD(IMPORTO)
010200160616     A**                                    TEXT('CTB PREV CARICO DATORE DI -
010300160616     A**                                    LAVORO    ')
010400160616     A**          N77CTBLV  R               REFFLD(IMPORTO)
010500160616     A**                                    TEXT('CTB PREV CARICO LAVORATORE-
010600160616     A**                                              ')
010700160615     A*---
010800160615     A*--- CAMPI AGGIUNTI PER IL MOD. 770/2006 COMPETENZA 2005
010900160615     A*---
011000160616     A**          N77SPERIMBR               REFFLD(IMPORTO)
011100160616     A**                                    TEXT('SPESE RIMBORSATE ')
011200160616     A**          N77RITRIMBR               REFFLD(IMPORTO)
011300160616     A**                                    TEXT('RITENUTE RIMBORSATE ')
011400160615     A*---
011500160615     A*--- CAMPI AGGIUNTI PER IL MOD. 770/2007 COMPETENZA 2006
011600160615     A*---
011700160616     A**          N77EREDE       1A         TEXT('EREDE')
011800160616     A            N77EVENTI      2A         TEXT('EVENTI ECCEZIONALI')
011900160616     A**          N77IMPPRFAR               REFFLD(IMPORTO)
012000160616     A**                                    TEXT('SOMMA CORRISPOSTA -
012100160616     A**                                    PRIMA DEL FALLIMENTO')
012200160616     A**          N77IMPCUCOR               REFFLD(IMPORTO)
012300160616     A**                                    TEXT('SOMMA CORRISPOSTA -
012400160616     A**                                    DAL CURATORE/COMMISSARIO')
012500160615     A*---
012600160615     A*--- Mod. 770/2010 Competenza 2009
012700160615     A*--- Redditi erogati da altri soggetti
012800160615     A*---
012900160616     A**          N77ASIMP  R               REFFLD(IMPORTO)
013000160616     A**                                    TEXT('TOT.REDDITO PERCEPITO ')
013100160616     A**          N77ASCDF  R               REFFLD(CDFISC)
013200160616     A**          N77ASIMS  R               REFFLD(IMPORTO)
013300160616     A**                                    TEXT('IMPONIBILE')
013400160616     A**          N77ASRAC  R               REFFLD(IMPORTO)
013500160616     A**                                    TEXT('IMPORTO RITENUTA A TITOLO -
013600160616     A**                                    D''ACCONTO')
013700160616     A**          N77ASRIM  R               REFFLD(IMPORTO)
013800160616     A**                                    TEXT('IMPORTO RITENUTA A TITOLO -
013900160616     A**                                    D''IMPOSTA')
014000160616     A**          N77ASRSO  R               REFFLD(IMPORTO)
014100160616     A**                                    TEXT('IMPORTO RITENUTA SOSPESA')
014200160616     A**          N77ASARA  R               REFFLD(IMPORTO)
014300160616     A**                                    TEXT('ADD.REGIONALE A TITOLO -
014400160616     A**                                    D''ACCONTO')
014500160616     A**          N77ASARI  R               REFFLD(IMPORTO)
014600160616     A**                                    TEXT('ADD.REGIONALE A TITOLO -
014700160616     A**                                    D''IMPOSTA')
014800160616     A**          N77ASARS  R               REFFLD(IMPORTO)
014900160616     A**                                    TEXT('ADD.REGIONALE SOSPESA')
015000160615     A*---
015100160615     A*--- Mod. 770/2011 Competenza 2010
015200160615     A*--- Redditi erogati da altri soggetti
015300160615     A*---
015400160616     A**          N77CAUAS      10A         TEXT('CAUSALE              ')
015500160615     A*---
015600160615     A*--- Mod. 770/2013 Competenza 2012
015700160615     A*--- Codice
015800160615     A*---
015900160616     A***         N77CODICE      1A         TEXT('CODICE               ')
016000160615     A*---
016100160615     A*--- Mod. 770/2014 Competenza 2013
016200160615     A*---
016300160615     A*--- Dati relativi alle somme erogate :addizionali comunali
016400160615     A*---
016500160616     A**          N77ACG    R               REFFLD(IMPORTO)
016600160616     A**                                    TEXT('ADD.COMUNALE ')
016700160616     A**          N77ACS    R               REFFLD(IMPORTO)
016800160616     A**                                    TEXT('ADD.COMUNALE SOSP.')
016900160616     A**          N77ACTA   R               REFFLD(IMPORTO)
017000160616     A**                                    TEXT('ADD.COMUNALE TIT.ACC.')
017100160615     A*--- Dati erogati da altri soggetti :addizionali comunali
017200160615     A*---
017300160616     A**          N77ASACI  R               REFFLD(IMPORTO)
017400160616     A**                                    TEXT('ADD.COMUNALE A TITOLO -
017500160616     A**                                    D''IMPOSTA')
017600160616     A**          N77ASACS  R               REFFLD(IMPORTO)
017700160616     A**                                    TEXT('ADD.COMUNALE SOSPESA')
017800160616     A**          N77ASACA  R               REFFLD(IMPORTO)
017900160616     A**                                    TEXT('ADD.COMUNALE A TITOLO -
018000160616     A**                                    D''ACCONTO')
018100160615     A*
018200160616     A**          N77CTGPRT      2A         TEXT('CATEGORIE PARTICOLARI')
018300160615     A*
018400160615     A            N77ESCLUDI     1A         TEXT('ESCLUDI DA CERTIFICAZIONE')
018401160616     A            N77CDFS   R               REFFLD(CDFISC)
018402160616     A                                      TEXT('Cod.Fisc.Sostituto di im-
018403160616     A                                      posta                       ')
018500160615     A*
018501160616     A**          N77PROTCEI     5  0       TEXT('PROTOCOLLO CERTIF. INVIATA')
018502160615     A*
018600160616     A**          N77PROTOC     17  0       TEXT('PROTOCOLLO TELEMATICO')
018601160615     A*
018700160616     A**          N77PROTCEA     6  0       TEXT('PROTOCOLLO CERTIF. ACCOLTA')
018800160615     A*--- MOD. 770/2016 COMPETENZA 2015
018801160616     A**          N77NRESS       1A
018802160616     A**                                    TEXT('FLAG NON RESIDENTI -
018804160616     A**                                    SCHUMACKER')
018805160615     A*---   (Dati previdenziali)
018900160616     A**          N77DPCDF  R               REFFLD(CDFISC)
019000160616     A**                                    TEXT('COD.FISCALE ENTE PREVI-
019100160616     A**                                    DENZIALE')
019200160616     A**          N77DPDEN      48
019300160616     A**                                    TEXT('DENOMINAZIONE ENTE PRE-
019400160616     A**                                    VIDENZIALE')
019500160616     A**          N77DPCENP      1A
019600160616     A**                                    TEXT('CODICE ENTE PREVIDENZI-
019700160616     A**                                    ALE')
019800160616     A**          N77DPCAZI     16A
019900160616     A**                                    TEXT('CODICE AZIENDA')
020000160616     A**          N77DPCATE      1A
020100160616     A**                                    TEXT('CATEGORIA')
020200160616     A**          N77DPACON      1A
020300160616     A**                                    TEXT('ALTRI CONTRIBUTI')
020400160616     A**          N77DPIMPA R               REFFLD(IMPORTO)
020500160616     A**                                    TEXT('IMPORTO ALTRI CONTRIBUTI')
020600160616     A**          N77DPCODU R               REFFLD(IMPORTO)
020700160616     A**                                    TEXT('IMPORTO CONTRIBUTI DOVUTI')
020800160616     A**          N77DPCOVE R               REFFLD(IMPORTO)
020900160616     A**                                    TEXT('IMPORTO CONTRIBUTI VERSATI')
021000160615     A*---   (Casi Particolari, operazioni straordinarie)
021100160616     A**          N77OSCDF1 R               REFFLD(CDFISC)
021200160616     A**                                    TEXT('COD.FISCALE SEZ.LAVORO-
021300160616     A**                                     AUTONOMO E REDD. DIV-')
021400160616     A**          N77OSCDF2 R               REFFLD(CDFISC)
021500160616     A**                                    TEXT('COD.FISCALE SEZIONE PI-
021600160616     A**                                    GNORAMENTO PRESSO TERZI')
021700160616     A**          N77OSCDF3 R               REFFLD(CDFISC)
021800160616     A**                                    TEXT('COD.FISCALE SEZIONE IN-
021900160616     A**                                    DENNITA DI ESPROPRIO')
022000160615     A*---   (Somme liquidate a seguito di pignoramento verso terzi)
022100160616     A**          N77F2CDF  R               REFFLD(CDFISC)
022200160616     A**                                    TEXT('COD.FISCALE DEBITORE P-
022300160616     A**                                    RINCIPALE')
022400160616     A**          N77F2IME  R               REFFLD(IMPORTO)
022500160616     A**                                    TEXT('SOMME EROGATE')
022600160616     A**          N77F2RIO  R               REFFLD(IMPORTO)
022700160616     A**                                    TEXT('RITENUTE OPERATE')
022800160616     A**          N77F2RINO R               REFFLD(FLAG)
022900160616     A**                                    TEXT('RITENUTE NON OPERATE')
023000160616     A**          N77F2CDF2 R               REFFLD(CDFISC)
023100160616     A**                                    TEXT('COD.FISCALE DEBITORE')
023300160616     A**          N77F2IME2 R               REFFLD(IMPORTO)
023400160616     A**                                    TEXT('SOMME EROGATE')
023500160616     A**          N77F2RIO2 R               REFFLD(IMPORTO)
023600160616     A**                                    TEXT('RITENUTE OPERATE')
023700160616     A**          N77F2RINO2R               REFFLD(FLAG)
023800160616     A**                                    TEXT('RITENUTE NON OPERATE')
023900160615     A*---   (Somme corrisposte a titolo di indennità di esproprio)
024300160616     A**          N77F3INE  R               REFFLD(IMPORTO)
024400160616     A**                                    TEXT('INDENNITA DI ESPROPRIO')
024500160616     A**          N77F3RIE  R               REFFLD(IMPORTO)
024600160616     A**                                    TEXT('RIENUTE OPERATE INDENN-
024601160616     A**                                    ITA DI ESPROPRIO')
024700160616     A**          N77F3AIN  R               REFFLD(IMPORTO)
024800160616     A**                                    TEXT('ALTRE INDENNITA')
025100160616     A**          N77F3ARI  R               REFFLD(IMPORTO)
025200160616     A**                                    TEXT('RITENUTE OPERATE ALTRE -
025300160616     A**                                    INDENNITA')
025400160616     A**          N77F3INE2 R               REFFLD(IMPORTO)
025500160616     A**                                    TEXT('INDENNITA DI ESPROPRIO')
025600160616     A**          N77F3RIE2 R               REFFLD(IMPORTO)
025700160616     A**                                    TEXT('RIENUTE OPERATE INDENN-
025800160616     A**                                    ITA DI ESPROPRIO')
025900160616     A**          N77F3AIN2 R               REFFLD(IMPORTO)
026000160616     A**                                    TEXT('ALTRE INDENNITA')
026100160616     A**          N77F3ARI2 R               REFFLD(IMPORTO)
026200160616     A**                                    TEXT('RITENUTE OPERATE ALTRE -
026300160616     A**                                    INDENNITA')
026301160615     A* DATI RESIDENZA ANNO PRECEDENTE
026400160616     A**          N77CITAP  R               REFFLD(LOCALIT)
026500160616     A**                                    TEXT('COMUNE DI RESIDENZA ANNO PREC-
026501160616     A**                                    EDENTE')
026600160616     A**          N77PRVAP  R               REFFLD(PROV)
026700160616     A**                                    TEXT('PROVINCIA RESIDENZA ANNO PREC-
026701160616     A**                                    EDENTE')
026800160616     A**          N77COMAP       4          TEXT('CODICE COMUNE ANNO PRECEDENTE-
026900160616     A**                                    ')
