000100110707     A                                      FIFO
000200130823     A          R SDGSCF000                 PFILE(SDGSCF00F)
000300100706     A*
000400130823     A          K SCFSOCIETA
000401130823     A          K SCFTPCOM
000500130823     A          K SCFANNO
000501130823     A          K SCFMESE
000513130823     A          K SCFPARTIVA
000514130823     A          K SCFCDFISC
003500100706     A*
