000100040109     A*
000200040109    >A* Impostare il nome del file di cui si vuole fare l'anagrafica
000300040109    >A* oppure il dizionario ANDIZ00F
000400150910    >A                                      REF(*LIBL/ANDIZ00F)
000500040109     A*
000600150915    >A          R SDGSD26S
000601150915     A*
000602150915     A            RICD26         1
000603150915     A* 0=PRIMA CHIAMATA / 1=CHIAMATE SUCCESSIVE
000604150915     A*
000605150915     A            ORDD26         2  0
000606150915     A            POSD26          L
000607150924     A* 0=NESSUN ERRIRE/1=ERRORI
000608150924     A            ERRD26         1
000609150915     A*
000610150915     A* 0=TROVATO RCD / 1=FINE FILE
000611150915     A            ENDD26         1
000612150915     A*
000613150915     A* SOCIETÀ
000614150915     A            SOCIETAD26R               REFFLD(SOCIETA)
000615150915     A*
000616150915     A* EVENTUALI PARZIALIZZAZIONI RICHIESTE A PRIORI
000617150915     A* E/O CAMPI PER RITORNO DA OPZIONE DI SELEZIONE
000618150915     A            CTBD26    R               REFFLD(CTB)
004300040109     A*
004400040109     A* eventuali parzializzazioni richieste a priori
004500040109     A* e/o campi per ritorno da opzione di selezione
004501150924     A            SIBOLLD26 R               REFFLD(FLAG)
004502150924     A                                      TEXT('Estrazione Bolle')
004600150915     A            SOGGD26   R               REFFLD(SOGG)
004601150915     A                                      TEXT('Soggetto legato  ')
004602150916     A            KCCD26    R               REFFLD(KCC)
004700150915     A                                      TEXT('Capoconto        ')
004800150916     A            KSCD26    R               REFFLD(KSC)
004801150924     A                                      TEXT('Sottoconto       ')
004802160125     A*
004803160125     A            TPDTRIFD26     1A
004804160125     A                                      TEXT('Tipo data di riferimento   -
004805160125     A                                                     ')
004900150915     A            DTREGDAD26R               REFFLD(DATA)
005000150910     A                                      TEXT('Data inizio reg. ')
005001150915     A            DTREGAD26 R               REFFLD(DATA)
005002150910     A                                      TEXT('Data fine   reg. ')
005003150915     A            DTDOCDAD26R               REFFLD(DATA)
005004150910     A                                      TEXT('Data inizio doc. ')
005005150915     A            DTDOCAD26 R               REFFLD(DATA)
005016150910     A                                      TEXT('Data fine   doc. ')
005017150915     A            SYSD26    R               REFFLD(SYS)
005018150911     A                                      TEXT('Sistema origine  ')
005019150916     A            NRASREGD26R               REFFLD(LRCNRASREG SDGLRC00F)
005020150911     A                                      TEXT('Num. assoluto reg')
005021150911     A*
