000100070907     A*
000200070907     A                                      FIFO
000300130823     A          R SDGSPR000                 PFILE(SDGSPR00F)
000400070907     A*
000500130823     A          K SPRSOCIETA
000600130823     A          K SPRTIPREG
000700130823     A          K SPRSTPREG
000800130823     A          K SPRTPREG
000900130823     A          K SPRLIBRO
001000130823     A          K SPRALIQ
001100130823     A          K SPRRIFIVA
001200130823     A          K SPRCAUSALE
001300130823     A          K SPRKCC
001400130823     A          K SPRKSC
001500130823     A          K SPRVOCE
001600130823     A          K SPRCLASSE
001700070907     A*
