000100070907     A*
000200070907     A                                      UNIQUE
000300070907     A*
000400130823     A          R SDGSPR000                 PFILE(SDGSPR00F)
000500070907     A*
000600130823     A          K SPRSOCIETA
000700130823     A          K SPRTIPREG
000800130823     A          K SPRSTPREG
000900130823     A          K SPRNRRIGA
001000070907     A*
