000100000000     H*PARMS MBR(*NONE)
000200130828     A                                      REF(*LIBL/SDGSCF00F)
000300130828     A          R SDGSG73S
000400130828     A            OPZG73         2A
000500130828     A            RETG73         1A
000600130828     A            OPRG73         1A
000700130828     A            ERRG73         1A
000800130828     A            CMTG73         1A
000900130828     A            SOCIETAG73R               REFFLD(SOCIETA ANDIZ00F)
001000130829     A            ANNG73         1          TEXT('Annullati S/N')
001100130829     A            TPANNG73  R               REFFLD(SCFTPANN)
001200130828     A            ANNOG73   R               REFFLD(SCFANNO)
001300130919     A            CFG73     R               REFFLD(SCFCF  )
001400130828     A            STATOG73  R               REFFLD(SCFSTATO)
001500130828     A            PARTIVAG73R               REFFLD(SCFPARTIVA)
001600130828     A            CDFISCG73 R               REFFLD(SCFCDFISC)
001700130828     A            SOGGG73   R               REFFLD(SCFSOGG)
001800130919     A            TPOPEG73  R               REFFLD(SCFTPOPE)
001900130828     A            QUADROG73 R               REFFLD(SCFQUADRO )
002000131206R141 A            CAUSALEG73R               REFFLD(SCFCAUSALE)
002100140327R133 A*
002200140327R133 A            TPCOMG73       1A
002300140327R133 A                                      TEXT('Tipo comunicazione E=Elench-
002400140327R133 A                                      i, S=Acquisti RSM')
002500140327R133 A*
