000100091019     H*PARMS MBR(*NONE)
000200091019     A*
000300130925     A                                      REF(SDGSCF00F)
000400091019     A*
000500130925    >A          R SDGSG78S
000600130925    >A            ERRG78         1A
000700091019     A                                      TEXT('Errore su pgm chiamato : 0=ne-
000800091019     A                                      ssuno; 1=errore; ...=errori specifi-
000900091019     A                                      ci del richiamo')
001000091019     A*
001100130925     A            SOCIETAG78R               REFFLD(SCFSOCIETA)
001200130925     A            TPCOMG78  R               REFFLD(SCFTPCOM  )
001300130925     A            ANNOG78   R               REFFLD(SCFANNO   )
001400130925     A            MESEG78   R               REFFLD(SCFMESE   )
001500130925     A            SEQQUAG78 R               REFFLD(SCFSEQQUA )
001600130925     A            QUADROG78 R               REFFLD(SCFQUADRO )
001700130925     A            COGRAGRG78R               REFFLD(SCFCOGRAGR)
001800130925     A            NOMERG78  R               REFFLD(SCFNOMER  )
001900130925     A            DTNASRG78 R               REFFLD(SCFDTNASR )
002000130925     A            LOCNASRG78R               REFFLD(SCFLOCNASR)
002001130925     A            PRVNASRG78R               REFFLD(SCFPRVNASR)
002002130925     A            STATORG78 R               REFFLD(SCFSTATOR )
002003130925     A            CODUICRG78R               REFFLD(SCFCODUICR)
002004130925     A            LOCALIRG78R               REFFLD(SCFLOCALIR)
002005130925     A            INDIRERG78R               REFFLD(SCFINDIRER)
002100130925     A            TPNRG78   R               REFFLD(SCFTPNR   )
002200130925     A            PIVARG78  R               REFFLD(SCFPIVAR  )
002300130925     A            CDFISCRG78R               REFFLD(SCFCDFISCR)
002400130925     A            TPOPERG78 R               REFFLD(SCFTPOPER )
002401130925     A            NATOPERG78R               REFFLD(SCFNATOPER)
002402130925     A            LEASINRG78R               REFFLD(SCFLEASINR)
002403130925     A            DTREGRG78 R               REFFLD(SCFDTREGR )
002404130925     A            NRREGRG78 R               REFFLD(SCFNRREGR )
002405130925     A            SERREGRG78R               REFFLD(SCFSERREGR)
002406130925     A* CHIAVE UNIVOCA
002407130925     A            SYSG78    R               REFFLD(SCFSYS)
002408130925     A            NRASREGG78R               REFFLD(SCFNRASREG)
002409130925     A            NRRIGAMG78R               REFFLD(SCFNRRIGAM)
002410130925     A            NRRIGAG78 R               REFFLD(SCFNRRIGA)
002411130925     A* DATI DI RITORNO
002500130925     A            NRRCDG78  R               REFFLD(NR ANDIZ00F)
002600130925     A            NROPEG78  R               REFFLD(FLAG ANDIZ00F)
