000100091019     H*PARMS MBR(*NONE)
000200091019     A*
000300160119     A                                      REF(SDGLRC00F)
000400091019     A*
000500160119     A          R SDGSG54S
000600091019     A*
000700160119     A            SOCIETAG54R               REFFLD(LRCSOCIETA)
000800160119     A            SYSG54    R               REFFLD(LRCSYS    )
000900160119     A            NRASREGG54R               REFFLD(LRCNRASREG)
001000160125     A            TPDOCG54  R               REFFLD(FLAG     ANDIZ00F)
001100160125     A                                      TEXT('Tipo documento B=Bolla F=Fa-
001200160125     A                                      ttura          ')
001300160125     A*
001400160125     A            TPDTRIFG54     1A
001500160125     A                                      TEXT('Tipo data di riferimento   -
001600160125     A                                                     ')
001700130925     A* DATI DI RITORNO
001800170825R264 X****        TPANNG54  R               REFFLD(SCFTPANN SDGSCF00F)
001900170825R264 A            TPANNG54       2A
002000170825R264 A                                      COLHDG('Tipo annullamento')
002100160119     A            SOGGG54   R               REFFLD(SOGG ANDIZ00F)
002200160126     A            KSCG54    R               REFFLD(KSC  ANDIZ00F)
002300160126     A            KCCG54    R               REFFLD(KCC  ANDIZ00F)
