000100021210     H*PARMS MBR(*NONE)
000600021210     A*
000601160728     A                                      REF(*LIBL/SDGSPA00F)
000602021210     A*
000700160728     A          R SDGSK13S
000701161020R235  * DS creata con il task R235 CU Percipiente in regime agevolato
000702161020R235  *
000703021210     A*
000704160728     A            OPZK13         2A
000705021210     A                                      TEXT('Opzione richiesta')
003600021210     A*
004200160728     A            SOCIETAK13R               REFFLD(SPASOCIETA    )
004703160728     A            KCCK13    R               REFFLD(SPAKCC        )
004704160728     A            KSCK13    R               REFFLD(SPAKSC        )
004706160728     A            DTINIK13  R               REFFLD(SPADTINI      )
004707160728     A            DTFINK13  R               REFFLD(SPADTFIN      )
004708021210     A*
004709160728     A            SOVRAK13       1          TEXT('Periodo sovrapposto ........')
004800021210     A*
