000100150105     A*%%TS  SD  20150105  161431  SDCONSUL4   REL-V7R1M0  5770-WDS
000200000000     A*PARMS RSTDSP(*YES) DFRWRT(*YES) DECFMT(*JOB)
000300150105     A*%%EC
000400150105     A                                      DSPSIZ(24 80 *DS3)
000500150105     A                                      REF(*LIBL/ANDIZ00F)
000600150105     A                                      CHGINPDFT(HI CS)
000700150105     A                                      PRINT
000800150105     A                                      ERRSFL
000900150105     A                                      HLPPNLGRP(LABEL SDGSJ62DH)
001000150105     A                                      HLPTITLE(' ')
001100150105     A                                      HELP
001200150105     A                                      ALTHELP
001300000000     A*---------------------------------------------------------------*
001400150105     A          R SJ62T1
001500150105     A*%%TS  SD  20150105  123235  SDCONSUL4   REL-V7R1M0  5770-WDS
001600150105     A            NOMAZN         4A  O  1  2DSPATR(HI)
001700150105     A            D1TIT         15A  O  1  8
001800150105     A                                  1 27'  Dichiarazione d''intento  '
001900150105     A                                      DSPATR(HI)
002000150105     A            NOMDIT        20A  O  1 61TEXT('DESCRIZIONE DITTA')
002100150105     A                                  2  2'SDG'
002200150105     A                                  2  6'FD'
002300150105     A            T1TIT         30A  O  2 26DSPATR(HI)
002400150105     A            NOMSIF        10A  O  2 61
002500000000     A*---------------------------------------------------------------*
002600150105     A          R SJ62D1
002700150105     A*%%TS  SD  20150105  123427  SDCONSUL4   REL-V7R1M0  5770-WDS
002800150105     A                                      CF02
002900150105     A                                      CA03
003000150105     A                                      CF04
003100150105     A                                      CF05
003200150105     A                                      CF06
003300150105     A                                      CF07
003400150105     A                                      CA08
003500150105     A                                      CF09
003600150105     A                                      CF10
003700150105     A                                      CF11
003800150105     A                                      CA12
003900150105     A                                      CF13
004000150105     A                                      CF14
004100150105     A                                      CF15
004200150105     A                                      CF16
004300150105     A                                      CF17
004400150105     A                                      CF18
004500150105     A                                      CF19
004600150105     A                                      CF20
004700150105     A                                      CF21
004800150105     A                                      CF22
004900150105     A                                      CF23
005000150105     A                                      CF24
005100150105     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
005200150105     A                                      CSRLOC(H1RIGA     H1COLO)
005300150105     A                                      OVERLAY
005400150105     A          H                           HLPPNLGRP(HLPD1 NDC757DH)
005500150105     A                                      HLPARA(03 001 08 080)
005600150105     A          H                           HLPPNLGRP(HLPKEYD1 NDC757DH)
005700150105     A                                      HLPARA(22 001 23 080)
005800150105     A            P1FIL_LIB     20A  P
005900150105     A            H1NMRC        10A  H      TEXT('Nome Record')
006000150105     A            H1NMFL        10A  H      TEXT('Nome Campo')
006100150105     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
006200150105     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
006300150105     A                                      ore')
006400150105     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
006500150105     A                                      ursore')
006600150105     A            D1PRG          3S 0H      TEXT('chiave univoca')
006700150105     A            D1MSG          1A  O  4  2TEXT('serve per emettere msg relati-
006800150105     A                                      vi a tutta la videata')
006900150105     A  93                                  ERRMSGID(PRO0007 *LIBL/PROMSG 93)
007000150105     A  94                                  ERRMSGID(PRO0127 *LIBL/PROMSG 94)
007100150105     A  97                                  ERRMSGID(CPD6A60 *LIBL/QCPFMSG 97)
007200150105     A  98                                  ERRMSGID(PRO0008 *LIBL/PROMSG 98)
007300150105     A                                  5  2'File di scarico ............:'
007400150105     A            D1FILE        10A  B  5 33
007500150105     A  51                                  ERRMSGID(PRO0014 *LIBL/PROMSG 51)
007600150105     A  50                                  ERRMSGID(PRO1797 *LIBL/PROMSG 50 &P-
007700150105     A                                      1FIL_LIB)
007800150105     A  54                                  ERRMSGID(NDC0890 *LIBL/PROMSG 54)
007900150105     A  55                                  ERRMSGID(NDC0891 *LIBL/PROMSG 55)
008000150105     A                                  6  2'Tipo di record .............:'
008100150105     A            D1TPREC        1A  B  6 33VALUES('A' 'B' 'E' 'Z')
008200150105     A                                  6 50'A/Z'
008300150105     A          R SJ62DA1
008400000000     A*%%TS  SD  20130912  180251  SDCONSUL1   REL-V7R1M0  5770-WDS
008500000000     A                                      CF02
008600000000     A                                      CA03
008700000000     A                                      CF04
008800000000     A                                      CF05
008900000000     A                                      CF06
009000000000     A                                      CF07
009100000000     A                                      CA08
009200000000     A                                      CF09
009300000000     A                                      CF10
009400000000     A                                      CF11
009500000000     A                                      CA12
009600000000     A                                      CF13
009700000000     A                                      CF14
009800000000     A                                      CF15
009900000000     A                                      CF16
010000000000     A                                      CF17
010100000000     A                                      CF18
010200000000     A                                      CF19
010300000000     A                                      CF20
010400000000     A                                      CF21
010500000000     A                                      CF22
010600000000     A                                      CF23
010700000000     A                                      CF24
010800000000     A                                      ROLLUP
010900000000     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
011000000000     A                                      CSRLOC(H1RIGA     H1COLO)
011100000000     A                                      OVERLAY
011200000000     A            H1NMRC        10A  H      TEXT('Nome Record')
011300000000     A            H1NMFL        10A  H      TEXT('Nome Campo')
011400000000     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
011500000000     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
011600000000     A                                      ore')
011700000000     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
011800000000     A                                      ursore')
011900000000     A            GA001010       1A  H
012000000000     A                                  4  2'Pos'
012100000000     A                                      DSPATR(HI)
012200000000     A                                  4  9'Tipo Record  "A"                  -
012300000000     A                                                                         -
012400000000     A                                       '
012500000000     A                                      DSPATR(UL)
012600000000     A                                      DSPATR(HI)
012700000000     A            D1MSG          1A  O  4 80TEXT('serve per emettere msg relati-
012800000000     A                                      vi a tutta la videata')
012900000000     A  95                                  ERRMSGID(PRO0012 *LIBL/PROMSG 95)
013000000000     A  96                                  ERRMSGID(PRO0013 *LIBL/PROMSG 96)
013100000000     A  97                                  ERRMSGID(CPD6A60 *LIBL/QCPFMSG 97)
013200000000     A  98                                  ERRMSGID(PRO0008 *LIBL/PROMSG 98)
013300000000     A                                  5  2'iniz'
013400000000     A                                      DSPATR(HI)
013500000000     A                                  5  9'1...5...10...15...20...25...30...3-
013600000000     A                                      5...40...45...50...55...60...65...7-
013700000000     A                                      0 '
013800000000     A                                  6  9'Record di tipo "A"'
013900000000     A                                  7  5'2'
014000000000     A            GA00101       14A  B  7  9
014100000000     A                                  7 25'Codice fornitura'
014200000000     A            GA00201        5A  B  7 42
014300000000     A                                  7 49'Tipo'
014400000000     A                                  7 54'Fornitore'
014500000000     A            GA00301        2A  B  7 64
014600000000     A                                  8  4'23'
014700000000     A                                  8  9'Cod.Fiscale'
014800000000     A            GA00401       16A  B  8 22
014900000000     A                                  8 79' '
015000000000     A                                  9  1' '
015100000000     A                                  9  4'39'
015200000000     A                                  9  9'Spazio'
015300000000     A                                  9 16'non'
015400000000     A                                  9 20'utilizzato'
015500000000     A            GA00701       70A  B 10  9
015600000000     A            GA00702       70A  B 11  9
015700000000     A            GA00703       70A  B 12  9
015800000000     A            GA00704       70A  B 13  9
015900000000     A            GA00705       70A  B 14  9
016000000000     A            GA00706       70A  B 15  9
016100000000     A            GA00707       63A  B 16  9
016200000000     A                                 17  3'522'
016300000000     A                                 17  9'Dichiarazione su piu invii'
016400000000     A                                 17 38'Progress.'
016500000000     A            GA00801        4A  B 17 49
016600000000     A                                 17 55'Num.Tot.Invii'
016700000000     A            GA00901        4A  B 17 70
016800000000     A                                 18  9'Spazio'
016900000000     A                                 18 16'a'
017000000000     A                                 18 18'disposizione'
017100000000     A                                 18 31'utente'
017200000000     A                                 19  3'530'
017300000000     A            GA01001       70A  B 19  9
017400000000     A            GA01002       30A  B 20  9
017500000000     A*
017600000000     A                                 21 72'Segue.  '
017700000000     A                                      DSPATR(HI)
017800000000     A* Disabilitato tasto ROLLUP
017900150105     A          R SJ62DA2
018000150105     A*%%TS  SD  20150105  123427  SDCONSUL4   REL-V7R1M0  5770-WDS
018100150105     A                                      CF02
018200150105     A                                      CA03
018300150105     A                                      CF04
018400150105     A                                      CF05
018500150105     A                                      CF06
018600150105     A                                      CF07
018700150105     A                                      CA08
018800150105     A                                      CF09
018900150105     A                                      CF10
019000150105     A                                      CF11
019100150105     A                                      CA12
019200150105     A                                      CF13
019300150105     A                                      CF14
019400150105     A                                      CF15
019500150105     A                                      CF16
019600150105     A                                      CF17
019700150105     A                                      CF18
019800150105     A                                      CF19
019900150105     A                                      CF20
020000150105     A                                      CF21
020100150105     A                                      CF22
020200150105     A                                      CF23
020300150105     A                                      CF24
020400150105     A                                      ROLLUP
020500150105     A                                      ROLLDOWN
020600150105     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
020700150105     A                                      CSRLOC(H1RIGA     H1COLO)
020800150105     A                                      OVERLAY
020900150105     A            H1NMRC        10A  H      TEXT('Nome Record')
021000150105     A            H1NMFL        10A  H      TEXT('Nome Campo')
021100150105     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
021200150105     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
021300150105     A                                      ore')
021400150105     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
021500150105     A                                      ursore')
021600150105     A                                  4  2'Pos'
021700150105     A                                      DSPATR(HI)
021800150105     A                                  4  9'Tipo Record "A"                   -
021900150105     A                                                                         -
022000150105     A                                       '
022100150105     A                                      DSPATR(UL)
022200150105     A                                      DSPATR(HI)
022300150105     A                                  4 14'Record'
022400150105     A                                  4 22'A'
022500150105     A            D1MSG          1A  O  4 80TEXT('serve per emettere msg relati-
022600150105     A                                      vi a tutta la videata')
022700150105     A  95                                  ERRMSGID(PRO0012 *LIBL/PROMSG 95)
022800150105     A  96                                  ERRMSGID(PRO0013 *LIBL/PROMSG 96)
022900150105     A  97                                  ERRMSGID(CPD6A60 *LIBL/QCPFMSG 97)
023000150105     A  98                                  ERRMSGID(PRO0008 *LIBL/PROMSG 98)
023100150105     A                                  5  2'iniz'
023200150105     A                                      DSPATR(HI)
023300150105     A                                  5  9'1...5...10...15...20...25...30...3-
023400150105     A                                      5...40...45...50...55...60...65...7-
023500150105     A                                      0'
023600150105     A                                  6  3'630'
023700150105     A                                  6  9'Filler'
023800150105     A            GA01101       63A  B  6 16
023900150105     A            GA01102       70A  B  7  9
024000150105     A            GA01103       70A  B  8  9
024100150105     A            GA01104       70A  B  9  9
024200150105     A            GA01105       70A  B 10  9
024300150105     A            GA01106       70A  B 11  9
024400150105     A            GA01107       70A  B 12  9
024500150105     A            GA01108       70A  B 13  9
024600150105     A            GA01119       70A  B 14  9
024700150105     A            GA01110       70A  B 15  9
024800150105     A            GA01111       70A  B 16  9
024900150105     A            GA01112       70A  B 17  9
025000150105     A            GA01113       70A  B 18  9
025100150105     A            GA01114       70A  B 19  9
025200150105     A            GA01115       70A  B 20  9
025300150105     A                                 21 72'Segue.'
025400150105     A                                      DSPATR(HI)
025500150105     A          R SJ62DA3
025600000000     A*%%TS  SD  20130913  115139  SDCONSUL1   REL-V7R1M0  5770-WDS
025700000000     A                                      CF02
025800000000     A                                      CA03
025900000000     A                                      CF04
026000000000     A                                      CF05
026100000000     A                                      CF06
026200000000     A                                      CF07
026300000000     A                                      CA08
026400000000     A                                      CF09
026500000000     A                                      CF10
026600000000     A                                      CF11
026700000000     A                                      CA12
026800000000     A                                      CF13
026900000000     A                                      CF14
027000000000     A                                      CF15
027100000000     A                                      CF16
027200000000     A                                      CF17
027300000000     A                                      CF18
027400000000     A                                      CF19
027500000000     A                                      CF20
027600000000     A                                      CF21
027700000000     A                                      CF22
027800000000     A                                      CF23
027900000000     A                                      CF24
028000000000     A                                      ROLLDOWN
028100000000     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
028200000000     A                                      CSRLOC(H1RIGA     H1COLO)
028300000000     A                                      OVERLAY
028400000000     A            H1NMRC        10A  H      TEXT('Nome Record')
028500000000     A            H1NMFL        10A  H      TEXT('Nome Campo')
028600000000     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
028700000000     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
028800000000     A                                      ore')
028900000000     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
029000000000     A                                      ursore')
029100000000     A                                  4  2'Pos'
029200000000     A                                      DSPATR(HI)
029300000000     A                                  4  9'Tipo Record "A"                   -
029400000000     A                                                                         '
029500000000     A                                      DSPATR(UL)
029600000000     A                                      DSPATR(HI)
029700000000     A                                  4 14'Record'
029800000000     A                                  4 22'A'
029900000000     A            D1MSG          1A  O  4 80TEXT('serve per emettere msg relati-
030000000000     A                                      vi a tutta la videata')
030100000000     A  95                                  ERRMSGID(PRO0012 *LIBL/PROMSG 95)
030200000000     A  96                                  ERRMSGID(PRO0013 *LIBL/PROMSG 96)
030300000000     A  97                                  ERRMSGID(CPD6A60 *LIBL/QCPFMSG 97)
030400000000     A  98                                  ERRMSGID(PRO0008 *LIBL/PROMSG 98)
030500000000     A                                  5  2'iniz'
030600000000     A                                      DSPATR(HI)
030700000000     A                                  5  9'1...5...10...15...20...25...30...3-
030800000000     A                                      5...40...45...50...55...60...65...7-
030900000000     A                                      0'
031000000000     A                                  7  9'Filler'
031100000000     A                                  8  2'1673'
031200000000     A            GA01116       25A  B  8  9
031300000000     A                                 11  9'Spazio riservato al servizio telem-
031400000000     A                                      atico'
031500000000     A                                 12  2'1698'
031600000000     A            GA01201       70A  B 12  9
031700000000     A            GA01202       70A  B 13  9
031800000000     A            GA01203       60A  B 14  9
031900000000     A                                 17  9'Caratteri di controllo'
032000000000     A                                 18  2'1898'
032100000000     A            GA01301        1A  B 18  9
032200000000     A            GA01401        2A  B 18 12
032300000000     A                                 21 76'Fine'
032400000000     A                                      DSPATR(HI)
032500150105     A          R SJ62DZ1
032600150105     A*%%TS  SD  20150105  161431  SDCONSUL4   REL-V7R1M0  5770-WDS
032700150105     A                                      CF02
032800150105     A                                      CA03
032900150105     A                                      CF04
033000150105     A                                      CF05
033100150105     A                                      CF06
033200150105     A                                      CF07
033300150105     A                                      CA08
033400150105     A                                      CF09
033500150105     A                                      CF10
033600150105     A                                      CF11
033700150105     A                                      CA12
033800150105     A                                      CF13
033900150105     A                                      CF14
034000150105     A                                      CF15
034100150105     A                                      CF16
034200150105     A                                      CF17
034300150105     A                                      CF18
034400150105     A                                      CF19
034500150105     A                                      CF20
034600150105     A                                      CF21
034700150105     A                                      CF22
034800150105     A                                      CF23
034900150105     A                                      CF24
035000150105     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
035100150105     A                                      CSRLOC(H1RIGA     H1COLO)
035200150105     A                                      OVERLAY
035300150105     A            H1NMRC        10A  H      TEXT('Nome Record')
035400150105     A            H1NMFL        10A  H      TEXT('Nome Campo')
035500150105     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
035600150105     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
035700150105     A                                      ore')
035800150105     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
035900150105     A                                      ursore')
036000150105     A            GZ00101        1A  H      TEXT('FILLER')
036100150105     A            GZ00501     1864A  H      TEXT('FILLER')
036200150105     A                                  4  2'Pos'
036300150105     A                                      DSPATR(HI)
036400150105     A                                  4  9'Tipo Record "Z"                   -
036500150105     A                                                                         -
036600150105     A                                       '
036700150105     A                                      DSPATR(UL)
036800150105     A                                      DSPATR(HI)
036900150105     A            D1MSG          1A  O  4 80TEXT('serve per emettere msg relati-
037000150105     A                                      vi a tutta la videata')
037100150105     A  95                                  ERRMSGID(PRO0012 *LIBL/PROMSG 95)
037200150105     A  96                                  ERRMSGID(PRO0013 *LIBL/PROMSG 96)
037300150105     A  97                                  ERRMSGID(CPD6A60 *LIBL/QCPFMSG 97)
037400150105     A  98                                  ERRMSGID(PRO0008 *LIBL/PROMSG 98)
037500150105     A                                  5  2'iniz'
037600150105     A                                      DSPATR(HI)
037700150105     A                                  5  9'1...5...10...15...20...25...30...3-
037800150105     A                                      5...40...45...50...55...60...65...7-
037900150105     A                                      0'
038000150105     A                                  6  9'Record di tipo "Z"'
038100150105     A                                  8  5'2'
038200150105     A                                  8  9'Filler'
038300150105     A            GZ00201       14A  B  8 17
038400150105     A                                 10  4'16'
038500150105     A                                 10  9'Numero record di tipo '
038600150105     A                                 10 32'B'
038700150105     A            GZ00301        9Y 0B 10 35EDTCDE(X)
038800150105     A                                 12  4'25'
038900150105     A                                 12  9'Filler'
039000150105     A            GZ00401        9A  B 12 17
039100150105     A                                 17  9'Caratteri di controllo'
039200150105     A                                 18  2'1898'
039300150105     A            GZ00601        1A  B 18  9
039400150105     A            GZ00701        2A  B 18 12
039500150105     A                                 21 76'Fine'
039600150105     A                                      DSPATR(HI)
039700000000      *---------------------------------------------------------------*
039800000000     A* PIEDE D1 - PARZIALIZZAZIONE
039900000000      *---------------------------------------------------------------*
040000150105     A          R SJ62Z1
040100000000      *---------------------------------------------------------------*
040200000000     A                                      OVERLAY
040300000000     A          H                           HLPPNLGRP(KEYDEFS  ANDIZH  )
040400000000     A                                      HLPARA(*RCD)
040500000000     A            Z1KE1         79     22  2
040600000000     A            H1ALLFUNCT   480A  H
040700000000     A            Z1KE2         79     23  2
040800000000      *---------------------------------------------------------------*
040900000000     A* PIEDE An/Bn/Zn - MANUTENZIONE
041000000000      *---------------------------------------------------------------*
041100150105     A          R SJ62Z2
041200000000      *---------------------------------------------------------------*
041300000000     A                                      OVERLAY
041400000000     A          H                           HLPPNLGRP(KEYDEFS  ANDIZH  )
041500000000     A                                      HLPARA(*RCD)
041600000000     A            Z2KE1         79     22  2
041700000000     A            H2ALLFUNCT   480A  H
041800000000     A            Z2KE2         79     23  2
041900000000      *---------------------------------------------------------------*
042000000000     A          R PROTECT
042100000000      *---------------------------------------------------------------*
042200000000     A                                      TEXT('Serve x inibire tutto il vide-
042300000000     A                                      o')
042400000000     A                                      CF02
042500000000     A                                      CA03
042600000000     A                                      CF04
042700000000     A                                      CF05
042800000000     A                                      CF06
042900000000     A                                      CF07
043000000000     A                                      CA08
043100000000     A                                      CF09
043200000000     A                                      CF10
043300000000     A                                      CF11
043400000000     A                                      CA12
043500000000     A                                      CF13
043600000000     A                                      CF14
043700000000     A                                      CF15
043800000000     A                                      CF16
043900000000     A                                      CF17
044000000000     A                                      CF18
044100000000     A                                      CF19
044200000000     A                                      CF20
044300000000     A                                      CF21
044400000000     A                                      CF22
044500000000     A                                      CF23
044600000000     A                                      CF24
044700000000     A                                      OVERLAY
044800000000     A                                      PROTECT
044900000000     A                                      CLRL(*NO)
