000100000000     H*PARMS MBR(*NONE)
000200130828     A                                      REF(*LIBL/SDGSCF00F)
000300130828     A          R SDGSG75S
000400130828     A            OPZG75         2A
000500130828     A            RETG75         1A
000600130828     A            OPRG75         1A
000700130828     A            ERRG75         1A
000800130828     A            CMTG75         1A
000900130828     A            ANNG75         1          TEXT('Annullati S/N')
001000130828     A            TPANNG75  R               REFFLD(SCFTPANN)
001100130828     A            SOCIETAG75R               REFFLD(SOCIETA ANDIZ00F)
001200130828     A            ANNOG75   R               REFFLD(SCFANNO)
001300130906     A            MESEG75   R               REFFLD(SCFMESE)
001400130828     A            CFG75     R               REFFLD(SCFCF    )
001500130828     A            SOGGG75   R               REFFLD(SCFSOGG)
001600130906     A            TPNG75    R               REFFLD(SCFTPN )
001700130828     A            PARTIVAG75R               REFFLD(SCFPARTIVA)
001800130828     A            CDFISCG75 R               REFFLD(SCFCDFISC)
001900130828     A            COGRAGG75 R               REFFLD(SCFCOGRAG )
002000130828     A            NOMEG75   R               REFFLD(SCFNOME   )
002100130828     A            DTNASCG75 R               REFFLD(SCFDTNASC )
002200130828     A            LOCNASCG75R               REFFLD(SCFLOCNASC)
002300130828     A            PRVNASCG75R               REFFLD(SCFPRVNASC)
002400130828     A            STATOG75  R               REFFLD(SCFSTATO)
002500130828     A            CODUICG75 R               REFFLD(SCFCODUIC )
002600130828     A            LOCALITG75R               REFFLD(SCFLOCALIT)
002700130828     A            INDIREG75 R               REFFLD(SCFINDIRE )
002800130919     A            TPOPEG75  R               REFFLD(SCFTPOPE  )
002900000000     A* CHIAVE UNIVOCA DI DETTAGLIO
003000130828     A            SYSG75    R               REFFLD(SCFSYS)
003100130828     A            NRASREGG75R               REFFLD(SCFNRASREG)
003200130828     A            NRRIGAG75 R               REFFLD(SCFNRRIGA)
003300000000     A* CHIAVE PER QUADRI
003400130828     A            QUADROG75 R               REFFLD(SCFQUADRO )
003500130829     A            COGRAGRG75R               REFFLD(SCFCOGRAGR)
003600130828     A            NOMERG75  R               REFFLD(SCFNOMER  )
003700130828     A            DTNASRG75 R               REFFLD(SCFDTNASR )
003800130829     A            LOCNASRG75R               REFFLD(SCFLOCNASR)
003900130829     A            PRVNASRG75R               REFFLD(SCFPRVNASR)
004000130828     A            STATORG75 R               REFFLD(SCFSTATOR )
004100130828     A            CODUICRG75R               REFFLD(SCFCODUICR)
004200130828     A            LOCALIRG75R               REFFLD(SCFLOCALIR)
004300130828     A            INDIRERG75R               REFFLD(SCFINDIRER)
004400130906     A            TPNRG75   R               REFFLD(SCFTPNR)
004500130828     A            PIVARG75  R               REFFLD(SCFPIVAR  )
004600130829     A            CDFISCRG75R               REFFLD(SCFCDFISCR)
004700130925     A            TPOPERG75 R               REFFLD(SCFTPOPER )
004800130925     A            NATOPERG75R               REFFLD(SCFNATOPER)
004900130902     A            LEASINRG75R               REFFLD(SCFLEASINR)
005000130828     A            DTREGRG75 R               REFFLD(SCFDTREGR )
005100130828     A            NRREGRG75 R               REFFLD(SCFNRREGR )
005200130829     A            SERREGRG75R               REFFLD(SCFSERREGR)
005300131206R141 A            CAUSALEG75R               REFFLD(SCFCAUSALE)
005400140328R133 A*
005500140328R133 A            TPCOMG75       1A
005600140328R133 A                                      TEXT('Tipo comunicazione E=Elench-
005700140328R133 A                                      i, S=Acquisti RSM')
005800140328R133 A*
