000100150105     H*PARMS MBR(*NONE)
000200150105     A*
000300150105     A                                      REF(*LIBL/ANDIZ00F)
000400150105     A*
000500150206     A          R SDGSK62S
000600150105     A*
000700150206     A            OPZK62         2A
000800150206     A            RETK62         1A
000900150206     A            OPRK62         1A
001000150206     A            ERRK62         1A
001100150206     A            SOCIETAK62R               REFFLD(SOCIETA ANDIZ00F)
001200150206     A            FILEK62   R               REFFLD(FILE10  ANDIZ00F)
001300150206     A            TPRECK62       1A
001400150105     A*
