000100070907     H*PARMS MBR(*NONE)
000200070907     A                                      REF(*LIBL/ANDIZ00F)
000300070907     A*
000400100719     A          R SDGSD11S
000500070907     A*
000600070907     A* Società
000700100719     A            SOCIETAD11R               REFFLD(SOCIETA ANDIZ00F)
000800160223R195 X****        ANNOD11   R               REFFLD(EBLANNO SDGEBL00F)
000900160223R195 X****        MESED11   R               REFFLD(EBLMESE SDGEBL00F)
000901160223R195 A            ANNOD11        4S 0
000902160223R195 A            MESED11        2S 0
001000100727     A            TRIMD11        1S 0
001100100719     A            MAXDIMD11      2S 0
001200100719     A            MAXSOGD11      5S 0
001300100719     A            LIBD11        10A
001400100727     A            FILETELD11R               REFFLD(FILE10  ANDIZ00F)
001500100727     A            FILED11   R               REFFLD(FILE10  ANDIZ00F)
001600100827     A            CORRD11        1A         TEXT('Correttiva nei termini-
001700100827     A                                                                  ')
001800100827     A            INTEGD11       1A         TEXT('Comunicazione Integrat-
001900100827     A                                      iva                         ')
002000100827     A            VARPERD11      1A         TEXT('Variazione periodicità-
002100100827     A                                                                  ')
002200100719     A            ERRD11         1A
002300101108R039 A            STPLD11        1A         TEXT('Stampa di lavoro file -
002400101108R039 A                                      telematico                  ')
002500101108     A*
