000100941024      *
000200941109     A                                      REF(ANSIF00F)
000300941024      *
000400090923     A          R SDGS001
000500941024      *
000600941109     A            XSCSOC    R               REFFLD(SIFSOCIETA)
000700941109      *
000800950607     A            XSCF01         5P 0       TEXT('A disposizione .............')
000900941109      *
001000950607     A            XSCF02         5P 0       TEXT('A disposizione .............')
001100941109      *
001200941111     A            XSCMCH    R               REFFLD(SIFUBICAZ)
001300941109      *
001400941111     A            XSCNSI    R               REFFLD(SIFSYSINF)
001500941109      *
001600941109     A            XSCLIN    R               REFFLD(SIFLINGUA)
001700941109      *
001800941109     A            XSCSKP    R               REFFLD(SIFSKP)
001900941109      *
002000941109     A            XSCFGO    R               REFFLD(SIFFLGOPE)
002100941109      *
002200941111     A            XSCDSI    R               REFFLD(SIFDESBREV)
002300941109      *
002400941109     A            XSCDIV    R               REFFLD(SIFDIVISA)
002500941109      *
002600941109     A            XSCINP    R               REFFLD(SIFINPUT)
002700941109      *
002800941109     A            XSCRGS    R               REFFLD(SIFRGS)
002900941109      *
003000941109     A            XSCVIA    R               REFFLD(SIFVIA)
003100941109      *
003200941111     A            XSCCIT    R               REFFLD(SIFLOCALIT)
003300941109      *
003400941111     A            XSCCDF    R               REFFLD(SIFCDFISC)
003500941109      *
003600941111     A            XSCIVA    R               REFFLD(SIFPARTIVA)
003700941109      *
003800941109     A            XSCCAP    R               REFFLD(SIFCAP)
003900941109      *
004000941111     A            XSCPRV    R               REFFLD(SIFPROV)
004100941109      *
004200941111     A            XSCSTA    R               REFFLD(SIFSTATO)
004300941109      *
004400941111     A            XSCTEL    R               REFFLD(SIFTELEFON)
004500941109      *
004600941111     A            XSCTLX    R               REFFLD(SIFTELEX)
004700941109      *
004800941111     A            XSCFAX    R               REFFLD(SIFTELEFAX)
004900941109      *
005000941109     A            XSCVSC    R               REFFLD(SIFVSC)
005100941109      *
005200941109     A            XSCCSC    R               REFFLD(SIFCSC)
005300941109      *
005400941109     A            XSCCAS    R               REFFLD(SIFCAS)
005500941109      *
005600941109     A            XSCPRS    R               REFFLD(SIFPRS)
005700941109      *
005800941109     A            XSCTLS    R               REFFLD(SIFTLS)
005900941109      *
006000941109     A            XSCCTI    R               REFFLD(SIFCTI)
006100941109      *
006200941111     A            XSCDTI    R               REFFLD(SIFDTISCC)
006300941109      *
006400941109     A            XSCESA    R               REFFLD(SIFESA)
006500941109      *
006600941111     A            XSCNCR    R               REFFLD(SIFNATGIUR)
006700941109      *
006800941111     A            XSCDAB    R               REFFLD(SIFDTAPBIL)
006900941109      *
007000941111     A            XSCDSA    R               REFFLD(SIFDTSCBIL)
007100941109      *
007200941111     A            XSCCCT    R               REFFLD(SIFISCCIAA)
007300941109      *
007400941111     A            XSCATT    R               REFFLD(SIFATCCIAA)
007500941205      *
007600941205     A            XSCCPC    R               REFFLD(SIFCAPOFCT)
007700941205      *
007800941205     A            XSCCPA    R               REFFLD(SIFCAPOFAN)
007900941205      *
008000941205     A            XSCSCF    R               REFFLD(SIFSOCFITT)
008100941205      *
008200941205     A            XSCCPF    R               REFFLD(SIFCAPOFSN)
008300941205      *
008400941205     A            XSCDFV    R               REFFLD(SIFDTFIVL)
008500941205      *
008600941205     A            XSCCDC    R               REFFLD(SIFCDCTL20)
008700941115     A*---------------------------------------------------------
008800941115     A* dati da ANUTN
008900941115     A*---------------------------------------------------------
009000941115     A*
009100941115     A            XSCUFF    R               REFFLD(UFFICIO ANDIZ00F)
009200941115     A*
009300941115     A            XSCGRP    R               REFFLD(GRUPPO ANDIZ00F)
009400941115     A*
009500941115     A            XSCCUT    R               REFFLD(UTENTE ANDIZ00F)
009600941115     A*
009700941115     A            XSCVFD    R               REFFLD(VRFGES ANDIZ00F)
009800941115     A*
009900950607     A            XSCF03         2          TEXT('A disposizione .............')
010000941115     A*
010100941115     A            XSCULM    R               REFFLD(LINGUA ANDIZ00F)
010200941115     A*---------------------------------------------------------
010300941115     A* dati di default profilo
010400941115     A*---------------------------------------------------------
010500941115     A*
010600941115     A            XSCDSO    R               REFFLD(SOCIETA ANDIZ00F)
010700941115     A            XSCDUN    R               REFFLD(UNITA ANDIZ00F)
010800941115     A            XSCDCO    R               REFFLD(CTB ANDIZ00F)
010900941117      *
011000941117     A            XSCON     R               REFFLD(SIFON)
011100941117     A            XSCOFF    R               REFFLD(SIFOFF)
011200950607     A*---------------------------------------------------------
011300950607     A* altri dati
011400950607     A*---------------------------------------------------------
011500950607      *
011600950607     A            XSCSIA    R               REFFLD(CDSIASI ANDIZ00F)
011700950607      *
011800950607     A            XSCSI2    R               REFFLD(CDSIASI ANDIZ00F)
011900941117      *
012000950607     A            XSCSYS    R               REFFLD(SYS ANDIZ00F)
012100951227     A            XSCSALDOC R               REFFLD(SIFSALDOC)
012200981106     A                                      TEXT('Libreria dati Home Banking .')
012300951227      *
012400951227     A            XSCSALDOA R               REFFLD(SIFSALDOA)
012500981106     A                                      TEXT('A disposizione .............')
012600981106      *
012700981106      * questa DS deve essere 1000 caratteri!
012800981106     A            FILLER       255          TEXT('LA DS DEVE ESSERE 1000 CHAR ')
