000100160705     H*PARMS MBR(*NONE)
000200160705     A*
000201160708R2322A* DS creata con le specifiche R2322
000500160705    >A                                      REF(*LIBL/ANDIZ00F)
000600160705     A*
000700160705    >A          R SDGSD44S
001300160705    >A            RETD44         1A
002000160705    >A            OPRD44         1A
002400160705     A*
002900160705    >A            ERRD44         1A
003300160705     A*
003700160705    >A            CMTD44         1A
003900160705    >A            SOCIETAD44R               REFFLD(SOCIETA )
004000160705    >A            SOGGD44   R               REFFLD(SOGG)
004100160705    >A            SYSD44    R               REFFLD(SYS)
004200160705    >A            NRASREGD44R               REFFLD(NR)
004201160711     A            WDWD44         1A
004500160705     A*
