000100150306     A*
000200150306     A                                      REF(ANDIZ00F)
000300150306     A*
000400150306     A          R SDGSK65S
000500150306     A*
000600150306     A            SOCK65    R               REFFLD(SOCIETA)
000700150306     A            LIBK65        10A         TEXT('Libreria dati')
000800150306     A            ANNOK65        4S 0       TEXT('Anno')
000900150306     A            ERRK65         1A
