000100980406     A*--------------------------------------------------------------*
000200170629     A* FILE ANAGRAFICO SOGGETTI A SPLIT PAYMENT                     *
000300980406     A*--------------------------------------------------------------*
000400170712     A                                      UNIQUE
000500170629     A          R ANSPI000                  PFILE(ANSPI00F)
000600170629     A          K SPIIVA
000601171207     A          K SPIDDE
