000100871021     A*--------------------------------------------------------------*
000200980406     A* FILE ANAGRAFICO CONTI                                        *
000300980406     A* NOTE: SE SI AGGIUNGONO DEI CAMPI, AGGIUNGERLI ANCHE ALLA 30C *
000400840614     A*--------------------------------------------------------------*
000500891005     A                                      REF(CNDIZION)
000600891005     A                                      UNIQUE
000700891005     A          R CNACO000                  TEXT('ANAGRAFICO P.D.C.')
000800840614     A            TRB02     R               REFFLD($TRB02)
000900840614     A            ATB02     R               REFFLD($ATB02)
001000840614     A            NRJOB     R               REFFLD($NRJOB)
001100840614     A            ACOFLG    R
001200840614     A            ACOKUT    R
001300840614     A            ACOKCC    R
001400840614     A            ACOKSC    R
001500840614     A            ACORAG    R
001600840614     A            ACOOPZ    R
001700060302     A            ACORX1    R               TEXT('DISP.MITTENTE IN ARRIVO 0=SI/-
001800060302     A                                      1=NO')
001900060302     A                                      COLHDG('DISP' 'MIT' 'ARR')
002000060302     A            ACORY1    R               TEXT('CHIUSURA AUTOMATICA GIACENZE -
002100060302     A                                      0=SI/1=NO')
002200060302     A                                      COLHDG('CHIU' 'AUT' 'GIAC')
002300060302     A            ACORZ1    R               TEXT('LIBERO')
002400060302     A            ACORX2    R               TEXT('LIBERO')
002500060302     A            ACORY2    R               TEXT('LIBERO')
002600060302     A            ACORZ2    R               TEXT('LIBERO')
002700060302     A            ACORX3    R               TEXT('LIBERO')
002800060302     A            ACORY3    R               TEXT('LIBERO')
002900060302     A            ACORZ3    R               TEXT('LIBERO')
003000060302     A            ACORX4    R               TEXT('LIBERO')
003100060302     A            ACORY4    R               TEXT('LIBERO')
003200060302     A            ACORZ4    R               TEXT('LIBERO')
003300840614     A            ACOTIC    R
003400840614     A            ACODUV    R
003500060302     A            ACOFID    R               TEXT('LIBERO')
003600840614     A            ACOABL    R
003700060302     A            ACOMEP    R               TEXT('LIBERO')
003800840614     A            ACODIV    R
003900060302     A            ACOFDO    R               TEXT('LIBERO')
004000891005     A            ACOLIB        11P 0       TEXT('VECCHIO CODICE')
004100891005     A                                      COLHDG('VECCHIO CODICE')
004200871204     A            ACOCTF         2A         TEXT('CATEGORIA FISCALE')
004300871204     A                                      COLHDG('CT' 'FS')
004400060302     A            ACOFPR         1A         TEXT('LIBERO')
004500060302     A            ACOITC         7P 0       TEXT('CATEGORIA SEAT')
004600060302     A                                      COLHDG('CAT' 'SEAT')
004700890906     A            ACODTR         6P 0       TEXT('NR.  TRASMISSIONE')
004800890606     A                                      COLHDG('TRASMIS.')
004900890606     A            ACOFTR         1A         TEXT('" "=DA TRAS "R"=RIC "T"=TRAS')
005000890606     A                                      COLHDG(' ' 'R' 'T')
005100890907     A*§  CAMPI AGGIUNTI  BARTOLINI
005200890907     A            ACOFTT    R               REFFLD($FTT)
005300890907     A            ACOFLT    R               REFFLD($FLT)
005400891005     A            ACOCE1    R               REFFLD($CDC)
005500060302     A                                      TEXT('LIBERO')
005600891005     A            ACOCE2    R               REFFLD($CDC)
005700060302     A                                      TEXT('LIBERO')
005800891005     A*
005900840614     A          K ACOKUT
006000840614     A          K ACOKCC
006100840614     A          K ACOKSC
