000100000000     A*--------------------------------------------------------------*
000200000000     A* FILE ANAGRAFICO INDIRIZZI LOGICO PER PARTITA IVA             *
000300000000     A*--------------------------------------------------------------*
000400890505     A                                      FIFO
000500000000     A          R CNIND000                  PFILE(CNIND00F)
000600000000     A          K INDKUT
000700890914     A          K INDKCC
000800000000     A          K INDIVA
000900000000     A          O INDIVA                    COMP(EQ '                ')
