000100000000     A*---------------------------------------------------------------**
000200000000     A*           FILE NUMERATORE AUTOMATICO FATTURE / NOTE          -**
000300000000     A*---------------------------------------------------------------**
000400000000     A          R CNNUM000                  TEXT('RECORD NUM. FATT./NOTE')
000500000000     A*-                                                               *
000600000000     A            NUMAAC         2  0       TEXT('ANNO DI COMPETENZA')
000700000000     A            NUMRGS         1  0       TEXT('NUMERO REGISTRO IVA')
000800891011     A            NUMLIB         3  0       TEXT('NUMERO LIBRO IVA')
000900000000     A            NUMNUM         7  0       TEXT('ULTIMO NUMERO PRELEVATO')
001000000000     A            NUMDTP         6  0       TEXT('DATA ULTIMO PRELIEVO')
001100000000     A*-                                                               *
001200000000     A          K NUMAAC
001300000000     A          K NUMRGS
001400000000     A          K NUMLIB
