000100871021     A*--------------------------------------------------------------*
000200920220     A* ANAGRAFICO CLIENTI BARTOLINI PER ARRICCHIMENTO SEAT
000300840614     A*--------------------------------------------------------------*
000600920210     A          R CNSEA000
001400920210     A            SEARAG        48A         TEXT('RAGIONE SOCIALE')
001500920210     A            SEAVIA        30A         TEXT('INDIRIZZO')
001600920210     A            SEACIT        30A         TEXT('LOCALITA ')
001700920210     A            SEACAP         5S 0       TEXT('C.A.P.')
001800920210     A            SEAPRV         2A         TEXT('SIGLA PROVINCIA "ITALIA"')
002100920210     A            SEATEL        16A         TEXT('NR.TELEFONO')
002601920210     A*
002603920220     A            SEACAT         5S 0       TEXT('COD.CATEGORIA SEAT')
002605920220     A            SEAMAC         4A         TEXT('COD.MACROCATEGORIA SEAT')
002606920220     A            SEATIP         1A         TEXT('COD.TIPOLOGIA SEAT')
002607920227     A            SEACOD         8S 0       TEXT('CODICE OPER.  SEAT')
002608920210     A*
002609920220     A            SEAKSC         7S 0       TEXT('COD.CLIENTE BARTOLINI')
002610920319     A*
002700920319     A            SEADCA        50A         TEXT('DESCRIZIONE CATEGORIA')
002800920319     A            SEADMA        50A         TEXT('DESCRIZIONE MACROCATEGORIA')
002900920319     A            SEADGR        50A         TEXT('DESCRIZIONE GRUPPO')
002901920323     A*        *
003000920323     A            SEAFIL         3S 0       TEXT('FILIALE')
003100920323     A            SEAARE         3S 0       TEXT('AREA')
003200920323     A            SEADIV         1A         TEXT('DIVISIONE')
003300920323     A*        *
003400920323     A            SEADFI        20A         TEXT('DESCR.FILIALE')
003500920323     A            SEADAR        20A         TEXT('DESCR.AREA')
003600920323     A            SEADDI        20A         TEXT('DESCR.DIVISIONE')
