000100871021     A*--------------------------------------------------------------*
000200920505     A* ANAGRAFICO CLIENTI POTENZIALI ACQUISTATI DA SEAT
000300840614     A*--------------------------------------------------------------*
000400920505     A          R CNSEA050
000500920505     A            SEA125         3A         TEXT('TIPO REC.:125')
000600920505     A            SEAFI1         5A         TEXT('FILLER')
000700920505     A            SEACRG         2S 0       TEXT('COD.REGIONE SEAT')
000800980730     A            SEACPR         3S 0       TEXT('COD.PROVINCIA SEAT')
000900920505     A            SEACCO         3S 0       TEXT('COD.COMUNE SEAT')
001000920507     A            SEAFI2        15A         TEXT('FILLER')
001100920505     A            SEACST         5S 0       TEXT('COD.STRADA SEAT')
001200920505     A            SEANOM        60A         TEXT('NOMINATIVO')
001300920505     A            SEAVIA        35A         TEXT('INDIRIZZO')
001400920505     A            SEACIT        34A         TEXT('LOCALITA ')
001500920210     A            SEACAP         5S 0       TEXT('C.A.P.')
001600920210     A            SEAPRV         2A         TEXT('SIGLA PROVINCIA "ITALIA"')
001700920505     A            SEAPTE         4S 0       TEXT('PREFISSO TELEFONO')
001800920505     A            SEATEL         8S 0       TEXT('NR.TELEFONO')
001900920505     A            SEACOD         8S 0       TEXT('CODICE OPER.  SEAT')
002000920505     A            SEAFGI         2S 0       TEXT('FORMA GIURIDICA')
002100920505     A            SEASEX         1A         TEXT('SESSO')
002200920505     A            SEALTE         3S 0       TEXT('NUMERO LINEE (OP2)')
002300980730     A            SEAFI3         3A         TEXT('FILLER')
002400920505     A            SEAMAC         4A         TEXT('COD.MACROCATEGORIA SEAT')
002500920505     A            SEACAT         5S 0       TEXT('COD.CATEGORIA SEAT')
002600980730     A            SEAFI4        12A         TEXT('FILLER')
002700980730     A            SEACHF         2A         TEXT('CODICE HITS FINANZIARIO')
002800980730     A            SEACTI         2A         TEXT('CODICE TITOLO')
002900920505     A            SEAPES        60A         TEXT('PAROLE ESPLICATIVE')
003000920505     A            SEAFI5        54A         TEXT('FILLER')
003100920505     A            SEADCA        60A         TEXT('DESCRIZIONE CATEGORIA')
