000100000614     A*%%TS  SD  20000614  143748  EDPFG       REL-V4R2M0  5769-PW1
000200000000     A*------------------------------------------------------------------------*
000300000614     A*%%EC
000400000614     A                                      DSPSIZ(24 80 *DS3)
000500000614     A                                      CHGINPDFT(HI CS)
000600000614     A                                      PRINT
000700000614     A                                      CF01
000800000614     A                                      CF02
000900000614     A                                      CF03
001000000614     A                                      CF04
001100000614     A                                      CF05
001200000614     A                                      CF06
001300000614     A                                      CF07
001400000614     A                                      CF08
001500000614     A                                      CF09
001600000614     A                                      CF10
001700000614     A                                      CF11
001800000614     A                                      CF12
001900000614     A                                      CF13
002000000614     A                                      CF14
002100000614     A                                      CF15
002200000614     A                                      CF16
002300000614     A                                      CF17
002400000614     A                                      CF18
002500000614     A                                      CF19
002600000614     A                                      CF20
002700000614     A                                      CF21
002800000614     A                                      CF22
002900000614     A                                      CF23
003000000614     A                                      CF24
003100000614     A                                      ROLLUP(97)
003200000614     A                                      ROLLDOWN(97)
003300000614     A                                      HELP
003400000000     A*------------------------------------------------------------------------*
003500010508     A          R SEA1DVT
003600000000     A*%%TS  SD  19950214  094756  EDPRN       REL-V2R3M0  5738-PW1
003700000000     A            VTDRSU        20A  O  1  2
003800000000     A                                  1 24'* STATISTICA DELTA PER FASCE DI PE-
003900000000     A                                      SO *'
004000000000     A                                      DSPATR(UL)
004100000000     A                                      DSPATR(RI)
004200010508     A                                  1 64'TISEA1R'
004300000000     A                                  1 73DATE
004400000000     A                                      EDTCDE(Y)
004500000000     A*------------------------------------------------------------------------*
004600010508     A          R SEA1DVF
004700000000     A                                      OVERLAY
004800000000     A            VFD001        19A  O 22  2
004900000000     A            VFD002        19A  O 22 22
005000000000     A            VFD003        19A  O 22 42
005100000000     A            VFD004        19A  O 22 62
005200000000     A            VFD005        19A  O 23  2
005300000000     A            VFD006        19A  O 23 22
005400000000     A            VFD007        19A  O 23 42
005500000000     A            VFD008        19A  O 23 62
005600000000     A*------------------------------------------------------------------------*
005700010508     A          R SEA1DV1
005800000614     A*%%TS  SD  20000614  143748  EDPFG       REL-V4R2M0  5769-PW1
005900000614     A                                      OVERLAY
006000000614     A                                  5  3'Anno/Mese iniziale ...:'
006100000614     A            V1CDAT         6Y 0B  5 28
006200000614     A N60                                  DSPATR(HI)
006300000614     A  60                                  DSPATR(RI)
006400000614     A  60                                  DSPATR(PC)
006500000614     A                                      CHECK(RB)
006600000614     A                                      EDTWRD('    /  ')
006700000614     A                                  6  3'Anno/Mese finale .....:'
006800000614     A            V1CDA2         6Y 0B  6 28
006900000614     A N61                                  DSPATR(HI)
007000000614     A  61                                  DSPATR(RI)
007100000614     A  61                                  DSPATR(PC)
007200000614     A                                      CHECK(RB)
007300000614     A                                      EDTWRD('    /  ')
007400000614     A                                  7  3'Statistica POSTE .....:'
007500000614     A            VIDPT          1A  B  7 28
007600000614     A  71                                  DSPATR(RI)
007700000614     A  71                                  DSPATR(PC)
007800000614     A                                  7 36'(S/N)'
007900130208     A                                  8  3'Stampa SOLO TOTALI ...:'
008000130208     A            V1CTOT         1A  B  8 28
008100130208     A  62                                  DSPATR(RI)
008200130208     A  62                                  DSPATR(PC)
008300130208     A                                  8 36'(S/N)'
008400130208     A                                 10  3'PARZIALIZZAZIONI'
008500000614     A                                      DSPATR(HI)
008600000614     A                                      DSPATR(UL)
008700130208     A                                 12  3'Delta Italia/Estero ..:'
008800130208     A            V1CIOE         1A  B 12 28
008900000614     A N72                                  DSPATR(HI)
009000000614     A  72                                  DSPATR(RI)
009100000614     A  72                                  DSPATR(PC)
009200130208     A                                 12 36'(I-Italia, E-Estero, '' ''-Tutto)'
009300000000     A*------------------------------------------------------------------------*
009400010508     A          R SEA1DVM                   SFL
009500000000     A                                      SFLMSGRCD(24)
009600000000     A            VMCKEY                    SFLMSGKEY
009700000000     A            VMCQUE                    SFLPGMQ
009800000000     A*------------------------------------------------------------------------*
009900010508     A          R SEA1DVK                   SFLCTL(SEA1DVM)
010000000000     A                                      OVERLAY
010100000000     A                                      SFLDSP
010200000000     A  40                                  SFLCLR
010300000000     A  44                                  SFLEND
010400000000     A                                      SFLSIZ(0002)
010500000000     A                                      SFLPAG(0001)
