000100000000     A*------------------------------------------------------------------------*
000200041220     A* DS PROCEDURA REPERIMENTO SALDI CLIENTE                                 *
000300000000     A*------------------------------------------------------------------------*
000400160408     A          R D72REC                    TEXT('DS REPERIMENTO SALDI CLIENTE')
000500041220     A*
000600160408     A            I72TLA         1          TEXT('S=SINGOLO; U=UNIFICANTE')
000700160408     A            I72TLE         2          TEXT('TIPO LEGAME X UNIFICANTE')
000800160408     A            I72KSC         7S 0       TEXT('CODICE CLIENTE')
000900160408     A            I72CTR         3A         TEXT('CODICE TARIFFA')
001000160408     A            I72DAI         6S 0       TEXT('AAAA/MM INIZIALE')
001100160408     A            I72DAF         6S 0       TEXT('AAAA/MM FINALE')
001800160408     A            O72ICMP       16S 3       TEXT('COMPETENZE LOGISTICA')
