000100091125     A*%%TS  SD  20091125  142436  EDPAB       REL-V5R4M0  5722-WDS
000200000000     A*---------------------------------------------------------------*
000300091125     A*%%EC
000400091125     A                                      DSPSIZ(24 80 *DS3)
000500091125     A                                      CHGINPDFT(HI CS)
000600091125     A                                      PRINT
000700091125     A                                      ERRSFL
000800091125     A                                      CA03
000900940926     A*
001000940926     A**-------------------------------------------------------------**
001100091125     A          R D01
001200091125     A*%%TS  SD  20091125  142436  EDPAB       REL-V5R4M0  5722-WDS
001300091125     A                                      CF06
001400091125     A                                      CF02
001500091125     A            D1C0SN         1A  H
001600091125     A            D1AMES         2Y 0H
001700091125     A            D1AANN         4Y 0H
001800091125     A                                  1  3SYSNAME
001900091125     A            KNSIF         10A  O  1 12
002000091125     A                                  1 25'*  Statistica Clienti con EXPORT  -
002100091125     A                                      *'
002200091125     A                                      DSPATR(RI)
002300091125     A                                      DSPATR(UL)
002400091125     A            NOMPGM        10A  O  1 61
002500091125     A                                  1 72DATE
002600091125     A                                      EDTCDE(Y)
002700091125     A            RSUT          20A  O  2  3
002800091125     A                                  2 25'*     su 12 mesi di fatturato     -
002900091125     A                                      *'
003000091125     A                                      DSPATR(RI)
003100091125     A                                      DSPATR(UL)
003200091125     A                                  2 61USER
003300091125     A                                  2 72TIME
003400091125     A                                  6 19'Periodo in esame'
003500091125     A                                      COLOR(WHT)
003600091125     A                                      DSPATR(RI)
003700091125     A                                 10 14'Fino   Anno/Mese'
003800091125     A                                      DSPATR(HI)
003900091125     A            D1ANNO         4Y 0B 10 35
004000091125     A  43
004100091125     AO 44                                  DSPATR(PC)
004200091125     A  44                                  ERRMSG('Data INCOMPLETA ...' 44)
004300091125     A                                      EDTCDE(8)
004400091125     A                                      DSPATR(CS)
004500091125     A                                      COMP(GT 0)
004600091125     A                                 10 40'/'
004700091125     A            D1MESE         2Y 0B 10 42
004800091125     A  43                                  DSPATR(PC)
004900091125     A                                      EDTCDE(8)
005000091125     A                                      DSPATR(CS)
005100091125     A  43                                  ERRMSG('L''Anno/Mese non è stato an-
005200091125     A                                      cora fatturato !!' 43)
005300091125     A                                      COMP(GT 0)
005400091125     A                                 10 48'Elabora 12 mesi fino al AAAA/MM'
005500091125     A                                 11 19'Stampa Elenco'
005600091125     A                                      DSPATR(ND)
005700091125     A            D1LIST         1A  B 11 35CHGINPDFT
005800091125     A                                      VALUES('S' 'N')
005900091125     A                                      DSPATR(ND)
006000091125     A                                      DSPATR(PR)
006100091125     A                                 11 38'S/N'
006200091125     A                                      DSPATR(ND)
006300091125     A                                 13 26'Network'
006400091125     A                                      DSPATR(ND)
006500091125     A                                 13 37'S/N'
006600091125     A                                      DSPATR(ND)
006700091125     A                                 14 28'DPD'
006800091125     A                                      DSPATR(ND)
006900091125     A            D1DPD          1A  B 14 38CHGINPDFT
007000091125     A                                      VALUES('S' 'N')
007100091125     A                                      DSPATR(ND)
007200091125     A                                      DSPATR(PR)
007300091125     A                                 15 28'EEX'
007400091125     A                                      DSPATR(ND)
007500091125     A            D1EEX          1A  B 15 38CHGINPDFT
007600091125     A                                      VALUES('S' 'N')
007700091125     A                                      DSPATR(ND)
007800091125     A                                      DSPATR(PR)
007900091125     A                                 16 28'FED'
008000091125     A                                      DSPATR(ND)
008100091125     A            D1FED          1A  B 16 38CHGINPDFT
008200091125     A                                      VALUES('S' 'N')
008300091125     A                                      DSPATR(ND)
008400091125     A                                      DSPATR(PR)
008500091125     A                                 23  9'F3=Fine'
008600091125     A                                 23 33'F6=Conferma'
008700060111     A          R W01
008800060111     A*%%TS  SD  20060111  095651  EDPAB       REL-V5R3M0  5722-WDS
008900060111     A                                      WINDOW(9 6 10 60)
009000060111     A                                      OVERLAY
009100060111     A                                  2  3'Ricordarsi di cambiare la JOBQ dur-
009200060111     A                                      ante la sottomissione'
009300060111     A                                  3  3'Occorrono circa 5 ore x eseguire l-
009400060111     A                                      a statistica'
009500060111     A                                  4  3'Vengono letti i 12 mesi da TITAS e-
009600060111     A                                       di Default la JOBQ'
009700060111     A                                  5  3'è la KSDIFFE. Altri lavori potrebb-
009800060111     A                                      ero rimanere in coda'
009900060111     A                                  6  3'x 5 ore aspettando che questo lavo-
010000060111     A                                      ro finisca.'
010100060111     A                                  7 11'Cambiare la JOBQ !!!!!'
010200060111     A                                  8  5'Lanciarla durante ora di pranzo - -
010300060111     A                                      orario migliore'
010400060111     A                                  9  8'F3-Fine Lavoro'
