000010140613     A*%%TS  SD  20140613  105151  EDPAB       REL-V7R1M0  5770-WDS
000020970821     A*------------------------------------------------------------------------*
000030140613     A*%%EC
000040140613     A                                      DSPSIZ(24 80 *DS3)
000050140613     A                                      CHGINPDFT(HI CS)
000060140613     A                                      PRINT
000070140613     A                                      HLPTITLE('Descrizione Campi Video')
000080140613     A                                      HLPPNLGRP(LABEL TISE90DH)
000090140613     A                                      ERRSFL
000100140613     A                                      CF01
000110140613     A                                      CF02
000120140613     A                                      CF03
000130140613     A                                      CF04
000140140613     A                                      CF05
000150140613     A                                      CF06
000160140613     A                                      CF07
000170140613     A                                      CF08
000180140613     A                                      CF09
000190140613     A                                      CF10
000200140613     A                                      CF11
000210140613     A                                      CF12
000220140613     A                                      CF13
000230140613     A                                      CF14
000240140613     A                                      CF15
000250140613     A                                      CF16
000260140613     A                                      CF17
000270140613     A                                      CF18
000280140613     A                                      CF19
000290140613     A                                      CF20
000300140613     A                                      CF21
000310140613     A                                      CF22
000320140613     A                                      CF23
000330140613     A                                      CF24
000340140613     A                                      ROLLUP(97)
000350140613     A                                      ROLLDOWN(97)
000360140613     A                                      HELP
000370000000     A*------------------------------------------------------------------------*
000380020116     A          R SE90DVT
000390980528     A            DSFIRS        20A  O  1  2
000400980528     A                                  1 27'***  STATISTICHE DELTA  ***'
000410980528     A                                      DSPATR(UL)
000420980528     A                                      DSPATR(RI)
000430020116     A                                  1 60'TISE90R'
000440980528     A                                  1 72DATE
000450980528     A                                      EDTCDE(Y)
000460980528     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000470980528     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000480980528     A                                  2 72TIME
000490000000     A*------------------------------------------------------------------------*
000500020116     A          R SE90DVF
000510000000     A                                      OVERLAY
000520000000     A            VFD001        19A  O 22  2
000530000000     A            VFD002        19A  O 22 22
000540000000     A            VFD003        19A  O 22 42
000550000000     A            VFD004        19A  O 22 62
000560000000     A            VFD005        19A  O 23  2
000570000000     A            VFD006        19A  O 23 22
000580000000     A            VFD007        19A  O 23 42
000590000000     A            VFD008        19A  O 23 62
000600000000     A*------------------------------------------------------------------------*
000610140613     A          R SE90DV1
000620140613     A*%%TS  SD  20140613  105151  EDPAB       REL-V7R1M0  5770-WDS
000630140613     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
000640140613     A                                      CSRLOC(H1RIGA     H1COLO)
000650140613     A                                      OVERLAY
000660140613     A          H                           HLPPNLGRP(V1CDAT TISE90DH)
000670140613     A                                      HLPARA(*FLD V1CDAT)
000680140613     A          H                           HLPPNLGRP(V1CDA2 TISE90DH)
000690140613     A                                      HLPARA(*FLD V1CDA2)
000700140613     A          H                           HLPPNLGRP(V1CFPC TISE90DH)
000710140613     A                                      HLPARA(*FLD V1CFPC)
000720140613     A          H                           HLPPNLGRP(V1CPDD TISE90DH)
000730140613     A                                      HLPARA(*FLD V1CPDD)
000740140613     A          H                           HLPPNLGRP(V1CPDA TISE90DH)
000750140613     A                                      HLPARA(*FLD V1CPDA)
000760140613     A          H                           HLPPNLGRP(V1CDFD TISE90DH)
000770140613     A                                      HLPARA(*FLD V1CDFD)
000780140613     A          H                           HLPPNLGRP(V1CDFA TISE90DH)
000790140613     A                                      HLPARA(*FLD V1CDFA)
000800140613     A          H                           HLPPNLGRP(V1CDFDP TISE90DH)
000810140613     A                                      HLPARA(*FLD V1CDFDP)
000820140613     A          H                           HLPPNLGRP(V1CDFAP TISE90DH)
000830140613     A                                      HLPARA(*FLD V1CDFAP)
000840140613     A          H                           HLPPNLGRP(V1CSPD TISE90DH)
000850140613     A                                      HLPARA(*FLD V1CSPD)
000860140613     A          H                           HLPPNLGRP(V1CCLV TISE90DH)
000870140613     A                                      HLPARA(*FLD V1CCLV)
000880140613     A          H                           HLPPNLGRP(V1CCL1 TISE90DH)
000890140613     A                                      HLPARA(*FLD V1CCL1)
000900140613     A          H                           HLPPNLGRP(V1CCL2 TISE90DH)
000910140613     A                                      HLPARA(*FLD V1CCL2)
000920140613     A          H                           HLPPNLGRP(V1CCL3 TISE90DH)
000930140613     A                                      HLPARA(*FLD V1CCL3)
000940140613     A          H                           HLPPNLGRP(V1CCL4 TISE90DH)
000950140613     A                                      HLPARA(*FLD V1CCL4)
000960140613     A          H                           HLPPNLGRP(V1CTSP TISE90DH)
000970140613     A                                      HLPARA(*FLD V1CTSP)
000980140613     A          H                           HLPPNLGRP(V1CIOE TISE90DH)
000990140613     A                                      HLPARA(*FLD V1CIOE)
001000140613     A          H                           HLPPNLGRP(V1CSCE TISE90DH)
001010140613     A                                      HLPARA(*FLD V1CSCE)
001020140613     A          H                           HLPPNLGRP(V1CDCK TISE90DH)
001030140613     A                                      HLPARA(*FLD V1CDCK)
001040140613     A          H                           HLPPNLGRP(V1CDFF TISE90DH)
001050140613     A                                      HLPARA(*FLD V1CDFF)
001060140613     A          H                           HLPPNLGRP(V1CDCC TISE90DH)
001070140613     A                                      HLPARA(*FLD V1CDCC)
001080140613     A          H                           HLPPNLGRP(V1CNTW TISE90DH)
001090140613     A                                      HLPARA(*FLD V1CNTW)
001100140613     A          H                           HLPPNLGRP(V1CDCF TISE90DH)
001110140613     A                                      HLPARA(*FLD V1CDCF)
001120140613     A          H                           HLPPNLGRP(V1CSIN TISE90DH)
001130140613     A                                      HLPARA(*FLD V1CSIN)
001140140613     A          H                           HLPPNLGRP(V1CFIC TISE90DH)
001150140613     A                                      HLPARA(*FLD V1CFIC)
001160140613     A          H                           HLPPNLGRP(V1CCOF TISE90DH)
001170140613     A                                      HLPARA(*FLD V1CCOF)
001180140613     A          H                           HLPPNLGRP(V1CARC TISE90DH)
001190140613     A                                      HLPARA(*FLD V1CARC)
001200140613     A          H                           HLPPNLGRP(V1CDIF TISE90DH)
001210140613     A                                      HLPARA(*FLD V1CDIF)
001220140613     A          H                           HLPPNLGRP(V1CDIC TISE90DH)
001230140613     A                                      HLPARA(*FLD V1CDIC)
001240140613     A          H                           HLPPNLGRP(V1CWCP TISE90DH)
001250140613     A                                      HLPARA(*FLD V1CWCP)
001260140613     A          H                           HLPPNLGRP(V1CWPC TISE90DH)
001270140613     A                                      HLPARA(*FLD V1CWPC)
001280140613     A            H1NMRC        10A  H      TEXT('Nome Record')
001290140613     A            H1NMFL        10A  H      TEXT('Nome Campo')
001300140613     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
001310140613     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
001320140613     A                                      ore')
001330140613     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
001340140613     A                                      ursore')
001350140613     A            V1CPOS         1A  H
001360140613     A                                  3 49'Crea Files x elab.PC.:'
001370140613     A                                      DSPATR(HI)
001380140613     A            V1CFPC         1A  B  3 72VALUES('S' 'N')
001390140613     A N73                                  DSPATR(HI)
001400140613     A  73                                  DSPATR(RI)
001410140613     A  73                                  DSPATR(PC)
001420140613     A                                  3 74'(S/N)'
001430140613     A                                  4  2'X Cliente/Unificante:'
001440140613     A                                      DSPATR(HI)
001450140613     A            V1CSCE         1A  B  4 24
001460140613     A N78                                  DSPATR(HI)
001470140613     A  78                                  DSPATR(RI)
001480140613     A  78                                  DSPATR(PC)
001490140613     A                                  4 26'(C/U)'
001500140613     A                                  4 52'WADELPCF/WADEAPCI -> Italia'
001510140613     A                                  5  2'Dati in statistica .:'
001520140613     A                                      DSPATR(HI)
001530140613     A            V1CIOE         1A  B  5 24
001540140613     A N72                                  DSPATR(HI)
001550140613     A  72                                  DSPATR(RI)
001560140613     A  72                                  DSPATR(PC)
001570140613     A                                      VALUES('I' 'E' 'T')
001580140613     A                                  5 26'(I/E/T=Italia+Estero)'
001590140613     A                                  5 52'WADELPCE/WADEAPCE -> Estero'
001600140613     A                                  6  2'Anno/Mese iniziale .:'
001610140613     A            V1CDAT         6Y 0B  6 24
001620140613     A N60                                  DSPATR(HI)
001630140613     A  60                                  DSPATR(RI)
001640140613     A  60                                  DSPATR(PC)
001650140613     A                                      CHECK(RB)
001660140613     A                                      EDTWRD('    /  ')
001670140613     A                                  6 32'(aaaa/mm)'
001680140613     A                                  6 52'WADELPCT/WADEAPCT -> Totale'
001690140613     A                                  7  2'Anno/Mese finale ...:'
001700140613     A            V1CDA2         6Y 0B  7 24
001710140613     A N61                                  DSPATR(HI)
001720140613     A  61                                  DSPATR(RI)
001730140613     A  61                                  DSPATR(PC)
001740140613     A                                      CHECK(RB)
001750140613     A                                      EDTWRD('    /  ')
001760140613     A                                  7 32'(aaaa/mm)'
001770140613     A                                  7 49'Crea file'
001780140613     A                                      DSPATR(HI)
001790140613     A                                  7 59'(WFTISE93F):'
001800140613     A            V1CWCP         1A  B  7 72VALUES('S' 'N')
001810140613     A N79                                  DSPATR(HI)
001820140613     A  79                                  DSPATR(RI)
001830140613     A  79                                  DSPATR(PC)
001840140613     A                                  7 74'(S/N)'
001850140613     A                                  8 49'Crea file'
001860140613     A                                      DSPATR(HI)
001870140613     A                                  8 59'(WFTISE94F):'
001880140613     A            V1CWPC         1A  B  8 72VALUES('S' 'N')
001890140613     A N80                                  DSPATR(HI)
001900140613     A  80                                  DSPATR(RI)
001910140613     A  80                                  DSPATR(PC)
001920140613     A                                  8 74'(S/N)'
001930140613     A                                  9  2'SELEZIONI                         -
001940140613     A                                                                         -
001950140613     A                                               '
001960140613     A                                      DSPATR(HI)
001970140613     A                                      DSPATR(UL)
001980140613     A                                 10  2'Tipo servizio .........?:'
001990140613     A            V1CTSP    R        B 10 28REFFLD(SDCTSP SISDC00F)
002000140613     A N71                                  DSPATR(HI)
002010140613     A  71                                  DSPATR(RI)
002020140613     A  71                                  DSPATR(PC)
002030140613     A            V1DTSP        15A  O 10 30
002040140613     A                                 10 47'Qualità cliente.?:'
002050140613     A            V1CCLV         1A  B 10 66
002060140613     A N50                                  DSPATR(HI)
002070140613     A  50                                  DSPATR(RI)
002080140613     A  50                                  DSPATR(PC)
002090140613     A            V1CCL1         1A  B 10 69
002100140613     A N51                                  DSPATR(HI)
002110140613     A  51                                  DSPATR(RI)
002120140613     A  51                                  DSPATR(PC)
002130140613     A            V1CCL2         1A  B 10 72
002140140613     A N52                                  DSPATR(HI)
002150140613     A  52                                  DSPATR(RI)
002160140613     A  52                                  DSPATR(PC)
002170140613     A            V1CCL3         1A  B 10 75
002180140613     A N53                                  DSPATR(HI)
002190140613     A  53                                  DSPATR(RI)
002200140613     A  53                                  DSPATR(PC)
002210140613     A            V1CCL4         1A  B 10 78
002220140613     A N54                                  DSPATR(HI)
002230140613     A  54                                  DSPATR(RI)
002240140613     A  54                                  DSPATR(PC)
002250140613     A                                 11  2'% scost.delta totale ...:'
002260140613     A            V1CPDD         4Y 1B 11 28CHECK(RB)
002270140613     A N75                                  DSPATR(HI)
002280140613     A  75                                  DSPATR(RI)
002290140613     A  75                                  DSPATR(PC)
002300140613     A                                      EDTCDE(Q)
002310140613     A                                 11 35'a'
002320140613     A            V1CPDA         4Y 1B 11 37CHECK(RB)
002330140613     A N76                                  DSPATR(HI)
002340140613     A  76                                  DSPATR(RI)
002350140613     A  76                                  DSPATR(PC)
002360140613     A                                      EDTCDE(Q)
002370140613     A                                 11 47'% scost.delta per fasce :'
002380140613     A            V1CSPD         4Y 1B 11 73CHECK(RB)
002390140613     A N74                                  DSPATR(HI)
002400140613     A  74                                  DSPATR(RI)
002410140613     A  74                                  DSPATR(PC)
002420140613     A                                      EDTCDE(Q)
002430140613     A                                 12  2'% scost.fatt.AP mese da.:'
002440140613     A            V1CDFD         4Y 1B 12 28CHECK(RB)
002450140613     A N46                                  DSPATR(HI)
002460140613     A  46                                  DSPATR(RI)
002470140613     A  46                                  DSPATR(PC)
002480140613     A                                      EDTCDE(Q)
002490140613     A                                 12 35'a'
002500140613     A            V1CDFA         4Y 1B 12 37CHECK(RB)
002510140613     A N47                                  DSPATR(HI)
002520140613     A  47                                  DSPATR(RI)
002530140613     A  47                                  DSPATR(PC)
002540140613     A                                      EDTCDE(Q)
002550140613     A                                 12 47'prog.da:'
002560140613     A            V1CDFDP        4Y 1B 12 56CHECK(RB)
002570140613     A N48                                  DSPATR(HI)
002580140613     A  48                                  DSPATR(RI)
002590140613     A  48                                  DSPATR(PC)
002600140613     A                                      EDTCDE(Q)
002610140613     A                                 12 63'a:'
002620140613     A            V1CDFAP        4Y 1B 12 66CHECK(RB)
002630140613     A N49                                  DSPATR(HI)
002640140613     A  49                                  DSPATR(RI)
002650140613     A  49                                  DSPATR(PC)
002660140613     A                                      EDTCDE(Q)
002670140613     A                                 14  2'STATISTICHE GRUPPO (A)            '
002680140613     A                                      DSPATR(HI)
002690140613     A                                      DSPATR(UL)
002700140613     A                                 14 46' STATISTICHE GRUPPO (B)           '
002710140613     A                                      DSPATR(HI)
002720140613     A                                      DSPATR(UL)
002730140613     A                                 15  2'Delta di Filiale .......:'
002740140613     A            V1CDCK         1A  B 15 28
002750140613     A N62                                  DSPATR(HI)
002760140613     A  62                                  DSPATR(RI)
002770140613     A  62                                  DSPATR(PC)
002780140613     A                                 15 30'(S/N)'
002790140613     A                                 15 47'Delta Commerciale .....:'
002800140613     A            V1CDFF         1A  B 15 72
002810140613     A N68                                  DSPATR(HI)
002820140613     A  68                                  DSPATR(RI)
002830140613     A  68                                  DSPATR(PC)
002840140613     A                                 15 74'(S/N)'
002850140613     A                                 16  2'Delta di Area ..........:'
002860140613     A            V1CDCC         1A  B 16 28
002870140613     A N63                                  DSPATR(HI)
002880140613     A  63                                  DSPATR(RI)
002890140613     A  63                                  DSPATR(PC)
002900140613     A                                 16 30'(S/N)'
002910140613     A                                 16 47'Rottura network esteri.:'
002920140613     A            V1CNTW         1A  B 16 72VALUES('S' 'N')
002930140613     A                                 16 74'(S/N)'
002940140613     A                                 17  2'Delta di Divisione .....:'
002950140613     A            V1CDCF         1A  B 17 28
002960140613     A N64                                  DSPATR(HI)
002970140613     A  64                                  DSPATR(RI)
002980140613     A  64                                  DSPATR(PC)
002990140613     A                                 17 30'(S/N)'
003000140613     A                                 17 47'Sintetica .............:'
003010140613     A            V1CSIN         1A  B 17 72VALUES('S' 'N')
003020140613     A                                 17 74'(S/N)'
003030140613     A                                 18  2'SELEZIONI (A)'
003040140613     A                                      DSPATR(HI)
003050140613     A                                 18 47'SELEZIONI (B)'
003060140613     A                                      DSPATR(HI)
003070140613     A                                 19  2'Punto operativo .......?:'
003080140613     A            V1CFIC         3A  B 19 28
003090140613     A N65                                  DSPATR(HI)
003100140613     A  65                                  DSPATR(RI)
003110140613     A  65                                  DSPATR(PC)
003120140613     A                                      CHECK(RB)
003130140613     A                                 19 47'Raggruppamento agente.?:'
003140140613     A            V1CCOF         7A  B 19 72
003150140613     A N69                                  DSPATR(HI)
003160140613     A  69                                  DSPATR(RI)
003170140613     A  69                                  DSPATR(PC)
003180140613     A                                      CHECK(RB)
003190140613     A                                 20  2'Area ..................?:'
003200140613     A            V1CARC         3A  B 20 28
003210140613     A N66                                  DSPATR(HI)
003220140613     A  66                                  DSPATR(RI)
003230140613     A  66                                  DSPATR(PC)
003240140613     A                                      CHECK(RB)
003250140613     A                                 20 47'Divisione commerciale.?:'
003260140613     A            V1CDIF         1A  B 20 72
003270140613     A N70                                  DSPATR(HI)
003280140613     A  70                                  DSPATR(RI)
003290140613     A  70                                  DSPATR(PC)
003300140613     A                                 21  2'Divisione .............?:'
003310140613     A            V1CDIC         1A  B 21 28
003320140613     A N67                                  DSPATR(HI)
003330140613     A  67                                  DSPATR(RI)
003340140613     A  67                                  DSPATR(PC)
003350140613     A                                 21 30'                                  -
003360140613     A                                                      '
003370140613     A                                      DSPATR(UL)
003380000000     A*------------------------------------------------------------------------*
003390020116     A          R SE90DVM                   SFL
003400000000     A                                      SFLMSGRCD(24)
003410000000     A            VMCKEY                    SFLMSGKEY
003420000000     A            VMCQUE                    SFLPGMQ
003430000000     A*------------------------------------------------------------------------*
003440020116     A          R SE90DVK                   SFLCTL(SE90DVM)
003450000000     A                                      OVERLAY
003460000000     A                                      SFLDSP
003470000000     A  40                                  SFLCLR
003480000000     A  44                                  SFLEND
003490000000     A                                      SFLSIZ(0002)
003500000000     A                                      SFLPAG(0001)
003510100510     A*--------------------------------------------------------*
003520100510     A          R WIN_ALERT
003530100510     A*%%TS  SD  20100510  164226  EDPAB       REL-V5R4M0  5722-WDS
003540100510     A                                      WINDOW(12 5 9 60)
003550100510     A                                      RTNCSRLOC(&H4NMRC &H4NMFL &H4POSC)
003560100510     A                                      CSRLOC(H4RIGA     H4COLO)
003570100510     A                                      OVERLAY
003580100510     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
003590100510     A                                          '))
003600100510     A            H4NMRC        10A  H      TEXT('Nome Record')
003610100510     A            H4NMFL        10A  H      TEXT('Nome Campo')
003620100510     A            H4POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
003630100510     A            H4RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
003640100510     A                                      ore')
003650100510     A            H4COLO         3S 0H      TEXT('Colonna dove posizionare il c-
003660100510     A                                      ursore')
003670100510     A            H4NRC          7S 0H      TEXT('NUMERO UNIVOCO')
003680100510     A            H4RECTRS       9S 0H      TEXT('NREL REC TRS')
003690100510     A            H4RECTRA       9S 0H      TEXT('NREL REC TRA')
003700100510     A                                  2  5' A T T E N Z I O N E : '
003710100510     A                                      DSPATR(UL)
003720100510     A                                  4  8'NELLA libreria di BUDGET non sono -
003730100510     A                                      presenti tutti'
003740100510     A                                  5  9'i Files necessari alla elaborazion-
003750100510     A                                      e.'
003760100510     A                                  6  2'Possono essere ricoperti dati elab-
003770100510     A                                      orati dal DELTA mensile.'
003780100510     A                                      DSPATR(RI)
003790100510     A                                  8 33'Enter x avanzare'
