000001080403     A*%%***********************************************************************
000002080403     A*%%TS  RD  20080403  100514  EDPES       REL-V5R4M0  5722-WDS
000003080403     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004080403     A*%%FI       0000000000000000000000000000000000000000000000000
000005080403     A*%%EC
000006080403     A*%%***********************************************************************
000007080403     A          R LRV7PT1
000008080403     A*%%***********************************************************************
000009080403     A*%%RI 00000
000010080403     A*%%***********************************************************************
000011080403     A            RSUT          20   O     1
000012080403     A                                      SKIPB(001)
000013080403     A N99                                75
000014080403     A                                      '*** LISTA DI CONTROLLO SPUNTE DOPP-
000015080403     A                                      IE ***'
000016080403     A                                      HIGHLIGHT
000017080403     A                                   135
000018080403     A                                      'FNLRV7R'
000019080403     A                                   165
000020080403     A                                      DATE(*YY)
000021080403     A                                      EDTCDE(8)
000022080403     A                                   186
000023080403     A                                      'PAG:'
000024080403     A                                   190
000025080403     A                                      PAGNBR
000026080403     A                                      EDTCDE(Z)
000027080403     A*
000028080403     A            KNMUS         10   O     1
000029080403     A                                      SKIPB(002)
000030080403     A            KNSIF         10   O    12
000031080403     A                                   165
000032080403     A                                      TIME
000033080403     A                                    22
000034080403     A                                      'SELEZIONI: Ambito'
000035080403     A                                      SPACEB(002)
000036080403     A            STPTBO         8A  O    +1
000037080403     A                                      HIGHLIGHT
000038080403     A                                    +3
000039080403     A                                      'Ricorrenze'
000040080403     A            STPMINR        1S 0O    +1
000041080403     A                                      HIGHLIGHT
000042080403     A            STPDSIP       40A  O    64
000043080403     A                                   114
000044080403     A                                      'Filiale'
000045080403     A            STPFIL         4A  O   122
000046080403     A                                      HIGHLIGHT
000047080403     A            STPDFIL       15A  O   127
000048080403     A                                      HIGHLIGHT
000049080403     A                                   145
000050080403     A                                      'Data'
000051080403     A            STPDELA        8S 0O   150
000052080403     A                                      EDTWRD('  /  /    ')
000053080403     A                                      HIGHLIGHT
000054080403     A                                   163
000055080403     A                                      'Foglio'
000056080403     A            STPNPG         1S 0O   170
000057080403     A                                      EDTCDE(4)
000058080403     A                                      HIGHLIGHT
000059080403     A                                   171
000060080403     A                                      '-'
000061080403     A            STPNFV         6S 0O   172
000062080403     A                                      EDTCDE(2)
000063080403     A                                      HIGHLIGHT
000064080403     A                                     1
000065080403     A                                      '-------- SPEDIZIONE -------'
000066080403     A                                      SKIPB(006)
000067080403     A                                    29
000068080403     A                                      '----- M I T T E N T E -----'
000069080403     A                                    57
000070080403     A                                      '--- D E S T I N A T A R I O ---'
000071080403     A                                    92
000072080403     A                                      'Segnacolli'
000073080403     A                                   108
000074080403     A                                      'S E G N A C O L L O   D O P P I O'
000075080403     A                                   144
000076080403     A                                      '---- S  P  U  N  T  A  T  O      D-
000077080403     A                                        A ----'
000078080403     A                                     1
000079080403     A                                      'Lnp'
000080080403     A                                      SKIPB(007)
000081080403     A                                     5
000082080403     A                                      'Ser-Numero'
000083080403     A                                    16
000084080403     A                                      ' Data   '
000085080403     A                                    +0
000086080403     A                                      ' LNA'
000087080403     A                                    +1
000088080403     A                                      'RagioneSociale Località    '
000089080403     A                                    +1
000090080403     A                                      'RagioneSociale  Località       '
000091080403     A                                    +3
000092080403     A                                      'DAL'
000093080403     A                                    +2
000094080403     A                                      '/'
000095080403     A                                    +3
000096080403     A                                      ' AL'
000097080403     A                                    +4
000098080403     A                                      'Numero'
000099080403     A                                   115
000100080403     A                                      '-------- Chi  Sono ---------'
000101080403     A                                     1
000102080403     A                                      '-----------------------------------
000103080403     A                                      ------------------------------------
000104080403     A                                      ------------------------------------
000105080403     A                                      ------------------------------------
000106080403     A                                      ------------------------------------
000107080403     A                                      ------------------------'
000108080403     A                                      SKIPB(008)
000109080403     A*%%***********************************************************************
000110080403     A*%%SS
000111080403     A*%%CL 001
000112080403     A*%%CL 002
000113080403     A*%%CL 002
000114080403     A*%%CL 001
000115080403     A*%%CL 001
000116080403     A*%%***********************************************************************
000117080403     A*
000118080403     A          R LRV7PD1
000119080403     A*%%***********************************************************************
000120080403     A*%%RI 00000
000121080403     A*%%***********************************************************************
000122080403     A                                      SPACEB(001)
000123080403     A            STPLNP         3  0O     1
000124080403     A                                      EDTCDE(4)
000125080403     A            STPNRS         2  0O     5
000126080403     A                                      EDTCDE(4)
000127080403     A            TRA01          1A  O    +0
000128080403     A            STPNSP         7  0O     8
000129080403     A                                      EDTCDE(4)
000130080403     A            STPDSP         6S 0O    16
000131080403     A                                      EDTWRD('  /  /  ')
000132080403     A            STPLNA         3  0O    25
000133080403     A            STPRSM        14   O    29
000134080403     A            STPLOM        12   O    44
000135080403     A            STPRSD        15A  O    57
000136080403     A            STPLOD        15A  O    73
000137080403     A            STPNCD         7S 0O    89
000138080403     A                                      EDTCDE(4)
000139080403     A                                    96
000140080403     A                                      '/'
000141080403     A            STPNCA         7S 0O    97
000142080403     A                                      EDTCDE(4)
000143080403     A            STPNSC         7S 0O   106
000144080403     A                                      EDTCDE(4)
000145080403     A            STPCHS        30A  O   114
000146080403     A            STPDOP        54A  O   145
000147080403     A*%%***********************************************************************
000148080403     A*%%SS
000149080403     A*%%***********************************************************************
000150080403     A          R LRV7PD2
000151080403     A*%%***********************************************************************
000152080403     A*%%RI 00000
000153080403     A*%%***********************************************************************
000154080403     A                                      SPACEB(001)
000155080403     A            STPNSC         7S 0O   106
000156080403     A                                      EDTCDE(4)
000157080403     A            STPDOP        54A  O   145
000158080403     A*%%***********************************************************************
000159080403     A*%%SS
000160080403     A*%%***********************************************************************
000161080403     A*
000162080403     A          R LRV7PD3
000163080403     A*%%***********************************************************************
000164080403     A*%%RI 00000
000165080403     A*%%***********************************************************************
000166080403     A                                      SPACEB(001)
000167080403     A*%%***********************************************************************
000168080403     A*%%SS
000169080403     A*%%***********************************************************************
000170080403     A          R LRV7PFINE
000171080403     A*%%***********************************************************************
000172080403     A*%%RI 00000
000173080403     A*%%FS 001
000174080403     A*%%***********************************************************************
000175080403     A                                      SPACEB(002)
000176080403     A                                     2
000177080403     A                                      'Totale colli:'
000178080403     A            TOTALE         9S 0O    +1
000179080403     A                                      EDTCDE(2)
000180080403     A
000181080403     A                                    90
000182080403     A                                      '** FINE STAMPA **'
000183080403     A                                      SPACEB(001)
000184080403     A*%%***********************************************************************
000185080403     A*%%SS
000186080403     A*%%CL 001
000187080403     A*%%CP+999CRTPRTF
000188080403     A*%%CP+    OVRFLW(66)
000189080403     A*%%CP+    FILE(GAITRAFIL/FNLRV7P)
000190080403     A*%%CP+    DEVTYPE(*SCS)
000191080403     A*%%CP     PAGESIZE(*N       198      *N     )
000192080403     A*%%***********************************************************************
000193080403      *----
