000100950929     A*------------------------------------------------------------------------*
000200111114     A          R WFATR89
000300041014      *
000400111114     A            F89DAL         8S 0       TEXT('DA DATA')
000500040826     A                                      COLHDG('DA DATA')
000600040826      *
000700111115     A            F89AL          8S 0       TEXT('A DATA')
000800040826     A                                      COLHDG('DA DATA')
000900111115      *
001000111115     A            F89GIO         8S 0       TEXT('IL GIORNO')
001100111115     A                                      COLHDG('IL GIORNO')
001200111114      *
001300111114     A            F89LNA         3S 0       TEXT('LINEA ARRIVO')
001400111114     A                                      COLHDG('LINEA ARRIVO')
001500040826      *
001600111114     A            F89NSP         7S 0       TEXT('NR SPEDIZIONI')
001700111114     A                                      COLHDG('NR SPEDIZIONI')
001800111114      *
001900111114     A            F89ATR         7S 0       TEXT('NR SPED.CON ATR')
002000111114     A                                      COLHDG('NR SPED.CON ATR')
002100111114      *
002200111114     A            F89NON         7S 0       TEXT('NR SPED.SENZA ATR')
002300111114     A                                      COLHDG('NR SPED.SENZA ATR')
002400111114      *
002500111114     A            F89PRC         9S 3       TEXT('PERCENTUALE SENZA ATR')
002600111114     A                                      COLHDG('PERC.SENZA ATR')
002700040826      *
