000010110705     A*%%TS  SD  20110705  111751  EDPRM       REL-V6R1M0  5761-WDS
000020940715     A*** FILE : FNLS01D *--------------------------------------------*
000030900516     A*          IMMISSIONE BOLLE                                      *
000040000000     A***-------------------------------------------------------------**
000050110705     A*%%EC
000060110705     A                                      DSPSIZ(24 80 *DS3)
000070110705     A                                      PRINT
000080940715     A***-------------------------------------------------------------**
000090940715     A*  VIDEATA DI PERSONALIZZAZIONE
000100940715     A***-------------------------------------------------------------**
000110070801     A          R LS01D00
000120070801     A*%%TS  SD  20070801  125421  EDPRM       REL-V5R3M0  5722-WDS
000130070801     A                                      CA03
000140070801     A                                      CF08
000150070801     A N12                                  CF20
000160070801     A                                      CF06
000170070801     A                                      CSRLOC(H0RIGA     H0COLO)
000180070801     A  90        VIDMSG        78   M
000190070801     A            AT0POE         1A  P
000200070801     A            AT0ORM         1A  P
000210070801     A            AT0DOR         1A  P
000220070801     A            AT0TCR         1A  P
000230070801     A            AT0ORE         1A  P
000240070801     A            AT0DAORM       1   P
000250070801     A            H0RIGA         3S 0H
000260070801     A            H0COLO         3S 0H
000270070801     A            VIDDSA        20A  O  1  2
000280070801     A            VIDTES        33A  O  1 26DSPATR(RI)
000290070801     A                                      DSPATR(UL)
000300070801     A                                  1 62'FNLS01R'
000310070801     A                                  1 72DATE
000320070801     A                                      EDTCDE(Y)
000330070801     A            KNSIF         10A  O  2  2
000340070801     A            KNMUS         10A  O  2 13
000350070801     A                                  2 72TIME
000360070801     A                                  3 18' P E R S O N A L I Z Z A Z I O N E-
000370070801     A                                         C A M P I '
000380070801     A                                      DSPATR(RI)
000390070801     A                                  4  2'Sigla  Operatore'
000400070801     A            V0CSOP         1A  B  4 20TEXT('sigla operatore')
000410070801     A N13                                  DSPATR(HI)
000420070801     A  13                                  DSPATR(PR)
000430070801     A N90N07N06
000440070801     AO 42                                  DSPATR(PC)
000450070801     A                                  5  2'Numero O.R.M. ..'
000460070801     A                                      DSPATR(&AT0DOR)
000470070801     A            V0CPOE         3Y 0B  5 20DSPATR(HI)
000480070801     A                                      EDTCDE(Z)
000490070801     A N90 06                               DSPATR(PC)
000500070801     A                                      DSPATR(&AT0POE)
000510041108     A*****                                 CHECK(RB)
000520070801     A            V0CNOR         9Y 0B  5 24EDTCDE(Z)
000530070801     A                                      DSPATR(HI)
000540070801     A                                      DSPATR(&AT0ORM)
000550041108     A*****                                 CHECK(RB)
000560070801     A            V0CNRV         2Y 0B  5 34DSPATR(HI)
000570070801     A                                      EDTCDE(Z)
000580070801     A                                      CHECK(ER)
000590070801     A                                      DSPATR(&AT0ORM)
000600070801     A                                      CHECK(RB)
000610070801     A                                  6  2'Data  Spedizione'
000620070801     A            VIDDSP         8Y 0B  6 20TEXT('data spedizione')
000630070801     A N24                                  DSPATR(HI)
000640070801     A  41                                  DSPATR(PC)
000650070801     A                                      CHECK(RB)
000660070801     A                                      EDTCDE(8)
000670070801     A  24                                  DSPATR(PR)
000680070801     A  24                                  DSPATR(RI)
000690070801     A N34                              7  2'RITIRO MERCE:Data'
000700070801     A  34                              7  2'RITIRO  Presunto'
000710070801     A            VIDDRT    R     Y  B  7 20REFFLD(BLPDRT FNBLP00F)
000720070801     A                                      TEXT('data ritiro merce')
000730070801     A                                      DSPATR(HI)
000740070801     A  43                                  DSPATR(PC)
000750070801     A                                      CHECK(RB)
000760070801     A                                      EDTCDE(8)
000770070801     A                                  7 42'Mattino/Pom.'
000780070801     A            V0CFPP         1A  B  7 55DSPATR(HI)
000790070801     A                                      DSPATR(MDT)
000800070801     A                                      VALUES('M' 'P' ' ')
000810070801     A  40                                  DSPATR(PC)
000820070801     A                                  8 15'Num'
000830070801     A            V0CNRT         1Y 0B  8 20CHECK(RZ)
000840070801     A                                      DSPATR(HI)
000850070801     A                                  8 33'Autotrasportatore.. ?'
000860070801     A            V0CPDR    R    4A  B  8 55REFFLD(BLPPDR FNBLP00F)
000870070801     A                                      TEXT('codice padroncino')
000880070801     A                                      DSPATR(HI)
000890070801     A  56                                  DSPATR(PC)
000900070801     A                                      CHECK(RZ)
000910070801     A  34                                  DSPATR(PR)
000920070801     A                                  9  2'Linea Partenza..'
000930070801     A            V0CLNP         3Y 0B  9 20TEXT('linea partenza')
000940070801     A                                      DSPATR(HI)
000950070801     A  45                                  DSPATR(PC)
000960070801     A                                      CHECK(RB)
000970070801     A                                      EDTCDE(Z)
000980070801     A                                 10  2'Codice  Bolla  ?'
000990070801     A            V0CCBO         2A  B 10 20TEXT('codice bolla')
001000070801     A                                      DSPATR(HI)
001010070801     A  46
001020070801     AON90 07                               DSPATR(PC)
001030070801     A                                 10 33'Linea Arrivo....... ?'
001040070801     A            V0CLNA         3A  B 10 55TEXT('linea di arrivo')
001050070801     A                                      DSPATR(HI)
001060070801     A                                      CHECK(RZ)
001070070801     A  47                                  DSPATR(PC)
001080070801     A                                 11  2'Tipo Servizio  ?'
001090070801     A            V0CTSP         1A  B 11 20TEXT('flag espresso')
001100070801     A                                      DSPATR(HI)
001110070801     A  48                                  DSPATR(PC)
001120070801     A                                 11 33'Cd.Trattamento Merce?'
001130070801     A            V0CCTM         2A  B 11 55TEXT('codice trattamento merce')
001140070801     A N26                                  DSPATR(HI)
001150070801     A  49                                  DSPATR(PC)
001160070801     A  26                                  DSPATR(RI)
001170070801     A  26                                  DSPATR(PR)
001180070801     A                                 12  2'Codice Tariffa..'
001190070801     A            V0CCTR         3A  B 12 20DSPATR(HI)
001200070801     A  58                                  DSPATR(PC)
001210070801     A                                      CHECK(RB)
001220070801     A                                 12 33'Natura Merce.........'
001230070801     A            V0CNAS        15A  B 12 55DSPATR(HI)
001240070801     A                                 13  2'Mittente ......:'
001250070801     A                                 13 20'codice'
001260070801     A            V0CCCM         4Y 0B 13 27DSPATR(HI)
001270070801     A                                      CHECK(RB)
001280070801     A  50                                  DSPATR(PC)
001290070801     A                                      EDTCDE(Z)
001300070801     A                                 13 33'Punto Operat.cliente'
001310070801     A            V0CFLC         3Y 0B 13 55DSPATR(HI)
001320070801     A                                      CHECK(RB)
001330070801     A  51                                  DSPATR(PC)
001340070801     A                                      EDTCDE(Z)
001350070801     A            V0CRSM        35A  B 14  2TEXT('ragione sociale mittente')
001360070801     A                                      DSPATR(HI)
001370070801     A  52                                  DSPATR(PC)
001380070801     A            V0CINM        35A  B 15  2TEXT('indirizzo mittente')
001390070801     A                                      DSPATR(HI)
001400070801     A                                 15 53'Naz?'
001410070801     A                                 15 58'Antep'
001420070801     A                                 15 64'PartitaIVA/CdFisc'
001430070801     A            V0CCAM         9A  B 16  2
001440070801     A N53                                  DSPATR(HI)
001450070801     A  53                                  DSPATR(PC)
001460070801     A  53                                  DSPATR(RI)
001470070801     A            V0CLOM        35A  B 16 12TEXT('localita'' mittente')
001480070801     A                                      DSPATR(HI)
001490070801     A  54                                  DSPATR(PC)
001500070801     A            V0CPRM         2A  B 16 49TEXT('provincia mittente')
001510070801     A N55                                  DSPATR(HI)
001520070801     A  55                                  DSPATR(PC)
001530070801     A  55                                  DSPATR(RI)
001540070801     A            V0CNZM         3A  B 16 53
001550070801     A N68                                  DSPATR(HI)
001560070801     A  68                                  DSPATR(PC)
001570070801     A  68                                  DSPATR(RI)
001580070801     A            V0CFAP         1A  O 16 60TEXT('flag anteporto')
001590070801     A                                      DSPATR(HI)
001600070801     A            V0CCPM        14A  B 16 64DSPATR(HI)
001610070801     A  70                                  DSPATR(PC)
001620070801     A            V0CISM         2A  B 16 79
001630070801     A N10                                  DSPATR(HI)
001640070801     A  10                                  DSPATR(RI)
001650070801     A                                 17 12'Tassazione con Tariffa Mittente (S-
001660070801     A                                      )'
001670070801     A            V0CFTM         1A  B 17 49TEXT('flag tassaz. tariffa mittente-
001680070801     A                                      ')
001690070801     A                                      DSPATR(HI)
001700070801     A                                      VALUES(' ' 'S')
001710070801     A                                      DSPATR(MDT)
001720070801     A            V0CCDF        16A  B 17 64
001730070801     A N22                                  DSPATR(PR)
001740070801     A  22                                  DSPATR(HI)
001750070801     A                                 18  2'MITTENTE ORIGINALE:R.Sociale'
001760070801     A                                 18 33'C.A.P.'
001770070801     A                                 18 49'Naz?'
001780070801     A            V0CRMO        25A  B 19  2TEXT('ragione sociale mittente')
001790070801     A                                      DSPATR(HI)
001800070801     A  71                                  DSPATR(PC)
001810070801     A            V0CCMO         9A  B 19 33DSPATR(HI)
001820070801     A  72                                  DSPATR(PC)
001830070801     A            V0CNMO         3A  B 19 49DSPATR(HI)
001840070801     A  73                                  DSPATR(PC)
001850070801     A                                 20  2'---------Consegna Richiesta -------
001860070801     A                                      -------'
001870070801     A                                 20 48'GG.Chiusura'
001880070801     A                                 21  2'Tipo( /D/P)'
001890070801     A            V0CTCR         1A  B 21 14DSPATR(HI)
001900070801     A                                      VALUES(' ' 'D' 'P')
001910070801     A                                      DSPATR(MDT)
001920070801     A                                      DSPATR(&AT0TCR)
001930070801     A                                 21 16'Data'
001940070801     A            V0CDCR         8Y 0B 21 21DSPATR(HI)
001950070801     A                                      CHECK(RB)
001960070801     A                                      EDTCDE(8)
001970070801     A  59                                  DSPATR(PC)
001980070801     A                                 21 32'Ora'
001990070801     A            V0CHCR         2Y 0B 21 36DSPATR(HI)
002000070801     A  60                                  DSPATR(PC)
002010070801     A                                      CHECK(RB)
002020070801     A                                      EDTCDE(Z)
002030070801     A                                 21 39':'
002040070801     A            V0CMCR         2Y 0B 21 41DSPATR(HI)
002050070801     A                                      CHECK(RZ)
002060070801     A                                      EDTCDE(Z)
002070070801     A            V0CGC1         2A  B 21 50DSPATR(HI)
002080070801     A  74                                  DSPATR(PC)
002090070801     A            V0CGC2         2A  B 21 55DSPATR(HI)
002100070801     A  62                                  DSPATR(PC)
002110070801     A                                 21 64'V-Valore'
002120070801     A            V0CBVA         1A  B 21 73DSPATR(HI)
002130070801     A                                      VALUES(' ' 'V')
002140070801     A                                 22 15'Oppure'
002150070801     A                                 23  2'Ore da aggiungere a delivery'
002160070801     A            V0CORE         2Y 0B 23 31DSPATR(HI)
002170070801     A                                      CHECK(RZ)
002180070801     A                                      EDTCDE(Z)
002190070801     A                                      DSPATR(&AT0ORE)
002200070801     A                                 24  2'F6=Conferma'
002210070801     A                                      DSPATR(HI)
002220070801     A                                 24 55'F3=Fine'
002230070801     A                                 24 65'F8=Int.O.R.M.'
002240070801     A                                      DSPATR(&AT0DOR)
002250070801     A                                  7 31'Da O.R.M.'
002260070801     A                                      DSPATR(&AT0DAORM)
002270070802     A                                      DSPATR(ND)
002280940715     A***-------------------------------------------------------------**
002290940715     A*  PRIMA VIDEATA
002300940715     A***-------------------------------------------------------------**
002310110705     A          R LS01D01
002320110705     A*%%TS  SD  20110705  111751  EDPRM       REL-V6R1M0  5761-WDS
002330110705     A N12
002340110705     AO 15                                  CA03
002350110705     A                                      CF06
002360110705     A N12N19
002370110705     AO 12                                  CF07
002380110705     A N12N19
002390110705     AO 12N15                               CF10
002400110705     A  12                                  CF12
002410110705     A N12                                  CF13
002420110705     A  12N15                               CF16
002430110705     A N12                                  CF05
002440110705     A  94                                  CF21
002450110705     A  96                                  CF22
002460110705     A                                      CF08
002470110705     A N12                                  CF20
002480110705     A                                      CF02
002490110705     A                                      CF17
002500110705     A                                      CF19
002510110705     A                                      CSRLOC(H1RIGA     H1COLO)
002520110705     A  90        VIDMSG        78   M
002530110705     A            ATRDRT         1A  P
002540110705     A            ATRFPP         1A  P
002550110705     A            ATRPDR         1A  P
002560110705     A            ATRFFD         1A  P
002570110705     A            ATRLNA         1A  P
002580110705     A            ATRTSP         1A  P
002590110705     A            ATRCCM         1A  P
002600110705     A            ATRPOE         1A  P
002610110705     A            ATRORM         1A  P
002620110705     A            ATRDOR         1A  P
002630110705     A            ATRNCL         1A  P
002640110705     A            ATRPKG         1A  P
002650110705     A            ATRFTM         1A  P
002660110705     A            ATRDES         1A  P
002670110705     A            ATRCBO         1A  P
002680110705     A            ATRDAORM       1A  P
002690110705     A            ATREMD         1A  P
002691110705     A            ATRCUP         1A  P
002700110705     A            H1RIGA         3S 0H
002710110705     A            H1COLO         3S 0H
002720110705     A            VIDDSA        20A  O  1  2
002730110705     A            VIDTES        33A  O  1 26DSPATR(RI)
002740110705     A                                      DSPATR(UL)
002750110705     A                                  1 62'FNLS01R'
002760110705     A                                  1 72DATE
002770110705     A                                      EDTCDE(Y)
002780110705     A            KNSIF         10A  O  2  2
002790110705     A            KNMUS         10A  O  2 13
002800110705     A                                  2 72TIME
002810110705     A            PREDSS        19A  O  3  2
002820110705     A                                  3 22'Num'
002830110705     A            PRENRS         2Y 0O  3 26TEXT('precedente serie')
002840110705     A                                      EDTCDE(Z)
002850110705     A            PRENSP         7Y 0O  3 29TEXT('precedente num.spedizione')
002860110705     A                                      EDTCDE(2)
002870110705     A                                  3 40'LNA'
002880110705     A            PRELNA         3A  O  3 44
002890110705     A                                  3 49'Rif.Mitt'
002900110705     A            PRERMN        15Y 0O  3 58TEXT('precedente rif.mittente')
002910110705     A                                      EDTCDE(Z)
002920110705     A                                  3 74'Zona'
002930110705     A            PREZNC         2S 0O  3 79
002940110705     A                                  4  2'==================================-
002950110705     A                                      ===================================-
002960110705     A                                      =========='
002970110705     A                                      DSPATR(HI)
002980110705     A                                  5  2'Sigla  Operatore'
002990110705     A            VIDSOP         1A  B  5 20TEXT('sigla operatore')
003000110705     A                                      DSPATR(HI)
003010110705     A  13                                  DSPATR(PR)
003020110705     A N90N38N07
003030110705     A N06
003040110705     AO 42                                  DSPATR(PC)
003050110705     A                                  6  2'Numero O.R.M. ..'
003060110705     A                                      DSPATR(&ATRDOR)
003070110705     A            VIDPOE         3Y 0B  6 20
003080110705     A N37                                  DSPATR(HI)
003090110705     A                                      EDTCDE(Z)
003100110705     A  37                                  DSPATR(PR)
003110110705     A  37                                  DSPATR(RI)
003120110705     A N90 06N38
003130110705     A N37                                  DSPATR(PC)
003140110705     A                                      DSPATR(&ATRPOE)
003150041108     A*****                                 CHECK(RB)
003160110705     A            VIDNOR         9Y 0B  6 24
003170110705     A N37                                  DSPATR(HI)
003180110705     A                                      EDTCDE(Z)
003190110705     A  37                                  DSPATR(PR)
003200110705     A  37                                  DSPATR(RI)
003210110705     A                                      DSPATR(&ATRORM)
003220110705     A  12N15                           6 33'Data Bordero''........'
003230041108     A******                                CHECK(RB)
003240110705     A            VIDNRV         2Y 0B  6 34
003250110705     A N37                                  DSPATR(HI)
003260110705     A                                      EDTCDE(Z)
003270110705     A  37                                  DSPATR(PR)
003280110705     A  37                                  DSPATR(RI)
003290110705     A                                      CHECK(ER)
003300110705     A                                      CHECK(RB)
003310110705     A                                      DSPATR(&ATRORM)
003320110705     A  12N15     VIDDBR    R     Y  O  6 55REFFLD(BLPDBR FNBLP00F)
003330110705     A                                      TEXT('data bordero'' ')
003340110705     A                                      DSPATR(HI)
003350110705     A                                      EDTCDE(8)
003360110705     A  12N15                           6 68'Nr. FV'
003370110705     A  12N15     VIDNFV         5Y 0O  6 75TEXT('numero foglio viaggio')
003380110705     A                                      DSPATR(HI)
003390110705     A                                      EDTCDE(2)
003400110705     A                                  7  2'Data  Spedizione'
003410110705     A            VIDDSP         8Y 0B  7 20TEXT('data spedizione')
003420110705     A                                      CHECK(RB)
003430110705     A N24                                  DSPATR(HI)
003440110705     A  24                                  DSPATR(RI)
003450110705     A  24                                  DSPATR(PR)
003460110705     A  41                                  DSPATR(PC)
003470110705     A                                      EDTCDE(8)
003480110705     A  98                              8  2'NUMERO SPEDIZIONE'
003490110705     A                                      DSPATR(HI)
003500110705     A  98        RECNSP         7Y 0B  8 20DSPATR(HI)
003510110705     A                                      CHECK(RB)
003520110705     A                                      EDTCDE(Z)
003530110705     A  61                                  DSPATR(PC)
003540110705     A  22                              8 33'Merce portata a magazzino...'
003550110705     A  22        VIDMAG         1A  B  8 62VALUES('S' ' ')
003560110705     A  34                                  DSPATR(HI)
003570110705     A N34                                  DSPATR(PR)
003580110705     A  22                              8 64'(S/ )'
003590110705     A N34                              9  2'RITIRO MERCE:Data'
003600110705     A  34                              9  2'RITIRO  Presunto'
003610110705     A            VIDDRT    R     Y  B  9 20REFFLD(BLPDRT FNBLP00F)
003620110705     A                                      TEXT('data ritiro merce')
003630110705     A                                      DSPATR(HI)
003640110705     A  43                                  DSPATR(PC)
003650110705     A                                      CHECK(RB)
003660110705     A                                      EDTCDE(8)
003670110705     A                                      DSPATR(&ATRDRT)
003680110705     A                                  9 42'Mattino/Pom.'
003690110705     A            VIDFPP         1A  B  9 55DSPATR(HI)
003700110705     A                                      DSPATR(MDT)
003710110705     A                                      VALUES('M' 'P' ' ')
003720110705     A  40                                  DSPATR(PC)
003730110705     A                                      DSPATR(&ATRFPP)
003740110705     A                                 10 15'Num'
003750110705     A            VIDNRT         1Y 0B 10 20CHECK(RZ)
003760110705     A                                      DSPATR(HI)
003770110705     A                                 10 33'Codice Autotrasport.?'
003780110705     A            VIDPDR    R    4A  B 10 55REFFLD(BLPPDR FNBLP00F)
003790110705     A                                      TEXT('codice padroncino')
003800110705     A N34                                  DSPATR(HI)
003810110705     A  56                                  DSPATR(PC)
003820110705     A                                      CHECK(RZ)
003830110705     A  34                                  DSPATR(PR)
003840110705     A  34                                  DSPATR(RI)
003850110705     A                                      DSPATR(&ATRPDR)
003860110705     A            V1DPDR        20A  O 10 61TEXT('descrizione codice padroncino-
003870110705     A                                      ')
003880110705     A                                 11  2'Linea Partenza..'
003890110705     A            VIDLNP         3Y 0B 11 20TEXT('linea partenza')
003900110705     A                                      DSPATR(HI)
003910110705     A  45                                  DSPATR(PC)
003920110705     A                                      CHECK(RB)
003930110705     A                                      EDTCDE(Z)
003940110705     A  12                                  DSPATR(PR)
003950110705     A                                 12  2'Cod.Mittente....'
003960110705     A  14        VIDFLC         3Y 0B 12 20TEXT('linea partenza')
003970110705     A N19N85                               DSPATR(HI)
003980110705     A                                      CHECK(RB)
003990110705     A                                      EDTCDE(Z)
004000110705     A  51
004010110705     AO 14N90N19                            DSPATR(PC)
004020110705     A  19
004030110705     AO 85                                  DSPATR(RI)
004040110705     A  19
004050110705     AO 85                                  DSPATR(PR)
004060110705     A            VIDCCM         4Y 0B 12 24
004070110705     A N19N85                               DSPATR(HI)
004080110705     A  19
004090110705     AO 85                                  DSPATR(RI)
004100110705     A  19
004110110705     AO 85                                  DSPATR(PR)
004120110705     A  50
004130110705     AON90 07N38
004140110705     A N19N85
004150110705     AON90 06N38
004160110705     A  37N19N85                            DSPATR(PC)
004170110705     A                                      EDTCDE(Z)
004180110705     A                                      CHECK(RB)
004190110705     A                                      DSPATR(&ATRCCM)
004200110705     A            VIDDMT        48A  B 12 33TEXT('localita'' destinatario')
004210110705     A  01N19                               DSPATR(HI)
004220110705     A N01
004230110705     AO 19                                  DSPATR(PR)
004240110705     A  19                                  DSPATR(RI)
004250110705     A  01N90                               DSPATR(PC)
004260110705     A                                 13  2'Colli...........'
004270110705     A            V1CNCL         5Y 0B 13 20TEXT('numero colli')
004280110705     A                                      DSPATR(HI)
004290110705     A                                      CHECK(RB)
004300110705     A                                      EDTCDE(Z)
004310110705     A  62
004320110705     AON90 07N38
004330110705     A  19
004340110705     AON90 07N38
004350110705     A  85
004360110705     AON90 06N38
004370110705     A  37 85
004380110705     AON90 06N38
004390110705     A  37 19                               DSPATR(PC)
004400110705     A                                      DSPATR(&ATRNCL)
004410110705     A N12                             13 33'Peso Kg. ............'
004420110705     A N12        VIDPKG    R     Y  B 13 55REFFLD(BLPPKB FNBLP00F)
004430110705     A                                      TEXT('peso in Kg.')
004440110705     A                                      DSPATR(HI)
004450110705     A  63                                  DSPATR(PC)
004460110705     A                                      CHECK(RB)
004470110705     A                                      EDTCDE(4)
004480110705     A                                      DSPATR(&ATRPKG)
004490110705     A                                 14  2'Codice  Bolla  ?'
004500110705     A            VIDCBO    R     A  B 14 20REFFLD(BLPCBO FNBLP00F)
004510110705     A N21                                  DSPATR(HI)
004520110705     A  21                                  DSPATR(RI)
004530110705     A  44 12
004540110705     AO 21                                  DSPATR(PR)
004550110705     A  46                                  DSPATR(PC)
004560110705     A                                      DSPATR(&ATRCBO)
004570110705     A                                 14 33'Linea Arrivo....... ?'
004580110705     A            VIDLNA         3A  B 14 55
004590110705     A N20                                  DSPATR(HI)
004600110705     A                                      CHECK(RZ)
004610110705     A  20                                  DSPATR(RI)
004620110705     A  44 12
004630110705     AO 20                                  DSPATR(PR)
004640110705     A  47                                  DSPATR(PC)
004650110705     A                                      DSPATR(&ATRLNA)
004660110705     A            V1DLNA        18A  O 14 61TEXT('descrizione LNA')
004670110705     A                                 15  2'Tipo Servizio  ?'
004680110705     A            VIDTSP         1A  B 15 20
004690110705     A N18                                  DSPATR(HI)
004700110705     A  18                                  DSPATR(RI)
004710110705     A  18                                  DSPATR(PR)
004720110705     A  48                                  DSPATR(PC)
004730110705     A                                      DSPATR(&ATRTSP)
004740110705     A            V1DTSP        10A  O 15 22
004750110705     A                                 15 33'Cd.Trattamento Merce?'
004760110705     A            VIDCTM         2A  B 15 55TEXT('codice trattamento merce')
004770110705     A N26                                  DSPATR(HI)
004780110705     A  12 15 44
004790110705     AO 12N15
004800110705     AO 26                                  DSPATR(PR)
004810110705     A  26                                  DSPATR(RI)
004820110705     A  49                                  DSPATR(PC)
004830110705     A  12        V1DCTM        20A  O 15 61TEXT('descrizione cd.trattam.merce')
004840110705     A                                 16  2'Destinatario....'
004850110705     A            VIDRSD    R   70A  B 17  2REFFLD(BLPRSD FNBLP00F)
004860110705     A                                      TEXT('ragione sociale destinatario')
004870110705     A                                      DSPATR(HI)
004880110705     A  64                                  DSPATR(PC)
004890110705     A                                      DSPATR(&ATRDES)
004900110705     A            VIDIND    R     A  B 18  2REFFLD(BLPIND FNBLP00F)
004910110705     A                                      TEXT('indirizzo destinatario')
004920110705     A                                      DSPATR(HI)
004930110705     A                                      DSPATR(&ATRDES)
004940110705     A                                 18 52'Naz?'
004950110705     A                                 18 58'Inolt'
004960110705     A                                 18 64'Partita IVA'
004970110705     A            VIDCAD    R        B 19  2REFFLD(BLPCAD FNBLP00F)
004980110705     A N65                                  DSPATR(HI)
004990110705     A  65                                  DSPATR(PC)
005000110705     A  65                                  DSPATR(RI)
005010110705     A                                      DSPATR(&ATRDES)
005020110705     A            VIDLOD    R     A  B 19 12REFFLD(BLPLOD FNBLP00F)
005030110705     A                                      TEXT('localita'' destinatario')
005040110705     A                                      DSPATR(HI)
005050110705     A  66                                  DSPATR(PC)
005060110705     A                                      DSPATR(&ATRDES)
005070110705     A            VIDPRD         2A  B 19 48TEXT('provincia destinatario')
005080110705     A N71                                  DSPATR(HI)
005090110705     A  67                                  DSPATR(PR)
005100110705     A  71                                  DSPATR(PC)
005110110705     A  71                                  DSPATR(RI)
005120110705     A                                      DSPATR(&ATRDES)
005130110705     A            VIDNZD    R        B 19 52REFFLD(BLPNZD FNBLP00F)
005140110705     A N68                                  DSPATR(HI)
005150110705     A  68                                  DSPATR(PC)
005160110705     A  68                                  DSPATR(RI)
005170110705     A                                      DSPATR(&ATRDES)
005180110705     A            VIDFIN         1A  B 19 60TEXT('flag inoltro')
005190110705     A                                      DSPATR(HI)
005200110705     A  69                                  DSPATR(PC)
005210110705     A                                      VALUES(' ' 'C' 'P' 'I')
005220110705     A                                      DSPATR(PR)
005230110705     A            VIDCPD        14A  B 19 64DSPATR(HI)
005240110705     A  70                                  DSPATR(PC)
005250110705     A            VIDISD         2A  B 19 79
005260110705     A N10                                  DSPATR(HI)
005270110705     A  10                                  DSPATR(RI)
005280110705     A                                 20  2'Referente consegna'
005290110705     A            VIDREF        35A  B 20 21DSPATR(HI)
005300110705     A                                 20 57'Telef.'
005310110705     A            VIDTEL        16A  B 20 64DSPATR(HI)
005320110705     A N12
005330110705     AO 15                             21  2'Network'
005340110705     A N12
005350110705     AO 15        VIDDPD         1A  B 21 10DSPATR(HI)
005360110705     A                                      VALUES(' ' 'D' 'F')
005370110705     A N12
005380110705     AO 15                             21 12'(D=DPD,F=FedEx)'
005390110705     A N12
005400110705     AO 15                             21 28'Nr.Parcel DPD'
005410110705     A N12
005420110705     AO 15        VIDNRD        14A  B 21 42DSPATR(HI)
005430110705     A  57                                  DSPATR(PC)
005440110705     A  12 15 79                            DSPATR(PR)
005450110705     A                                 21 57'Fermo Deposito (N/S).'
005460110705     A            VIDFFD         1A  B 21 79TEXT('fermo deposito')
005470110705     A                                      DSPATR(HI)
005480110705     A                                      VALUES('N' 'S' ' ')
005490110705     A                                      DSPATR(MDT)
005500110705     A  52                                  DSPATR(PC)
005510110705     A                                      DSPATR(&ATRFFD)
005520110705     A                                 22  2'F2=Cappario DPD'
005530110705     A                                 22 41'Tassazione con Tariffa Mittente   -
005540110705     A                                      (S).'
005550110705     A            VIDFTM         1A  B 22 80TEXT('flag tassaz. tariffa mittente-
005560110705     A                                      ')
005570110705     A N28                                  DSPATR(HI)
005580110705     A                                      DSPATR(MDT)
005590110705     A  28                                  DSPATR(RI)
005600110705     A                                      VALUES(' ' 'S')
005610110705     A  28                                  DSPATR(PR)
005620110705     A                                      DSPATR(&ATRFTM)
005630110705     A N12                             23  2'F13=Personalizz.'
005640110705     A  94                             23 19'F21=Det.colli'
005650110705     A N12                             23 19'F5=Riepilogo'
005660110705     A  96                             24 19'F22="CHI SONO"'
005670110705     A N12
005680110705     AO 15                             24 73'F3=Fine'
005690110705     A N12N19
005700110705     AO 12                             24  2'F7=Ricerca Mitt.'
005710110705     A                                 23 53'F8=ORM'
005720110705     A                                      DSPATR(&ATRDOR)
005730110705     A  12N15                          23 61'F16=Annul.'
005740110705     A N12N19
005750110705     AO 12N15                          24 48'F10=Abilita Fil.cliente'
005760110705     A  12                             23 73'F12=Rit.'
005770110705     A                                  9 31'Da O.R.M.'
005780110705     A                                      DSPATR(&ATRDAORM)
005790110705     A                                 23 34'F17=Ind.Mail Dest.'
005800110705     A                                      DSPATR(&ATREMD)
005810110705     A                                 24 34'F19=CUP/CIG'
005820110705     A                                      DSPATR(&ATRCUP)
005830110705     A          R LS01D02
005840110705     A*%%TS  SD  20110705  092344  EDPRM       REL-V6R1M0  5761-WDS
005850110705     A                                      CF06
005860110705     A  12N15                               CF08
005870110705     A                                      CF09
005880110705     A                                      CF12
005890110705     A                                      CF18
005900110705     A                                      CF11
005910110705     A                                      CF15
005920110705     A  12N15                               CF17
005930110705     A                                      CSRLOC(H2RIGA     H2COLO)
005940110705     A  90        VIDMSG        78   M
005950110705     A            ATRCTR         1A  P
005960110705     A            ATRTBA         1A  P
005970110705     A            ATRNBA         1A  P
005980110705     A            ATRTB2         1A  P
005990110705     A            ATRNB2         1A  P
006000110705     A            ATRRMA         1A  P
006010110705     A            ATRCDF         1A  P
006020110705     A            ATRGVA         1A  P
006030110705     A            ATRRMN         1A  P
006040110705     A            ATRBVA         1A  P
006050110705     A            ATRF15         1A  P
006060110705     A            H2RIGA         3S 0H
006070110705     A            H2COLO         3S 0H
006080110705     A            VIDORE         3S 0H
006090110705     A            VIDDSA        20A  O  1  2
006100110705     A            VIDTES        33A  O  1 26DSPATR(RI)
006110110705     A                                      DSPATR(UL)
006120110705     A                                  1 62'FNLS01R'
006130110705     A                                  1 72DATE
006140110705     A                                      EDTCDE(Y)
006150110705     A            KNSIF         10A  O  2  2
006160110705     A            KNMUS         10A  O  2 13
006170110705     A                                  2 72TIME
006180110705     A            V2DTSP         8A  O  3  1
006190110705     A  09
006200110705     AO 97                                  DSPATR(RI)
006210110705     A N09N97                               DSPATR(HI)
006220110705     A                                  3 10'Linea Arrivo'
006230110705     A            VIDLNA         3A  O  3 23DSPATR(HI)
006240110705     A  40                                  DSPATR(PC)
006250110705     A            V1DLNA        18A  O  3 27DSPATR(HI)
006260110705     A                                  3 46'Codice Bolla'
006270110705     A            VIDCBO    R        O  3 59REFFLD(BLPCBO FNBLP00F)
006280110705     A                                      DSPATR(HI)
006290110705     A            V2DCBO        18A  O  3 62DSPATR(HI)
006300110705     A                                  4  1'Destinat'
006310110705     A            V2CRSD    R        O  4 10REFFLD(BLPRSD FNBLP00F)
006320110705     A            V2CLOD        34A  O  4 46TEXT('LOCALITA'' DESTINATARIO')
006330110705     A                                  5  1'Mittente'
006340110705     A            VIDRSM        35A  B  5 10
006350110705     A N19                                  DSPATR(HI)
006360110705     A  02                                  DSPATR(PR)
006370110705     A  52                                  DSPATR(PC)
006380110705     A  19                                  DSPATR(RI)
006390110705     A                                  5 46'Codice'
006400110705     A            WKSC           7S 0O  5 53
006410110705     A N19                                  DSPATR(HI)
006420110705     A  19                                  DSPATR(RI)
006430110705     A            V2DTEL        20A  O  5 61
006440110705     A            VIDINM        35A  B  6 10
006450110705     A N19                                  DSPATR(HI)
006460110705     A  02                                  DSPATR(PR)
006470110705     A  19                                  DSPATR(RI)
006480110705     A                                  6 53'Naz?'
006490110705     A                                  6 58'Antep'
006500110705     A                                  6 64'PartitaIVA/CdFisc'
006510110705     A            VIDCAM         9A  B  7  2
006520110705     A N19N53                               DSPATR(HI)
006530110705     A  02                                  DSPATR(PR)
006540110705     A  53                                  DSPATR(PC)
006550110705     A  19
006560110705     AO 53                                  DSPATR(RI)
006570110705     A            VIDLOM        35A  B  7 12
006580110705     A N19                                  DSPATR(HI)
006590110705     A  02                                  DSPATR(PR)
006600110705     A  54                                  DSPATR(PC)
006610110705     A  19                                  DSPATR(RI)
006620110705     A            VIDPRM         2A  B  7 49
006630110705     A N19N55                               DSPATR(HI)
006640110705     A  02                                  DSPATR(PR)
006650110705     A  55                                  DSPATR(PC)
006660110705     A  19
006670110705     AO 55                                  DSPATR(RI)
006680110705     A            VIDNZM         3A  B  7 53
006690110705     A N19N68                               DSPATR(HI)
006700110705     A  02                                  DSPATR(PR)
006710110705     A  68                                  DSPATR(PC)
006720110705     A  19
006730110705     AO 68                                  DSPATR(RI)
006740110705     A            VIDFAP         1A  O  7 60
006750110705     A  19                                  DSPATR(RI)
006760110705     A            VIDCPM        14A  B  7 64
006770110705     A N19N39                               DSPATR(HI)
006780110705     A  02
006790110705     AO 39                                  DSPATR(PR)
006800110705     A  70                                  DSPATR(PC)
006810110705     A  19                                  DSPATR(RI)
006820110705     A            VIDISM         2A  B  7 79
006830110705     A N10N19N39                            DSPATR(HI)
006840110705     A  02
006850110705     AO 39                                  DSPATR(PR)
006860110705     A  10
006870110705     AO 19                                  DSPATR(RI)
006880110705     A                                  8 51'Consegna'
006890110705     A            VIDCDF        16A  B  8 64
006900110705     A  02
006910110705     AON22                                  DSPATR(PR)
006920110705     A                                      DSPATR(&ATRCDF)
006930110705     A                                  9  2'Colli'
006940110705     A                                  9 11'Peso'
006950110705     A                                  9 19'Rifer.Mitt.Numer'
006960110705     A                                  9 38'Volume (F11)'
006970110705     A                                  9 53'DDT'
006980110705     A                                  9 59'Serie'
006990110705     A                                  9 67'Segnacolli'
007000110705     A            VIDNCL         5Y 0B 10  2TEXT('numero colli')
007010110705     A                                      DSPATR(HI)
007020110705     A  41                                  DSPATR(PC)
007030110705     A                                      CHECK(RB)
007040110705     A                                      EDTCDE(Z)
007050110705     A            V2CPKG    R     Y  B 10  9REFFLD(BLPPKB FNBLP00F)
007060110705     A                                      TEXT('peso kg')
007070110705     A                                      DSPATR(HI)
007080110705     A                                      CHECK(RB)
007090110705     A  42                                  DSPATR(PC)
007100110705     A                                      EDTCDE(4)
007110110705     A            VIDRMN    R     Y  B 10 19REFFLD(BLPRMN FNBLP00F)
007120110705     A                                      TEXT('riferimento mittente')
007130110705     A                                      DSPATR(HI)
007140110705     A                                      CHECK(RB)
007150110705     A                                      EDTCDE(Z)
007160110705     A  43                                  DSPATR(PC)
007170110705     A  79N43
007180110705     AO 44N43                               DSPATR(PR)
007190110705     A                                      DSPATR(&ATRRMN)
007200110705     A            VIDFVR         1A  O 10 38
007210110705     A            VIDVOL    R     Y  B 10 41REFFLD(BLPVLB FNBLP00F)
007220110705     A                                      TEXT('volume')
007230110705     A                                      DSPATR(HI)
007240110705     A                                      CHECK(RB)
007250110705     A                                      EDTCDE(4)
007260110705     A  47
007270110705     AO 12 15 36
007280110705     A N90                                  DSPATR(PC)
007290110705     A            VIDBAM         1A  B 10 54
007300110705     A N97                                  DSPATR(HI)
007310110705     A                                      VALUES('N' 'S')
007320110705     A                                      DSPATR(MDT)
007330110705     A  97                                  DSPATR(RI)
007340110705     A  77                                  DSPATR(PC)
007350110705     A            VIDNRS         2Y 0B 10 59TEXT('serie spedizione')
007360110705     A                                      DSPATR(HI)
007370110705     A                                      CHECK(RZ)
007380110705     A                                      EDTCDE(Z)
007390110705     A N95
007400110705     AO 12N15                               DSPATR(PR)
007410110705     A  56                                  DSPATR(PC)
007420110705     A            VIDNCD         7Y 0B 10 63TEXT('segnacollo dal')
007430110705     A                                      DSPATR(HI)
007440110705     A                                      CHECK(RB)
007450110705     A                                      EDTCDE(Z)
007460110705     A  12 15 44
007470110705     AO 25                                  DSPATR(PR)
007480110705     A  45
007490110705     AO 12 15N36
007500110705     A N90                                  DSPATR(PC)
007510110705     A                                 10 71'/'
007520110705     A            VIDNCA         7Y 0B 10 73TEXT('segnacollo al')
007530110705     A                                      CHECK(RB)
007540110705     A                                      EDTCDE(Z)
007550110705     A                                      DSPATR(HI)
007560110705     A  12 15 44
007570110705     AO 25                                  DSPATR(PR)
007580110705     A  46                                  DSPATR(PC)
007590110705     A                                 11  2'Rifer.Mitt.Alfab'
007600110705     A                                 11 20'Natura Merce'
007610110705     A                                 11 37'MITTENTE ORIGINALE:R.Sociale   C.A-
007620110705     A                                      .P.   Naz?'
007630110705     A            VIDRMA    R     A  B 12  2REFFLD(BLPRMA FNBLP00F)
007640110705     A                                      TEXT('riferimenti mitt. alfabetici')
007650110705     A                                      DSPATR(HI)
007660110705     A  58                                  DSPATR(PC)
007670110705     A  79                                  DSPATR(PR)
007680110705     A                                      DSPATR(&ATRRMA)
007690110705     A            VIDNAS        15A  B 12 20TEXT('natura merce')
007700110705     A N27N97                               DSPATR(HI)
007710110705     A  27
007720110705     AO 97                                  DSPATR(RI)
007730110705     A  27                                  DSPATR(PR)
007740110705     A  48                                  DSPATR(PC)
007750110705     A            VIDRMO        25A  B 12 37TEXT('mittente originale')
007760110705     A N03                                  DSPATR(HI)
007770110705     A  71                                  DSPATR(PC)
007780110705     A  03                                  DSPATR(RI)
007790110705     A  03                                  DSPATR(PR)
007800110705     A            VIDCMO         9A  B 12 66
007810110705     A N03                                  DSPATR(HI)
007820110705     A  72                                  DSPATR(PC)
007830110705     A  03                                  DSPATR(RI)
007840110705     A  03                                  DSPATR(PR)
007850110705     A            VIDNMO         3A  B 12 78
007860110705     A N03                                  DSPATR(HI)
007870110705     A  73                                  DSPATR(PC)
007880110705     A  03                                  DSPATR(RI)
007890110705     A  03                                  DSPATR(PR)
007900110705     A                                 13  2'-?----- C/ASSEGNO ------?-'
007910110705     A                                 13 30'----------- Codice  Tariffa  Mitte-
007920110705     A                                      nte -------------'
007930110705     A            VIDTIC         2A  B 14  2TEXT('tipo incasso contrassegno')
007940110705     A                                      DSPATR(HI)
007950110705     A  49                                  DSPATR(PC)
007960110705     A  76                                  DSPATR(PR)
007970110705     A            VIDCAS    R        B 14  6REFFLD(AR9CAS FIAR900F)
007980110705     A                                      TEXT('importo contrassegno')
007990110705     A                                      DSPATR(HI)
008000110705     A  50                                  DSPATR(PC)
008010110705     A                                      CHECK(RB)
008020110705     A                                      EDTCDE(2)
008030110705     A                                      CHANGE(11 'Indica se e'' stato modi-
008040110705     A                                      ficato')
008050110705     A            VIDVCA         3A  B 14 25
008060110705     A N93                                  DSPATR(HI)
008070110705     A  51                                  DSPATR(PC)
008080110705     A  93                                  DSPATR(RI)
008090110705     A  33                                  DSPATR(PR)
008100110705     A                                 14 30'?'
008110110705     A            VIDCTR         3A  B 14 32TEXT('codice tariffa 1')
008120110705     A N29                                  DSPATR(HI)
008130110705     A  29                                  DSPATR(RI)
008140110705     A  29                                  DSPATR(PR)
008150110705     A  83                                  DSPATR(PC)
008160110705     A                                      CHECK(RZ)
008170110705     A                                      DSPATR(&ATRCTR)
008180110705     A            DEFCTR        10A  O 14 37
008190110705     A            DEVCTR        15A  O 14 49
008200110705     A            VIDCT2         3A  O 14 66TEXT('codice tariffa 2')
008210110705     A                                      DSPATR(RI)
008220110705     A            VIDCT3         3A  O 14 70TEXT('codice tariffa 3')
008230110705     A                                      DSPATR(RI)
008240110705     A            VIDCT4         3A  O 14 74TEXT('codice tariffa 4')
008250110705     A                                      DSPATR(RI)
008260110705     A            VIDCT5         3A  O 14 78TEXT('codice tariffa 5')
008270110705     A                                      DSPATR(RI)
008280110705     A                                 15 11'---------------------- N o t e ----
008290110705     A                                      -------------------'
008300110705     A            VIDES2         3A  O 15 66
008310110705     A            VIDES3         3A  O 15 70
008320110705     A            VIDES4         3A  O 15 74
008330110705     A            VIDES5         3A  O 15 78
008340110705     A            VIDNT1        35A  B 16  2TEXT('disposizioni')
008350110705     A N97                                  DSPATR(HI)
008360110705     A  97                                  DSPATR(RI)
008370110705     A  86                                  DSPATR(PC)
008380110705     A            VIDNT2        35A  B 16 38TEXT('disposizioni')
008390110705     A N97                                  DSPATR(HI)
008400110705     A  97                                  DSPATR(RI)
008410110705     A                                 17  3'-Importo da Assicurare ?-'
008420110705     A                                 17 33'Q.tà da Fatturare'
008430110705     A                                 17 52'Valore Merce dichiar. ?'
008440110705     A                                 17 77'Zona'
008450110705     A            VIDIAS    R        B 18  6REFFLD(BLPIAS FNBLP00F)
008460110705     A                                      DSPATR(HI)
008470110705     A                                      CHECK(RB)
008480110705     A                                      EDTCDE(2)
008490110705     A  80                                  DSPATR(PC)
008500110705     A                                      CHANGE(89 'indicat se e'' stato mod-
008510110705     A                                      ificato')
008520110705     A            VIDVAS         3A  B 18 25
008530110705     A N92                                  DSPATR(HI)
008540110705     A  81                                  DSPATR(PC)
008550110705     A  92                                  DSPATR(RI)
008560110705     A            VIDQFT    R        B 18 33REFFLD(BLPQFT FNBLP00F)
008570110705     A                                      TEXT('QUANTITA'' DA FATTURARE')
008580110705     A                                      DSPATR(HI)
008590110705     A                                      CHECK(RB)
008600110705     A                                      EDTCDE(2)
008610110705     A  84                                  DSPATR(PC)
008620110705     A            VIDVMD    R        B 18 53REFFLD(BLPVMD FNBLP00F)
008630110705     A                                      TEXT('VALORE MERCE DICHIARATO')
008640110705     A                                      DSPATR(HI)
008650110705     A  82                                  DSPATR(PC)
008660110705     A                                      CHECK(RB)
008670110705     A                                      EDTCDE(2)
008680110705     A                                      CHANGE(88 'Indica se e'' stato vari-
008690110705     A                                      ato')
008700110705     A            VIDVAD         3A  B 18 72
008710110705     A N99                                  DSPATR(HI)
008720110705     A  69                                  DSPATR(PC)
008730110705     A  99                                  DSPATR(RI)
008740110705     A            VIDZNC         2Y 0B 18 78TEXT('zona consegna')
008750110705     A                                      EDTCDE(Z)
008760110705     A                                      DSPATR(HI)
008770110705     A                                      DSPATR(UL)
008780110705     A N12
008790110705     AO 12 15                               DSPATR(PR)
008800110705     A N12                                  DSPATR(ND)
008810110705     A  57                                  DSPATR(PC)
008820110705     A                                 19  2'--------- Consegna  Richiesta -----
008830110705     A                                      -----'
008840110705     A                                 19 43'GG.Chius'
008850110705     A                                 19 53'S-BolRientro'
008860110705     A                                 20  2'Tipo( /D/P)'
008870110705     A            VIDTCR         1A  B 20 14TEXT('tipo consegna richiesta')
008880110705     A N17                                  DSPATR(HI)
008890110705     A                                      VALUES(' ' 'D' 'P')
008900110705     A  17                                  DSPATR(RI)
008910110705     A                                      DSPATR(MDT)
008920110705     A  17                                  DSPATR(PR)
008930110705     A                                 20 16'Data'
008940110705     A            VIDDCR         8Y 0B 20 21TEXT('data consegna richista')
008950110705     A N16                                  DSPATR(HI)
008960110705     A  16                                  DSPATR(RI)
008970110705     A  16                                  DSPATR(PR)
008980110705     A  59                                  DSPATR(PC)
008990110705     A                                      CHECK(RB)
009000110705     A                                      EDTCDE(Z)
009010110705     A                                 20 30'Ora'
009020110705     A            VIDHCR         2Y 0B 20 34TEXT('ora consegna')
009030110705     A N23                                  DSPATR(HI)
009040110705     A  23                                  DSPATR(RI)
009050110705     A  23                                  DSPATR(PR)
009060110705     A  60                                  DSPATR(PC)
009070110705     A                                      CHECK(RB)
009080110705     A                                      EDTCDE(Z)
009090110705     A                                 20 37':'
009100110705     A            VIDMCR         2Y 0B 20 39TEXT('minuti consegna')
009110110705     A N23                                  DSPATR(HI)
009120110705     A  23                                  DSPATR(RI)
009130110705     A  23                                  DSPATR(PR)
009140110705     A                                      CHECK(RZ)
009150110705     A                                      EDTCDE(Z)
009160110705     A            VIDGC1         2A  B 20 44TEXT('giorno chiusura 1')
009170110705     A N91                                  DSPATR(HI)
009180110705     A  74                                  DSPATR(PC)
009190110705     A  91                                  DSPATR(RI)
009200110705     A  91                                  DSPATR(PR)
009210110705     A            VIDGC2         2A  B 20 48TEXT('giorno chiusura 2')
009220110705     A N91                                  DSPATR(HI)
009230110705     A  62                                  DSPATR(PC)
009240110705     A  91                                  DSPATR(RI)
009250110705     A  91                                  DSPATR(PR)
009260110705     A                                 20 53'F-FrFrontiera'
009270110705     A            VIDFBR         1A  B 20 67DSPATR(HI)
009280110705     A  44 12                               DSPATR(PR)
009290110705     A                                      DSPATR(MDT)
009300110705     A                                      VALUES(' ' 'S' 'F')
009310110705     A                                 20 71'V-Valore'
009320110705     A            VIDBVA         1A  B 20 80VALUES(' ' 'V')
009330110705     A                                      DSPATR(&ATRBVA)
009340110705     A                                 21  6'Consegne  Particolari'
009350110705     A                                 21 43'----------- PARTICOLARITA'' -------
009360110705     A                                      -----'
009370110705     A                                 22  2'?'
009380110705     A            VIDTC1         1A  B 22  4DSPATR(HI)
009390110705     A  63                                  DSPATR(PC)
009400110705     A            V2DTC1         9A  O 22  6
009410110705     A                                 22 17'?'
009420110705     A            VIDTC2         1A  B 22 19DSPATR(HI)
009430110705     A  64                                  DSPATR(PC)
009440110705     A            V2DTC2         9A  O 22 21
009450110705     A                                 22 43'C/Assegno'
009460110705     A                                 22 54'Giacenza'
009470110705     A                                 22 64'Consegna'
009480110705     A                                 22 74'Varie'
009490110705     A                                 23  2'Bancali: Tp.?'
009500110705     A            VIDTBA         2A  B 23 16DSPATR(HI)
009510110705     A                                      DSPATR(&ATRTBA)
009520110705     A                                      CHECK(RZ)
009530110705     A                                 23 19'n.'
009540110705     A            VIDNBA         2Y 0B 23 22DSPATR(HI)
009550110705     A                                      DSPATR(&ATRNBA)
009560110705     A                                      EDTCDE(Z)
009570110705     A                                      CHECK(RB)
009580110705     A                                 23 27'Tp.?'
009590110705     A            VIDTB2         2A  B 23 32DSPATR(HI)
009600110705     A                                      DSPATR(&ATRTB2)
009610110705     A                                      CHECK(RZ)
009620110705     A                                 23 35'n.'
009630110705     A            VIDNB2         2Y 0B 23 38DSPATR(HI)
009640110705     A                                      DSPATR(&ATRNB2)
009650110705     A                                      EDTCDE(Z)
009660110705     A                                      CHECK(RB)
009670110705     A                                 23 43'?'
009680110705     A            VIDGCR         1A  B 23 45DSPATR(HI)
009690110705     A                                      VALUES(' ' '?')
009700110705     A            VIDGCA         2A  B 23 48
009710110705     A N97                                  DSPATR(HI)
009720110705     A  65                                  DSPATR(PC)
009730110705     A  97                                  DSPATR(RI)
009740110705     A                                 23 54'?'
009750110705     A            VIDGGR         1A  B 23 56DSPATR(HI)
009760110705     A                                      VALUES(' ' '?')
009770110705     A            VIDGGA         2A  B 23 59
009780110705     A N97                                  DSPATR(HI)
009790110705     A  66                                  DSPATR(PC)
009800110705     A  97                                  DSPATR(RI)
009810110705     A                                 23 64'?'
009820110705     A            VIDGMR         1A  B 23 66DSPATR(HI)
009830110705     A                                      VALUES(' ' '?')
009840110705     A            VIDGMA         2A  B 23 69
009850110705     A N97                                  DSPATR(HI)
009860110705     A  67                                  DSPATR(PC)
009870110705     A  97                                  DSPATR(RI)
009880110705     A                                 23 74'?'
009890110705     A            VIDGVR         1A  B 23 76DSPATR(HI)
009900110705     A                                      VALUES(' ' '?')
009910110705     A            VIDGVA         2A  B 23 78
009920110705     A N97                                  DSPATR(HI)
009930110705     A  75                                  DSPATR(PC)
009940110705     A  97                                  DSPATR(RI)
009950110705     A                                      DSPATR(&ATRGVA)
009960110705     A  12N15                          24  1'F8=Agg+Stampa'
009970110705     A                                 24 15'F9=Tassazione'
009980110705     A                                 24 55'F18=ParcelDPD'
009990110705     A                                 24 69'F12=Ritorno'
010000110705     A                                 24 29'F15=CliTass'
010010110705     A                                      DSPATR(&ATRF15)
010020940920     A***-------------------------------------------------------------**
010030940920     A*  3 VIDEATA: ESTENSIONE BOLLE E TASSAZIONE- IN SFL LE VARIE
010040940920     A***-------------------------------------------------------------**
010050991025     A          R LS01S03                   SFL
010060991025     A*%%TS  SD  19991025  175959  EDPND       REL-V4R2M0  5769-PW1
010070991025     A            V3CEV1         1A  H
010080991025     A            V3HVA1    R     S  H      REFFLD(AR7VAN FIAR700F)
010090991025     A            V3CSV1    R        B 19  6REFFLD(AR7SVN *LIBL/FIAR700F)
010100991025     A                                      DSPATR(HI)
010110991025     A  50                                  DSPATR(PC)
010120991025     A  87                                  DSPATR(PR)
010130991025     A            V3CVA1    R     Y  B 19  8REFFLD(AR7VAN *LIBL/FIAR700F)
010140991025     A                                      DSPATR(HI)
010150991025     A  51                                  DSPATR(PC)
010160991025     A                                      EDTCDE(4)
010170991025     A  87                                  DSPATR(PR)
010180991025     A                                      CHECK(RB)
010190040126     A          R LS01C03                   SFLCTL(LS01S03)
010200040126     A*%%TS  SD  20040126  094327  EDPMB       REL-V4R4M0  5769-PW1
010210040126     A  *DS3                                SFLLIN(0004)
010220040126     A                                      SFLSIZ(0020)
010230040126     A                                      SFLPAG(0020)
010240040126     A                                      ROLLUP(36)
010250040126     A                                      CF12
010260040126     A N87                                  CF14
010270040126     A  05N18                               CF22
010280040126     A  12N15                               CF08
010290040126     A                                      CF06
010300040126     A                                      OVERLAY
010310040126     A N35                                  SFLDSP
010320040126     A N35                                  SFLDSPCTL
010330040126     A  35                                  SFLCLR
010340040126     A                                      CSRLOC(H3RIGA     H3COLO)
010350040126     A  90        VIDMSG        78   M
010360040126     A            VI2ES1         1A  H
010370040126     A            VI2ES2         1A  H
010380040126     A            VI2ES3         1A  H
010390040126     A            VI2ES4         1A  H
010400041217     A            VI2ES5         1A  H
010410041217     A            VI2ES6         1A  H
010420040126     A            VI2IMV        13  3H
010430040126     A            ATRSV2         1A  P
010440040126     A            ATRSV3         1A  P
010450040126     A            ATRSV4         1A  P
010460041217     A            ATRSV5         1A  P
010470041217     A            ATRSV6         1A  P
010480040126     A            H3RIGA         3S 0H
010490040126     A            H3COLO         3S 0H
010500040126     A            VIDDSA        20A  O  1  2
010510040126     A            VIDTES        33A  O  1 26DSPATR(RI)
010520040126     A                                      DSPATR(UL)
010530040126     A                                  1 62'FNLS01R'
010540040126     A                                  1 72DATE
010550040126     A                                      EDTCDE(Y)
010560040126     A            KNSIF         10A  O  2  2
010570040126     A            KNMUS         10A  O  2 13
010580040126     A                                  2 72TIME
010590040126     A  09        V2DTSP         8A  O  3  1DSPATR(RI)
010600040126     A                                  3 10'Linea Arrivo'
010610040126     A            V3CLNA         3A  O  3 23DSPATR(HI)
010620040126     A            V3DLNA        18A  O  3 27DSPATR(HI)
010630040126     A                                  3 46'Codice Bolla'
010640040126     A            VIDCBO    R        O  3 59REFFLD(BLPCBO FNBLP00F)
010650040126     A                                      DSPATR(HI)
010660040126     A            V2DCBO        18A  O  3 62DSPATR(HI)
010670040126     A                                  4  1'Destinat'
010680040126     A            V2CRSD    R        O  4 10REFFLD(BLPRSD FNBLP00F)
010690040126     A            V2CLOD        34A  O  4 46TEXT('LOCALITA'' DESTINATARIO')
010700040126     A                                  5  1'Mittente'
010710040126     A            VIDRSM        35A  O  5 10
010720040126     A            V3CLOM        34A  O  5 46TEXT('LOCALITA'' DESTINATARIO')
010730040126     A                                  6  1'C/Assegno'
010740040126     A            VIDTIC         2A  O  6 12TEXT('tipo incasso contrassegno')
010750040126     A            VIDCAS        13Y 3O  6 16TEXT('importo contrassegno')
010760040126     A                                      EDTCDE(2)
010770040126     A            VIDVCA         3A  O  6 35
010780040126     A  05                              7  2'-----------------------'
010790040126     A  05                              7 26'E S T E N S I O N E   B O L L A'
010800040126     A                                      DSPATR(HI)
010810040126     A  05                              7 58'---------------------'
010820040126     A  05                              8  4'Divisa'
010830041217     A  05                              8 14'Esenzione IVA'
010840041217     A  05                              8 33'?--- Varie ---'
010850041217     A  05                              8 49'?--- Varie ---'
010860040126     A  05                              9  5'?'
010870040126     A  05        VI2DIV    R        B  9  7REFFLD(AR6DIV FIAR600F)
010880040126     A                                      DSPATR(HI)
010890040126     A  43                                  DSPATR(PC)
010900041217     A  05                              9 12'?'
010910041217     A  05        VI2CEI         1A  B  9 14TEXT('esenz. IVA')
010920040126     A                                      DSPATR(HI)
010930040126     A  42                                  DSPATR(PC)
010940040126     A  87                                  DSPATR(PR)
010950041217     A  05        V2DCEI        15A  O  9 16
010960041217     A  05        VI2SV1    R     A  B  9 33REFFLD(AR7SVN FIAR700F)
010970040126     A                                      TEXT('flag varie 1')
010980040126     A                                      DSPATR(HI)
010990040126     A  40                                  DSPATR(PC)
011000041217     A  05        VI2VA1    R     Y  B  9 35REFFLD(AR7VAN FIAR700F)
011010040126     A                                      TEXT('importo varie 1')
011020040126     A                                      DSPATR(HI)
011030040126     A                                      CHECK(RB)
011040040126     A                                      EDTCDE(4)
011050040126     A  41                                  DSPATR(PC)
011060041217     A  05        VI2SV2    R     A  B  9 49REFFLD(AR7SVN FIAR700F)
011070040126     A                                      TEXT('flag varie 2')
011080040126     A                                      DSPATR(HI)
011090040126     A                                      DSPATR(&ATRSV2)
011100041217     A  05        VI2VA2    R     Y  B  9 51REFFLD(AR7VAN FIAR700F)
011110040126     A                                      TEXT('importo varie 2')
011120040126     A                                      DSPATR(HI)
011130040126     A                                      CHECK(RB)
011140040126     A                                      EDTCDE(4)
011150041217     A  05        VI2SV3    R     A  B  9 65REFFLD(AR7SVN FIAR700F)
011160040126     A                                      TEXT('flag varie 3')
011170040126     A                                      DSPATR(HI)
011180040126     A                                      DSPATR(&ATRSV3)
011190041217     A  05        VI2VA3    R     Y  B  9 67REFFLD(AR7VAN FIAR700F)
011200040126     A                                      TEXT('importo varie 3')
011210040126     A                                      DSPATR(HI)
011220040126     A                                      CHECK(RB)
011230040126     A                                      EDTCDE(4)
011240041217     A  05        VI2SV4    R     A  B 10 33REFFLD(AR7SVN FIAR700F)
011250040126     A                                      TEXT('flag varie 4')
011260040126     A                                      DSPATR(HI)
011270040126     A                                      DSPATR(&ATRSV4)
011280041217     A  05        VI2VA4    R     Y  B 10 35REFFLD(AR7VAN FIAR700F)
011290040126     A                                      TEXT('importo varie 4')
011300040126     A                                      DSPATR(HI)
011310040126     A                                      CHECK(RB)
011320040126     A                                      EDTCDE(4)
011330041217     A  05        VI2SV5    R     A  B 10 49REFFLD(AR7SVN FIAR700F)
011340041217     A                                      TEXT('flag varie 5')
011350041217     A                                      DSPATR(HI)
011360041217     A                                      DSPATR(&ATRSV5)
011370041217     A  05        VI2VA5    R     Y  B 10 51REFFLD(AR7VAN FIAR700F)
011380041217     A                                      TEXT('importo varie 5')
011390041217     A                                      DSPATR(HI)
011400041217     A                                      CHECK(RB)
011410041217     A                                      EDTCDE(4)
011420041217     A  05        VI2SV6    R     A  B 10 65REFFLD(AR7SVN FIAR700F)
011430041217     A                                      TEXT('flag varie 6')
011440041217     A                                      DSPATR(HI)
011450041217     A                                      DSPATR(&ATRSV6)
011460041217     A  05        VI2VA6    R     Y  B 10 67REFFLD(AR7VAN FIAR700F)
011470041217     A                                      TEXT('importo varie 6')
011480041217     A                                      DSPATR(HI)
011490041217     A                                      CHECK(RB)
011500041217     A                                      EDTCDE(4)
011510040126     A                                 11  2'----------------------------'
011520040126     A                                 11 31'T A S S A Z I O N E'
011530040126     A                                      DSPATR(HI)
011540040126     A                                 11 51'----------------------------'
011550040126     A                                 12  4'Divisa'
011560040126     A                                 12 22'Trasporto'
011570040126     A                                 12 41'Imponibile'
011580040126     A  22                             12 60'Totale FATTURA'
011590040126     A                                 13  5'?'
011600040126     A            VIDDIV    R        B 13  7REFFLD(AR6DIV FIAR600F)
011610040126     A                                      DSPATR(HI)
011620040126     A  87                                  DSPATR(PR)
011630040126     A  53                                  DSPATR(PC)
011640040126     A            VIDPOR    R     Y  B 13 19REFFLD(AR6POR FIAR600F)
011650040126     A                                      DSPATR(HI)
011660040126     A                                      CHECK(RB)
011670040126     A  52                                  DSPATR(PC)
011680040126     A  87                                  DSPATR(PR)
011690040126     A                                      EDTCDE(4)
011700040126     A            VIDIMV    R     Y  B 13 37REFFLD(AR6IMV FIAR600F)
011710040126     A                                      DSPATR(HI)
011720040126     A                                      CHECK(RB)
011730040126     A  45                                  DSPATR(PC)
011740040126     A  87                                  DSPATR(PR)
011750040126     A                                      EDTCDE(4)
011760040126     A  22        VIDIFT    R        O 13 57REFFLD(AR6IFT FIAR600F)
011770040126     A                                      EDTCDE(2)
011780040126     A                                      DSPATR(RI)
011790040126     A N34                             14 31'-------- F A T T U R A --------'
011800040126     A                                 15  4'Esenzione IVA'
011810040126     A N34                             15 31'Registro'
011820040126     A N34                             15 40'Numero'
011830040126     A N34                             15 54'D a t a'
011840040126     A                                 16  2'?'
011850040126     A            VIDCEI         1A  B 16  4DSPATR(HI)
011860040126     A  46                                  DSPATR(PC)
011870040126     A  87                                  DSPATR(PR)
011880040126     A            V3DCEI        20A  O 16  6
011890040126     A            VIDFIV         3Y 0O 16 34DSPATR(HI)
011900040126     A  47                                  DSPATR(PC)
011910040126     A                                      EDTCDE(Z)
011920040126     A  34                                  DSPATR(ND)
011930040126     A            VIDNFT         6Y 0O 16 40DSPATR(HI)
011940040126     A  48                                  DSPATR(PC)
011950040126     A                                      EDTCDE(Z)
011960040126     A  34                                  DSPATR(ND)
011970040126     A            VIDDFT         8Y 0O 16 52DSPATR(HI)
011980040126     A                                      EDTCDE(8)
011990040126     A  49                                  DSPATR(PC)
012000040126     A  34                                  DSPATR(ND)
012010040126     A                                 18  6'? -- Varie ---'
012020040126     A                                 18 24'? -- Varie ---'
012030040126     A                                 18 42'? -- Varie ---'
012040040126     A                                 18 60'? -- Varie ---'
012050050407     A  05                              8 65'? -- Varie ---'
012060940920     A***-------------------------------------------------------------**
012070940920     A*  VIDEATA PIEDI DEL SFL
012080940920     A***-------------------------------------------------------------**
012090941115     A          R LS01D04
012100941115     A*%%TS  SD  19941115  113420  EDPES       REL-V2R3M0  5738-PW1
012110941115     A                                      CA03
012120941115     A  12N15                          24  2'F8=Aggior+Stampa'
012130011029     A N87                             24 20'F14=Tassazione 1-Bolla'
012140941115     A  05N08                          24 45'F22=Tassazione 2-Bolla'
012150941115     A                                 24 69'F12=Ritorno'
012160940920     A***-------------------------------------------------------------**
012170940920     A*  VIDEATA CHE INFORMA LA SBORDERIZZAZIONE DELLA BOLLA
012180940920     A***-------------------------------------------------------------**
012190941231     A          R LS01D05
012200941231     A*%%TS  SD  19941231  121344  EDPES       REL-V2R3M0  5738-PW1
012210941231     A            VIDDSA        20A  O  1  2
012220941231     A            VIDTES        33A  O  1 26DSPATR(RI)
012230941231     A                                      DSPATR(UL)
012240941231     A                                  1 62'FNLS01R'
012250941231     A                                  1 72DATE
012260941231     A                                      EDTCDE(Y)
012270941231     A            KNSIF         10A  O  2  2
012280941231     A            KNMUS         10A  O  2 13
012290941231     A                                  2 72TIME
012300941231     A  09        V2DTSP         8A  O  3  1DSPATR(RI)
012310941231     A                                  3 10'Linea Arrivo'
012320941231     A            VIDLNA         3A  O  3 23DSPATR(HI)
012330941231     A            V1DLNA        18A  O  3 27DSPATR(HI)
012340941231     A                                  3 46'Codice Bolla'
012350941231     A            VIDCBO    R        O  3 59REFFLD(BLPCBO FNBLP00F)
012360941231     A                                      DSPATR(HI)
012370941231     A            V2DCBO        18A  O  3 62DSPATR(HI)
012380941231     A                                  7 26'** A T T E N Z I O N E !! **'
012390941231     A                                      DSPATR(RI)
012400941231     A                                      DSPATR(UL)
012410941231     A                                      DSPATR(BL)
012420941231     A                                 10 16' B O L L A   G I A''   B O R D E R-
012430941231     A                                       I Z Z A T A : '
012440941231     A                                      DSPATR(RI)
012450941231     A                                      DSPATR(UL)
012460941231     A                                 13  9'e'' stata variata la  LINEA DI ARR-
012470941231     A                                      IVO                            '
012480941231     A                                      DSPATR(RI)
012490941231     A                                 14  9'o la  DATA SPEDIZIONE  e'' diventa-
012500941231     A                                      ta maggiore della data bordero'''
012510941231     A                                      DSPATR(RI)
012520941231     A                                 17 21'**********************************-
012530941231     A                                      ****'
012540941231     A                                 18 21'* Questa bolla viene automaticamen-
012550941231     A                                      te *'
012560941231     A                                 19 21'*                                 -
012570941231     A                                         *'
012580941231     A                                 20 21'*   considerata  NON  BORDERIZZATA-
012590941231     A                                         *'
012600941231     A                                 21 21'**********************************-
012610941231     A                                      ****'
012620941231     A                                 24  3'Enter=Prosegui'
012630971210     A***-------------------------------------------------------------**
012640971210     A*  VIDEATA PER L'IMMISSIONE DEL NUMERO AWB
012650971210     A***-------------------------------------------------------------**
012660000829     A          R LS01D06
012670000829     A*%%TS  SD  20000829  121546  EDPRM       REL-V4R2M0  5769-PW1
012680000829     A  90        VIDMSG        78   M
012690000829     A            VIDDSA        20A  O  1  2
012700000829     A            VIDTES        33A  O  1 26DSPATR(RI)
012710000829     A                                      DSPATR(UL)
012720000829     A                                  1 62'FNLS01R'
012730000829     A                                  1 72DATE
012740000829     A                                      EDTCDE(Y)
012750000829     A            KNSIF         10A  O  2  2
012760000829     A            KNMUS         10A  O  2 13
012770000829     A                                  2 72TIME
012780000829     A  09        V2DTSP         8A  O  3  1DSPATR(RI)
012790000829     A                                  3 10'Linea Arrivo'
012800000829     A            V6CLNA         3A  O  3 23DSPATR(HI)
012810000829     A            V6DLNA        18A  O  3 27DSPATR(HI)
012820000829     A                                  3 46'Codice Bolla'
012830000829     A            VIDCBO    R        O  3 59REFFLD(BLPCBO FNBLP00F)
012840000829     A                                      DSPATR(HI)
012850000829     A            V2DCBO        18A  O  3 62DSPATR(HI)
012860000829     A  12N15                           6  3'Inserimento numero AWB :'
012870000829     A  12N15     V6CINS        10A  O  6 29
012880000829     A  12N15                           8  3'Etichetta stampata ....:'
012890000829     A  12N15     V6CSTA         2A  O  8 29
012900000829     A                                 13 16'Numero A. W. B.  :'
012910000829     A            V6CAWB        10Y 0B 13 36DSPATR(HI)
012920000829     A                                      CHECK(RZ)
012930000829     A  40                                  DSPATR(PC)
012940000829     A                                      EDTCDE(Z)
012950000829     A                                 24  2'ENTER=Prosegui'
012960991206     A*  VIDEATA PER L'IMMISSIONE DEL NUMERO PARCEL DPD
012970991130     A***-------------------------------------------------------------**
012980060619     A          R LS01D07
012990060619     A*%%TS  SD  20060619  141657  EDPRM       REL-V5R3M0  5722-WDS
013000060619     A  90        VIDMSG        78   M
013010060619     A            VIDDSA        20A  O  1  2
013020060619     A            VIDTES        33A  O  1 26DSPATR(RI)
013030060619     A                                      DSPATR(UL)
013040060619     A                                  1 62'FNLS01R'
013050060619     A                                  1 72DATE
013060060619     A                                      EDTCDE(Y)
013070060619     A            KNSIF         10A  O  2  2
013080060619     A            KNMUS         10A  O  2 13
013090060619     A                                  2 72TIME
013100060619     A  09        V2DTSP         8A  O  3  1DSPATR(RI)
013110060619     A                                  3 10'Linea Arrivo'
013120060619     A            V7CLNA         3A  O  3 23DSPATR(HI)
013130060619     A            V7DLNA        18A  O  3 27DSPATR(HI)
013140060619     A                                  3 46'Codice Bolla'
013150060619     A            VIDCBO    R        O  3 59REFFLD(BLPCBO FNBLP00F)
013160060619     A                                      DSPATR(HI)
013170060619     A            V2DCBO        18A  O  3 62DSPATR(HI)
013180060619     A            V7CNPR        14A  B 13 36TEXT('Numero distinta DPD')
013190060619     A                                      DSPATR(HI)
013200060619     A  40                                  DSPATR(PC)
013210060622     A  13
013220060619     A  12N15 79                            DSPATR(PR)
013230060619     A                                 24  2'ENTER=Prosegui'
013240060619     A                                 13  9'Identificativo pacco DPD:'
013250000829     A*----------------------------------------------------------------
013260000829     A* VIDEATA PER LA MANUTENZIONE DEL CODICE "CHI SONO"
013270000829     A*----------------------------------------------------------------
013280000921     A          R LS01S08                   SFL
013290000921     A*%%TS  SD  20000921  164106  EDPRM       REL-V4R2M0  5769-PW1
013300000921     A                                      TEXT('y')
013310000921     A            V8CSCE         1A  B  8 12VALUES(' ' 'A')
013320000921     A  61                                  DSPATR(PC)
013330000921     A            V8CNOT        35A  O  8 18
013340000921     A            V8HDKC         1A  H
013350000921     A            V8HESG         1A  H
013360000921     A            V8HST2         1S 0H
013370000921     A            V8HFLS         3S 0H
013380000921     A            V8HLNA         3S 0H
013390000921     A            V8HNRS         2S 0H
013400000921     A            V8HNSC         7S 0H
013410000921     A            V8HPRE        35A  H
013420000928     A          R LS01C08                   SFLCTL(LS01S08)
013430000928     A*%%TS  SD  20000928  105824  EDPRM       REL-V4R2M0  5769-PW1
013440000928     A N33                                  CF09
013450000928     A                                      CF12
013460000928     A                                      CF06
013470000928     A                                      OVERLAY
013480000928     A  78                                  SFLDSP
013490000928     A N35                                  SFLDSPCTL
013500000928     A  35                                  SFLCLR
013510000928     A N35                                  SFLEND
013520000928     A                                      SFLSIZ(0015)
013530000928     A                                      SFLPAG(0014)
013540000928     A  90        V8ZMSG        78   M
013550000928     A            VIDDSA        20A  O  1  2
013560000928     A            VIDTES        33A  O  1 26DSPATR(RI)
013570000928     A                                      DSPATR(UL)
013580000928     A                                  1 62'FNLS01R'
013590000928     A                                  1 72DATE
013600000928     A                                      EDTCDE(Y)
013610000928     A            KNSIF         10A  O  2  2
013620000928     A            KNMUS         10A  O  2 13
013630000928     A                                  2 72TIME
013640000928     A                                  4 12'Cliente:'
013650000928     A                                      DSPATR(HI)
013660000928     A            V8CKSC         7Y 0O  4 22EDTCDE(Z)
013670000928     A                                  4 30'-'
013680000928     A            V8DKSC        40A  O  4 32
013690000928     A                                  6 12'A'
013700000928     A                                      DSPATR(HI)
013710000928     A                                  6 18'Cod."CHI SONO"'
013720000928     A                                      DSPATR(HI)
013730000928     A                                      DSPATR(UL)
013740000928     A            V8CNBR         4S 0H      SFLRCDNBR
013750000928     A          R LS01Z08
013760000928     A*%%TS  SD  20000928  105824  EDPRM       REL-V4R2M0  5769-PW1
013770000928     A N33                             24 23'F9=Aggiunta codici'
013780000928     A                                 24 67'F12=Ritorno'
013790000928     A                                 24  2'A=Annullamento'
013800000928     A                                 24 44'F6=Fine manutenzione'
013810000914     A          R LS01D09
013820000914     A*%%TS  SD  20000914  101928  EDPRM       REL-V4R2M0  5769-PW1
013830000914     A                                      CF06
013840000914     A                                      CF12
013850000914     A                                      OVERLAY
013860000914     A                                 24  2'Cod."CHI SONO":'
013870000914     A            V9CNOT        35A  B 24 18CHECK(ER)
013880000914     A                                      DSPATR(PC)
013890000914     A                                 22  2'                                  -
013900000914     A                                                                         -
013910000914     A                                               '
013920000914     A                                      DSPATR(UL)
013930000914     A                                 24 55'F6=Fine Imm.'
013940000914     A                                 24 69'F12=Ritorno'
013950020123     A          R LS01W01
013960020123     A*%%TS  SD  20020123  131041  EDPRM       REL-V4R4M0  5769-PW1
013970020123     A                                      CF06
013980020123     A                                      CF12
013990020123     A                                      OVERLAY
014000020123     A                                      WINDOW(5 32 6 45)
014010020123     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
014020020123     A                                          '))
014030020123     A                                  2  2'Inserita nazione:'
014040020123     A            W01NZD        24A  O  2 20DSPATR(HI)
014050020123     A                                  4  2'Premere F6 per confermare'
014060020123     A                                  5 33'F12=Ritorno'
014070060110     A          R LS01W02
014080060110     A*%%TS  SD  20060110  130828  EDPRM       REL-V5R3M0  5722-WDS
014090060110     A                                      WINDOW(7 7 10 68)
014100060110     A                                      CF12
014110060110     A                                      OVERLAY
014120060110     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
014130060110     A                                          '))
014140060110     A                                  9 50'F12 = Ritorno'
014150060110     A            W02TES        67A  O  1  1DSPATR(HI)
014160060110     A            W02RIG1       67A  O  3  1
014170060110     A            W02RIG2       67A  O  4  1
014180060110     A            W02RIG3       67A  O  5  1
014190060110     A            W02RIG4       67A  O  6  1
014200060110     A            W02TES1       67A  O  2  1DSPATR(HI)
014210070604     A          R LS01W03
014220070604     A*%%TS  SD  20070604  091800  EDPRM       REL-V5R3M0  5722-WDS
014230070604     A                                      CF06
014240070604     A                                      CF12
014250070604     A                                      CSRLOC(H3RIGA H3COLO)
014260070604     A                                      OVERLAY
014270070604     A                                      WINDOW(7 15 8 44)
014280070604     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
014290070604     A                                          '))
014300070604     A            AT3C01         1A  P
014310070604     A            AT3COR         1A  P
014320070604     A            AT3C02         1A  P
014330070604     A            AT3CSF         1A  P
014340070604     A            AT3F12         1A  P
014350070604     A            H3RIGA         3S 0H
014360070604     A            H3COLO         3S 0H
014370070604     A  90        W03MSG        42   M
014380070604     A            W03RIG1       42A  O  1  2DSPATR(HI)
014390070604     A            W03RIG2       42A  O  2  2
014400070604     A                                  4  2'Colli originali'
014410070604     A                                      DSPATR(&AT3C01)
014420070604     A            W03COR         5Y 0B  4 18CHECK(RB)
014430070604     A                                      EDTCDE(4)
014440070604     A                                      DSPATR(&AT3COR)
014450070604     A                                      DSPATR(HI)
014460070604     A                                  4 25'Colli sfusi'
014470070604     A                                      DSPATR(&AT3C02)
014480070604     A            W03CSF         5Y 0B  4 37CHECK(RB)
014490070604     A                                      EDTCDE(4)
014500070604     A                                      DSPATR(&AT3CSF)
014510070604     A                                      DSPATR(HI)
014520070604     A                                  7  2'F06 = Conferma'
014530070604     A                                  7 31'F12 = Ritorno'
014540070604     A                                      DSPATR(&AT3F12)
014550051121     A          R LS01D08
014560051121     A*%%TS  SD  20051121  120638  EDPRM       REL-V5R3M0  5722-WDS
014570070606     A          R LS01W02PDA
014580070606     A*%%TS  SD  20070606  130122  EDPRM       REL-V5R3M0  5722-WDS
014590070606     A                                      OVERLAY
014600070606     A                                      WINDOW(7 20 7 40)
014610070606     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
014620070606     A                                          '))
014630070606     A                                  6 13'premere INVIO per continuare'
014640070606     A                                  2  2'ATTENZIONE:'
014650070606     A                                      DSPATR(HI)
014660070606     A                                  4  2'avvisare l''aut.'
014670070606     A                                  2 14'O.R.M. già trasmesso a PDA:'
014680070606     A            W02PDR_P       7Y 0O  4 18EDTCDE(Z)
014690070606     A            W02RSC_P      15   O  4 26
014700100517     A          R LS01W3CP
014710100517     A*%%TS  SD  20100517  121650  EDPES       REL-V6R1M0  5761-WDS
014720100517     A                                      WINDOW(12 20 7 40)
014730100517     A                                      CF06
014740100517     A                                      OVERLAY
014750100517     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
014760100517     A                                          '))
014770100517     A                                  1 12'EASY SPED / EASY WEB'
014780100517     A                                      DSPATR(HI)
014790100517     A                                      DSPATR(UL)
014800100517     A                                  3  2'AVVISARE POC:'
014810100517     A                                      DSPATR(HI)
014820100517     A            W3CPFL1       24A  O  3 16
014830100517     A            W3CPFL2       38A  O  4  2
014840100517     A            W3CPFL3       16A  O  5  2
014850100517     A                                  6 27'F6=Continua'
014860110509     A          R LS01WCLI
014870110509     A*%%TS  SD  20110509  110907  EDPRM       REL-V6R1M0  5761-WDS
014880110509     A                                      WINDOW(7 15 8 44)
014890110509     A                                      CF06
014900110509     A                                      CF12
014910110509     A                                      CSRLOC(HCLIRIGA   HCLICOLO)
014920110509     A                                      OVERLAY
014930110509     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
014940110509     A                                          '))
014950110509     A            ATRWKSC        1A  P
014960110509     A            ATRWCTR        1A  P
014970110509     A            HCLIRIGA       3S 0H
014980110509     A            HCLICOLO       3S 0H
014990110509     A  90        WCLIMSG       42   M
015000110509     A                                  4  2'Codice cliente'
015010110509     A                                  5  2'Codice tariffa'
015020110509     A                                  7  2'F06 = Conferma'
015030110509     A                                  7 31'F12 = Ritorno'
015040110509     A                                  2  7'Cliente/tariffa per tassazione'
015050110509     A                                      DSPATR(HI)
015060110509     A            WCLICTR        3A  B  5 18CHECK(RB)
015070110509     A                                      DSPATR(HI)
015080110509     A                                      DSPATR(&ATRWCTR)
015090110509     A            WCLIKSC        7Y 0B  4 18CHECK(RZ)
015100110509     A                                      DSPATR(HI)
015110110509     A                                      EDTCDE(Z)
015120110509     A                                      DSPATR(&ATRWKSC)
015130110509     A            WCLIDKS       18A  O  4 26
015140100305     A          R LS01WCAS
015150100305     A*%%TS  SD  20100305  103140  EDPES       REL-V5R4M0  5722-WDS
015160100305     A                                      WINDOW(10 34 13 43)
015170100305     A                                      CF06
015180100305     A                                      CF12
015190100305     A                                      CSRLOC(HCASRIGA   HCASCOLO)
015200100305     A                                      OVERLAY
015210100305     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
015220100305     A                                          '))
015230100305     A            HCASRIGA       3S 0H
015240100305     A            HCASCOLO       3S 0H
015250100305     A  90        WCASMSG       42   M
015260100305     A                                 12 12'F6=Conferma'
015270100305     A                                 12 31'F12=Ritorno'
015280100305     A                                  1  6'Scelta Beneficiario Contrassegno'
015290100305     A                                      DSPATR(HI)
015300100305     A            WCASSEL1       1A  B  4  1DSPATR(HI)
015310100305     A                                      VALUES(' ' 'X')
015320100305     A                                  3  5'Mittente Spedizione:'
015330100305     A            WCASSEL2       1A  B  7  1DSPATR(HI)
015340100305     A                                      VALUES(' ' 'X')
015350100305     A                                      DSPATR(PC)
015360100305     A                                  6  5'Ordinante O.R.M.:'
015370100305     A            WCASMIT       35A  O  4  5DSPATR(HI)
015380100305     A            WCASORD       35A  O  7  5DSPATR(HI)
015390100305     A            WCASDEST      35A  O 10  5DSPATR(HI)
015400100305     A                                 12  1'X=Scelta'
015410100305     A            WCASCOR        7S 0O  6 24DSPATR(HI)
015420100305     A                                  9  5'Destinatario Spedizione:'
015430100305     A                                  3  1'X'
015440110512     A          R LS01WEMD
015450110512     A*%%TS  SD  20110512  105333  EDPRM       REL-V6R1M0  5761-WDS
015460110512     A                                      WINDOW(8 2 6 70)
015470110512     A                                      CF06
015480110512     A                                      CF12
015490110512     A                                      CSRLOC(HEMDRIGA   HEMDCOLO)
015500110512     A                                      OVERLAY
015510110512     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
015520110512     A                                          '))
015530110512     A            ATRWEMD        1A  P
015540110512     A            HEMDRIGA       3S 0H
015550110512     A            HEMDCOLO       3S 0H
015560110512     A  90        WEMDMSG       70   M
015570110512     A                                  5  2'F06 = Conferma'
015580110512     A                                  5 31'F12 = Ritorno'
015590110512     A                                  1 19'Indirizzo Email Destinatario'
015600110512     A                                      DSPATR(HI)
015610110512     A            WEMDEST       70A  B  3  1DSPATR(&ATRWEMD)
015620110512     A                                      DSPATR(HI)
015630110516     A          R LS01WANN
015640110516     A*%%TS  SD  20110516  115124  EDPRM       REL-V6R1M0  5761-WDS
015650110516     A                                      TEXT('Conferma annullamento')
015660110516     A                                      CF06
015670110516     A                                      OVERLAY
015680110516     A                                      WINDOW(18 5 5 55)
015690110516     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
015700110516     A                                          '))
015710110516     A                                  2 14'CONFERMI ANNULLAMENTO ?'
015720110516     A            WVANN          1A  B  2 38VALUES('S' 'N')
015730110516     A                                  2 40'(S/N)'
015740110516     A                                  4  3'F6=Conferma'
015750110519     A          R LS01WVAB
015760110519     A*%%TS  SD  20110519  131220  EDPRM       REL-V6R1M0  5761-WDS
015770110519     A                                      TEXT('Conferma annullamento')
015780110519     A                                      CF12
015790110519     A                                      OVERLAY
015800110519     A                                      WINDOW(16 2 5 73)
015810110519     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
015820110519     A                                          '))
015830110519     A            WMS1          72A  O  2  1
015840110519     A                                  4 52'F12=Ritorno'
015850110705     A          R LS01WCUP
015860110705     A*%%TS  SD  20110705  092344  EDPRM       REL-V6R1M0  5761-WDS
015870110705     A                                      CF06
015880110705     A                                      CF12
015900110705     A                                      OVERLAY
015910110705     A                                      WINDOW(8 2 6 50)
015920110705     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
015930110705     A                                          '))
015940110705     A            ATRWEMD        1A  P
015980110705     A                                  5  2'F06 = Conferma'
015990110705     A                                  5 20'F12 = Ritorno'
016000110705     A                                  1  4'Codici per tracciabilità flussi fi-
016010110705     A                                      nanziari'
016020110705     A                                      DSPATR(HI)
016030110705     A            WCUPCUP       17A  B  3  7DSPATR(&ATRWEMD)
016040110705     A                                      DSPATR(HI)
016050110705     A            WCUPCIG       17A  B  3 32DSPATR(&ATRWEMD)
016060110705     A                                      DSPATR(HI)
016070110705     A                                  3  3'CUP'
016080110705     A                                  3 28'CIG'
