000001150519     A*%%***********************************************************************
000002150519     A*%%TS  RD  20150519  120340  EDPES       REL-V7R1M0  5770-WDS
000003150519     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004150519     A*%%FI       0000000000000000000000000000000000000000000000000
000005150519     A*%%***********************************************************************
000006150519     A          R LS61T1
000007150519     A*%%***********************************************************************
000008150519     A*%%RI 00000
000009150519     A*%%FS 001
000010150519     A*%%***********************************************************************
000011150519     A                                      SKIPB(002)
000012150519     A                                      SPACEA(001)
000013150519     A            RSUT          20A  O     1
000014150519     A                                    +0
000015150519     A                                      '/'
000016150519     A            SIMFEL         3S 0O    +0
000017150519     A                                   +21
000018150519     A                                      'LISTA MOTIVI DI NON PULIZIA BOLLE -
000019150519     A                                      PARTENZA'
000020150519     A            WDATE          8S 0O   +22
000021150519     A                                      EDTWRD('  /  /    ')
000022150519     A                                    +5
000023150519     A                                      'Pag.'
000024150519     A                                    +0
000025150519     A                                      PAGNBR
000026150519     A                                      EDTCDE(Z)
000027150519     A            KNSIF     R        O     1
000028150519     A                                      REFFLD(KNSIF KPJBA)
000029150519     A                                      SPACEB(001)
000030150519     A            KNMUS     R        O    +1
000031150519     A                                      REFFLD(KNMUS KPJBA)
000032150519     A                                    21
000033150519     A                                      'LNP ITALIA'
000034150519     A                                      SPACEB(001)
000035150519     A                                    +3
000036150519     A                                      'IMPORT'
000037150519     A                                    +3
000038150519     A                                      'Con riserva'
000039150519     A                                    +2
000040150519     A                                      'Con C.A.'
000041150519     A                                    21
000042150519     A                                      '-----------------------------------
000043150519     A                                      ---------'
000044150519     A                                      SPACEB(001)
000045150519     A                                     1
000046150519     A                                      'DATE PULIZIA BOLLE:'
000047150519     A                                      SPACEB(001)
000048150519     A            DTPITA         6S 0O    +2
000049150519     A                                      EDTWRD('  /  /  ')
000050150519     A            DTPIMP         6S 0O    +3
000051150519     A                                      EDTWRD('  /  /  ')
000052150519     A            DTPRSV         6S 0O    +4
000053150519     A                                      EDTWRD('  /  /  ')
000054150519     A            DTPCAN         6S 0O    +3
000055150519     A                                      EDTWRD('  /  /  ')
000056150519     A                                     1
000057150519     A                                      'DATE STAMPA.......:'
000058150519     A                                      SPACEB(002)
000059150519     A            DTSITA         6S 0O    +2
000060150519     A                                      EDTWRD('  /  /  ')
000061150519     A            DTSIMP         6S 0O    +3
000062150519     A                                      EDTWRD('  /  /  ')
000063150519     A            DTSRSV         6S 0O    +4
000064150519     A                                      EDTWRD('  /  /  ')
000065150519     A            DTSCAN         6S 0O    +3
000066150519     A                                      EDTWRD('  /  /  ')
000067150519     A                                    +2
000068150519     A                                      'Non cons.:'
000069150519     A            DTSNCN         6S 0O    +0
000070150519     A                                      EDTWRD('  /  /  ')
000071150519     A                                    +2
000072150519     A                                      'Non cons. con C.A.:'
000073150519     A            DTSNCC         6S 0O    +0
000074150519     A                                      EDTWRD('  /  /  ')
000075150519     A                                    66
000076150519     A                                      'Rimpalli:'
000077150519     A                                      SPACEB(001)
000078150519     A            DTSRIM         6S 0O    +1
000079150519     A                                      EDTWRD('  /  /  ')
000080150519     A                                     1
000081150519     A                                      'S P E D I Z I O N E'
000082150519     A                                      SPACEB(002)
000083150519     A                                    +7
000084150519     A                                      'LNA'
000085150519     A                                    +1
000086150519     A                                      'Cod'
000087150519     A                                    +1
000088150519     A                                      'C O N S E G N A'
000089150519     A                                    31
000090150519     A                                      'Bol'
000091150519     A                                      SPACEB(001)
000092150519     A                                    +2
000093150519     A                                      'Data'
000094150519     A                                    +2
000095150519     A                                      'Anomala'
000096150519     A                                    +1
000097150519     A                                      'Bloc'
000098150519     A*%%***********************************************************************
000099150519     A*%%SS
000100150519     A*%%CL 001
000101150519     A*%%CL 001
000102150519     A*%%CL 001
000103150519     A*%%CL 001
000104150519     A*%%CL 002
000105150519     A*%%CL 001
000106150519     A*%%CL 002
000107150519     A*%%CL 001
000108150519     A*%%CL 001
000109150519     A*%%***********************************************************************
000110150519     A          R LS61D1
000111150519     A*%%***********************************************************************
000112150519     A*%%RI 00000
000113150519     A*%%***********************************************************************
000114150519     A                                      SPACEA(001)
000115150519     A            P1CLNP    R        O     1
000116150519     A                                      REFFLD(BLPLNP *LIBL/FNBLP00F)
000117150519     A            P1CNRS    R        O     5
000118150519     A                                      REFFLD(BLPNRS *LIBL/FNBLP00F)
000119150519     A                                      EDTCDE(Z)
000120150519     A                                     7
000121150519     A                                      '-'
000122150519     A            P1CNSP    R        O     8
000123150519     A                                      REFFLD(BLPNSP *LIBL/FNBLP00F)
000124150519     A                                      EDTCDE(Z)
000125150519     A            P1CDSP         8  0O    16
000126150519     A                                      EDTWRD('  /  /    ')
000127150519     A            P1CLNA    R        O    +1
000128150519     A                                      REFFLD(BLPLNA FNBLP00F)
000129150519     A            P1CCBO         2A  O    +1
000130150519     A            P1CDCM         8  0O    35
000131150519     A                                      EDTWRD('  /  /    ')
000132150519     A            P1CCCA         1A  O    +2
000133150519     A            P1CFBC         1A  O    +2
000134150519     A            P01MES        79A  O    +2
000135150519     A*%%***********************************************************************
000136150519     A*%%SS
000137150519     A*%%CL 001
000138150519     A*%%***********************************************************************
000139150519     A          R LS61Z1
000140150519     A*%%***********************************************************************
000141150519     A*%%RI 00000
000142150519     A*%%FS 001
000143150519     A*%%***********************************************************************
000144150519     A                                      SPACEB(002)
000145150519     A                                    52
000146150519     A                                      '** FINE STAMPA **'
000147150519     A*%%***********************************************************************
000148150519     A*%%SS
000149150519     A*%%CP+999CRTPRTF
000150150519     A*%%CP+    FILE(GAITRAFIL/FNLS61P)
000151150519     A*%%CP+    DEVTYPE(*SCS)
000152150519     A*%%CP     PAGESIZE(*N       132      *N     )
000153150519     A*%%***********************************************************************
