000100040430     A*%%TS  SD  20040430  113633  EDPRM       REL-V4R4M0  5769-PW1
000200040430     A*** FILE : FNLSD1D *--------------------------------------------*
000300000000     A***-------------------------------------------------------------**
000400040430     A*%%EC
000500040430     A                                      DSPSIZ(24 80 *DS3)
000600040430     A                                      CHGINPDFT(HI UL)
000700040430     A                                      PRINT
000800941223     A*
000900941223     A**-------------------------------------------------------------**
001000040430     A          R LSD1D01
001100040430     A*%%TS  SD  20040430  113633  EDPRM       REL-V4R4M0  5769-PW1
001200040430     A                                      CA03
001300040430     A                                      CF06
001400040430     A  28        V1CMSG        78   M
001500040430     A            RSUT          20A  O  1  2
001600040430     A                                  1 26'* STATISTICA M.CUBI IN PARTENZA *'
001700040430     A                                      DSPATR(RI)
001800040430     A                                  1 61'FNLSD1R'
001900040430     A                                  1 71DATE
002000040430     A                                      EDTCDE(Y)
002100040430     A            KNSIF         10A  O  2  2
002200040430     A            KNMUS         10A  O  2 13
002300040430     A                                  2 26'*     PER TERMINAL DI ARRIVO    *'
002400040430     A                                      DSPATR(RI)
002500040430     A                                      DSPATR(UL)
002600040430     A                                  2 71TIME
002700040430     A                                 10  1'Data spedizione ......:'
002800040430     A            V1CDSD         8Y 0B 10 29CHECK(RB)
002900040430     A                                      EDTCDE(8)
003000040430     A  43                                  DSPATR(PC)
003100040430     A                                 24  2'F6=Conferma'
003200040430     A                                 24 73'F3=Fine'
003300040430     A                                 10 25'Dal'
003400040430     A                                 10 41'al'
003500040430     A            V1CDSA         8Y 0B 10 44CHECK(RB)
003600040430     A                                      EDTCDE(8)
003700040430     A  44                                  DSPATR(PC)
