000001120521     A*%%***********************************************************************
000002120521     A*%%TS  RD  20120521  111203  EDPES       REL-V6R1M0  5761-WDS
000003120521     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004120521     A*%%FI       0000000000000000000000000000000000000000000000000
000005120521     A*%%EC
000006120521     A*%%***********************************************************************
000007120521     A          R LSV3PT1
000008120521     A*%%***********************************************************************
000009120521     A*%%RI 00000
000010120521     A*%%***********************************************************************
000011120521     A            RSUT          20   O     1
000012120521     A                                      SKIPB(001)
000013120521     A            STPTES        49A  O   +17
000014120521     A                                    92
000015120521     A                                      'FNLSV3R'
000016120521     A                                   106
000017120521     A                                      DATE(*YY)
000018120521     A                                      EDTCDE(8)
000019120521     A                                   125
000020120521     A                                      'PAG:'
000021120521     A                                   129
000022120521     A                                      PAGNBR
000023120521     A                                      EDTCDE(Z)
000024120521     A*
000025120521     A            KNMUS         10   O     1
000026120521     A                                      SKIPB(002)
000027120521     A            KNSIF         10   O    12
000028120521     A            STPTES2       49A  O   +16
000029120521     A                                   107
000030120521     A                                      TIME
000031120521     A                                     1
000032120521     A                                      'Cliente Mittente'
000033120521     A                                      SPACEB(002)
000034120521     A            STACCM         7S  O    18
000035120521     A                                      HIGHLIGHT
000036120521     A                                    25
000037120521     A                                      '-'
000038120521     A            STARAG        25A  O    26
000039120521     A                                      HIGHLIGHT
000040120521     A                                    53
000041120521     A                                      'Linea Partenza'
000042120521     A            STALNP         3S  O    68
000043120521     A                                      EDTCDE(Z)
000044120521     A            STPDLNP       10A  O    71
000045120521     A            STPDECINV     24A  O    83
000046120521     A            STPDATA1       8S 0O   108
000047120521     A                                      EDTWRD('  /  /    ')
000048120521     A            STPDECINV2     2A  O   120
000049120521     A            STPDATA2       8S 0O   123
000050120521     A                                      EDTWRD('  /  /    ')
000051120521     A                                      HIGHLIGHT
000052120521     A                                     1
000053120521     A                                      '-------- SPEDIZIONE -------'
000054120521     A                                      SKIPB(006)
000055120521     A                                    +2
000056120521     A                                      '---- RIFERIMENTI MITTENTE -----'
000057120521     A                                    63
000058120521     A                                      '--- D E S T I N A T A R I O ---'
000059120521     A                                    +2
000060120521     A                                      '----- CONSEGNA -----'
000061120521     A                                    +2
000062120521     A                                      'DOCUMEN.FIRMATO'
000063120521     A                                     1
000064120521     A                                      'Lnp'
000065120521     A                                      SKIPB(007)
000066120521     A                                     5
000067120521     A                                      'Ser-Numero'
000068120521     A                                    16
000069120521     A                                      ' Data   '
000070120521     A                                    +0
000071120521     A                                      ' LNA'
000072120521     A                                    35
000073120521     A                                      'Numerico'
000074120521     A                                    +3
000075120521     A                                      'Alfanumerico'
000076120521     A                                    +5
000077120521     A                                      'RagioneSociale  Località       '
000078120521     A                                    +4
000079120521     A                                      'Data'
000080120521     A                                    +6
000081120521     A                                      'Anomala'
000082120521     A                                    +4
000083120521     A                                      'Data Ricezione'
000084120521     A                                     1
000085120521     A                                      '-----------------------------------
000086120521     A                                      ------------------------------------
000087120521     A                                      ------------------------------------
000088120521     A                                      ------------------------------------
000089120521     A                                      ------------------------------------
000090120521     A                                      ------------------------'
000091120521     A                                      SKIPB(008)
000092120521     A*%%***********************************************************************
000093120521     A*%%SS
000094120521     A*%%CL 001
000095120521     A*%%CL 002
000096120521     A*%%CL 002
000097120521     A*%%CL 001
000098120521     A*%%CL 001
000099120521     A*%%***********************************************************************
000100120521     A*
000101120521     A          R LSV3PD1
000102120521     A*%%***********************************************************************
000103120521     A*%%RI 00000
000104120521     A*%%***********************************************************************
000105120521     A                                      SPACEB(001)
000106120521     A            STPLNP         3  0O     1
000107120521     A                                      EDTCDE(4)
000108120521     A            STPNRS         2  0O     5
000109120521     A                                      EDTCDE(4)
000110120521     A            TRA01          1A  O    +0
000111120521     A            STPNSP         7  0O     8
000112120521     A                                      EDTCDE(4)
000113120521     A            STPDSP         6S 0O    16
000114120521     A                                      EDTWRD('  /  /  ')
000115120521     A            STPLNA         3  0O    25
000116120521     A            STPRMN        15S  O    +2
000117120521     A                                      EDTCDE(Z)
000118120521     A            STPRMA        15A  O    +1
000119120521     A            STPRSD        15A  O    63
000120120521     A            STPLOD        15A  O    79
000121120521     A            STPDCM         8S  O    +2
000122120521     A                                      EDTWRD('  /  /    ')
000123120521     A            STPCCA        11A  O    +1
000124120521     A            STPINV         8S  O    +3
000125120521     A                                      EDTWRD('  /  /    ')
000126120521     A*%%***********************************************************************
000127120521     A*%%SS
000128120521     A*%%***********************************************************************
000129120521     A*
000130120521     A          R LSV3PD3
000131120521     A*%%***********************************************************************
000132120521     A*%%RI 00000
000133120521     A*%%***********************************************************************
000134120521     A                                      SPACEB(001)
000135120521     A*%%***********************************************************************
000136120521     A*%%SS
000137120521     A*%%***********************************************************************
000138120521     A          R LSV3PFINE
000139120521     A*%%***********************************************************************
000140120521     A*%%RI 00000
000141120521     A*%%FS 001
000142120521     A*%%***********************************************************************
000143120521     A                                      SPACEB(002)
000144120521     A                                     2
000145120521     A                                      'Totale Spedizioni:'
000146120521     A            TOTALE         9S 0O    +1
000147120521     A                                      EDTCDE(2)
000148120521     A
000149120521     A                                    54
000150120521     A                                      '** FINE STAMPA **'
000151120521     A                                      SPACEB(002)
000152120521     A  01                                 2
000153120521     A                                      'Richiesta creazione file:  WFDDT00-
000154120521     A                                      F  '
000155120521     A                                      SPACEB(002)
000156120521     A                                      HIGHLIGHT
000157120521     A            STAINVIO      40A  O    +3
000158120521     A            STAEM         50A  O    +1
000159120521     A                                      HIGHLIGHT
000160120521     A*%%***********************************************************************
000161120521     A*%%SS
000162120521     A*%%CL 002
000163120521     A*%%CL 002
000164120521     A*%%FL 001
000165120521     A*%%NP
000166120521     A*%%***********************************************************************
000167120521     A          R LSV3PT2
000168120521     A*%%***********************************************************************
000169120521     A*%%RI 00000
000170120521     A*%%***********************************************************************
000171120521     A            RSUT          20   O     1
000172120521     A                                      SKIPB(001)
000173120521     A            STPTES        49A  O   +17
000174120521     A                                    92
000175120521     A                                      'FNLSV3R'
000176120521     A                                   106
000177120521     A                                      DATE(*YY)
000178120521     A                                      EDTCDE(8)
000179120521     A                                   125
000180120521     A                                      'PAG:'
000181120521     A                                   129
000182120521     A                                      PAGNBR
000183120521     A                                      EDTCDE(Z)
000184120521     A*
000185120521     A            KNMUS         10   O     1
000186120521     A                                      SKIPB(002)
000187120521     A            KNSIF         10   O    12
000188120521     A                                   107
000189120521     A                                      TIME
000190120521     A                                     1
000191120521     A                                      'Cliente Mittente'
000192120521     A                                      SPACEB(002)
000193120521     A            STACCM         7S  O    18
000194120521     A                                      HIGHLIGHT
000195120521     A                                    25
000196120521     A                                      '-'
000197120521     A            STARAG        25A  O    26
000198120521     A                                      HIGHLIGHT
000199120521     A                                    53
000200120521     A                                      'Linea Partenza'
000201120521     A            STALNP         3S  O    68
000202120521     A                                      EDTCDE(Z)
000203120521     A            STPDLNP       10A  O    71
000204120521     A            STPDECINV     24A  O    83
000205120521     A            STPDATA1       8S 0O   108
000206120521     A                                      EDTWRD('  /  /    ')
000207120521     A            STPDECINV2     2A  O   120
000208120521     A            STPDATA2       8S 0O   123
000209120521     A                                      EDTWRD('  /  /    ')
000210120521     A                                      HIGHLIGHT
000211120521     A                                      SKIPB(004)
000212120521     A            STPDEC3       24A  O    83
000213120521     A                                      SPACEB(002)
000214120521     A            STPDATA3       8S 0O   108
000215120521     A                                      EDTWRD('  /  /    ')
000216120521     A            STPDEC33       2A  O   120
000217120521     A            STPDATA4       8S 0O   123
000218120521     A                                      EDTWRD('  /  /    ')
000219120521     A                                      HIGHLIGHT
000220120521     A                                      SKIPB(006)
000221120521     A            STPDEC4       24A  O    83
000222120521     A                                      SPACEB(002)
000223120521     A            STPDATA5       8S 0O   108
000224120521     A                                      EDTWRD('  /  /    ')
000225120521     A            STPDEC44       2A  O   120
000226120521     A            STPDATA6       8S 0O   123
000227120521     A                                      EDTWRD('  /  /    ')
000228120521     A                                      HIGHLIGHT
000229120521     A                                      SKIPB(008)
000230120521     A            STPINVE       30A  O     2
000231120521     A                                      SPACEB(001)
000232120521     A            STPERRA       35A  O    42
000233120521     A  01                                 2
000234120521     A                                      'Richiesta creazione file:  WFDDT00-
000235120521     A                                      F  '
000236120521     A                                      SPACEB(002)
000237120521     A                                      HIGHLIGHT
000238120521     A  01                                +3
000239120521     A                                      'Indirizzo e-mail per invio file ex-
000240120521     A                                      cel:'
000241120521     A            STAEM         50A  O    +2
000242120521     A                                      HIGHLIGHT
000243120521     A*%%***********************************************************************
000244120521     A*%%SS
000245120521     A*%%CL 001
000246120521     A*%%CL 002
000247120521     A*%%CL 002
000248120521     A*%%CL 002
000249120521     A*%%CL 001
000250120521     A*%%CL 002
000251120521     A*%%CP+999CRTPRTF
000252120521     A*%%CP+    OVRFLW(65)
000253120521     A*%%CP+    FILE(GAITRASRC/FNLSV3P)
000254120521     A*%%CP+    DEVTYPE(*SCS)
000255120521     A*%%CP     PAGESIZE(*N       198      *N     )
000256120521     A*%%***********************************************************************
000257120521     A
000258120521      *----
