000001120704     A*%%***********************************************************************
000002120704     A*%%TS  RD  20120704  131147  EDPES       REL-V6R1M0  5761-WDS
000003120704     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004120704     A*%%FI       0000000000000000000000000000000000000000000000000
000005120704     A*%%EC
000006120704     A*%%***********************************************************************
000007120704     A          R LSV3PT1
000008120704     A*%%***********************************************************************
000009120704     A*%%RI 00000
000010120704     A*%%***********************************************************************
000011120704     A            RSUT          20   O     1
000012120704     A                                      SKIPB(001)
000013120704     A            STPTES        49A  O   +17
000014120704     A                                    92
000015120704     A                                      'FNLSV3R'
000016120704     A                                   106
000017120704     A                                      DATE(*YY)
000018120704     A                                      EDTCDE(8)
000019120704     A                                   125
000020120704     A                                      'PAG:'
000021120704     A                                   129
000022120704     A                                      PAGNBR
000023120704     A                                      EDTCDE(Z)
000024120704     A*
000025120704     A            KNMUS         10   O     1
000026120704     A                                      SKIPB(002)
000027120704     A            KNSIF         10   O    12
000028120704     A            STPTES2       49A  O   +16
000029120704     A                                   107
000030120704     A                                      TIME
000031120704     A                                     1
000032120704     A                                      'Cliente Mittente'
000033120704     A                                      SPACEB(002)
000034120704     A            STACCM         7S  O    18
000035120704     A                                      HIGHLIGHT
000036120704     A                                    25
000037120704     A                                      '-'
000038120704     A            STARAG        25A  O    26
000039120704     A                                      HIGHLIGHT
000040120704     A                                    53
000041120704     A                                      'Linea Partenza'
000042120704     A            STALNP         3S  O    68
000043120704     A                                      EDTCDE(Z)
000044120704     A            STPDLNP       10A  O    71
000045120704     A            STPDECINV     24A  O    83
000046120704     A            STPDATA1       8S 0O   108
000047120704     A                                      EDTWRD('  /  /    ')
000048120704     A            STPDECINV2     2A  O   120
000049120704     A            STPDATA2       8S 0O   123
000050120704     A                                      EDTWRD('  /  /    ')
000051120704     A                                      HIGHLIGHT
000052120704     A                                     1
000053120704     A                                      '-------- SPEDIZIONE -------'
000054120704     A                                      SKIPB(006)
000055120704     A                                    +2
000056120704     A                                      '---- RIFERIMENTI MITTENTE -----'
000057120704     A                                    63
000058120704     A                                      '--- D E S T I N A T A R I O ---'
000059120704     A                                    +2
000060120704     A                                      '----- CONSEGNA -----'
000061120704     A                                    +3
000062120704     A                                      '-------------  D  O  C  U  M  E  N-
000063120704     A                                        T  I    F  I  R  M  A  T  I ------
000064120704     A                                      --------'
000065120704     A                                     1
000066120704     A                                      'Lnp'
000067120704     A                                      SKIPB(007)
000068120704     A                                     5
000069120704     A                                      'Ser-Numero'
000070120704     A                                    16
000071120704     A                                      ' Data   '
000072120704     A                                    +0
000073120704     A                                      ' LNA'
000074120704     A                                    35
000075120704     A                                      'Numerico'
000076120704     A                                    +3
000077120704     A                                      'Alfanumerico'
000078120704     A                                    +5
000079120704     A                                      'RagioneSociale  Località       '
000080120704     A                                    +4
000081120704     A                                      'Data'
000082120704     A                                    +6
000083120704     A                                      'Anomala'
000084120704     A                                    +4
000085120704     A                                      'Data Ricezione'
000086120704     A                                    +1
000087120704     A                                      'Motivazione documenti non corretti'
000088120704     A                                    +1
000089120704     A                                      'inserim.'
000090120704     A                                    +2
000091120704     A                                      'Data scannerizzaz.'
000092120704     A                                     1
000093120704     A                                      '-----------------------------------
000094120704     A                                      ------------------------------------
000095120704     A                                      ------------------------------------
000096120704     A                                      ------------------------------------
000097120704     A                                      ------------------------------------
000098120704     A                                      ------------------------'
000099120704     A                                      SKIPB(008)
000100120704     A*%%***********************************************************************
000101120704     A*%%SS
000102120704     A*%%CL 001
000103120704     A*%%CL 002
000104120704     A*%%CL 002
000105120704     A*%%CL 001
000106120704     A*%%CL 001
000107120704     A*%%***********************************************************************
000108120704     A*
000109120704     A          R LSV3PD1
000110120704     A*%%***********************************************************************
000111120704     A*%%RI 00000
000112120704     A*%%***********************************************************************
000113120704     A                                      SPACEB(001)
000114120704     A            STPLNP         3  0O     1
000115120704     A                                      EDTCDE(4)
000116120704     A            STPNRS         2  0O     5
000117120704     A                                      EDTCDE(4)
000118120704     A            TRA01          1A  O    +0
000119120704     A            STPNSP         7  0O     8
000120120704     A                                      EDTCDE(4)
000121120704     A            STPDSP         6S 0O    16
000122120704     A                                      EDTWRD('  /  /  ')
000123120704     A            STPLNA         3  0O    25
000124120704     A            STPRMN        15S  O    +2
000125120704     A                                      EDTCDE(Z)
000126120704     A            STPRMA        15A  O    +1
000127120704     A            STPRSD        15A  O    63
000128120704     A            STPLOD        15A  O    79
000129120704     A            STPDCM         8S  O    +2
000130120704     A                                      EDTWRD('  /  /    ')
000131120704     A            STPCCA        11A  O    +1
000132120704     A            STPINV         8S  O    +3
000133120704     A                                      EDTWRD('  /  /    ')
000134120704     A            STPMTVDT       8A  O    +3
000135120704     A                                    +0
000136120704     A                                      '-'
000137120704     A            STDMTVDT      25A  O    +0
000138120704     A            STPDIMTV       8S  O    +1
000139120704     A                                      EDTWRD('  /  /    ')
000140120704     A            STPDTSCAN      8S  O    +2
000141120704     A                                      EDTWRD('  /  /    ')
000142120704     A*%%***********************************************************************
000143120704     A*%%SS
000144120704     A*%%***********************************************************************
000145120704     A*
000146120704     A          R LSV3PD3
000147120704     A*%%***********************************************************************
000148120704     A*%%RI 00000
000149120704     A*%%***********************************************************************
000150120704     A                                      SPACEB(001)
000151120704     A*%%***********************************************************************
000152120704     A*%%SS
000153120704     A*%%***********************************************************************
000154120704     A          R LSV3PFINE
000155120704     A*%%***********************************************************************
000156120704     A*%%RI 00000
000157120704     A*%%FS 001
000158120704     A*%%***********************************************************************
000159120704     A                                      SPACEB(002)
000160120704     A                                     2
000161120704     A                                      'Totale Spedizioni:'
000162120704     A            TOTALE         9S 0O    +1
000163120704     A                                      EDTCDE(2)
000164120704     A
000165120704     A                                    54
000166120704     A                                      '** FINE STAMPA **'
000167120704     A                                      SPACEB(002)
000168120704     A  01                                 2
000169120704     A                                      'Richiesta creazione file:  WFDDT00-
000170120704     A                                      F  '
000171120704     A                                      SPACEB(002)
000172120704     A                                      HIGHLIGHT
000173120704     A            STAINVIO      40A  O    +3
000174120704     A            STAEM         50A  O    +1
000175120704     A                                      HIGHLIGHT
000176120704     A*%%***********************************************************************
000177120704     A*%%SS
000178120704     A*%%CL 002
000179120704     A*%%CL 002
000180120704     A*%%FL 001
000181120704     A*%%NP
000182120704     A*%%***********************************************************************
000183120704     A          R LSV3PT2
000184120704     A*%%***********************************************************************
000185120704     A*%%RI 00000
000186120704     A*%%***********************************************************************
000187120704     A            RSUT          20   O     1
000188120704     A                                      SKIPB(001)
000189120704     A            STPTES        49A  O   +17
000190120704     A                                    92
000191120704     A                                      'FNLSV3R'
000192120704     A                                   106
000193120704     A                                      DATE(*YY)
000194120704     A                                      EDTCDE(8)
000195120704     A                                   125
000196120704     A                                      'PAG:'
000197120704     A                                   129
000198120704     A                                      PAGNBR
000199120704     A                                      EDTCDE(Z)
000200120704     A*
000201120704     A            KNMUS         10   O     1
000202120704     A                                      SKIPB(002)
000203120704     A            KNSIF         10   O    12
000204120704     A                                   107
000205120704     A                                      TIME
000206120704     A                                     1
000207120704     A                                      'Cliente Mittente'
000208120704     A                                      SPACEB(002)
000209120704     A            STACCM         7S  O    18
000210120704     A                                      HIGHLIGHT
000211120704     A                                    25
000212120704     A                                      '-'
000213120704     A            STARAG        25A  O    26
000214120704     A                                      HIGHLIGHT
000215120704     A                                    53
000216120704     A                                      'Linea Partenza'
000217120704     A            STALNP         3S  O    68
000218120704     A                                      EDTCDE(Z)
000219120704     A            STPDLNP       10A  O    71
000220120704     A            STPDECINV     24A  O    83
000221120704     A            STPDATA1       8S 0O   108
000222120704     A                                      EDTWRD('  /  /    ')
000223120704     A            STPDECINV2     2A  O   120
000224120704     A            STPDATA2       8S 0O   123
000225120704     A                                      EDTWRD('  /  /    ')
000226120704     A                                      HIGHLIGHT
000227120704     A                                      SKIPB(004)
000228120704     A            STPDEC3       24A  O    83
000229120704     A                                      SPACEB(002)
000230120704     A            STPDATA3       8S 0O   108
000231120704     A                                      EDTWRD('  /  /    ')
000232120704     A            STPDEC33       2A  O   120
000233120704     A            STPDATA4       8S 0O   123
000234120704     A                                      EDTWRD('  /  /    ')
000235120704     A                                      HIGHLIGHT
000236120704     A                                      SKIPB(006)
000237120704     A            STPDEC4       24A  O    83
000238120704     A                                      SPACEB(002)
000239120704     A            STPDATA5       8S 0O   108
000240120704     A                                      EDTWRD('  /  /    ')
000241120704     A            STPDEC44       2A  O   120
000242120704     A            STPDATA6       8S 0O   123
000243120704     A                                      EDTWRD('  /  /    ')
000244120704     A                                      HIGHLIGHT
000245120704     A                                      SKIPB(008)
000246120704     A            STPINVE       30A  O     2
000247120704     A                                      SPACEB(001)
000248120704     A            STPERRA       35A  O    42
000249120704     A  01                                 2
000250120704     A                                      'Richiesta creazione file:  WFDDT00-
000251120704     A                                      F  '
000252120704     A                                      SPACEB(002)
000253120704     A                                      HIGHLIGHT
000254120704     A  01                                +3
000255120704     A                                      'Indirizzo e-mail per invio file ex-
000256120704     A                                      cel:'
000257120704     A            STAEM         50A  O    +2
000258120704     A                                      HIGHLIGHT
000259120704     A*%%***********************************************************************
000260120704     A*%%SS
000261120704     A*%%CL 001
000262120704     A*%%CL 002
000263120704     A*%%CL 002
000264120704     A*%%CL 002
000265120704     A*%%CL 001
000266120704     A*%%CL 002
000267120704     A*%%CP+999CRTPRTF
000268120704     A*%%CP+    OVRFLW(65)
000269120704     A*%%CP+    FILE(GAITRASRC/FNLSV3P)
000270120704     A*%%CP+    DEVTYPE(*SCS)
000271120704     A*%%CP     PAGESIZE(*N       198      *N     )
000272120704     A*%%***********************************************************************
000273120704     A
000274120704      *----
