000001990126     A*%%***********************************************************************
000002990126     A*%%TS  RD  19990126  100723  EDPES       REL-V3R7M0  5716-PW1
000003990126     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004990126     A*%%FI       0000000000000000000000000000000000000000000000000
000005990126     A*%%***********************************************************************
000006990126     A**************************************************************************
000007990126     A*   STAMPA/RISTAMPA SPEDIZIONI PARTITE
000008990126     A*
000009990126     A*      COMPILARE CON:     PAGESIZE(66 198)
000010990126     A*                         CPI(15)
000011990126     A**************************************************************************
000012990126     A* ?  T E S T A T A    D I    S T A M P A  ?
000013990126     A          R LSD6T01
000014990126     A*%%***********************************************************************
000015990126     A*%%RI 00000
000016990126     A*%%FS 001
000017990126     A*%%***********************************************************************
000018990126     A                                      SKIPB(002)
000019990126     A            P1CRSU        20A        1
000020990126     A                                    21
000021990126     A                                      '/'
000022990126     A            SIMFEL         3S 0     22
000023990126     A                                    43
000024990126     A                                      'E L E N C O    S P E D I Z I O N I-
000025990126     A                                          P A R T I T E'
000026990126     A                                      HIGHLIGHT
000027990126     A            P1CSTA         8A      107
000028990126     A                                   121
000029990126     A                                      'DAL'
000030990126     A            P1CSS1         8S 0O   126
000031990126     A                                      EDTWRD('  /  /    ')
000032990126     A                                   138
000033990126     A                                      'AL'
000034990126     A            P1CSS2         8S 0O   142
000035990126     A                                      EDTWRD('  /  /    ')
000036990126     A                                   160
000037990126     A                                      'FNLSD6R'
000038990126     A            WDATE          8S 0O   174
000039990126     A                                      EDTWRD('  /  /    ')
000040990126     A                                   191
000041990126     A                                      'PAG.'
000042990126     A                                   195
000043990126     A                                      PAGNBR
000044990126     A                                      EDTCDE(Z)
000045990126     A            KNSIF     R              1
000046990126     A                                      REFFLD(KNSIF *LIBL/KPJBA)
000047990126     A                                      SPACEB(001)
000048990126     A            KNMUS     R             13
000049990126     A                                      REFFLD(KNMUS *LIBL/KPJBA)
000050990126     A            ORARIO         6S 0    175
000051990126     A                                      EDTWRD('  :  :  ')
000052990126     A                                    12
000053990126     A                                      'LINEA DI PARTENZA'
000054990126     A                                      SKIPB(005)
000055990126     A            P1CLNP    R        O    31
000056010726     A*?*                                   REFFLD(STBLNP *LIBL/FNSTB00F)
000057010726     A                                      REFFLD(BLPLNP *LIBL/FNBLP00F)
000058990126     A                                    35
000059990126     A                                      '-'
000060990126     A            P1DLNP    R        O    37
000061990126     A                                      REFFLD(ORGDES *LIBL/AZORG00F)
000062990126     A                                   159
000063990126     A                                      '------- L E G A M I    B O L L A --
000064990126     A                                      ------'
000065990126     A                                     1
000066990126     A                                      'DATA SPED.'
000067990126     A                                      SPACEB(001)
000068990126     A                                    12
000069990126     A                                      '-------MITTENTE--------'
000070990126     A                                    36
000071990126     A                                      '----DESTINATARIO----'
000072990126     A                                    57
000073990126     A                                      'SR'
000074990126     A                                    60
000075990126     A                                      'SPEDIZ.'
000076990126     A                                    68
000077990126     A                                      'LNA'
000078990126     A                                    73
000079990126     A                                      'RIFER.MITTENTE'
000080990126     A                                    88
000081990126     A                                      '-----GIACENZA-----'
000082990126     A                                   107
000083990126     A                                      '-----DISTINTA-----'
000084990126     A                                   126
000085990126     A                                      'D.CONSEGNA'
000086990126     A                                   137
000087990126     A                                      '--CONSEGNA ANOMALA---'
000088990126     A                                   159
000089990126     A                                      'DATA SPED.'
000090990126     A                                   170
000091990126     A                                      'LNP'
000092990126     A                                   174
000093990126     A                                      'SR'
000094990126     A                                   177
000095990126     A                                      'SPEDIZ.'
000096990126     A                                   185
000097990126     A                                      'LNA'
000098990126     A                                     1
000099990126     A                                      '-----------------------------------
000100990126     A                                      ------------------------------------
000101990126     A                                      ------------------------------------
000102990126     A                                      ------------------------------------
000103990126     A                                      ------------------------------------
000104990126     A                                      ------------------------'
000105990126     A                                      SPACEB(001)
000106990126     A*%%***********************************************************************
000107990126     A*%%SS
000108990126     A*%%CL 001
000109990126     A*%%CL 002
000110990126     A*%%CL 001
000111990126     A*%%CL 001
000112990126     A*%%***********************************************************************
000113990126     A**************************************************************************
000114990126     A* ?  D E T T A G L I O    B O L L A  ?
000115990126     A          R LSD6P01
000116990126     A*%%***********************************************************************
000117990126     A*%%RI 00000
000118990126     A*%%***********************************************************************
000119990126     A                                      SPACEB(001)
000120990126     A            P1CDSP         8S 0O     1
000121990126     A                                      EDTWRD('  /  /    ')
000122990126     A            P1CKSC    R        O    12
000123010726     A*?*                                   REFFLD(STBKSC *LIBL/FNSTB00F)
000124010726     A                                      REFFLD(BLPKSC *LIBL/FNBLP00F)
000125010726     A            P1CRSM        15   O    20
000126010726     A*?*                                   REFFLD(STBRSM *LIBL/FNSTB00F)
000128010726     A            P1CRSD        20   O    36
000129010726     A*?*                                   REFFLD(STBRSD *LIBL/FNSTB00F)
000131990126     A            P1CNRS    R        O    57
000132990126     A                                      EDTCDE(Z)
000133010726     A*?*                                   REFFLD(STBNRS *LIBL/FNSTB00F)
000134010726     A                                      REFFLD(BLPNRS *LIBL/FNBLP00F)
000135990126     A            P1CNSP    R        O    60
000136010726     A*?*                                   REFFLD(STBNSP *LIBL/FNSTB00F)
000137010726     A                                      REFFLD(BLPNSP *LIBL/FNBLP00F)
000138990126     A                                      EDTCDE(Z)
000139990126     A            P1CLNA    R        O    68
000140010726     A*?*                                   REFFLD(STBLNA *LIBL/FNSTB00F)
000141010726     A                                      REFFLD(BLPLNA *LIBL/FNBLP00F)
000142990126     A            P1CRMN    R        O    72
000143010726     A*?*                                   REFFLD(STBRMN *LIBL/FNSTB00F)
000144010726     A                                      REFFLD(BLPRMN *LIBL/FNBLP00F)
000145990126     A                                      EDTCDE(Z)
000146010726     A            P1CNGC         7  0O    88
000147010726     A*?*                                   REFFLD(STBNGC *LIBL/FNSTB00F)
000148990126     A                                      EDTCDE(Z)
000149010726     A            P1CDCG         8  0O    96
000150010726     A*?*                                   REFFLD(STBDCG *LIBL/FNSTB00F)
000151990126     A                                      EDTWRD('  /  /    ')
000152990126     A            P1CNDC    R        O   107
000153010726     A*?*                                   REFFLD(STBNDC *LIBL/FNSTB00F)
000154010726     A                                      REFFLD(BLPNDC *LIBL/FNBLP00F)
000155990126     A                                      EDTCDE(Z)
000156990126     A            P1CDDC    R        O   115
000157010726     A*?*                                   REFFLD(STBDDC *LIBL/FNSTB00F)
000158010726     A                                      REFFLD(BLPDDC *LIBL/FNBLP00F)
000159990126     A                                      EDTWRD('  /  /    ')
000160990126     A            P1CDCM    R        O   126
000161010726     A*?*                                   REFFLD(STBDCM *LIBL/FNSTB00F)
000162010726     A                                      REFFLD(BLPDCM *LIBL/FNBLP00F)
000163990126     A                                      EDTWRD('  /  /    ')
000164990126     A            P1CCCA    R        O   137
000165010726     A*?*                                   REFFLD(STBCCA *LIBL/FNSTB00F)
000166010726     A                                      REFFLD(BLPCCA *LIBL/FNBLP00F)
000167990126     A            P1DCCA        19A  O   139
000168990126     A*%%***********************************************************************
000169990126     A*%%SS
000170990126     A*%%***********************************************************************
000171990126     A**************************************************************************
000172990126     A* ?  D E T T A G L I O    L E G A M E    B O L L A  ?
000173990126     A          R LSD6P02
000174990126     A*%%***********************************************************************
000175990126     A*%%RI 00000
000176990126     A*%%***********************************************************************
000177990126     A            P2CDSP         8S 0O   159
000178990126     A                                      EDTWRD('  /  /    ')
000179990126     A            P2CLNP    R        O   170
000180990126     A                                      REFFLD(LBLLPO *LIBL/FNLBL00F)
000181990126     A            P2CNRS    R        O   174
000182990126     A                                      EDTCDE(Z)
000183990126     A                                      REFFLD(LBLNRO *LIBL/FNLBL00F)
000184990126     A            P2CNSP    R        O   177
000185990126     A                                      REFFLD(LBLNSO *LIBL/FNLBL00F)
000186990126     A                                      EDTCDE(Z)
000187990126     A            P2CLNA    R        O   185
000188990126     A                                      REFFLD(LBLLAO *LIBL/FNLBL00F)
000189990126     A            P2CPOS        10A  O   189
000190990126     A*%%***********************************************************************
000191990126     A*%%SS
000192990126     A*%%***********************************************************************
000193990126     A          R LSD6P04
000194990126     A*%%***********************************************************************
000195990126     A*%%RI 00000
000196990126     A*%%***********************************************************************
000197990126     A                                      SPACEB(001)
000198990126     A  05                                42
000199990126     A                                      'Com.Anomalia:'
000200990126     A  05        P4CFIL         3S 0O    56
000201990126     A  05        P4CNCA         7S 0O    +1
000202990126     A                                      EDTCDE(Z)
000203990126     A  05                                +1
000204990126     A                                      'del'
000205990126     A  05        P4CDCA         8S 0O    +1
000206990126     A                                      EDTWRD('  /  /    ')
000207990126     A  05                                +4
000208990126     A                                      'chiusa il'
000209990126     A  05        P4CCHC         8S 0O    +1
000210990126     A                                      EDTWRD('  /  /    ')
000211990126     A                                    +2
000212990126     A                                      'segnacolli:'
000213990126     A            P4CFLS         3S 0O    +1
000214990126     A                                      EDTCDE(Z)
000215990126     A                                    +0
000216990126     A                                      '/'
000217990126     A            P4CNS1         7S 0O    +0
000218990126     A                                      EDTCDE(Z)
000219990126     A            P4CNS2         7S 0O    +1
000220990126     A                                      EDTCDE(Z)
000221990126     A            P4CNS3         7S 0O    +1
000222990126     A                                      EDTCDE(Z)
000223990126     A            P4CNS4         7S 0O    +1
000224990126     A                                      EDTCDE(Z)
000225990126     A            P4CNS5         7S 0O    +1
000226990126     A                                      EDTCDE(Z)
000227990126     A            P4CNS6         7S 0O    +1
000228990126     A                                      EDTCDE(Z)
000229990126     A            P4CNS7         7S 0O    +1
000230990126     A                                      EDTCDE(Z)
000231990126     A            P4CNS8         7S 0O    +1
000232990126     A                                      EDTCDE(Z)
000233990126     A            P4CNS9         7S 0O    +1
000234990126     A                                      EDTCDE(Z)
000235990126     A*%%***********************************************************************
000236990126     A*%%SS
000237990126     A*%%***********************************************************************
000238990126     A**************************************************************************
000239990126     A* ?  S A L T A    U N A    R I G A  ?
000240990126     A          R LSD6P03
000241990126     A*%%***********************************************************************
000242990126     A*%%RI 00000
000243990126     A*%%***********************************************************************
000244990126     A                                      SPACEB(001)
000245990126     A*%%***********************************************************************
000246990126     A*%%SS
000247990126     A*%%***********************************************************************
000248990126     A**************************************************************************
000249990126     A* ?  N E S S U N A    B O L L A  ?
000250990126     A          R LSD6Z01
000251990126     A*%%***********************************************************************
000252990126     A*%%RI 00000
000253990126     A*%%FS 002
000254990126     A*%%***********************************************************************
000255990126     A                                      SPACEB(003)
000256990126     A                                    82
000257990126     A                                      '****  NESSUNA BOLLA DA STAMPARE  *-
000258990126     A                                      ***'
000259990126     A*%%***********************************************************************
000260990126     A*%%SS
000261990126     A*%%***********************************************************************
000262990126     A**************************************************************************
000263990126     A* ?  F I N E    S T A M P A  ?
000264990126     A          R LSD6Z02
000265990126     A*%%***********************************************************************
000266990126     A*%%RI 00000
000267990126     A*%%FS 001
000268990126     A*%%***********************************************************************
000269990126     A                                      SPACEB(002)
000270990126     A                                    38
000271990126     A                                      'BOLLE STAMPATE :'
000272990126     A            P2CBOL         7S 0O    55
000273990126     A                                      EDTCDE(Z)
000274990126     A                                    88
000275990126     A                                      '****  FINE  STAMPA  ****'
000276990126     A*%%***********************************************************************
000277990126     A*%%SS
000278990126     A*%%CP+999CRTPRTF
000279990126     A*%%CP+    FILE(GAITRASRC/FNLSD6P)
000280990126     A*%%CP+    DEVTYPE(*SCS)
000281990126     A*%%CP     PAGESIZE(*N       198      *N     )
000282990126     A*%%***********************************************************************
