000100091110     A*%%TS  SD  20091110  093036  EDPMB       REL-V5R4M0  5722-WDS
000200091110     A*%%EC
000300091110     A                                      DSPSIZ(24 80 *DS3)
000400091110     A                                      PRINT
000500031009     A          R LS80T01
000600031009     A*%%TS  SD  20031009  093048  EDPMB       REL-V4R4M0  5769-PW1
000700031009     A            VIDDSA        20A  O  1  2
000800031009     A            VIDTES        32A  O  1 25DSPATR(RI)
000900031009     A                                      DSPATR(UL)
001000031009     A                                  1 72DATE
001100031009     A                                      EDTCDE(Y)
001200031009     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
001300031009     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
001400031009     A                                  2 72TIME
001500031009     A            VIDTES1       15A  O  2 33DSPATR(RI)
001600031009     A                                      DSPATR(UL)
001700031009     A                                  1 61'FNLS80R'
001800091110     A          R LS80S01                   SFL
001900091110     A*%%TS  SD  20091110  093036  EDPMB       REL-V5R4M0  5722-WDS
002000091110     A            V1SCCM         7  0O  5  2EDTCDE(Z)
002100091110     A  10                                  DSPATR(RI)
002200091110     A            V1SRAG        13   O  5 10
002300091110     A  10                                  DSPATR(RI)
002400091110     A            V1SMGS         5A  O  5 28
002500091110     A            V1SRVAB        5  0O  5 34EDTCDE(2)
002600091110     A            V1STNCL        6Y 0O  5 41EDTCDE(2)
002700091110     A            V1STPKB        8Y 1O  5 49EDTCDE(2)
002800091110     A            V1SRVAD        5Y 0O  5 61EDTCDE(2)
002900091110     A            V1SRVAT        5Y 0O  5 68EDTCDE(2)
003000091110     A            V1SNSR         2Y 0O  5 24EDTCDE(Z)
003100091110     A            V1SRVAX        5Y 0O  5 75EDTCDE(2)
003200040604     A          R LS80C01                   SFLCTL(LS80S01)
003300040604     A*%%TS  SD  20040604  150815  EDPRM       REL-V4R4M0  5769-PW1
003400040604     A                                      SFLSIZ(0019)
003500040604     A                                      SFLPAG(0018)
003600040604     A                                      CA12
003700040604     A                                      OVERLAY
003800040604     A N21                                  SFLDSP
003900040604     A N21                                  SFLDSPCTL
004000040604     A  21                                  SFLCLR
004100040604     A  20                                  SFLEND(*MORE)
004200040604     A            REC            4S 0H      SFLRCDNBR
004300091110     A  28        V1CMSG        79   M
004400040604     A                                  4  2'C L I E N T E         Sr   Data  B-
004500040604     A                                      olle   Colli        Peso  n.VAD  n.-
004600040604     A                                      VAT  n.VAX'
004700040604     A                                      DSPATR(HI)
004800040604     A                                      DSPATR(UL)
004900031007     A          R LS80Z01
005000031007     A                                      OVERLAY
005100031007     A                                 24  2'F12=Ritorno'
005200031008     A          R LS80D01
005300031008     A*%%TS  SD  20031008  144030  EDPMB       REL-V4R4M0  5769-PW1
005400031008     A                                      CA12
005500031008     A                                      OVERLAY
005600031008     A                                  4  2'C L I E N T E                Sr   -
005700031008     A                                      Data  Bolle   Colli        Peso  n.-
005800031008     A                                      VAD  n.VAT'
005900031008     A                                      DSPATR(HI)
006000031008     A                                      DSPATR(UL)
006100031008     A                                 13 28'NON TROVATI RECORD NEL VAB'
006200031008     A                                      DSPATR(HI)
