000001090911     A*%%***********************************************************************
000002090911     A*%%TS  RD  20090911  113538  EDPES       REL-V5R4M0  5722-WDS
000003090911     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004090911     A*%%FI       0000000000000000000000000000000000000000000000000
000005090911     A*%%***********************************************************************
000006090911      *  S T A T I S T I C A    P A R T E N Z E
000007090911      *       B  O  L  L  E  T  T  A  T  O
000008090911      *
000009090911      *      COMPILARE CON:     PAGESIZE(66 198)
000010090911      *                         CPI(15)
000011090911      *
000012090911      * ?  T E S T A T A    D I    S T A M P A  ?
000013090911     A          R LSC5T1
000014090911     A*%%***********************************************************************
000015090911     A*%%RI 00000
000016090911     A*%%FS 001
000017090911     A*%%***********************************************************************
000018090911     A                                      SKIPB(002)
000019090911     A            RSUT          20A  O     1
000020090911     A            STRIP          8A  O    41
000021090911     A                                    81
000022090911     A                                      'S T A T I S T I C A     P A R T E -
000023090911     A                                      N Z E'
000024090911     A                                   155
000025090911     A                                      'FNLSC5R'
000026090911     A            WDATE          8S 0    171
000027090911     A                                      EDTWRD('  /  /    ')
000028090911     A                                   191
000029090911     A                                      'PAG.'
000030090911     A N31                               195
000031090911     A                                      PAGNBR
000032090911     A                                      EDTCDE(Z)
000033090911     A            KNSIF     R              1
000034090911     A                                      REFFLD(KNSIF KPJBA)
000035090911     A                                      SKIPB(003)
000036090911     A            KNMUS     R             12
000037090911     A                                      REFFLD(KNSIF KPJBA)
000038090911     A            STRIP1         8A  O    41
000039090911     A            UTIME          6S 0    172
000040090911     A                                      EDTWRD('  :  :  ')
000041090911     A  43                                81
000042090911     A                                      'BOLLETTATO  DAL'
000043090911     A                                      SPACEB(001)
000044090911     A N43                                66
000045090911     A                                      'BOLLETTATO IN SOSPENSIONE  DAL'
000046090911     A            DS1GDA    R             98
000047090911     A                                      REFFLD(DS1GDA DSLS01)
000048090911     A                                      EDTWRD('  /  /    ')
000049090911     A                                   110
000050090911     A                                      'AL'
000051090911     A            DS1GAL    R            114
000052090911     A                                      REFFLD(DS1GAL DSLS01)
000053090911     A                                      EDTWRD('  /  /    ')
000054090911     A                                    37
000055090911     A                                      '------------------ P E S I --------
000056090911     A                                      ------------'
000057090911     A                                      SPACEB(001)
000058090911     A                                    97
000059090911     A                                      '--------------------------------- -
000060090911     A                                      S P E D I Z I O N I ----------------
000061090911     A                                      -------------------'
000062090911     A                                     1
000063090911     A                                      'PUNTO OPERATIVO'
000064090911     A                                      SPACEB(001)
000065090911     A                                    30
000066090911     A                                      'COLLI'
000067090911     A                                    37
000068090911     A                                      'FINO A 35Q'
000069090911     A                                    49
000070090911     A                                      'OLTRE 35Q.'
000071090911     A                                    65
000072090911     A                                      'TOTALE'
000073090911     A                                    74
000074090911     A                                      'TASSABILE'
000075090911     A                                    89
000076090911     A                                      'VOLUME'
000077090911     A                                    97
000078090911     A                                      '----'
000079090911     A            WDTSPE         8A  O    +0
000080090911     A                                   109
000081090911     A                                      '----'
000082090911     A                                   115
000083090911     A                                      '----'
000084090911     A            WDTSPD         8A  O    +0
000085090911     A                                   127
000086090911     A                                      '----'
000087090911     A                                   133
000088090911     A                                      '----'
000089090911     A            WDTSPC         8A  O    +0
000090090911     A                                   145
000091090911     A                                      '----'
000092090911     A                                   151
000093090911     A                                      '-----TOTALI-----'
000094090911     A                                   169
000095090911     A                                      '----RECUPERI----'
000096090911     A                                    97
000097090911     A                                      '     FR'
000098090911     A                                      SPACEB(001)
000099090911     A                                   106
000100090911     A                                      '     AS'
000101090911     A                                   115
000102090911     A                                      '     FR'
000103090911     A                                   124
000104090911     A                                      '     AS'
000105090911     A                                   133
000106090911     A                                      '     FR'
000107090911     A                                   142
000108090911     A                                      '     AS'
000109090911     A                                   151
000110090911     A                                      '     FR'
000111090911     A                                   160
000112090911     A                                      '     AS'
000113090911     A                                   169
000114090911     A                                      '     FR'
000115090911     A                                   178
000116090911     A                                      '     AS'
000117090911     A*%%***********************************************************************
000118090911     A*%%SS
000119090911     A*%%CL 001
000120090911     A*%%CL 001
000121090911     A*%%CL 001
000122090911     A*%%CL 001
000123090911     A*%%CL 001
000124090911     A*%%***********************************************************************
000125090911      * ?  T E S T A T A    D I    S T A M P A  ?CON NUOVO TIPO SERVIZIO
000126090911     A          R LSC5T1N
000127090911     A*%%***********************************************************************
000128090911     A*%%RI 00000
000129090911     A*%%FS 001
000130090911     A*%%***********************************************************************
000131090911     A                                      SKIPB(002)
000132090911     A            RSUT          20A  O     1
000133090911     A                                    21
000134090911     A                                      '/'
000135090911     A            SIMFEL         3S 0O    22
000136090911     A            STRIP          8A  O    41
000137090911     A                                    81
000138090911     A                                      'S T A T I S T I C A     P A R T E -
000139090911     A                                      N Z E'
000140090911     A                                   155
000141090911     A                                      'FNLSC5R'
000142090911     A            WDATE          8S 0    171
000143090911     A                                      EDTWRD('  /  /    ')
000144090911     A                                   191
000145090911     A                                      'PAG.'
000146090911     A N31                               195
000147090911     A                                      PAGNBR
000148090911     A                                      EDTCDE(Z)
000149090911     A            KNSIF     R              1
000150090911     A                                      REFFLD(KNSIF KPJBA)
000151090911     A                                      SKIPB(003)
000152090911     A            KNMUS     R             12
000153090911     A                                      REFFLD(KNSIF KPJBA)
000154090911     A            STRIP1         8A  O    41
000155090911     A            UTIME          6S 0    172
000156090911     A                                      EDTWRD('  :  :  ')
000157090911     A  43                                81
000158090911     A                                      'BOLLETTATO  DAL'
000159090911     A                                      SPACEB(001)
000160090911     A N43                                66
000161090911     A                                      'BOLLETTATO IN SOSPENSIONE  DAL'
000162090911     A            DS1GDA    R             98
000163090911     A                                      REFFLD(DS1GDA DSLS01)
000164090911     A                                      EDTWRD('  /  /    ')
000165090911     A                                   110
000166090911     A                                      'AL'
000167090911     A            DS1GAL    R            114
000168090911     A                                      REFFLD(DS1GAL DSLS01)
000169090911     A                                      EDTWRD('  /  /    ')
000170090911     A                                    37
000171090911     A                                      '------------------ P E S I --------
000172090911     A                                      ------------'
000173090911     A                                      SPACEB(001)
000174090911     A                                    95
000175090911     A                                      '-----------------------------------
000176090911     A                                      ------- S P E D I Z I O N I --------
000177090911     A                                      -----------------------------------'
000178090911     A                                     1
000179090911     A                                      'PUNTO OPERATIVO'
000180090911     A                                      SPACEB(001)
000181090911     A                                    30
000182090911     A                                      'COLLI'
000183090911     A                                    37
000184090911     A                                      'FINO A 35Q'
000185090911     A                                    49
000186090911     A                                      'OLTRE 35Q.'
000187090911     A                                    65
000188090911     A                                      'TOTALE'
000189090911     A                                    74
000190090911     A                                      'TASSABILE'
000191090911     A                                    88
000192090911     A                                      'VOLUME'
000193090911     A                                    95
000194090911     A                                      '----'
000195090911     A            WDTSPH         8A  O    99
000196090911     A                                   107
000197090911     A                                      '----'
000198090911     A                                   113
000199090911     A                                      '----'
000200090911     A            WDTSPE         8A  O   117
000201090911     A                                   125
000202090911     A                                      '----'
000203090911     A                                   131
000204090911     A                                      '----'
000205090911     A            WDTSPD         8A  O   135
000206090911     A                                   143
000207090911     A                                      '----'
000208090911     A                                   149
000209090911     A                                      '----'
000210090911     A            WDTSPC         8A  O   153
000211090911     A                                   161
000212090911     A                                      '----'
000213090911     A                                   166
000214090911     A                                      '-----TOTALI-----'
000215090911     A                                   184
000216090911     A                                      '----RECUPERI---'
000217090911     A                                    95
000218090911     A                                      '     FR'
000219090911     A                                      SPACEB(001)
000220090911     A                                   103
000221090911     A                                      '     AS'
000222090911     A                                   112
000223090911     A                                      '     FR'
000224090911     A                                   121
000225090911     A                                      '     AS'
000226090911     A                                   130
000227090911     A                                      '     FR'
000228090911     A                                   139
000229090911     A                                      '     AS'
000230090911     A                                   148
000231090911     A                                      '     FR'
000232090911     A                                   157
000233090911     A                                      '     AS'
000234090911     A                                   166
000235090911     A                                      '     FR'
000236090911     A                                   175
000237090911     A                                      '     AS'
000238090911     A                                   184
000239090911     A                                      '     FR'
000240090911     A                                   192
000241090911     A                                      '     AS'
000242090911     A*%%***********************************************************************
000243090911     A*%%SS
000244090911     A*%%CL 001
000245090911     A*%%CL 001
000246090911     A*%%CL 001
000247090911     A*%%CL 001
000248090911     A*%%CL 001
000249090911     A*%%***********************************************************************
000250090911      * ?  S A L T A    U N A    R I G A  ?
000251090911     A*         R LSC5T2                    SPACEB(1)
000252090911     A*                                    1' '
000253090911      * ?  R I G A    D I    S E P A R A Z I O N E  ?
000254090911     A          R LSC5T3
000255090911     A*%%***********************************************************************
000256090911     A*%%RI 00000
000257090911     A*%%***********************************************************************
000258090911     A                                      SPACEB(001)
000259090911     A                                     1
000260090911     A                                      '-----------------------------------
000261090911     A                                      ------------------------------------
000262090911     A                                      ------------------------------------
000263090911     A                                      ------------------------------------
000264090911     A                                      ------------------------------------
000265090911     A                                      ----------'
000266090911     A*%%***********************************************************************
000267090911     A*%%SS
000268090911     A*%%***********************************************************************
000269090911      * ?  D E T T A G L I O  ?
000270090911     A          R LSC5D1
000271090911     A*%%***********************************************************************
000272090911     A*%%RI 00000
000273090911     A*%%***********************************************************************
000274090911     A                                      SPACEB(001)
000275090911     A                                      SPACEA(001)
000276090911     A  40        FILIAP         3S 0O     1
000277090911     A            ORGDEP        20A        6
000278090911     A            COLLIP         7S 0     28
000279090911     A                                      EDTCDE(4)
000280090911     A            PEF35P         9S 1     37
000281090911     A                                      EDTCDE(4)
000282090911     A            PEO35P         9S 1     49
000283090911     A                                      EDTCDE(4)
000284090911     A            PETOTP         9S 1     61
000285090911     A                                      EDTCDE(4)
000286090911     A            PETASP         9S 1     73
000287090911     A                                      EDTCDE(4)
000288090911     A            VOLUMP         9S 2     87
000289090911     A                                      EDTCDE(4)
000290090911     A            SPESTP         7S 0    106
000291090911     A                                      EDTCDE(4)
000292090911     A            SPSTTP         7S 0    124
000293090911     A                                      EDTCDE(4)
000294090911     A            SPNOTP         7S 0    142
000295090911     A                                      EDTCDE(4)
000296090911     A            SPTOTP         7S 0    160
000297090911     A                                      EDTCDE(4)
000298090911     A            SPRETP         7S 0    178
000299090911     A                                      EDTCDE(4)
000300090911     A            SPESFP         7S 0     97
000301090911     A                                      EDTCDE(4)
000302090911     A                                      SPACEB(001)
000303090911     A            SPESAP         7S 0    106
000304090911     A                                      EDTCDE(4)
000305090911     A            SPSTFP         7S 0    115
000306090911     A                                      EDTCDE(4)
000307090911     A            SPSTAP         7S 0    124
000308090911     A                                      EDTCDE(4)
000309090911     A            SPNOFP         7S 0    133
000310090911     A                                      EDTCDE(4)
000311090911     A            SPNOAP         7S 0    142
000312090911     A                                      EDTCDE(4)
000313090911     A            SPTOFP         7S 0    151
000314090911     A                                      EDTCDE(4)
000315090911     A            SPTOAP         7S 0    160
000316090911     A                                      EDTCDE(4)
000317090911     A            SPREFP         7S 0    169
000318090911     A                                      EDTCDE(4)
000319090911     A            SPREAP         7S 0    178
000320090911     A                                      EDTCDE(4)
000321090911     A*%%***********************************************************************
000322090911     A*%%SS
000323090911     A*%%CL 001
000324090911     A*%%CL 001
000325090911     A*%%***********************************************************************
000326090911      * ?  R I G A    D I    S E P A R A Z I O N E  ?
000327090911     A          R LSC5T3N
000328090911     A*%%***********************************************************************
000329090911     A*%%RI 00000
000330090911     A*%%***********************************************************************
000331090911     A                                      SPACEB(001)
000332090911     A                                     1
000333090911     A                                      '-----------------------------------
000334090911     A                                      ------------------------------------
000335090911     A                                      ------------------------------------
000336090911     A                                      ------------------------------------
000337090911     A                                      ------------------------------------
000338090911     A                                      ------------------------'
000339090911     A*%%***********************************************************************
000340090911     A*%%SS
000341090911     A*%%***********************************************************************
000342090911      * ?  D E T T A G L I O  ? CON NUOVO TIPO SERVIZIO
000343090911     A          R LSC5D1N
000344090911     A*%%***********************************************************************
000345090911     A*%%RI 00000
000346090911     A*%%***********************************************************************
000347090911     A                                      SPACEB(001)
000348090911     A                                      SPACEA(001)
000349090911     A  40        FILIAP         3S 0O     1
000350090911     A            ORGDEP        20A        6
000351090911     A            COLLIP         7S 0     28
000352090911     A                                      EDTCDE(4)
000353090911     A            PEF35P         9S 1     37
000354090911     A                                      EDTCDE(4)
000355090911     A            PEO35P         9S 1     49
000356090911     A                                      EDTCDE(4)
000357090911     A            PETOTP         9S 1     61
000358090911     A                                      EDTCDE(4)
000359090911     A            PETASP         9S 1     73
000360090911     A                                      EDTCDE(4)
000361090911     A            VOLUMP         9S 2     85
000362090911     A                                      EDTCDE(4)
000363090911     A            SPHSTP         7S 0    103
000364090911     A                                      EDTCDE(4)
000365090911     A            SPESTP         7S 0    121
000366090911     A                                      EDTCDE(4)
000367090911     A            SPSTTP         7S 0    139
000368090911     A                                      EDTCDE(4)
000369090911     A            SPNOTP         7S 0    157
000370090911     A                                      EDTCDE(4)
000371090911     A            SPTOTP         7S 0    175
000372090911     A                                      EDTCDE(4)
000373090911     A            SPRETP         7S 0    192
000374090911     A                                      EDTCDE(4)
000375090911     A            SPHSFP         7S 0     95
000376090911     A                                      EDTCDE(4)
000377090911     A                                      SPACEB(001)
000378090911     A            SPHSAP         7S 0    103
000379090911     A                                      EDTCDE(4)
000380090911     A            SPESFP         7S 0    112
000381090911     A                                      EDTCDE(4)
000382090911     A            SPESAP         7S 0    121
000383090911     A                                      EDTCDE(4)
000384090911     A            SPSTFP         7S 0    130
000385090911     A                                      EDTCDE(4)
000386090911     A            SPSTAP         7S 0    139
000387090911     A                                      EDTCDE(4)
000388090911     A            SPNOFP         7S 0    148
000389090911     A                                      EDTCDE(4)
000390090911     A            SPNOAP         7S 0    157
000391090911     A                                      EDTCDE(4)
000392090911     A            SPTOFP         7S 0    166
000393090911     A                                      EDTCDE(4)
000394090911     A            SPTOAP         7S 0    175
000395090911     A                                      EDTCDE(4)
000396090911     A            SPREFP         7S 0    184
000397090911     A                                      EDTCDE(4)
000398090911     A            SPREAP         7S 0    192
000399090911     A                                      EDTCDE(4)
000400090911     A*%%***********************************************************************
000401090911     A*%%SS
000402090911     A*%%CL 001
000403090911     A*%%CL 001
000404090911     A*%%***********************************************************************
000405090911      * ?  S T A M P A    N U L L A  ?
000406090911     A          R LSC5E1
000407090911     A*%%***********************************************************************
000408090911     A*%%RI 00000
000409090911     A*%%FS 002
000410090911     A*%%***********************************************************************
000411090911     A                                      SPACEB(003)
000412090911     A                                    87
000413090911     A                                      '( NESSUNA BOLLA TROVATA )'
000414090911     A*%%***********************************************************************
000415090911     A*%%SS
000416090911     A*%%***********************************************************************
000417090911      * ?  F I N E    S T A M P A  ?
000418090911     A          R LSC5E2
000419090911     A*%%***********************************************************************
000420090911     A*%%RI 00000
000421090911     A*%%FS 001
000422090911     A*%%***********************************************************************
000423090911     A                                      SPACEB(002)
000424090911     A                                    88
000425090911     A                                      '***   FINE  STAMPA   ***'
000426090911     A                                      SKIPA(065)
000427090911     A                                     1
000428090911     A                                      'PESO TASSABILE: E'' CALCOLATO CON -
000429090911     A                                      UN RAPPORTO PESO/VOLUME 1 MC ='
000430090911     A            §QTKPM         5S 1     66
000431090911     A                                      EDTCDE(4)
000432090911     A                                    73
000433090911     A                                      'Q.LI ARROTONDATO AI'
000434090911     A            §3IARR         6S 0     93
000435090911     A                                      EDTCDE(Z)
000436090911     A                                   100
000437090911     A                                      'KG. SUPERIORI, PER LE SOLE SPEDIZI-
000438090911     A                                      ONI CON PESO FINO A KG. 3500, ESCLU-
000439090911     A                                      SE BOLLE DI RECUPERO E C/SERV.'
000440090911     A*%%***********************************************************************
000441090911     A*%%SS
000442090911     A*%%CL 045
000443090911     A*%%CP+999CRTPRTF
000444090911     A*%%CP+    CPI(15)
000445090911     A*%%CP+    FILE(GAITRAFIL/FNLSC5P)
000446090911     A*%%CP+    DEVTYPE(*SCS)
000447090911     A*%%CP     PAGESIZE(*N       198      *N     )
000448090911     A*%%***********************************************************************
