000010130319     A*%%TS  SD  20130319  140510  EDPRM       REL-V6R1M0  5761-WDS
000020040220     A*-------------------------------------------------------------------------
000030000000     A*   FILE : FNLS05D
000040000000     A*          VISUALIZZAZIONE SINGOLA BOLLA PARTENZE
000050000000     A*-------------------------------------------------------------------------
000060130319     A*%%EC
000070130319     A                                      DSPSIZ(24 80 *DS3)
000080130319     A                                      PRINT
000090000000     A**************************************************************************
000100990701     A          R LS05T01
000110990701     A            V1CRSU        20A  O  1  2
000120990701     A                                  1 26'* VISUALIZZAZIONE BOLLA PARTENZE *'
000130990701     A                                      DSPATR(RI)
000140990701     A                                      DSPATR(UL)
000150990701     A                                  1 63'FNLS05R'
000160990701     A                                  1 72DATE
000170990701     A                                      EDTCDE(Y)
000180990701     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000190990701     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000200990701     A                                  2 72TIME
000210000000     A**************************************************************************
000220110610     A          R LS05D01
000230110610     A*%%TS  SD  20110610  130253  EDPRM       REL-V6R1M0  5761-WDS
000240110610     A  27                                  CF01
000250110610     A  12                                  CF02
000260110610     A                                      CA03
000270110610     A  06                                  CF04
000280110610     A  95                                  CF05
000290110610     A  22N05                               CF07
000300110610     A  10                                  CF10
000310110610     A  77                                  CF11
000320110610     A                                      CA12
000330110610     A  04                                  CF13
000340110610     A  03                                  CF14
000350110610     A  28                                  CF16
000360110610     A  07                                  CF18
000370110610     A  22                                  CF19
000380110610     A  22                                  CF20
000390110610     A                                      CF21
000400110610     A  24                                  CF22
000410110610     A  94N15                               CF23
000420110610     A                                      CA24
000430110610     A  55                                  CF08
000440110610     A                                      OVERLAY
000450110610     A            VHCAAC         4S 0H
000460110610     A            VHCFIL         3S 0H
000470110610     A            VHCNCA         7S 0H
000480110610     A            V1CAAS    R        H      REFFLD(BLPAAS FNBLP00F)
000490110610     A                                  3  2'Data SPEDIZIONE........'
000500110610     A                                      DSPATR(UL)
000510110610     A            V1CDSP         8Y 0O  3 27TEXT('data spedizione')
000520110610     A                                      DSPATR(HI)
000530110610     A                                      EDTWRD('  /  /    ')
000540110610     A                                      DSPATR(UL)
000550110610     A                                  3 40'Numero'
000560110610     A                                      DSPATR(UL)
000570110610     A            V1CLP1    R        O  3 48REFFLD(BLPLNP FNBLP00F)
000580110610     A                                      DSPATR(UL)
000590110610     A                                      DSPATR(HI)
000600110610     A            V1CNRS    R        O  3 53REFFLD(BLPNRS FNBLP00F)
000610110610     A                                      DSPATR(HI)
000620110610     A                                      DSPATR(UL)
000630110610     A                                      EDTCDE(Z)
000640110610     A            V1CNSP    R        O  3 56REFFLD(BLPNSP FNBLP00F)
000650110610     A                                      DSPATR(HI)
000660110610     A                                      EDTCDE(2)
000670110610     A                                      DSPATR(UL)
000680110610     A            V1DTSP         8A  O  3 72TEXT('TIPO SERVIZIO BOLLA')
000690110610     A                                      DSPATR(RI)
000700110610     A                                  4  2'RITIRO MERCE: Data.....'
000710110610     A            V1CDRT    R        O  4 27REFFLD(BLPDRT FNBLP00F)
000720110610     A                                      EDTWRD('  /  /    ')
000730110610     A                                  4 40'Num.'
000740110610     A            V1CNRT    R        O  4 45REFFLD(BLPNRT FNBLP00F)
000750110610     A            V1DFPP         3A  O  4 48
000760110610     A                                  4 53'Autotr.'
000770110610     A            V1CPDR    R     Y  O  4 61REFFLD(BLPPDR FNBLP00F)
000780110610     A                                      EDTCDE(Z)
000790110610     A                                      DSPATR(UL)
000800110610     A            V1DPDR        12A  O  4 69
000810110610     A                                  5  2'NUMERO ORM..:'
000820110610     A            V1CPOE         3A  O  5 16DSPATR(UL)
000830110610     A                                  5 20'-'
000840110610     A            V1CNSR         2Y 0O  5 22DSPATR(UL)
000850110610     A                                      EDTCDE(Z)
000860110610     A                                  5 25'-'
000870110610     A            V1CNOR         7Y 0O  5 27DSPATR(UL)
000880110610     A                                      EDTCDE(Z)
000890110610     A            V1CNRV         2Y 0O  5 35DSPATR(UL)
000900110610     A                                      EDTCDE(Z)
000910110610     A                                  5 40'FV Partenza Bolla...'
000920110610     A            V1CNFV    R        O  5 62REFFLD(BLPNFV FNBLP00F)
000930110610     A                                      EDTCDE(2)
000940110610     A                                      DSPATR(UL)
000950110610     A  44                              5 72'GIACENTE'
000960110610     A                                      DSPATR(RI)
000970110610     A                                  6  2'Data Spunta Entrata....'
000980110610     A            V1CDSE    R        O  6 27REFFLD(BLPDSE FNBLP00F)
000990110610     A                                      EDTWRD('  /  /    ')
001000110610     A                                  6 40'Data Bordero''...............'
001010110610     A            V1CDBR    R        O  6 71REFFLD(BLPDBR FNBLP00F)
001020110610     A                                      EDTWRD('  /  /    ')
001030110610     A                                  7  2'Partenza Primo Collo...'
001040110610     A            V1CDPC    R        O  7 27REFFLD(BLPDPC FNBLP00F)
001050110610     A                                      EDTWRD('  /  /    ')
001060110610     A                                  7 40'Partenza Ultimo Collo.......'
001070110610     A            V1CDUC    R        O  7 71REFFLD(BLPDUC FNBLP00F)
001080110610     A                                      EDTWRD('  /  /    ')
001090110610     A                                  8  2'Data ARRIVO al TRANSITO'
001100110610     A            V1CDET    R        O  8 27REFFLD(BLPDET FNBLP00F)
001110110610     A                                      EDTWRD('  /  /    ')
001120110610     A                                  8 40'Data PARTENZA Dal TRANSITO'
001130110610     A            V1CDUT    R        O  8 71REFFLD(BLPDUT FNBLP00F)
001140110610     A                                      EDTWRD('  /  /    ')
001150110610     A                                  9  2'ARRIVO a Filiale Arrivo'
001160110610     A            V1CDAM    R        O  9 27REFFLD(BLPDAM FNBLP00F)
001170110610     A                                      EDTWRD('  /  /    ')
001180110610     A                                 10  2'CONSEGNA MERCE: Teorica'
001190110610     A  94                             10 26'F23=Visual.'
001200110610     A                                      DSPATR(RI)
001210110610     A N94        V1CDCE    R        O 10 27REFFLD(BLPDCE FNBLP00F)
001220110610     A                                      EDTWRD('  /  /    ')
001230110610     A                                      DSPATR(HI)
001240110610     A  98                             10 38'Reale'
001250110610     A            V1CDCM    R        O 10 44REFFLD(BLPDCM FNBLP00F)
001260110610     A                                      EDTWRD('  /  /    ')
001270110610     A                                      DSPATR(HI)
001280110610     A  98                             10 55'Ora'
001290110610     A N98N94     V1CHMC    R        O 10 59REFFLD(BLPHMC FNBLP00F)
001300110610     A                                      EDTWRD('  :  ')
001310110610     A                                      DSPATR(HI)
001320110610     A N94                             10 65'Ore Ritardo'
001330110610     A N94        V1CNRC    R        O 10 77REFFLD(BLPNRC FNBLP00F)
001340110610     A                                      EDTCDE(Q)
001350110610     A                                      DSPATR(HI)
001360110610     A                                 11  2'Linea  Partenza........'
001370110610     A            V1CLNP    R        O 11 27REFFLD(BLPLNP FNBLP00F)
001380110610     A                                      DSPATR(HI)
001390110610     A                                      DSPATR(UL)
001400110610     A            V1DLNP    R        O 11 31REFFLD(ORGDES AZORG00F)
001410110610     A                                      DSPATR(HI)
001420110610     A                                 12  2'Linea  Arrivo..........'
001430110610     A            V1CLNA    R        O 12 27REFFLD(BLPLNA FNBLP00F)
001440110610     A                                      DSPATR(HI)
001450110610     A                                      DSPATR(UL)
001460110610     A            V1DLNA    R        O 12 31REFFLD(ORGDES AZORG00F)
001470110610     A                                      DSPATR(HI)
001480110610     A                                 11 60'Sigla  Operatore'
001490110610     A            VIDSOP    R        O 11 80REFFLD(BLPSOP FNBLP00F)
001500110610     A                                      DSPATR(HI)
001510110610     A                                      DSPATR(UL)
001520110610     A                                 13  2'Codice Bolla...........'
001530110610     A            V1CCBO    R        O 13 27REFFLD(BLPCBO FNBLP00F)
001540110610     A                                      DSPATR(HI)
001550110610     A                                      DSPATR(UL)
001560110610     A            V1DCBO    R        O 13 31REFFLD(§3ADES DS3A)
001570110610     A                                      DSPATR(HI)
001580110610     A                                 13 60'Cod.Trattam.Merce'
001590110610     A            V1CCTM    R        O 13 79REFFLD(BLPCTM FNBLP00F)
001600110610     A                                      DSPATR(HI)
001610110610     A                                      DSPATR(UL)
001620110610     A                                 14  2'----------------- M     I     T   -
001630110610     A                                        T     E     N     T     E --------
001640110610     A                                      ----------'
001650110610     A            V2CCDM    R        O 15  2REFFLD(BLPKSC FNBLP00F)
001660110610     A                                      DSPATR(HI)
001670110610     A                                      EDTCDE(Z)
001680110610     A            V1CRSM    R        O 15 10REFFLD(BLPRSM FNBLP00F)
001690110610     A                                      DSPATR(HI)
001700110610     A                                      DSPATR(UL)
001710110610     A  13                             15 48'Riferim.Partner:'
001720110610     A  13        V2CRPP        15A  O 15 65TEXT('RIF.PARTNER PARTENZA')
001730110610     A                                      DSPATR(HI)
001740110610     A                                      DSPATR(UL)
001750110610     A            V1CINM    R        O 16 10REFFLD(BLPINM FNBLP00F)
001760110610     A                                      DSPATR(HI)
001770110610     A                                      DSPATR(UL)
001780110610     A  14                             16 48'Lin.Arrivo e zona DPD:'
001790110610     A  09        V1CEST        28A  O 16 52
001800110610     A            V2CRTN         4A  O 16 71DSPATR(HI)
001810110610     A            V2CZON         2A  O 16 76DSPATR(HI)
001820110610     A            V2CXCO         1A  O 17  2DSPATR(HI)
001830110610     A            V1CCAM    R        O 17 10REFFLD(BLPCAM FNBLP00F)
001840110610     A                                      DSPATR(HI)
001850110610     A                                      DSPATR(UL)
001860110610     A            V1CLOM    R        O 17 21REFFLD(BLPLOM FNBLP00F)
001870110610     A                                      DSPATR(HI)
001880110610     A                                      DSPATR(UL)
001890110610     A            V1CPRM    R        O 17 57REFFLD(BLPPRM FNBLP00F)
001900110610     A                                      DSPATR(HI)
001910110610     A                                      DSPATR(UL)
001920110610     A                                 17 61'Naz'
001930110610     A            V1CNZM    R        O 17 65REFFLD(BLPNZM FNBLP00F)
001940110610     A                                      DSPATR(HI)
001950110610     A                                      DSPATR(UL)
001960110610     A                                 17 73'Antep.'
001970110610     A            V1CFAP    R        O 17 80REFFLD(BLPFAP FNBLP00F)
001980110610     A                                      DSPATR(HI)
001990110610     A                                      DSPATR(UL)
002000110610     A                                 18  2'P.IVA'
002010110610     A            V1CPIM    R        O 18  8REFFLD(BLPCPI FNBLP00F)
002020110610     A                                      DSPATR(HI)
002030110610     A                                      DSPATR(UL)
002040110610     A                                 18 26'Cod.Fiscale'
002050110610     A            V1CDFM        16A  O 18 38DSPATR(HI)
002060110610     A                                      DSPATR(UL)
002070110610     A                                 18 56'Telefono'
002080110610     A            V2CTEL    R        O 18 65REFFLD(BLPCPI FNBLP00F)
002090110610     A                                      DSPATR(HI)
002100110610     A                                      DSPATR(UL)
002110110610     A                                 19  2'COLLI'
002120110610     A                                 19 10'---------- P   E   S   O ----------
002130110610     A                                      -'
002140110610     A                                 19 48'----- V   O   L   U   M   E ----'
002150110610     A                                 20 10'Bollett.'
002160110610     A                                 20 20'Da VDL'
002170110610     A                                 20 28'Colli'
002180110610     A                                 20 34'Boll/Variat'
002190110610     A                                 20 48'Bollett.'
002200110610     A                                 20 58'Da VDL'
002210110610     A                                 20 65'Colli'
002220110610     A                                 20 71'Fatturare'
002230110610     A            V1CNCL    R        O 21  2REFFLD(BLPNCL FNBLP00F)
002240110610     A                                      DSPATR(HI)
002250110610     A                                      EDTCDE(Z)
002260110610     A                                      DSPATR(UL)
002270110610     A            V1CPKB    R        O 21 10REFFLD(BLPPKB FNBLP00F)
002280110610     A                                      DSPATR(HI)
002290110610     A                                      EDTCDE(4)
002300110610     A                                      DSPATR(UL)
002310110610     A            V1CPKC    R        O 21 19REFFLD(BLPPKC FNBLP00F)
002320110610     A                                      DSPATR(HI)
002330110610     A                                      EDTCDE(4)
002340110610     A                                      DSPATR(UL)
002350110610     A            V1CNCP    R        O 21 28REFFLD(BLPNCP FNBLP00F)
002360110610     A                                      DSPATR(HI)
002370110610     A                                      DSPATR(UL)
002380110610     A                                      EDTCDE(Z)
002390110610     A            V1CPKF    R        O 21 36REFFLD(BLPPKF FNBLP00F)
002400110610     A                                      DSPATR(HI)
002410110610     A                                      EDTCDE(4)
002420110610     A                                      DSPATR(UL)
002430110610     A            V1CFVB    R        O 21 48REFFLD(BLPFVB FNBLP00F)
002440110610     A                                      DSPATR(HI)
002450110610     A                                      DSPATR(UL)
002460110610     A            V1CVLB    R        O 21 50REFFLD(BLPVLB FNBLP00F)
002470110610     A                                      DSPATR(HI)
002480110610     A                                      DSPATR(UL)
002490110610     A                                      EDTCDE(2)
002500110610     A            V1CVLC    R        O 21 58REFFLD(BLPVLC FNBLP00F)
002510110610     A                                      DSPATR(HI)
002520110610     A                                      DSPATR(UL)
002530110610     A                                      EDTCDE(4)
002540110610     A            V1CNCR    R        O 21 65REFFLD(BLPNCR FNBLP00F)
002550110610     A                                      DSPATR(HI)
002560110610     A                                      DSPATR(UL)
002570110610     A                                      EDTCDE(Z)
002580110610     A            V1CFVF    R        O 21 72REFFLD(BLPFVF FNBLP00F)
002590110610     A                                      DSPATR(HI)
002600110610     A                                      DSPATR(UL)
002610110610     A            V1CVLF    R        O 21 74REFFLD(BLPVLF FNBLP00F)
002620110610     A                                      DSPATR(HI)
002630110610     A                                      DSPATR(UL)
002640110610     A                                      EDTCDE(4)
002650110610     A                                 22  2'BANCALI'
002660110610     A            V1CNBA         2Y 0O 22 10DSPATR(UL)
002670110610     A                                      DSPATR(HI)
002680110610     A                                      EDTCDE(Z)
002690110610     A            V1DTBA        10A  O 22 13DSPATR(UL)
002700110610     A                                      DSPATR(HI)
002710110610     A                                 22 24'/'
002720110610     A            V1CNB2         2Y 0O 22 26DSPATR(UL)
002730110610     A                                      DSPATR(HI)
002740110610     A                                      EDTCDE(Z)
002750110610     A            V1DTB2        10A  O 22 29DSPATR(UL)
002760110610     A                                      DSPATR(HI)
002770110610     A                                 22 41'Tass.con Tar.Mittente'
002780110610     A            V1CFTM    R        O 22 63REFFLD(BLPFTM FNBLP00F)
002790110610     A                                      DSPATR(HI)
002800110610     A                                 22 67'Cons.a mag.'
002810110610     A            V1CFDN    R    2   O 22 79REFFLD(BLPFDN FNBLP00F)
002820110610     A                                      DSPATR(HI)
002830110610     A                                      DSPATR(UL)
002840110610     A N34        LEGAME        58A  O 23  2DSPATR(RI)
002850110610     A                                 23 73'F3=Fine'
002860110610     A            FD01          62A  O 24  2
002870110610     A            F24D01        16A  O 24 65
002880110610     A  46        VIDPRU        10   O 12 60DSPATR(HI)
002890110610     A  46        VIDNMTD       10   O 12 71DSPATR(HI)
002900000000     A**************************************************************************
002910110610     A          R LS05D02
002920110610     A*%%TS  SD  20110610  130253  EDPRM       REL-V6R1M0  5761-WDS
002930110610     A  27                                  CF01
002940110610     A  12                                  CF02
002950110610     A  06                                  CF04
002960110610     A  95                                  CF05
002970110610     A  22N05                               CF07
002980110610     A  55                                  CF08
002990110610     A  10                                  CF10
003000110610     A  77                                  CF11
003010110610     A                                      CA12
003020110610     A  04                                  CF13
003030110610     A  03                                  CF14
003040110610     A  28                                  CF16
003050110610     A  07                                  CF18
003060110610     A  22                                  CF19
003070110610     A  22                                  CF20
003080110610     A                                      CF21
003090110610     A  24                                  CF22
003100110610     A                                      CA24
003110110610     A                                      OVERLAY
003120110610     A                                  3  2'Linea Arrivo'
003130110610     A            V1CLNA    R        O  3 15REFFLD(BLPLNA *LIBL/FNBLP00F)
003140110610     A                                      DSPATR(HI)
003150110610     A            V2DLNA    R   17   O  3 19REFFLD(ORGDES *LIBL/AZORG00F)
003160110610     A                                      DSPATR(HI)
003170110610     A                                  3 38'Cod.Bolla'
003180110610     A            V1CCBO    R        O  3 48REFFLD(BLPCBO *LIBL/FNBLP00F)
003190110610     A                                      DSPATR(HI)
003200110610     A            V2DCBO    R   20   O  3 51REFFLD(§3ADES *LIBL/DS3A)
003210110610     A                                      DSPATR(HI)
003220110610     A            V1DTSP         8A  O  3 72TEXT('TIPO SERVIZIO BOLLA')
003230110610     A                                      DSPATR(RI)
003240110610     A                                  4  2'Mittente'
003250110610     A            V2CCDM         7Y 0O  4 11EDTCDE(Z)
003260110610     A            V2CRSM    R        O  4 19REFFLD(BLPRSM *LIBL/FNBLP00F)
003270110610     A                                  4 56'Tel.'
003280110610     A            V2CTEL    R        O  4 61REFFLD(INDTEL *LIBL/CNIND00F)
003290110610     A            V2CLOM    R        O  5 19REFFLD(BLPLOM *LIBL/FNBLP00F)
003300110610     A            V2CPRM    R        O  5 56REFFLD(BLPPRM *LIBL/FNBLP00F)
003310110610     A            V2CNZM    R        O  5 59REFFLD(BLPNZM *LIBL/FNBLP00F)
003320110610     A  44                              5 72'GIACENTE'
003330110610     A                                      DSPATR(RI)
003340110610     A                                  6  2'Destin'
003350110610     A            V2CNOM        70A  O  6 10DSPATR(HI)
003360110610     A                                      DSPATR(UL)
003370110610     A            V2CCDD         7Y 0O  7  2DSPATR(HI)
003380110610     A                                      EDTCDE(Z)
003390110610     A            V2CIND    R        O  7 10REFFLD(BLPIND *LIBL/FNBLP00F)
003400110610     A                                      DSPATR(HI)
003410110610     A                                      DSPATR(UL)
003420110610     A                                  7 62'Inl'
003430110610     A                                  7 67'P.IVA/Cd.Fisc'
003440110610     A            V2CCAD    R        O  8 10REFFLD(BLPCAD *LIBL/FNBLP00F)
003450110610     A                                      DSPATR(HI)
003460110610     A                                      DSPATR(UL)
003470110610     A            V2CLOD    R        O  8 20REFFLD(BLPLOD *LIBL/FNBLP00F)
003480110610     A                                      DSPATR(HI)
003490110610     A                                      DSPATR(UL)
003500110610     A            V2CPRD    R        O  8 56REFFLD(BLPPRD *LIBL/FNBLP00F)
003510110610     A                                      DSPATR(HI)
003520110610     A                                      DSPATR(UL)
003530110610     A            V2CNZD    R        O  8 59REFFLD(BLPNZD *LIBL/FNBLP00F)
003540110610     A                                      DSPATR(HI)
003550110610     A                                      DSPATR(UL)
003560110610     A            V2CFIN    R        O  8 63REFFLD(BLPFIN *LIBL/FNBLP00F)
003570110610     A                                      DSPATR(HI)
003580110610     A                                      DSPATR(UL)
003590110610     A            V2CPID    R        O  8 65REFFLD(BLPCPI *LIBL/FNBLP00F)
003600110610     A                                      DSPATR(HI)
003610110610     A                                      DSPATR(UL)
003620110610     A                                  9  2'Ref. Consegna'
003630110610     A            V2CREF        35A  O  9 20DSPATR(HI)
003640110610     A                                      DSPATR(UL)
003650110610     A            V2CDFD        16A  O  9 65DSPATR(HI)
003660110610     A                                      DSPATR(UL)
003670110610     A                                 10  2'Telefono'
003680110610     A            V2CTELD       16A  O 10 20DSPATR(UL)
003690110610     A                                      DSPATR(HI)
003700110610     A            V2CFNS        15A  O 10 63DSPATR(BL)
003710110610     A                                 11  7'Riferimenti Mittente'
003720110610     A                                 11 36'Natura Merce'
003730110610     A                                 11 52'-LNP Ser numero SEGNACOLLI-'
003740110610     A            V2CRMN    R        O 12  2REFFLD(BLPRMN *LIBL/FNBLP00F)
003750110610     A                                      DSPATR(HI)
003760110610     A                                      EDTCDE(Z)
003770110610     A                                      DSPATR(UL)
003780110610     A            V2CRMA    R        O 12 19REFFLD(BLPRMA *LIBL/FNBLP00F)
003790110610     A                                      DSPATR(HI)
003800110610     A                                      DSPATR(UL)
003810110610     A            V1CNAS    R        O 12 36REFFLD(BLPNAS *LIBL/FNBLP00F)
003820110610     A                                      DSPATR(HI)
003830110610     A                                      DSPATR(UL)
003840110610     A            V2CFLS    R     A  O 12 53REFFLD(BLPFLS *LIBL/FNBLP00F)
003850110610     A                                      DSPATR(UL)
003860110610     A                                      DSPATR(HI)
003870110610     A            V1CNRS    R        O 12 57REFFLD(BLPNRS *LIBL/FNBLP00F)
003880110610     A                                      DSPATR(HI)
003890110610     A                                      EDTCDE(Z)
003900110610     A                                      DSPATR(UL)
003910110610     A            V2CNCD    R        O 12 61REFFLD(BLPNCD *LIBL/FNBLP00F)
003920110610     A                                      DSPATR(HI)
003930110610     A                                      EDTCDE(Z)
003940110610     A                                      DSPATR(UL)
003950110610     A                                 12 69'/'
003960110610     A            V2CNCA    R        O 12 71REFFLD(BLPNCA *LIBL/FNBLP00F)
003970110610     A                                      EDTCDE(Z)
003980110610     A                                      DSPATR(HI)
003990110610     A                                      DSPATR(UL)
004000110610     A                                 13  2'Importo da Assicurare'
004010110610     A                                 13 31'Q.tà da Fatturare'
004020110610     A                                 13 56'Valore Merce Dichiarato'
004030110610     A            V2CIAS    R        O 14  2REFFLD(BLPIAS *LIBL/FNBLP00F)
004040110610     A                                      DSPATR(HI)
004050110610     A                                      EDTCDE(2)
004060110610     A            V2CVAS    R        O 14 20REFFLD(BLPVAS *LIBL/FNBLP00F)
004070110610     A                                      DSPATR(HI)
004080110610     A            V2CQFT    R        O 14 31REFFLD(BLPQFT *LIBL/FNBLP00F)
004090110610     A                                      DSPATR(HI)
004100110610     A                                      EDTCDE(2)
004110110610     A            V2CVMD    R        O 14 56REFFLD(BLPVMD *LIBL/FNBLP00F)
004120110610     A                                      DSPATR(HI)
004130110610     A                                      EDTCDE(2)
004140110610     A            V2CVAD    R        O 14 75REFFLD(BLPVAD *LIBL/FNBLP00F)
004150110610     A                                      DSPATR(HI)
004160110610     A                                 15  2'------C/Assegno--------Ben-'
004170110610     A                                 15 32'------Tariffa------'
004180110610     A                                 15 56'----Mittente Originale---'
004190110610     A            V2CTIC    R        O 16  2REFFLD(AR9TIC *LIBL/FIAR900F)
004200110610     A                                      DSPATR(HI)
004210110610     A            V2CCAS    R        O 16  5REFFLD(AR9CAS *LIBL/FIAR900F)
004220110610     A                                      DSPATR(HI)
004230110610     A                                      EDTCDE(4)
004240110610     A            V2CVCA    R        O 16 20REFFLD(AR9VCA *LIBL/FIAR900F)
004250110610     A                                      DSPATR(HI)
004260110610     A  43                             16 25'?'
004270110610     A  43        V2CBEN         1A  B 16 27DSPATR(HI)
004280110610     A                                      VALUES(' ' '?')
004290110610     A            V2CCTR    R        O 16 32REFFLD(BLPCTR *LIBL/FNBLP00F)
004300110610     A                                      DSPATR(HI)
004310110610     A            V2DCTR        15A  O 16 36TEXT('DESCRIZIONE')
004320110610     A            V2CRMO    R        O 16 56REFFLD(BLPRMO *LIBL/FNBLP00F)
004330110610     A                                      DSPATR(HI)
004340110610     A                                 17  2'-------Consegna Richiesta-------'
004350110610     A                                 17 37'GG.Chiusura'
004360110610     A                                 17 50'Fermo Dep.'
004370110610     A                                 17 61'BolRientro'
004380110610     A  01                                  DSPATR(HI)
004390110610     A            V2CFBR    R    2   O 17 73REFFLD(BLPFBR *LIBL/FNBLP00F)
004400110610     A                                      DSPATR(HI)
004410110610     A                                      DSPATR(UL)
004420110610     A                                 17 77'Zona'
004430110610     A            V2CTCR        11A  O 18  2TEXT('tipo consegna richiesta')
004440110610     A                                      DSPATR(HI)
004450110610     A            V2CDCR    R        O 18 14REFFLD(BLPDCR *LIBL/FNBLP00F)
004460110610     A                                      DSPATR(HI)
004470110610     A                                      EDTWRD('  /  /    ')
004480110610     A                                 18 25'Ore'
004490110610     A            V2CHCR    R        O 18 29REFFLD(BLPHCR *LIBL/FNBLP00F)
004500110610     A                                      DSPATR(HI)
004510110610     A                                      EDTWRD('  :  ')
004520110610     A            V2CGC1    R        O 18 39REFFLD(BLPGC1 *LIBL/FNBLP00F)
004530110610     A                                      DSPATR(HI)
004540110610     A            V2CGC2    R        O 18 44REFFLD(BLPGC2 *LIBL/FNBLP00F)
004550110610     A                                      DSPATR(HI)
004560110610     A            V2CFFD         3A  O 18 53DSPATR(HI)
004570110610     A                                      TEXT('FLAG FERMO DEPOSITO: S=SI')
004580110610     A                                 18 61'FrFrontiera'
004590110610     A  02                                  DSPATR(HI)
004600110610     A            V2CFFR    R    2   O 18 73REFFLD(BLPFBR *LIBL/FNBLP00F)
004610110610     A                                      DSPATR(HI)
004620110610     A                                      DSPATR(UL)
004630110610     A            V2CZNC    R        O 18 77REFFLD(BLPZNC *LIBL/FNBLP00F)
004640110610     A                                      EDTCDE(Z)
004650110610     A                                      DSPATR(HI)
004660110610     A            V2CBVA         1A  O 18 80TEXT('FLAG "COLLI DI VALORE"')
004670110610     A                                 19 19'C/Assegno'
004680110610     A                                 19 31'Giacenza'
004690110610     A                                 19 42'Consegna'
004700110610     A                                 19 53'-Varie--'
004710110610     A                                 20  2'Particolarità:'
004720110610     A                                      DSPATR(UL)
004730110610     A  16                             20 19'?'
004740110610     A  16        V2IGCA         1A  B 20 21TEXT('INTERROGAZIONE PARTICOLARITA'-
004750110610     A                                      ' C/ASSEGNO')
004760110610     A                                      VALUES(' ' '?')
004770110610     A            V2CGCA    R        O 20 25REFFLD(AR9GCA *LIBL/FIAR900F)
004780110610     A                                      DSPATR(HI)
004790110610     A  17                             20 31'?'
004800110610     A  17        V2IGGA         1A  B 20 33TEXT('INTERROGAZIONE PARTICOLARITA'-
004810110610     A                                      ' GIACENZA')
004820110610     A                                      VALUES(' ' '?')
004830110610     A            V2CGGA    R        O 20 37REFFLD(BLPGGA *LIBL/FNBLP00F)
004840110610     A                                      DSPATR(HI)
004850110610     A  18                             20 42'?'
004860110610     A  18        V2IGMA         1A  B 20 44TEXT('INTERROGAZIONE PARTICOLARITA'-
004870110610     A                                      ' CONSEGNA')
004880110610     A                                      VALUES(' ' '?')
004890110610     A            V2CGMA    R        O 20 48REFFLD(BLPGMA *LIBL/FNBLP00F)
004900110610     A                                      DSPATR(HI)
004910110610     A  19                             20 53'?'
004920110610     A  19        V2IGVA         1A  B 20 55TEXT('INTERROGAZIONE PARTICOLARITA'-
004930110610     A                                      ' VARIE')
004940110610     A                                      VALUES(' ' '?')
004950110610     A            V2CGVA    R        O 20 59REFFLD(BLPGVA *LIBL/FNBLP00F)
004960110610     A                                      DSPATR(HI)
004970110610     A                                 21  2'---------------------------------N-
004980110610     A                                       o t e------------------------------
004990110610     A                                      ----'
005000110610     A            V2CNO1    R        O 22  2REFFLD(AR4NOT *LIBL/FIAR400F)
005010110610     A                                      DSPATR(HI)
005020110610     A            V2CNO2    R        O 22 40REFFLD(AR4NOT *LIBL/FIAR400F)
005030110610     A                                      DSPATR(HI)
005040110610     A N34        LEGAME        58A  O 23  2DSPATR(RI)
005050110610     A            FD02          62A  O 24  2
005060110610     A            F24D02        16A  O 24 65
005070110610     A  45                             10 37'Email Destinatario'
005080110610     A  45        V2CEMD         2A  O 10 56DSPATR(HI)
005090110610     A  45                             10 61'?'
005100110610     A  45        V2CEMW         1A  B 10 59DSPATR(HI)
005110110610     A                                      VALUES(' ' '?')
005120951219     A**************************************************************************
005130991022     A          R LS05S03                   SFL
005140991022     A            VS3DES    R        O 19  2REFFLD(§7KDES DS7K)
005150060216     A            VS3NOT    R        O 19 31REFFLD(AR4NOT *LIBL/FIAR400F)
005160991022     A                                      DSPATR(HI)
005170000000     A**************************************************************************
005180010220     A          R LS05C03                   SFLCTL(LS05S03)
005190040220     A     27                               CF01
005200040220     A  12                                  CF02
005210040220     A  06                                  CF04
005220010220     A  95                                  CF05
005230010220     A  22N05                               CF07
005240040220     A  55                                  CF08
005250010220     A  10                                  CF10
005260021218     A  77                                  CF11
005270010220     A                                      CA12
005280010220     A  04                                  CF13
005290010220     A  03                                  CF14
005300040220     A     28                               CF16
005310010220     A  07                                  CF18
005320010220     A  22                                  CF19
005330010220     A  22                                  CF20
005340010220     A                                      CF21
005350010220     A  24                                  CF22
005360010220     A  94N15                               CF23
005370010220     A                                      CA24
005380010220     A                                      OVERLAY
005390010220     A N26                                  SFLDSP
005400010220     A                                      SFLDSPCTL
005410010220     A  26                                  SFLCLR
005420010220     A N26                                  SFLEND
005430010220     A                                      SFLSIZ(0005)
005440010220     A                                      SFLPAG(0004)
005450010220     A            REC3           4S 0H      SFLRCDNBR
005460010220     A                                  3  2'Linea Arrivo'
005470010220     A            V1CLNA    R        O  3 15REFFLD(BLPLNA *LIBL/FNBLP00F)
005480010220     A                                      DSPATR(HI)
005490010220     A            V2DLNA    R   17   O  3 19REFFLD(ORGDES *LIBL/AZORG00F)
005500010220     A                                      DSPATR(HI)
005510010220     A                                  3 38'Cod.Bolla'
005520010220     A            V1CCBO    R        O  3 48REFFLD(BLPCBO *LIBL/FNBLP00F)
005530010220     A                                      DSPATR(HI)
005540010220     A            V2DCBO    R   20   O  3 51REFFLD(§3ADES *LIBL/DS3A)
005550010220     A                                      DSPATR(HI)
005560010220     A            V1DTSP         8A  O  3 72TEXT('TIPO SERVIZIO BOLLA')
005570010220     A                                      DSPATR(RI)
005580010220     A                                 10  2'DISTINTA : Del.......'
005590010220     A            V3CDDC    R        O 10 28REFFLD(BLPDCE *LIBL/FNBLP00F)
005600010220     A                                      EDTWRD('  /  /    ')
005610010220     A                                      DSPATR(HI)
005620010220     A                                 10 50'Numero'
005630010220     A            V3CNDC         7Y 0O 10 57DSPATR(HI)
005640010220     A                                      EDTCDE(2)
005650010220     A                                 11  2'Tipo Mancata Consegna'
005660010220     A            V3CTMC    R        O 11 28REFFLD(BLPTMC *LIBL/FNBLP00F)
005670010220     A                                      DSPATR(HI)
005680010220     A            V3DTMC    R   47   O 11 33REFFLD(§2ADES *LIBL/DS2A)
005690010220     A                                 13  2'C O N S E G N A:'
005700010220     A                                      DSPATR(HI)
005710010220     A                                      DSPATR(UL)
005720010220     A                                 13 19'TEORICA'
005730010220     A N94        V1CDCE    R        O 13 28REFFLD(BLPDCE *LIBL/FNBLP00F)
005740010220     A                                      EDTWRD('  /  /    ')
005750010220     A                                      DSPATR(HI)
005760010220     A  94                             13 28'F23=Visualizza'
005770010220     A                                      DSPATR(RI)
005780010220     A N98N94                          13 50'Ora'
005790010220     A N98N94     VIDHC2         4Y 0O 13 55EDTWRD('  :  ')
005800010220     A                                      DSPATR(HI)
005810010220     A  98                             14 21'REALE'
005820010220     A            V1CDCM    R        O 14 28REFFLD(BLPDCM *LIBL/FNBLP00F)
005830010220     A                                      EDTWRD('  /  /    ')
005840010220     A                                      DSPATR(HI)
005850010220     A  98                             14 50'Ora'
005860010220     A  98        V1CHMC    R        O 14 55REFFLD(BLPHMC *LIBL/FNBLP00F)
005870010220     A                                      EDTWRD('  :  ')
005880010220     A                                      DSPATR(HI)
005890010220     A N94                             14 62'Ore Ritardo'
005900010220     A N94        V1CNRC    R        O 14 74REFFLD(BLPNRC *LIBL/FNBLP00F)
005910010220     A                                      EDTCDE(Q)
005920010220     A                                      DSPATR(HI)
005930010220     A                                 15  2'Consegne Particolari :'
005940010220     A            V3CTC1    R    1   O 15 28REFFLD(BLPTC1 *LIBL/FNBLP00F)
005950010220     A                                      DSPATR(HI)
005960010220     A            V3DTC1    R   16   O 15 31REFFLD(§1PDES *LIBL/DS1P)
005970010220     A                                      DSPATR(HI)
005980010220     A            V3CTC2    R    1   O 15 50REFFLD(BLPTC1 *LIBL/FNBLP00F)
005990010220     A                                      DSPATR(HI)
006000010220     A            V3DTC2    R        O 15 53REFFLD(§1PDES *LIBL/DS1P)
006010010220     A                                      DSPATR(HI)
006020010220     A                                 16  2'Prima Conseg. Parziale'
006030010220     A            V3CDCP    R        O 16 28REFFLD(BLPDCP *LIBL/FNBLP00F)
006040010220     A                                      EDTWRD('  /  /    ')
006050010220     A                                      DSPATR(HI)
006060010220     A                                 17  2'Consegna  Anomala ....'
006070010220     A            V3CCCA    R        O 17 28REFFLD(BLPCCA *LIBL/FNBLP00F)
006080010220     A                                      DSPATR(HI)
006090010220     A            V3DCCA    R        O 17 31REFFLD(§7ODEI *LIBL/DS7O)
006100010220     A                                      DSPATR(HI)
006110951219     A**************************************************************************
006120991021     A          R LS05Z03
006130991021     A                                      OVERLAY
006140991021     A N34        LEGAME        58A  O 23  2DSPATR(RI)
006150021218     A            FD03          62A  O 24  2
006160021218     A            F24D03        16A  O 24 65
006170040220     A**************************************************************************
006180051104     A          R LS05D04
006190051104     A*%%TS  SD  20051104  112514  EDPES       REL-V4R4M0  5769-PW1
006200051104     A                                      CA12
006210051104     A                                      OVERLAY
006220051104     A            V1DTSP         8A  O  3 72TEXT('TIPO SERVIZIO BOLLA')
006230051104     A                                      DSPATR(RI)
006240051104     A                                  4  2'SPEDIZIONE:'
006250051104     A                                      DSPATR(UL)
006260051104     A            V1CLNP    R        O  4 15REFFLD(BLPLNP *LIBL/FNBLP00F)
006270051104     A                                      DSPATR(HI)
006280051104     A                                      DSPATR(UL)
006290051104     A            V1CNRS    R        O  4 20REFFLD(BLPNRS *LIBL/FNBLP00F)
006300051104     A                                      DSPATR(HI)
006310051104     A                                      EDTCDE(Z)
006320051104     A                                      DSPATR(UL)
006330051104     A            V1CNSP    R        O  4 24REFFLD(BLPNSP *LIBL/FNBLP00F)
006340051104     A                                      DSPATR(HI)
006350051104     A                                      EDTCDE(Z)
006360051104     A                                      DSPATR(UL)
006370051104     A                                  4 33'del'
006380051104     A            V1CDSP         8Y 0O  4 38DSPATR(HI)
006390051104     A                                      EDTWRD('  /  /    ')
006400051104     A                                      DSPATR(UL)
006410051104     A                                  4 53'Rifer.Mitt.'
006420051104     A            V2CRMN    R        O  4 65REFFLD(BLPRMN *LIBL/FNBLP00F)
006430051104     A                                      DSPATR(HI)
006440051104     A                                      EDTCDE(Z)
006450051104     A                                  5  2'Linea Arrivo'
006460051104     A            V1CLNA    R        O  5 15REFFLD(BLPLNA *LIBL/FNBLP00F)
006470051104     A                                      DSPATR(HI)
006480051104     A                                  5 19'-'
006490051104     A            V9DLNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
006500051104     A                                      DSPATR(HI)
006510051104     A                                  5 38'Destinat.'
006520051104     A            V9CRSD    R   32   O  5 48REFFLD(BLPRSD *LIBL/FNBLP00F)
006530051104     A                                      DSPATR(HI)
006540051104     A                                  7  1'----------------------  E S T E N -
006550051104     A                                      S I O N E    B O L L A  ------------
006560051104     A                                      -----------'
006570051104     A                                      DSPATR(HI)
006580051104     A                                  9  2'Cliente Fatturazione'
006590051104     A            VI2KSC         7S 0O  9 25DSPATR(HI)
006600051104     A            VI2DKS        35A  O  9 34DSPATR(HI)
006610051104     A                                 11 16'----- Tariffa ------'
006620051104     A                                 11 45'---- Contrassegno ----'
006630051104     A            VI2CTR         3Y 0O 12 16DSPATR(HI)
006640051104     A            VI2DCT        15A  O 12 21
006650051104     A            V2CCAS        13Y 3O 12 45DSPATR(HI)
006660051104     A                                      EDTCDE(2)
006670051104     A            V2CVCA         3A  O 12 64DSPATR(HI)
006680051104     A                                 15 14'Divisa'
006690051104     A                                 15 30'Importo / L.IVA / Numero / Data FA-
006700051104     A                                      TTURA'
006710051104     A            VI2DIV         3A  O 16 16DSPATR(HI)
006720051104     A            VI2IFT        13A  O 16 24DSPATR(HI)
006730051104     A            VI2FIV    R        O 16 41REFFLD(AR6FIV *LIBL/FIAR600F)
006740051104     A                                      DSPATR(HI)
006750051104     A                                      EDTCDE(Z)
006760051104     A            VI2NFT    R        O 16 47REFFLD(AR6NFT *LIBL/FIAR600F)
006770051104     A                                      DSPATR(HI)
006780051104     A                                      EDTCDE(2)
006790051104     A            VI2DFT        10A  O 16 57DSPATR(HI)
006800051104     A                                 18  2'---- Varie ----'
006810051104     A                                 18 18'---- Varie ----'
006820051104     A            VI2FI2        10A  O 18 35
006830051104     A N11                             18 47'Importo I.V.A.'
006840051104     A  11                             18 47'Importo Bollo'
006850051104     A                                 18 62'Esenzione IVA'
006860051104     A            VI2SV1         1A  O 19  2DSPATR(HI)
006870051104     A            VI2VA1        13A  O 19  4DSPATR(HI)
006880051104     A            VI2SV5         1A  O 19 18DSPATR(HI)
006890051104     A            VI2VA5        13A  O 19 20DSPATR(HI)
006900051104     A            VI2FIM         8A  O 19 36DSPATR(HI)
006910051104     A            VI2IVA        13A  O 19 47DSPATR(HI)
006920051104     A            VI2CEI    R        O 19 62REFFLD(AR6CEI *LIBL/FIAR600F)
006930051104     A                                      DSPATR(HI)
006940051104     A            VI2DCE        15A  O 19 64TEXT('DESCRIZIONE')
006950051104     A            VI2SV2         1A  O 20  2DSPATR(HI)
006960051104     A            VI2VA2        13A  O 20  4DSPATR(HI)
006970051104     A            VI2SV6         1A  O 20 18DSPATR(HI)
006980051104     A            VI2VA6        13A  O 20 20DSPATR(HI)
006990051104     A            VI2SV3         1A  O 21  2DSPATR(HI)
007000051104     A            VI2VA3        13A  O 21  4DSPATR(HI)
007010051104     A            VI2SV4         1A  O 22  2DSPATR(HI)
007020051104     A            VI2VA4        13A  O 22  4DSPATR(HI)
007030051104     A                                 24  2'F12=Ritorno'
007040000000     A**************************************************************************
007050000000     A*  LS05D07  --  FORMATO RIEPILOGATIVO DELLA BOLLA IN ARRIVO
007060000000     A**************************************************************************
007070130319     A          R LS05D07
007080130319     A*%%TS  SD  20130319  140510  EDPRM       REL-V6R1M0  5761-WDS
007090130319     A  27                                  CF01
007100130319     A  12                                  CF02
007110130319     A                                      CA03
007120130319     A  06                                  CF04
007130130319     A  95                                  CF05
007140130319     A  22N05                               CF07
007150130319     A  55                                  CF08
007160130319     A  10                                  CF10
007170130319     A  77                                  CF11
007180130319     A                                      CA12
007190130319     A  04                                  CF13
007200130319     A  03                                  CF14
007210130319     A                                      CA15
007220130319     A  28                                  CF16
007230130319     A  07                                  CF18
007240130319     A  22                                  CF19
007250130319     A  22                                  CF20
007260130319     A                                      CF21
007270130319     A  24                                  CF22
007280130319     A  94                                  CF23
007290130319     A                                      CA24
007300130319     A                                      OVERLAY
007310130319     A                                  3 16'SPEDIZIONE:'
007320130319     A                                      DSPATR(UL)
007330130319     A            V1CLNP    R        O  3 30REFFLD(BLPLNP *LIBL/FNBLP00F)
007340130319     A                                      DSPATR(HI)
007350130319     A                                      DSPATR(UL)
007360130319     A            V1CNRS    R        O  3 35REFFLD(BLPNRS *LIBL/FNBLP00F)
007370130319     A                                      DSPATR(UL)
007380130319     A                                      DSPATR(HI)
007390130319     A                                      EDTCDE(Z)
007400130319     A                                  3 38'-'
007410130319     A            V1CNSP    R        O  3 40REFFLD(BLPNSP *LIBL/FNBLP00F)
007420130319     A                                      DSPATR(HI)
007430130319     A                                      EDTCDE(2)
007440130319     A                                      DSPATR(UL)
007450130319     A                                  3 53'Del'
007460130319     A            V1CDSP         8Y 0O  3 58TEXT('DATA SPEDIZIONE')
007470130319     A                                      DSPATR(HI)
007480130319     A                                      EDTWRD('  /  /    ')
007490130319     A                                      DSPATR(UL)
007500130319     A            V1DTSP         8A  O  3 72TEXT('TIPO SERVIZIO BOLLA')
007510130319     A                                      DSPATR(RI)
007520130319     A            V1DAR8        16A  O  4 17DSPATR(HI)
007530130319     A            V1DBAM         6A  O  4 35
007540130319     A  08                                  DSPATR(HI)
007550130319     A                                  4 43'Stampa LetVet'
007560130319     A            V1DFST         8A  O  4 58
007570130319     A                                  5  2'Ritiro Merce'
007580130319     A            V1CDRT    R        O  5 16REFFLD(BLPDRT *LIBL/FNBLP00F)
007590130319     A                                      EDTWRD('  /  /    ')
007600130319     A                                  5 35'Partenza Primo  Collo'
007610130319     A            V1CDPC    R        O  5 58REFFLD(BLPDPC *LIBL/FNBLP00F)
007620130319     A                                      EDTWRD('  /  /    ')
007630130319     A  44                              5 72'GIACENTE'
007640130319     A                                      DSPATR(RI)
007650130319     A                                  6  2'Data Bordero'''
007660130319     A            V1CDBR    R        O  6 16REFFLD(BLPDBR *LIBL/FNBLP00F)
007670130319     A                                      EDTWRD('  /  /    ')
007680130319     A                                  6 35'Partenza Ultimo Collo'
007690130319     A            V1CDUC    R        O  6 58REFFLD(BLPDUC *LIBL/FNBLP00F)
007700130319     A                                      EDTWRD('  /  /    ')
007710130319     A                                  7  2'Data ARRIVO'
007720130319     A            V1CDAM    R        O  7 16REFFLD(BLPDAM *LIBL/FNBLP00F)
007730130319     A                                      EDTWRD('  /  /    ')
007740130319     A                                  8  2'Linea Arrivo'
007750130319     A            V1CLNA    R        O  8 16REFFLD(BLPLNA *LIBL/FNBLP00F)
007760130319     A                                      DSPATR(HI)
007770130319     A            V1DLNA    R        O  8 21REFFLD(ORGDES *LIBL/AZORG00F)
007780130319     A                                      DSPATR(HI)
007790130319     A                                  8 45'Cod.Bolla'
007800130319     A            V1CCBO    R        O  8 55REFFLD(BLPCBO *LIBL/FNBLP00F)
007810130319     A                                      DSPATR(HI)
007820130319     A            V7DCBO    R   23   O  8 58REFFLD(§3ADES *LIBL/DS3A)
007830130319     A                                      DSPATR(HI)
007840130319     A                                  9  2'-----------------------------------
007850130319     A                                      ------------------------------------
007860130319     A                                      ----------'
007870130319     A                                 10  2'Prima Cons.Parziale'
007880130319     A            V3CDCP    R     Y  O 10 22REFFLD(BLPDCP *LIBL/FNBLP00F)
007890130319     A                                      DSPATR(HI)
007900130319     A                                      EDTWRD('  /  /    ')
007910130319     A                                 10 35'Con.Anomala'
007920130319     A            V3CCCA    R        O 10 47REFFLD(BLPCCA *LIBL/FNBLP00F)
007930130319     A                                      DSPATR(HI)
007940130319     A            V7DCCA        14A  O 10 49DSPATR(HI)
007950130319     A                                 10 64'Mancata Cons:'
007960130319     A            V3CTMC    R        O 10 78REFFLD(BLPTMC *LIBL/FNBLP00F)
007970130319     A                                      DSPATR(HI)
007980130319     A                                 11  2'CONSEGNA:'
007990130319     A                                      DSPATR(HI)
008000130319     A                                      DSPATR(UL)
008010130319     A                                 11 13'TEORICA'
008020130319     A  94                             11 22'F23=Visual.'
008030130319     A                                      DSPATR(RI)
008040130319     A N94        V1CDCE    R        O 11 22REFFLD(BLPDCE *LIBL/FNBLP00F)
008050130319     A                                      EDTWRD('  /  /    ')
008060130319     A                                      DSPATR(HI)
008070130319     A  98                             11 35'REALE'
008080130319     A  98        V1CDCM    R        O 11 42REFFLD(BLPDCM *LIBL/FNBLP00F)
008090130319     A                                      EDTWRD('  /  /    ')
008100130319     A                                      DSPATR(HI)
008110130319     A  98
008120130319     AON98N94     V1CHMC    R        O 11 54REFFLD(BLPHMC *LIBL/FNBLP00F)
008130130319     A                                      EDTWRD('  :  ')
008140130319     A                                      DSPATR(HI)
008150130319     A N94                             11 64'ORE RITARDO'
008160130319     A N94        V1CNRC    R        O 11 77REFFLD(BLPNRC *LIBL/FNBLP00F)
008170130319     A                                      EDTCDE(Q)
008180130319     A                                      DSPATR(HI)
008190130319     A                                 12  2'-----------------------------------
008200130319     A                                      ------------------------------------
008210130319     A                                      ----------'
008220130319     A                                 13  2'Mittente'
008230130319     A            V7CRSM    R   28   O 13 12REFFLD(BLPRSM *LIBL/FNBLP00F)
008240130319     A                                      DSPATR(HI)
008250130319     A                                      DSPATR(UL)
008260130319     A                                 13 41'Destinat.'
008270130319     A            V7CRSD    R   30   O 13 51REFFLD(BLPRSD *LIBL/FNBLP00F)
008280130319     A                                      DSPATR(HI)
008290130319     A                                      DSPATR(UL)
008300130319     A            V1CKSC    R        O 14  3REFFLD(BLPKSC *LIBL/FNBLP00F)
008310130319     A                                      DSPATR(HI)
008320130319     A                                      EDTCDE(Z)
008330130319     A            V7CINM    R   28   O 14 12REFFLD(BLPINM *LIBL/FNBLP00F)
008340130319     A                                      DSPATR(HI)
008350130319     A                                      DSPATR(UL)
008360130319     A            V1CCDD    R        O 14 42REFFLD(BLPKSC *LIBL/FNBLP00F)
008370130319     A                                      DSPATR(HI)
008380130319     A                                      EDTCDE(Z)
008390130319     A            V7CIND    R   24   O 14 51REFFLD(BLPIND *LIBL/FNBLP00F)
008400130319     A                                      DSPATR(HI)
008410130319     A                                      DSPATR(UL)
008420130319     A                                 14 78'Inl'
008430130319     A            V1CCAM    R        O 15  2REFFLD(BLPCAM *LIBL/FNBLP00F)
008440130319     A                                      DSPATR(HI)
008450130319     A                                      DSPATR(UL)
008460130319     A            V7CLOM    R   25   O 15 12REFFLD(BLPLOM *LIBL/FNBLP00F)
008470130319     A                                      DSPATR(HI)
008480130319     A                                      DSPATR(UL)
008490130319     A            V1CPRM    R        O 15 38REFFLD(BLPPRM *LIBL/FNBLP00F)
008500130319     A                                      DSPATR(HI)
008510130319     A                                      DSPATR(UL)
008520130319     A            V2CCAD    R        O 15 41REFFLD(BLPCAD *LIBL/FNBLP00F)
008530130319     A                                      DSPATR(HI)
008540130319     A                                      DSPATR(UL)
008550130319     A            V7CLOD    R   24   O 15 51REFFLD(BLPLOD *LIBL/FNBLP00F)
008560130319     A                                      DSPATR(HI)
008570130319     A                                      DSPATR(UL)
008580130319     A            V2CPRD    R        O 15 76REFFLD(BLPPRD *LIBL/FNBLP00F)
008590130319     A                                      DSPATR(HI)
008600130319     A                                      DSPATR(UL)
008610130319     A            V2CFIN    R        O 15 79REFFLD(BLPFIN *LIBL/FNBLP00F)
008620130319     A                                      DSPATR(HI)
008630130319     A                                      DSPATR(UL)
008640130319     A                                 16  2'Riferimenti:'
008650130319     A                                 16 19'-LNP Serie Numero SEGNACOLLI-'
008660130319     A                                 16 51'R'
008670130319     A                                 16 55'-----Contrassegno-----Ben-'
008680130319     A            V2CRMN    R        O 17  2REFFLD(BLPRMN *LIBL/FNBLP00F)
008690130319     A                                      EDTCDE(Z)
008700130319     A                                      DSPATR(UL)
008710130319     A                                      DSPATR(HI)
008720130319     A            V2CFLS    R     A  O 17 20REFFLD(BLPFLS *LIBL/FNBLP00F)
008730130319     A                                      DSPATR(HI)
008740130319     A                                      DSPATR(UL)
008750130319     A            V7CNRS    R        O 17 25REFFLD(BLPNRS *LIBL/FNBLP00F)
008760130319     A                                      DSPATR(HI)
008770130319     A                                      DSPATR(UL)
008780130319     A                                      EDTCDE(Z)
008790130319     A            V2CNCD    R        O 17 30REFFLD(BLPNCD *LIBL/FNBLP00F)
008800130319     A                                      EDTCDE(Z)
008810130319     A                                      DSPATR(UL)
008820130319     A                                      DSPATR(HI)
008830130319     A                                 17 38'/'
008840130319     A            V2CNCA    R        O 17 40REFFLD(BLPNCA *LIBL/FNBLP00F)
008850130319     A                                      EDTCDE(Z)
008860130319     A                                      DSPATR(UL)
008870130319     A                                      DSPATR(HI)
008880130319     A            V2CXCO    R        O 17 51REFFLD(BLPXCO *LIBL/FNBLP00F)
008890130319     A                                      DSPATR(UL)
008900130319     A                                      DSPATR(HI)
008910130319     A            V2CTIC    R        O 17 55REFFLD(AR9TIC *LIBL/FIAR900F)
008920130319     A                                      DSPATR(HI)
008930130319     A            V2CCAS    R        O 17 58REFFLD(AR9CAS *LIBL/FIAR900F)
008940130319     A                                      EDTCDE(4)
008950130319     A                                      DSPATR(HI)
008960130319     A            V2CVCA    R        O 17 73REFFLD(AR9VCA *LIBL/FIAR900F)
008970130319     A                                      DSPATR(HI)
008980130319     A  43                             17 77'?'
008990130319     A  43        V2CBEN         1A  B 17 79DSPATR(HI)
009000130319     A                                      VALUES(' ' '?')
009010130319     A            V2CRMA    R        O 18  2REFFLD(BLPRMA *LIBL/FNBLP00F)
009020130319     A                                      DSPATR(HI)
009030130319     A                                      DSPATR(UL)
009040130319     A            V2CFNS        15A  O 18 31DSPATR(BL)
009050130319     A                                 19  2'Colli'
009060130319     A                                 19 10'Peso'
009070130319     A                                 19 19'Volume'
009080130319     A                                 19 28'------Consegna Richiesta--------'
009090130319     A                                 19 61'GG.Chiusura'
009100130319     A                                 19 73'Ferm.Dep'
009110130319     A            V1CNCL    R        O 20  2REFFLD(BLPNCL *LIBL/FNBLP00F)
009120130319     A                                      TEXT('numero colli')
009130130319     A                                      DSPATR(HI)
009140130319     A                                      EDTCDE(Z)
009150130319     A                                      DSPATR(UL)
009160130319     A            V1CPKF    R        O 20  8REFFLD(BLPPKF *LIBL/FNBLP00F)
009170130319     A                                      DSPATR(HI)
009180130319     A                                      EDTCDE(4)
009190130319     A                                      DSPATR(UL)
009200130319     A            V1CFVF    R        O 20 18REFFLD(BLPFVB *LIBL/FNBLP00F)
009210130319     A                                      DSPATR(HI)
009220130319     A                                      DSPATR(UL)
009230130319     A            V1CVLF    R        O 20 20REFFLD(BLPVLB *LIBL/FNBLP00F)
009240130319     A                                      EDTCDE(4)
009250130319     A                                      DSPATR(HI)
009260130319     A                                      DSPATR(UL)
009270130319     A            V2CTCR        11A  O 20 28TEXT('tipo consegna richiesta')
009280130319     A                                      DSPATR(HI)
009290130319     A            V2CDCR    R        O 20 40REFFLD(BLPDCR *LIBL/FNBLP00F)
009300130319     A                                      DSPATR(HI)
009310130319     A                                      EDTWRD('  /  /    ')
009320130319     A                                 20 51'Ore'
009330130319     A            V2CHCR    R        O 20 55REFFLD(BLPHCR *LIBL/FNBLP00F)
009340130319     A                                      DSPATR(HI)
009350130319     A                                      EDTWRD('  :  ')
009360130319     A            V2CGC1    R        O 20 64REFFLD(BLPGC1 *LIBL/FNBLP00F)
009370130319     A                                      DSPATR(HI)
009380130319     A            V2CGC2    R        O 20 68REFFLD(BLPGC2 *LIBL/FNBLP00F)
009390130319     A                                      DSPATR(HI)
009400130319     A            V2CFFD    R    3   O 20 76DSPATR(HI)
009410130319     A                                 21  2'Consegne Particolari:'
009420130319     A            V3CTC1    R        O 21 24REFFLD(BLPTC1 *LIBL/FNBLP00F)
009430130319     A                                      DSPATR(HI)
009440130319     A            V3DTC1    R   16   O 21 26REFFLD(§1PDES *LIBL/DS1P)
009450130319     A                                      DSPATR(HI)
009460130319     A            V3CTC2    R        O 21 43REFFLD(BLPTC2 *LIBL/FNBLP00F)
009470130319     A                                      DSPATR(HI)
009480130319     A            V3DTC2    R        O 21 45REFFLD(§1PDES *LIBL/DS1P)
009490130319     A                                      DSPATR(HI)
009500130319     A                                 21 72'Zona'
009510130319     A            V2CZNC    R        O 21 77REFFLD(BLPZNC *LIBL/FNBLP00F)
009520130319     A                                      EDTCDE(Z)
009530130319     A                                      DSPATR(HI)
009540130319     A            V2CBVA         1A  O 21 80TEXT('FLAG "COLLI DI VALORE"')
009550130319     A                                 22  2'Note:'
009560130319     A            V2CNO1    R        O 22  8REFFLD(AR4NOT *LIBL/FIAR400F)
009570130319     A                                      DSPATR(HI)
009580130319     A            V2CNO2    R        O 22 45REFFLD(AR4NOT *LIBL/FIAR400F)
009590130319     A                                      DSPATR(HI)
009600130319     A N34        LEGAME        58A  O 23  2DSPATR(RI)
009610130319     A                                 23 62'F15=Bolla'
009620130319     A                                      DSPATR(HI)
009630130319     A                                 23 73'F3=Fine'
009640130319     A            FD07          62A  O 24  2
009650130319     A            F24D07        16A  O 24 65
009660040220     A**************************************************************************
009670110705     A          R LS05D08
009680110705     A*%%TS  SD  20110705  093553  EDPES       REL-V6R1M0  5761-WDS
009690110705     A                                      OVERLAY
009700110705     A            V1DTSP         8A  O  3 72TEXT('TIPO SERVIZIO BOLLA')
009710110705     A                                      DSPATR(RI)
009720110705     A                                  4  2'SPEDIZIONE:'
009730110705     A                                      DSPATR(UL)
009740110705     A            V1CLNP    R        O  4 15REFFLD(BLPLNP *LIBL/FNBLP00F)
009750110705     A                                      DSPATR(HI)
009760110705     A                                      DSPATR(UL)
009770110705     A            V1CNRS    R        O  4 20REFFLD(BLPNRS *LIBL/FNBLP00F)
009780110705     A                                      DSPATR(HI)
009790110705     A                                      EDTCDE(Z)
009800110705     A                                      DSPATR(UL)
009810110705     A            V1CNSP    R        O  4 24REFFLD(BLPNSP *LIBL/FNBLP00F)
009820110705     A                                      DSPATR(HI)
009830110705     A                                      EDTCDE(Z)
009840110705     A                                      DSPATR(UL)
009850110705     A                                  4 33'del'
009860110705     A            V1CDSP         8Y 0O  4 38DSPATR(HI)
009870110705     A                                      EDTWRD('  /  /    ')
009880110705     A                                      DSPATR(UL)
009890110705     A                                  4 53'Rifer.Mitt.'
009900110705     A            V2CRMN    R        O  4 65REFFLD(BLPRMN *LIBL/FNBLP00F)
009910110705     A                                      DSPATR(HI)
009920110705     A                                      EDTCDE(Z)
009930110705     A                                  5  2'Linea Arrivo'
009940110705     A            V1CLNA    R        O  5 15REFFLD(BLPLNA *LIBL/FNBLP00F)
009950110705     A                                      DSPATR(HI)
009960110705     A                                  5 19'-'
009970110705     A            V9DLNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
009980110705     A                                      DSPATR(HI)
009990110705     A                                  5 38'Destinat.'
010000110705     A            V9CRSD    R   32   O  5 48REFFLD(BLPRSD *LIBL/FNBLP00F)
010010110705     A                                      DSPATR(HI)
010020110705     A                                  6  2'Cli.Fatturaz'
010030110705     A            V8CKSC         7S 0O  6 15DSPATR(HI)
010040110705     A            V8DKSC        25A  O  6 23DSPATR(HI)
010050110705     A                                  6 53'Tariffa'
010060110705     A            V8CCTR         3Y 0O  6 61DSPATR(HI)
010070110705     A            V8DCTR        10A  O  6 65
010080110705     A  84                              7  7'--------'
010090110705     A  84                              7 17'Proposta Tassazione da Bollettazio-
010100110705     A                                      ne'
010110110705     A  84                              7 55'---------'
010120110705     A  84                              8  7'Cliente'
010130110705     A  84        V8CAR4KSC      7  0O  8 15DSPATR(HI)
010140110705     A  84        V8DAR4KSC     25   O  8 23
010150110705     A  84                              8 53'Tariffa'
010160110705     A  84        V8CAR4CTR      3   O  8 61DSPATR(HI)
010170110705     A                                  9  3'Colli'
010180110705     A                                  9 12'Peso Fatt.'
010190110705     A                                  9 27'Volume Fatt.'
010200110705     A                                  9 43'Qta'' Fatturabile'
010210110705     A                                  9 62'Codice Tassazione'
010220110705     A            V1CNCL    R        O 10  2REFFLD(BLPNCL *LIBL/FNBLP00F)
010230110705     A                                      DSPATR(HI)
010240110705     A                                      EDTCDE(2)
010250110705     A            V1CPKF    R        O 10 12REFFLD(BLPPKF *LIBL/FNBLP00F)
010260110705     A                                      DSPATR(HI)
010270110705     A                                      EDTCDE(2)
010280110705     A                                 10 22'Kg.'
010290110705     A            V1CFVF    R        O 10 29REFFLD(BLPFVF *LIBL/FNBLP00F)
010300110705     A                                      DSPATR(HI)
010310110705     A            V1CVLF    R        O 10 32REFFLD(BLPVLF *LIBL/FNBLP00F)
010320110705     A                                      DSPATR(HI)
010330110705     A                                      EDTCDE(4)
010340110705     A            V2CQFT    R        O 10 42REFFLD(BLPQFT *LIBL/FNBLP00F)
010350110705     A                                      DSPATR(HI)
010360110705     A                                      EDTCDE(2)
010370110705     A            V8CCTS    R        O 10 62REFFLD(BLPCTS *LIBL/FNBLP00F)
010380110705     A                                      DSPATR(HI)
010390110705     A            V8DCTS        15A  O 10 65TEXT('DESCRIZIONE')
010400110705     A                                 12 10'Divisa'
010410110705     A                                 12 28'Importo / L.IVA / Numero / Data FA-
010420110705     A                                      TTURA'
010430110705     A            V8CDIV         3A  O 13 12DSPATR(HI)
010440110705     A            V8CIFT        13A  O 13 22DSPATR(HI)
010450110705     A            V8CFIV    R        O 13 39REFFLD(AR6FIV *LIBL/FIAR600F)
010460110705     A                                      DSPATR(HI)
010470110705     A                                      EDTCDE(Z)
010480110705     A            V8CNFT    R        O 13 45REFFLD(AR6NFT *LIBL/FIAR600F)
010490110705     A                                      DSPATR(HI)
010500110705     A                                      EDTCDE(2)
010510110705     A            V8CDFT        10A  O 13 56DSPATR(HI)
010520110705     A                                 15  7'Trasporto'
010530110705     A                                 15 21'Tot.Imponibile'
010540110705     A                                 15 47'I.V.A.'
010550110705     A                                 15 58'Esenzione IVA'
010560110705     A            V8CPOR        13A  O 16  3DSPATR(HI)
010570110705     A            V8CIMV        13A  O 16 22DSPATR(HI)
010580110705     A            V8CIVA        13A  O 16 40DSPATR(HI)
010590110705     A            V8CCEI    R        O 16 58REFFLD(AR6CEI *LIBL/FIAR600F)
010600110705     A                                      DSPATR(HI)
010610110705     A            V8DCEI    R        O 16 60REFFLD(§EIDES *LIBL/DSEI)
010620110705     A            V8DFIM         8A  O 17 27
010630110705     A                                 18  2'--------- Varie ---------'
010640110705     A                                 18 29'--------- Varie ---------'
010650110705     A                                 18 56'--------- Varie ---------'
010660000000     A**************************************************************************
010670110705     A          R LS05S08                   SFL
010680110705     A*%%TS  SD  20110705  093553  EDPES       REL-V6R1M0  5761-WDS
010690110705     A            V8CSV1    R        O 19  2REFFLD(AR6SV1 *LIBL/FIAR600F)
010700110705     A                                      DSPATR(HI)
010710110705     A            V8CDES         9A  O 19 18TEXT('DESCRIZIONE')
010720110705     A            V8CVA1        13A  O 19  4DSPATR(HI)
010730000000     A**************************************************************************
010740110705     A          R LS05C08                   SFLCTL(LS05S08)
010750110705     A*%%TS  SD  20110705  093553  EDPES       REL-V6R1M0  5761-WDS
010760110705     A                                      CA12
010770110705     A                                      OVERLAY
010780110705     A  20                                  SFLDSP
010790110705     A  21                                  SFLDSPCTL
010800110705     A N21                                  SFLCLR
010810110705     A                                      SFLSIZ(0016)
010820110705     A                                      SFLPAG(0015)
010830110705     A                                      SFLLIN(0002)
010840110705     A                                 24  2'F12=Ritorno'
010850000000     A**************************************************************************
010860941230     A          R LS05S09                   SFL
010870950103     A            V9CI80         1A  H      TEXT('INDICATORE 80')
010880950103     A            V9CI81         1A  H      TEXT('INDICATORE 81')
010890950103     A            V9CI82         1A  H      TEXT('INDICATORE 82')
010900950103     A            V9CI83         1A  H      TEXT('INDICATORE 83')
010910941230     A            V9CAAP    R        O 11  2REFFLD(LBLAAP *LIBL/FNLBL00F)
010920941230     A  81                                  DSPATR(RI)
010930941230     A                                      EDTCDE(Z)
010940941230     A            V9CLPP    R        O 11  7REFFLD(LBLLPP *LIBL/FNLBL00F)
010950941230     A  81                                  DSPATR(RI)
010960950103     A                                      EDTCDE(Z)
010970941230     A            V9CNRP    R        O 11 11REFFLD(LBLNRP *LIBL/FNLBL00F)
010980941230     A  81                                  DSPATR(RI)
010990941230     A                                      EDTCDE(Z)
011000941230     A            V9CNSP    R        O 11 14REFFLD(LBLNSP *LIBL/FNLBL00F)
011010941230     A  81                                  DSPATR(RI)
011020941230     A                                      EDTCDE(Z)
011030941230     A            V9CLAP    R        O 11 22REFFLD(LBLLAP *LIBL/FNLBL00F)
011040941230     A  81                                  DSPATR(RI)
011050950103     A                                      EDTCDE(Z)
011060941230     A            V9CAAN    R        O 11 30REFFLD(LBLAAN *LIBL/FNLBL00F)
011070941230     A  83                                  DSPATR(ND)
011080941230     A  82                                  DSPATR(RI)
011090941230     A                                      EDTCDE(Z)
011100941230     A            V9CLPN    R        O 11 35REFFLD(LBLLPN *LIBL/FNLBL00F)
011110941230     A  83                                  DSPATR(ND)
011120941230     A  82                                  DSPATR(RI)
011130950103     A                                      EDTCDE(Z)
011140941230     A            V9CNRN    R        O 11 39REFFLD(LBLNRN *LIBL/FNLBL00F)
011150941230     A  83                                  DSPATR(ND)
011160941230     A  82                                  DSPATR(RI)
011170941230     A                                      EDTCDE(Z)
011180941230     A            V9CNSN    R        O 11 42REFFLD(LBLNSN *LIBL/FNLBL00F)
011190941230     A  83                                  DSPATR(ND)
011200941230     A  82                                  DSPATR(RI)
011210941230     A                                      EDTCDE(Z)
011220941230     A            V9CLAN    R        O 11 50REFFLD(LBLLAN *LIBL/FNLBL00F)
011230941230     A  83                                  DSPATR(ND)
011240941230     A  82                                  DSPATR(RI)
011250950103     A                                      EDTCDE(Z)
011260941230     A            V9CSCE         1A  B 11 55DSPATR(UL)
011270941230     A                                      VALUES('5' ' ')
011280941230     A  80                                  DSPATR(ND)
011290941230     A  80                                  DSPATR(PR)
011300941230     A                                      DSPATR(HI)
011310941230     A            V9CPRE        23A  O 11 57
011320941230     A                                 12  2'  '
011330000000     A**************************************************************************
011340010220     A          R LS05C09                   SFLCTL(LS05S09)
011350010220     A                                      CA12
011360010220     A                                      OVERLAY
011370010220     A  20                                  SFLDSP
011380010220     A  21                                  SFLDSPCTL
011390010220     A N21                                  SFLCLR
011400010220     A  23                                  SFLEND
011410010220     A                                      SFLFOLD(CA09)
011420010220     A                                      SFLSIZ(0007)
011430010220     A                                      SFLPAG(0006)
011440010220     A            REC9           4S 0H      SFLRCDNBR
011450010220     A                                  4  2'SPEDIZIONE:'
011460010220     A                                      DSPATR(UL)
011470010220     A            V1CLNP    R        O  4 15REFFLD(BLPLNP *LIBL/FNBLP00F)
011480010220     A                                      DSPATR(HI)
011490010220     A                                      DSPATR(UL)
011500010220     A            V1CNRS    R        O  4 20REFFLD(BLPNRS *LIBL/FNBLP00F)
011510010220     A                                      DSPATR(HI)
011520010220     A                                      EDTCDE(Z)
011530010220     A                                      DSPATR(UL)
011540010220     A            V1CNSP    R        O  4 24REFFLD(BLPNSP *LIBL/FNBLP00F)
011550010220     A                                      DSPATR(HI)
011560010220     A                                      EDTCDE(Z)
011570010220     A                                      DSPATR(UL)
011580010220     A                                  4 33'del'
011590010220     A            V1CDSP         8Y 0O  4 38DSPATR(HI)
011600010220     A                                      EDTWRD('  /  /    ')
011610010220     A                                      DSPATR(UL)
011620010220     A                                  4 53'Rifer.Mitt.'
011630010220     A            V2CRMN    R        O  4 65REFFLD(BLPRMN *LIBL/FNBLP00F)
011640010220     A                                      DSPATR(HI)
011650010220     A                                      EDTCDE(Z)
011660010220     A                                  5  2'Linea Arrivo'
011670010220     A            V1CLNA    R        O  5 15REFFLD(BLPLNA *LIBL/FNBLP00F)
011680010220     A                                      DSPATR(HI)
011690010220     A                                  5 19'-'
011700010220     A            V9DLNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
011710010220     A                                      DSPATR(HI)
011720010220     A                                  5 38'Destinat.'
011730010220     A            V9CRSD    R   32   O  5 48REFFLD(BLPRSD *LIBL/FNBLP00F)
011740010220     A                                      DSPATR(HI)
011750010220     A                                  7  9'B O L L A'
011760010220     A                                  7 37'B O L L A'
011770010220     A                                  8  2'  P R E C E D E N T E  '
011780010220     A                                      DSPATR(UL)
011790010220     A                                  8 30'    S E G U E N T E    '
011800010220     A                                      DSPATR(UL)
011810010220     A                                  8 55'5'
011820010220     A                                      DSPATR(UL)
011830010220     A                                      DSPATR(HI)
011840010220     A                                  9  2'Anno'
011850010220     A                                  9  7'LNP'
011860010220     A                                  9 11'Sr'
011870010220     A                                  9 14'Nr.sped'
011880010220     A                                  9 22'LNA'
011890010220     A                                  9 30'Anno'
011900010220     A                                  9 35'LNP'
011910010220     A                                  9 39'Sr'
011920010220     A                                  9 42'Nr.sped'
011930010220     A                                  9 50'LNA'
011940000000     A**************************************************************************
011950941230     A          R LS05Z09
011960941230     A                                      OVERLAY
011970941230     A                                 24  3'F12=Ritorno'
011980941230     A                                 24 36'INVIO=Prosegui'
011990960222     A**************************************************************************
012000010709     A*****     R LS05S10                   SFL
012010010709     A*****       VS0DES    R        O 19  2REFFLD(§7KDES DS7K)
012020060216     A*****       VS0NOT    R        O 19 31REFFLD(AR4NOT *LIBL/FIAR400F)
012030010709     A*****                                 DSPATR(HI)
012040000000     A**************************************************************************
012050010709     A*****     R LS05C10                   SFLCTL(LS05S10)
012060010709     A*****                                 CA03
012070010709     A**95*                                 CF05
012080010709     A*****                                 CA12
012090010709     A**07*                                 CF18
012100010709     A**24*                                 CF22
012110010709     A**12*                                 CF02
012120010709     A*****                                 OVERLAY
012130010709     A*N26*                                 SFLDSP
012140010709     A*****                                 SFLDSPCTL
012150010709     A**26*                                 SFLCLR
012160010709     A*N26*                                 SFLEND
012170010709     A*****                                 SFLSIZ(0005)
012180010709     A*****                                 SFLPAG(0004)
012190010709     A*****       REC10          4S 0H      SFLRCDNBR
012200010709     A*****                             4 13'SPEDIZIONE:'
012210010709     A*****                                 DSPATR(UL)
012220010709     A*****                             4 25'N.'
012230010709     A*****       V0CLNP    R        O  4 28REFFLD(STBLNP *LIBL/FNSTB00F)
012240010709     A*****                                 DSPATR(HI)
012250010709     A*****                                 DSPATR(UL)
012260010709     A*****       V0CNRS    R        O  4 33REFFLD(STBNRS *LIBL/FNSTB00F)
012270010709     A*****                                 DSPATR(UL)
012280010709     A*****                                 DSPATR(HI)
012290010709     A*****                                 EDTCDE(Z)
012300010709     A*****                             4 36'-'
012310010709     A*****       V0CNSP    R        O  4 38REFFLD(STBNSP *LIBL/FNSTB00F)
012320010709     A*****                                 DSPATR(HI)
012330010709     A*****                                 EDTCDE(2)
012340010709     A*****                                 DSPATR(UL)
012350010709     A*****                             4 50'Del'
012360010709     A*****       V0CDSP         8Y 0O  4 55TEXT('DATA SPEDIZIONE')
012370010709     A*****                                 DSPATR(HI)
012380010709     A*****                                 EDTWRD('  /  /    ')
012390010709     A*****                                 DSPATR(UL)
012400010709     A*****                             4 71' ARCHIVIO '
012410010709     A*****                                 DSPATR(RI)
012420010709     A*****                             5 71' STORICO  '
012430010709     A*****                                 DSPATR(RI)
012440010709     A*****                             6  2'Filiale di arrivo ..:'
012450010709     A*****       V0CLNA    R        O  6 25REFFLD(STBLNA *LIBL/FNSTB00F)
012460010709     A*****                                 DSPATR(HI)
012470010709     A*****                                 DSPATR(UL)
012480010709     A*****       V0DLNA    R        O  6 37REFFLD(ORGDES *LIBL/AZORG00F)
012490010709     A*****                             8  2'Mittente ...........:'
012500010709     A*****       V0CKSC    R        O  8 25REFFLD(STBKSC *LIBL/FNSTB00F)
012510010709     A*****                                 DSPATR(HI)
012520010709     A*****                                 DSPATR(UL)
012530010709     A*****       V0CRSM    R        O  8 37REFFLD(STBRSM *LIBL/FNSTB00F)
012540010709     A*****                                 DSPATR(HI)
012550010709     A*****                                 DSPATR(UL)
012560010709     A*****                             9  2'Riferimento mitt. ..:'
012570010709     A*****       V0CRMN    R        O  9 25REFFLD(STBRMN *LIBL/FNSTB00F)
012580010709     A*****                                 EDTCDE(Z)
012590010709     A*****                                 DSPATR(HI)
012600010709     A*****                                 DSPATR(UL)
012610010709     A*****                            10  2'Destinatario .......:'
012620010709     A*****       V0CRSD    R        O 10 25REFFLD(STBRSD *LIBL/FNSTB00F)
012630010709     A*****                                 DSPATR(HI)
012640010709     A*****                                 DSPATR(UL)
012650010709     A*****                            12  2'Giacenza .......: Nr.'
012660010709     A*****       V0CNGC    R        O 12 25REFFLD(STBNGC *LIBL/FNSTB00F)
012670010709     A*****                                 EDTCDE(Z)
012680010709     A*****                                 DSPATR(HI)
012690010709     A*****                                 DSPATR(UL)
012700010709     A*****                            12 37'chiusa il'
012710010709     A*****       V0CDCG    R        O 12 47REFFLD(STBDCG *LIBL/FNSTB00F)
012720010709     A*****                                 EDTWRD('  /  /    ')
012730010709     A*****                                 DSPATR(HI)
012740010709     A*****                                 DSPATR(UL)
012750010709     A*****                            13  2'Distinta .......: Nr.'
012760010709     A*****       V0CNDC    R        O 13 25REFFLD(STBNDC *LIBL/FNSTB00F)
012770010709     A*****                                 EDTCDE(Z)
012780010709     A*****                                 DSPATR(HI)
012790010709     A*****                                 DSPATR(UL)
012800010709     A*****                            13 37'del'
012810010709     A*****       V0CDDC    R        O 13 47REFFLD(STBDDC *LIBL/FNSTB00F)
012820010709     A*****                                 EDTWRD('  /  /    ')
012830010709     A*****                                 DSPATR(HI)
012840010709     A*****                                 DSPATR(UL)
012850010709     A*****                            14  2'Data consegna merce :'
012860010709     A*****       V0CDCM    R        O 14 25REFFLD(STBDCM *LIBL/FNSTB00F)
012870010709     A*****                                 EDTWRD('  /  /    ')
012880010709     A*****                                 DSPATR(HI)
012890010709     A*****                                 DSPATR(UL)
012900010709     A*****                            15  2'Consegna anomala ...:'
012910010709     A*****       V0CCCA    R        O 15 25REFFLD(STBCCA *LIBL/FNSTB00F)
012920010709     A*****                                 DSPATR(HI)
012930010709     A*****                                 DSPATR(UL)
012940010709     A*****       V0DCCA    R        O 15 37REFFLD(§7ODEI *LIBL/DS7O)
012950010709     A*****                            17  2'Data di stampa .....:'
012960010709     A*****       V0CDDS    R        O 17 25REFFLD(STBDDS *LIBL/FNSTB00F)
012970010709     A*****                                 EDTWRD('  /  /    ')
012980010709     A*****                                 DSPATR(HI)
012990010709     A*****                                 DSPATR(UL)
013000960222     A**************************************************************************
013010010709     A*****     R LS05Z10
013020010709     A*****                                 OVERLAY
013030010709     A*N34*       LEGAME        58A  O 23  2DSPATR(RI)
013040010709     A**12*                            24 14'F2=C.A.'
013050010709     A*****                            24 25'F3=Fine'
013060010709     A**95*                            24 37'F5=Eventi'
013070010709     A*****                            24 50'F12=Ritorno'
013080010709     A**24*                            24 64'F22=Contrassegno'
013090990119     A**************************************************************************
013100990119     A          R LS05S11                   SFL
013110990119     A            V11AAC         4  0H
013120990119     A            V11SCE         1A  B  7  2DSPATR(HI)
013130990119     A                                      VALUES('5' ' ')
013140990119     A            V11FIL         3  0O  7  4DSPATR(HI)
013150990119     A            V11NCA         7Y 0O  7  8DSPATR(HI)
013160990119     A                                      EDTCDE(Z)
013170990119     A            V11DCA         8Y 0O  7 17EDTWRD('  /  /    ')
013180990119     A            V11FCA         3  0O  7 29
013190990119     A            V11DFA        48   O  7 33
013200990119     A**************************************************************************
013210010220     A          R LS05C11                   SFLCTL(LS05S11)
013220010220     A                                      SFLSIZ(0017)
013230010220     A                                      SFLPAG(0016)
013240010220     A                                      CA12
013250010220     A                                      OVERLAY
013260010220     A  20                                  SFLDSP
013270010220     A  21                                  SFLDSPCTL
013280010220     A N21                                  SFLCLR
013290010220     A  23                                  SFLEND
013300010220     A                                  4  2'SPEDIZIONE:'
013310010220     A                                      DSPATR(UL)
013320010220     A            V1CLNP    R        O  4 15REFFLD(BLPLNP *LIBL/FNBLP00F)
013330010220     A                                      DSPATR(HI)
013340010220     A                                      DSPATR(UL)
013350010220     A            V1CNRS    R        O  4 20REFFLD(BLPNRS *LIBL/FNBLP00F)
013360010220     A                                      DSPATR(HI)
013370010220     A                                      EDTCDE(Z)
013380010220     A                                      DSPATR(UL)
013390010220     A            V1CNSP    R        O  4 24REFFLD(BLPNSP *LIBL/FNBLP00F)
013400010220     A                                      DSPATR(HI)
013410010220     A                                      EDTCDE(Z)
013420010220     A                                      DSPATR(UL)
013430010220     A                                  4 33'del'
013440010220     A            V1CDSP         8Y 0O  4 38DSPATR(HI)
013450010220     A                                      EDTWRD('  /  /    ')
013460010220     A                                      DSPATR(UL)
013470010220     A                                  4 53'Rifer.Mitt.'
013480010220     A            V2CRMN    R        O  4 65REFFLD(BLPRMN *LIBL/FNBLP00F)
013490010220     A                                      DSPATR(HI)
013500010220     A                                      EDTCDE(Z)
013510010220     A                                  5  2'Linea Arrivo'
013520010220     A            V1CLNA    R        O  5 15REFFLD(BLPLNA *LIBL/FNBLP00F)
013530010220     A                                      DSPATR(HI)
013540010220     A                                  5 19'-'
013550010220     A            V9DLNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
013560010220     A                                      DSPATR(HI)
013570010220     A                                  5 38'Destinat.'
013580010220     A            V9CRSD    R   32   O  5 48REFFLD(BLPRSD *LIBL/FNBLP00F)
013590010220     A                                      DSPATR(HI)
013600010220     A                                  6  2'5|Comunicazione Anomalia |  F a s -
013610010220     A                                      e                                  -
013620010220     A                                               |'
013630010220     A                                      DSPATR(UL)
013640010220     A                                      DSPATR(HI)
013650040220     A**************************************************************************
013660990119     A          R LS05Z11
013670990119     A                                      OVERLAY
013680990119     A                                 24  3'F12=Ritorno'
013690990119     A                                 24 36'INVIO=Prosegui'
013700091125     A**************************************************************************
013710110601     A          R LS05WDAS
013720110601     A*%%TS  SD  20110601  111528  EDPRM       REL-V6R1M0  5761-WDS
013730110601     A                                      OVERLAY
013740110601     A                                      WINDOW(17 2 6 45)
013750110601     A                                  1  1'Beneficiario C/Assegno:'
013760110601     A            WDABEN        20A  O  1 25DSPATR(UL)
013770110601     A            WDASCDI        7A  O  3  1DSPATR(HI)
013780110601     A            WDASRSC       35A  O  3 10DSPATR(HI)
013790110601     A                                  5 30'INVIO=Prosegui'
