000100090916     A*%%***********************************************************************
000200090916     A*%%TS  RD  20090916  105444  EDPES       REL-V5R4M0  5722-WDS
000300090916     A*%%FI+10660100000000000000000000000000000000000000000000000000
000400090916     A*%%FI       0000000000000000000000000000000000000000000000000
000500090916     A*%%***********************************************************************
000600090916     A*  STAMPA STATISTICA A TERRA
000700090916     A*
000800090916     A*      COMPILARE CON:     PAGESIZE(66 198)
000900090916     A*                         CPI(15)
001000090916     A*
001100090916      * ?  T E S T A T A    D I    S T A M P A  ?
001200090916     A          R LSC2T1
001300090916     A*%%***********************************************************************
001400090916     A*%%RI 00000
001500090916     A*%%FS 001
001600090916     A*%%***********************************************************************
001700090916     A                                      SKIPB(002)
001800090916     A            RSUT          20A        1
001900090916     A            STRIP          8A       41
002000090916     A                                    81
002100090916     A                                      'S T A T I S T I C A     P A R T E -
002200090916     A                                      N Z E'
002300090916     A                                   155
002400090916     A                                      'FNLSC2R'
002500090916     A            WDATE          8S 0    171
002600090916     A                                      EDTWRD('  /  /    ')
002700090916     A                                   191
002800090916     A                                      'PAG.'
002900090916     A                                   195
003000090916     A                                      PAGNBR
003100090916     A                                      EDTCDE(Z)
003200090916     A            KNSIF     R              1
003300090916     A                                      REFFLD(KNSIF KPJBA)
003400090916     A                                      SPACEB(001)
003500090916     A            KNMUS     R             12
003600090916     A                                      REFFLD(KNMUS KPJBA)
003700090916     A            STRIP1         8A       41
003800090916     A            UTIME          6S 0    172
003900090916     A                                      EDTWRD('  :  :  ')
004000090916     A  43                                71
004100090916     A                                      'A TERRA PER LINEA DI PARTENZA  DAL'
004200090916     A                                      SPACEB(001)
004300090916     A N43                                60
004400090916     A                                      'A TERRA PER TERMINAL DI ARRIVO DEL-
004500090916     A                                      L''AREA  DAL'
004600090916     A            DS1GDA    R            107
004700090916     A                                      REFFLD(DS1GDA DSLS01)
004800090916     A                                      EDTWRD('  /  /    ')
004900090916     A                                   119
005000090916     A                                      'AL'
005100090916     A            DS1GAL    R            123
005200090916     A                                      REFFLD(DS1GAL DSLS01)
005300090916     A                                      EDTWRD('  /  /    ')
005400090916     A                                    24
005500090916     A                                      '-----------------------------------
005600090916     A                                      -------- D   A      P   A   R   T  -
005700090916     A                                       I   R   E -------------------------
005800090916     A                                      -------------'
005900090916     A                                      SPACEB(001)
006000090916     A                                      HIGHLIGHT
006100090916     A                                   150
006200090916     A                                      '-- G  L  O  B  A  L  E ---'
006300090916     A                                      HIGHLIGHT
006400090916     A                                    25
006500090916     A                                      '---- COLLI ----'
006600090916     A                                      SPACEB(001)
006700090916     A                                    44
006800090916     A                                      '-------------- P  E  S  O ---------
006900090916     A                                      -----'
007000090916     A                                    87
007100090916     A                                      '----- VOLUME -----'
007200090916     A                                    +5
007300090916     A                                      '----- S P E D I Z I O N I -----'
007400090916     A                                   150
007500090916     A                                      '------- SPEDIZIONI -------'
007600090916     A                                    +6
007700090916     A                                      'TOTALE VOLUME'
007800090916     A  43                                 2
007900090916     A                                      'P.O. DI'
008000090916     A                                      SPACEB(001)
008100090916     A N43                                 1
008200090916     A                                      'TERMINAL DI'
008300090916     A                                      SPACEB(001)
008400090916     A                                    25
008500090916     A                                      'TOTALE'
008600090916     A                                    33
008700090916     A                                      '%SUL DA'
008800090916     A                                    44
008900090916     A                                      'FINO 35 Q'
009000090916     A                                    54
009100090916     A                                      'OLTRE 35 Q'
009200090916     A                                    68
009300090916     A                                      'TOTALE'
009400090916     A                                    76
009500090916     A                                      '%SUL DA'
009600090916     A                                    91
009700090916     A                                      'TOTALE'
009800090916     A                                    98
009900090916     A                                      '%SUL DA'
010000090916     A                                   111
010100090916     A                                      'TOTALE'
010200090916     A                                    +2
010300090916     A                                      ' FUORI  AFFIDABILITA'' '
010400090916     A                                   150
010500090916     A                                      ' TOTALE'
010600090916     A                                   159
010700090916     A                                      'COMPLETE'
010800090916     A                                   168
010900090916     A                                      'SPAREGG.'
011000090916     A                                    +6
011100090916     A                                      ' A MAGAZZINO'
011200090916      *
011300090916     A  43                                 2
011400090916     A                                      'PARTENZA'
011500090916     A                                      SPACEB(001)
011600090916     A N43                                 3
011700090916     A                                      'ARRIVO'
011800090916     A                                      SPACEB(001)
011900090916     A                                    33
012000090916     A                                      'PARTIRE'
012100090916     A                                    76
012200090916     A                                      'PARTIRE'
012300090916     A                                    98
012400090916     A                                      'PARTIRE'
012500090916     A                                   120
012600090916     A                                      'totale'
012700090916     A                                   128
012800090916     A                                      '%sul da part.'
012900090916     A*%%***********************************************************************
013000090916     A*%%SS
013100090916     A*%%CL 001
013200090916     A*%%CL 001
013300090916     A*%%CL 001
013400090916     A*%%CL 001
013500090916     A*%%CL 001
013600090916     A*%%CL 001
013700090916     A*%%CL 001
013800090916     A*%%CL 001
013900090916     A*%%***********************************************************************
014000090916      * ?  S A L T A    U N A    R I G A  ?
014100090916     A          R LSC2T2
014200090916     A*%%***********************************************************************
014300090916     A*%%RI 00000
014400090916     A*%%***********************************************************************
014500090916     A                                      SPACEB(001)
014600090916     A                                     1
014700090916     A                                      ' '
014800090916     A*%%***********************************************************************
014900090916     A*%%SS
015000090916     A*%%***********************************************************************
015100090916      * ?  R I G A    D I    S E P A R A Z I O N E  ?
015200090916     A          R LSC2T3
015300090916     A*%%***********************************************************************
015400090916     A*%%RI 00000
015500090916     A*%%***********************************************************************
015600090916     A                                      SPACEB(001)
015700090916     A                                     1
015800090916     A                                      '-----------------------------------
015900090916     A                                      ------------------------------------
016000090916     A                                      ------------------------------------
016100090916     A                                      ------------------------------------
016200090916     A                                      ------------------------------------
016300090916     A                                      --------------------'
016400090916     A*%%***********************************************************************
016500090916     A*%%SS
016600090916     A*%%***********************************************************************
016700090916      * ?  D E T T A G L I O  ?
016800090916     A          R LSC2D1
016900090916     A*%%***********************************************************************
017000090916     A*%%RI 00000
017100090916     A*%%***********************************************************************
017200090916     A                                      SPACEB(001)
017300090916     A  40 41     FILIAP         3  0      1
017400090916     A  40 41                              4
017500090916     A                                      '-'
017600090916     A  40        ORGDEP        18A        5
017700090916     A N40        DESCRP        13A        5
017800090916     A N40        TIPOP          5A       18
017900090916      * COLLI
018000090916     A            COTOTP         7  0     24
018100090916     A                                      EDTCDE(4)
018200090916     A  45        COSDPP         5S 2     33
018300090916     A                                      EDTCDE(4)
018400090916     A  45                                39
018500090916     A                                      '%'
018600090916      * PESO
018700090916     A            PEF35P         8S 1     44
018800090916     A                                      EDTCDE(4)
018900090916     A            PEO35P         8S 1     54
019000090916     A                                      EDTCDE(4)
019100090916     A            PETOTP         8S 1     65
019200090916     A                                      EDTCDE(4)
019300090916     A  45        PESDPP         5S 2     76
019400090916     A                                      EDTCDE(4)
019500090916     A  45                                82
019600090916     A                                      '%'
019700090916      * VOLUME
019800090916     A            VOTOTP         9S 4     87
019900090916     A                                      EDTCDE(4)
020000090916     A  45        VOSDPP         5S 2     98
020100090916     A                                      EDTCDE(4)
020200090916     A  45                               104
020300090916     A                                      '%'
020400090916      * SPEDIZIONI
020500090916     A            SPTOTP         7S 0    110
020600090916     A                                      EDTCDE(4)
020700090916     A  45        SPFAFF         7  0O   119
020800090916     A                                      EDTCDE(4)
020900090916     A  45        SPSDPP         7S 2    130
021000090916     A                                      EDTCDE(4)
021100090916     A  45                               138
021200090916     A                                      '%'
021300090916      * SPEDIZIONI COMPLETE E SPAREGGIATE
021400090916     A            SPTOTA         7S 0    150
021500090916     A                                      EDTCDE(4)
021600090916      * SPEDIZIONI COMPLETE E SPAREGGIATE
021700090916     A            SPCONP         7S 0    160
021800090916     A                                      EDTCDE(4)
021900090916     A            SPSPAP         7S 0    168
022000090916     A                                      EDTCDE(4)
022100090916     A N03        VOTOTM         9S 4O    +8
022200090916     A                                      EDTCDE(4)
022300090916     A*%%***********************************************************************
022400090916     A*%%SS
022500090916     A*%%***********************************************************************
022600090916      * ?  S T A M P A    N U L L A  ?
022700090916     A          R LSC2E1
022800090916     A*%%***********************************************************************
022900090916     A*%%RI 00000
023000090916     A*%%FS 002
023100090916     A*%%***********************************************************************
023200090916     A                                      SPACEB(003)
023300090916     A                                    85
023400090916     A                                      '( NESSUN COLLO/BOLLA TROVATO )'
023500090916     A*%%***********************************************************************
023600090916     A*%%SS
023700090916     A*%%***********************************************************************
023800090916      * ?  F I N E    S T A M P A  ?
023900090916     A          R LSC2E2
024000090916     A*%%***********************************************************************
024100090916     A*%%RI 00000
024200090916     A*%%***********************************************************************
024300090916     A                                      SPACEB(001)
024400090916     A                                    88
024500090916     A                                      '***   FINE  STAMPA   ***'
024600090916     A*%%***********************************************************************
024700090916     A*%%SS
024800090916     A*%%***********************************************************************
024900090916      * ?  % SUL DA PARTIRE  ?
025000090916     A          R LSC2E4
025100090916     A*%%***********************************************************************
025200090916     A*%%RI 00000
025300090916     A*%%FS 046
025400090916     A*%%***********************************************************************
025500091001     A                                      SKIPB(065)
025600090916     A                                     1
025700090916     A                                      'A livello di P.O. le "% SUL DA PAR-
025800090916     A                                      TIRE" non comprendono i Conto Servi-
025900090916     A                                      zi, considerati invece a livello di-
026000090916     A                                       TOTALE'
026100090916     A*%%***********************************************************************
026200090916     A*%%SS
026300090916     A*%%***********************************************************************
026400090916     A          R LSC2E5
026500090916     A*%%***********************************************************************
026600090916     A*%%RI 00000
026700090916     A*%%FS 063
026800090916     A*%%***********************************************************************
026900091001     A                                      SKIPB(065)
027000090916     A                                     1
027100090916     A                                      'A livello di TERMINAL DI ARRIVO le-
027200090916     A                                       "% SUL DA PARTIRE" comprendono i c-
027300090916     A                                      onto Servizi.'
027400090916     A*%%***********************************************************************
027500090916     A*%%SS
027600090916     A*%%***********************************************************************
027700090916      * ?  AVVISO DI FOGLI VIAGGIO APERTI  ?
027800090916     A          R LSC2E3
027900090916     A*%%***********************************************************************
028000090916     A*%%RI 00000
028100090916     A*%%***********************************************************************
028200090916     A                                      SPACEB(001)
028300090916     A                                    49
028400090916     A                                      '***   SONO STATI TROVATI ALCUNI FO-
028500090916     A                                      GLI VIAGGIO APERTI AVENTI DATA PART-
028600090916     A                                      ENZA COMPRESA NEL PERIDO   ***'
028700090916     A*%%***********************************************************************
028800090916     A*%%SS
028900090916     A*%%CP+999CRTPRTF
029000090916     A*%%CP+    CPI(15)
029100090916     A*%%CP+    FILE(GAITRAFIL/FNLSC2P)
029200090916     A*%%CP+    DEVTYPE(*SCS)
029300090916     A*%%CP     PAGESIZE(*N       198      *N     )
029400090916     A*%%CS+999CRTPRTF
029500090916     A*%%CS+    FILE(QTEMP/QPRDRPT)
029600090916     A*%%CS+    DEVTYPE(*SCS)
029700090916     A*%%CS     PAGESIZE(*N 198)
029800090916     A*%%***********************************************************************
