000010130305     A*%%TS  SD  20130305  125804  EDPES       REL-V6R1M0  5761-WDS
000020130301     A*** FILE : FNLSW3D *--------------------------------------------*
000030000000     A***-------------------------------------------------------------**
000040130305     A*%%EC
000050130305     A                                      DSPSIZ(24 80 *DS3)
000060130305     A                                      CHGINPDFT(HI UL)
000070130305     A                                      PRINT
000080941223     A*
000090941223     A**-------------------------------------------------------------**
000100130305     A          R LSW3D01
000110130305     A*%%TS  SD  20130305  125804  EDPES       REL-V6R1M0  5761-WDS
000120130305     A                                      CA03
000130130305     A                                      CF06
000140130305     A  28        V1CMSG        78   M
000150130305     A            RSUT          20A  O  1  2
000160130305     A                                  1 24'*CONTEGGIO COLLI DI BOLLE ABBINATE-
000170130305     A                                      *'
000180130305     A                                      DSPATR(RI)
000190130305     A                                      DSPATR(UL)
000200130305     A                                  1 61'FNLSW3R'
000210130305     A                                  1 71DATE
000220130305     A                                      EDTCDE(Y)
000230130305     A            KNSIF         10A  O  2  2
000240130305     A            KNMUS         10A  O  2 13
000250130305     A                                  2 71TIME
000260130305     A                                 10  1'Data spedizione ......:'
000270130305     A                                 10 25'Dal'
000280130305     A            V1CDSD         8Y 0B 10 29CHECK(RB)
000290130305     A                                      EDTCDE(8)
000300130305     A  43                                  DSPATR(PC)
000310130305     A                                 10 41'al'
000320130305     A            V1CDSA         8Y 0B 10 44CHECK(RB)
000330130305     A                                      EDTCDE(8)
000340130305     A  44                                  DSPATR(PC)
000350130305     A                                 24  2'F6=Conferma'
000360130305     A                                 24 73'F3=Fine'
