000001060405     A*%%***********************************************************************
000002060405     A*%%TS  RD  20060405  115438  EDPRM       REL-V5R3M0  5722-WDS
000003060405     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004060405     A*%%FI       0000000000000000000000000000000000000000000000000
000005060405     A*%%***********************************************************************
000006060405     A          R TESTA
000007060405     A*%%***********************************************************************
000008060405     A*%%RI 00000
000009060405     A*%%FS 001
000010060405     A*%%***********************************************************************
000011060405     A                                      SKIPB(002)
000012060405     A            RSUT          20A  O     1
000013060405     A            PTITOLO       50A  O   +21
000014060405     A                                    99
000015060405     A                                      'FNLS03R'
000016060405     A            WDTGIO         8S 0O   109
000017060405     A                                      EDTWRD('  /  /    ')
000018060405     A                                   125
000019060405     A                                      'PAG.'
000020060405     A                                   129
000021060405     A                                      PAGNBR
000022060405     A                                      EDTCDE(Z)
000023060405     A            KNSIF     R     A  O     1
000024060405     A                                      REFFLD(KNSIF KPJBA)
000025060405     A                                      SPACEB(001)
000026060405     A            KNMUS     R        O    +1
000027060405     A                                      REFFLD(KNMUS KPJBA)
000028060405     A            UTIME          6S 0O   111
000029060405     A                                      EDTWRD('  :  :  ')
000030090127     A  13                                 1
000031090127     A                                      'Cliente Mittente:'
000032060405     A                                      SPACEB(003)
000033090127     A  13        P1CCCM         7S 0O    +0
000034090127     A  13        P1DCCM        30A  O    +1
000035090127     A N13                                 1
000036090127     A                                      'Linea di Partenza:'
000037090127     A                                      SPACEB(003)
000038090127     A N13        P1CLNP         3S 0O    +0
000039090127     A N13        P1DLNP        18A  O    +1
000040060405     A                                     1
000041060405     A                                      'S p e d i z i o n e      '
000042060405     A                                      SPACEB(002)
000043060405     A                                    27
000044060405     A                                      'Data'
000045060405     A                                    +8
000046060405     A                                      'Destinatario'
000047060405     A                                   +24
000048060405     A                                      'N.Colli'
000049060405     A                                    +2
000050060405     A                                      '  Segnacolli   '
000051060405     A                                    +4
000052060405     A                                      'Rif.Mitt.Num.'
000053060405     A                                    +2
000054060405     A                                      'Rif.Mitt.Alfa'
000055060405     A                                     1
000056060405     A                                      'Lnp Sr  Numero  Data     '
000057060405     A                                      SPACEB(001)
000058060405     A                                    27
000059060405     A                                      'Immissione'
000060060405     A                                    86
000061060405     A                                      'Dal'
000062060405     A                                    94
000063060405     A                                      'Al'
000064060405     A                                     1
000065060405     A                                      '-----------------------------------
000066060405     A                                      ------------------------------------
000067060405     A                                      ------------------------------------
000068060405     A                                      ----------------------------'
000069060405     A                                      SPACEB(001)
000070060405     A*%%***********************************************************************
000071060405     A*%%SS
000072060405     A*%%CL 001
000073060405     A*%%CL 003
000074060405     A*%%CL 002
000075060405     A*%%CL 001
000076060405     A*%%CL 001
000077060405     A*%%***********************************************************************
000078060405     A          R RIGSPED
000079060405     A*%%***********************************************************************
000080060405     A*%%RI 00000
000081060405     A*%%***********************************************************************
000082060405     A                                      SPACEB(001)
000083060405     A N02        BLPNCD         7S 0O    84
000084060405     A                                      EDTCDE(Z)
000085060405     A N02                                91
000086060405     A                                      '/'
000087060405     A N02        BLPNCA         7S 0O    92
000088060405     A                                      EDTCDE(Z)
000089060405     A            BLPNCL         5S 0O    76
000090060405     A                                      EDTCDE(Z)
000091060405     A            BLPRMN        15S 0O   101
000092060405     A                                      EDTCDE(Z)
000093060405     A            BLPRMA        15A  O   118
000094060405     A  02                                84
000095060405     A                                      'Non Sequenziali'
000096060405     A            BLPLNP         3S 0O     1
000097060405     A            BLPNRS         2S 0O    +1
000098060405     A                                      EDTCDE(Z)
000099081205     A            WLPNSP         7S 0O    +1
000100060405     A                                      EDTCDE(Z)
000101060405     A            V11DSP         8S 0O    +1
000102060405     A                                      EDTCDE(8)
000103060405     A            P1CDIM         8S 0O    +1
000104060405     A                                      EDTCDE(8)
000105060405     A            BLPRSD        35A  O    39
000106060405     A*%%***********************************************************************
000107060405     A*%%SS
000108060405     A*%%***********************************************************************
000109060405     A          R FINES
000110060405     A*%%***********************************************************************
000111060405     A*%%RI 00000
000112060405     A*%%FS 002
000113060405     A*%%***********************************************************************
000114060405     A                                      SPACEB(003)
000115060405     A                                    51
000116060405     A                                      '***  F I N E   S T A M P A  ***'
000117060405     A*%%***********************************************************************
000118060405     A*%%SS
000119060405     A*%%CP+999CRTPRTF
000120060405     A*%%CP+    CPI(15)
000121060405     A*%%CP+    OVRFLW(66)
000122060405     A*%%CP+    FILE(GAITRAFIL/FNLS03P)
000123060405     A*%%CP+    DEVTYPE(*SCS)
000124060405     A*%%CP     PAGESIZE(*N       132      *N     )
000125060405     A*%%CS+999CRTPRTF
000126060405     A*%%CS+    FILE(QTEMP/QPRDRPT)
000127060405     A*%%CS+    DEVTYPE(*SCS)
000128060405     A*%%CS     PAGESIZE(*N 132)
000129060405     A*%%***********************************************************************
