000010130307     A*%%TS  SD  20130307  110844  EDPES       REL-V6R1M0  5761-WDS
000020130307     A*%%EC
000030130307     A                                      DSPSIZ(24 80 *DS3)
000040130307     A          R SF56W01
000050130307     A*%%TS  SD  20130307  110844  EDPES       REL-V6R1M0  5761-WDS
000060130307     A                                      OVERLAY
000070130307     A                                      WINDOW(7 15 10 50)
000080130307     A                                  1  5'Recupero Variazioni Post-Fatturazi-
000090130307     A                                      one'
000100130307     A                                      DSPATR(HI)
000110130307     A                                  4 42'NO'
000120130307     A                                      DSPATR(HI)
000130130307     A                                      DSPATR(UL)
000140130307     A                                  3  2'SIMULAZIONE'
000150130307     A                                  3 14'creaz.Bolle di recupero '
000160130307     A                                  7  3'CREAZIONE'
000170130307     A                                      DSPATR(HI)
000180130307     A                                  7 13'bolle di recupero ........:'
000190130307     A                                      DSPATR(HI)
000200130307     A                                  7 42'SI'
000210130307     A                                      DSPATR(HI)
000220130307     A                                      DSPATR(UL)
000230130307     A                                  4 15'nella libreria EDPRECPF :'
000240130307     A                                  5  1'(file di controllo GAITRAAZM/WFRPF-
000250130307     A                                      00S)'
000260130307     A                                  8  2'(file di controllo GAITRAAZM/WFRPF-
000270130307     A                                      00F)'
000280130307     A                                 10 40'F12=Ritorno'
000290130307     A                                 10  2'F6=Elabora'
000300130307     A                                 10 15'F15=Modifica richieste'
