000100021009      *PARMS MBR(*NONE)
000200021009     A          R ANGYCSDS
000300021009     A                                      TEXT('Tabella YCS capitale sociale')
000400021009     A            YCSIMPCASO    11S 2
000500021009     A                                      TEXT('Importo capitale sociale')
