000100031007      *PARMS MBR(*NONE)
000200960305     A          R CNTEL03                   TEXT('REGISTRAZIONE PER CONTO ECONO+
000300960305     A                                      MICO')
000400031007     A            T03TRE         2          TEXT('Tipo record: 03')
000500031007     A            T03NRF        21          TEXT('Numero documento')
000600031008     A            T03KCC        12          TEXT('Capo conto e voce')
000700031007     A            T03IMP        15          TEXT('Importo costo')
000800031007     A            T03CDC        10          TEXT('Centro di costo')
000900031008     A            T03KSC        10          TEXT('Sotto conto')
001000031007     A            T03BIM         2S 0       TEXT('Periodo di riferimento')
001100031007     A            T03ANN         4S 0       TEXT('Anno di riferimento')
001200031007     A            T03DIP         8S 0       TEXT('Data inizio periodo -
001300031007     A                                      competenza costo')
001400031007     A            T03DFP         8S 0       TEXT('Data fine   periodo -
001500031007     A                                      competenza costo')
001600031007     A            T03NRT        14          TEXT('Numero utenza')
001700070424     A            T03TPLNA       1A         TEXT('Tipologia linea.')
001800070424     A*                                     'T' = Linea fissa.
001900070424     A*                                     'M' = Linea mobile.
002000070424     A*                                     'A' = Altro.
002100070424     A            T03SOCLNA     10A         TEXT('Società dotazione linea.')
002200070426     A            T03RIFIVA     10A         TEXT('Riferimento IVA.')
