000100031008     A          R CNTEL000                  TEXT('Flat file fatture Telecom')
000200031008     A            T00REC       120          TEXT('Dati')
