000100170426     H ACTGRP(*CALLER)
000101170426     Fynfmft01l IF   E           K DISK    alias
000102170426     Dkpjba          E DS                  qualified
