000100950925     A          R DVPGB000                  PFILE(DVPGB00F)
000200940318     A*
000300950925     A          K PGBSOC
000400951025     A          K PGBRIF
000500951025     A          K PGBPRG
000600981023     A          K PGBCDA
000601981023     A          K PGBVOC
000602981023     A          K PGBCDC
000700940318     A*
