000100030523      /TITLE Trigger ANSOG00F.
000200030523
000300030523     H DFTACTGRP(*NO) ACTGRP(*CALLER) USRPRF(*OWNER)
000400030523
000500030523      /COPY QSYSINC/QRPGLESRC,TRGBUF
000600030523     D                             4920
000700030523     D Length          S             10I 0
000800030523
000900030523     ***********************************************************************
001000030523     **
001100030523     ** Principale.
001200030523     **
001300030523     ***********************************************************************
001400030523     C     *ENTRY        PLIST
001500030523     C                   PARM                    QDBTB
001600030523     C                   PARM                    Length
001700030523
001800030523     C                   CALL      'YCO000TR'
001900030523     C                   PARM                    QDBTB
002000030523     C                   PARM                    Length
002100030523
002200030523     C                   RETURN
