000100950929     A*------------------------------------------------------------------------*
000200030221     A*  DS ESTERNA PROCEDURA CONTROLLO CLIENTI CONTENZIOSO
000300950929     A*------------------------------------------------------------------------*
000400030221     A          R YCOA01
000700030221     A            Y01DTI         8S 0       TEXT('DATA VARIAZ. DAL')
000800030221     A            Y01DTF         8S 0       TEXT('DATA VARIAZ. AL')
