000100070108     A          R TD25                      TEXT('IFCSUM D96A-TD25')
000200070108     A            D25PRG         4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300070108     A            D25TPR         4          TEXT('CHIAVE-TIPO RECORD')
000400070108     A            D25FLG         1          TEXT('FLAG USI VARI (ERRORI..)')
000500960328     A*
002201070108     A            D256311        3          TEXT('MEA-6311 QUAL.UNITÀ MISURA  ')
002202070108     A            D256313        3          TEXT('MEA-6313 TIPO UNITÀ MISURA  ')
002203070108     A            D256321        3          TEXT('MEA-6321 COD.TIPO VALORE    ')
002204070108     A            D256411        3          TEXT('MEA-6411 UNITÀ DI MISURA    ')
002205070109     A            D256314       16S 3       TEXT('MEA-6314 VALORE             ')
002206070105     A*
