000100070105     A          R TD19                      TEXT('IFCSUM D96A-TD19')
000200070105     A            D19PRG         4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300070105     A            D19TPR         4          TEXT('CHIAVE-TIPO RECORD')
000400070105     A            D19FLG         1          TEXT('FLAG USI VARI (ERRORI..)')
000500960328     A*
002201070105     A            D195025        3          TEXT('MOA-5025 QUAL. IMPORTO    ')
002202070109     A            D195004       18S 3       TEXT('MOA-5004 IMPORTO          ')
002203070105     A            D196345        3          TEXT('MOA-6345 CODICE VALUTA    ')
002204070105     A            D196343        3          TEXT('MOA-6343 QUAL.VALUTA      ')
002205070105     A            D194405        3          TEXT('MOA-4405 COD.STATO        ')
002206070105     A*
