000100070108     A          R TD36                      TEXT('IFCSUM D96A-TD36')
000200070108     A            D36PRG         4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300070108     A            D36TPR         4          TEXT('CHIAVE-TIPO RECORD')
000400070108     A            D36FLG         1          TEXT('FLAG USI VARI (ERRORI..)')
000401070108     A*
000402070108     A            D363139        3          TEXT('CTA-3139 QUALIF.CONTATTO    ')
000403070108     A            D363413       17          TEXT('CTA-3139 IDENTIF.CONTATTO   ')
000404070108     A            D363412       35          TEXT('CTA-3412 NOME CONTATTO      ')
000405070108     A*
