000100070105     A          R TD05                      TEXT('IFCSUM D96A-TD05')
000200070105     A            D05PRG         4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300070105     A            D05TPR         4          TEXT('CHIAVE-TIPO RECORD')
000400070105     A            D05FLG         1          TEXT('FLAG USI VARI (ERRORI..)')
002300070105     A*
002400070105     A            D054451        3          TEXT('FTX-4451 CODICE TESTO     ')
002500070105     A            D054440       70          TEXT('FTX-4440 TESTO LIBERO     ')
002600070105     A            D0544401      70          TEXT('FTX-4440 TESTO LIBERO     ')
002700070105     A            D0544402      70          TEXT('FTX-4440 TESTO LIBERO     ')
002800070105     A            D0544403      70          TEXT('FTX-4440 TESTO LIBERO     ')
002900070105     A            D0544404      70          TEXT('FTX-4440 TESTO LIBERO     ')
003000070105     A*
003100070105     A            D0544511       3          TEXT('FTX-4451 CODICE TESTO     ')
003200070105     A            D0544405      70          TEXT('FTX-4440 TESTO LIBERO     ')
003300070105     A            D0544406      70          TEXT('FTX-4440 TESTO LIBERO     ')
003400070105     A            D0544407      70          TEXT('FTX-4440 TESTO LIBERO     ')
003500070105     A            D0544408      70          TEXT('FTX-4440 TESTO LIBERO     ')
003600070105     A            D0544409      70          TEXT('FTX-4440 TESTO LIBERO     ')
