000100070105     A          R TT30                      TEXT('IFCSUM D96A-TT30')
000200070105     A            T30PRG         4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300070105     A            T30TPR         4          TEXT('CHIAVE-TIPO RECORD')
000400070105     A            T30FLG         1          TEXT('FLAG USI VARI (ERRORI..)')
000500960328     A*
002201070105     A            T308053        3          TEXT('EQD-8053 QUALIF. EQUIPAGGIAM')
002202070105     A            T308260       17          TEXT('EQD-8260 EQUIPAGGIAMENTO ')
002203070105     A            T301131        3          TEXT('EQD-1131 TIPO CODICE     ')
002204070105     A*
002205070105     A            T306350       15S 0       TEXT('EQN-6350 NUMERO DI PALLETS')
002206070105     A*
002207070105     A            T309308       10          TEXT('SEL-9308 NUMERO PIOMBO ')
