000100070105     A          R TT20                      TEXT('IFCSUM D96A-TT20')
000200070105     A            T20PRG         4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300070105     A            T20TPR         4          TEXT('CHIAVE-TIPO RECORD')
000400070105     A            T20FLG         1          TEXT('FLAG USI VARI (ERRORI..)')
000500960502     A*
000600070105     A            T208051        3          TEXT('TDT-8051 ISTRUZIONI TRASPOR.')
000700070105     A            T208028       17          TEXT('TDT-8028 NON USATO')
000800070105     A            T208067        3          TEXT('TDT-8051 COD.MODAL. TRASPOR.')
000900070105     A            T203128       35          TEXT('TDT-3128 NOME VETTORE       ')
001000070105     A            T208212       35          TEXT('TDT-8212 ID MEZZO DI TRASP. ')
001100070105     A            T208453        3          TEXT('TDT-8453 NAZION. MEZZO DI TR')
001200960502     A*
001300070105     A            T203227        3          TEXT('LOC-3227 QUALIF. LOCALITA   ')
001400070105     A            T203225       25          TEXT('LOC-3227 LOCALITA           ')
001500070105     A            T201131        3          TEXT('LOC-1131 TIPO CODICE ')
001600070105     A            T203224       17          TEXT('LOC-3224 LOCALITA IN CHIARO ')
001700960502     A*
001800070105     A            T2032271       3          TEXT('LOC-3227 QUALIF. LOCALITA   ')
001900070105     A            T2032251      25          TEXT('LOC-3227 LOCALITA           ')
002000070105     A            T2011311       3          TEXT('LOC-1131 TIPO CODICE ')
002100070105     A            T2012241      17          TEXT('LOC-3224 LOCALITA IN CHIARO ')
002200960502     A*
002300070105     A            T2032272       3          TEXT('LOC-3227 QUALIF. LOCALITA   ')
002400070105     A            T2032252      25          TEXT('LOC-3227 LOCALITA           ')
002500070105     A            T2011312       3          TEXT('LOC-1131 TIPO CODICE ')
002600070105     A            T2012242      17          TEXT('LOC-3224 LOCALITA IN CHIARO ')
002700960328     A*
002800070105     A            T202005        3          TEXT('DTM-2005 QUAL. DATA       ')
002900070105     A            T202380       12          TEXT('DTM-2380 DATA             ')
003000070105     A            T202379        3          TEXT('DTM-2379 FORMATO DATA     ')
003100960328     A*
003200070105     A            T2020051       3          TEXT('DTM-2005 QUAL. DATA       ')
003300070105     A            T2023801      12          TEXT('DTM-2380 DATA             ')
003400070105     A            T2023791       3          TEXT('DTM-2379 FORMATO DATA     ')
003500960328     A*
003600070105     A            T2020052       3          TEXT('DTM-2005 QUAL. DATA       ')
003700070105     A            T2023802      12          TEXT('DTM-2380 DATA             ')
003800070105     A            T2023792       3          TEXT('DTM-2379 FORMATO DATA     ')
003801070105     A*
003802070105     A            T2020053       3          TEXT('DTM-2005 QUAL. DATA       ')
003803070105     A            T2023803      12          TEXT('DTM-2380 DATA             ')
003804070105     A            T2023793       3          TEXT('DTM-2379 FORMATO DATA     ')
003805070105     A*
003806070105     A            T2020054       3          TEXT('DTM-2005 QUAL. DATA       ')
003807070105     A            T2023804      12          TEXT('DTM-2380 DATA             ')
003808070105     A            T2023794       3          TEXT('DTM-2379 FORMATO DATA     ')
003809070105     A*
003810070105     A            T2020055       3          TEXT('DTM-2005 QUAL. DATA       ')
003811070105     A            T2023805      12          TEXT('DTM-2380 DATA             ')
003812070105     A            T2023795       3          TEXT('DTM-2379 FORMATO DATA     ')
003900960328     A*
004000070105     A            T2020056       3          TEXT('DTM-2005 QUAL. DATA       ')
004100070105     A            T2023806      12          TEXT('DTM-2380 DATA             ')
004200070105     A            T2023796       3          TEXT('DTM-2379 FORMATO DATA     ')
004300070105     A*
004400070105     A            T2020057       3          TEXT('DTM-2005 QUAL. DATA       ')
004500070105     A            T2023807      12          TEXT('DTM-2380 DATA             ')
004600070105     A            T2023797       3          TEXT('DTM-2379 FORMATO DATA     ')
004700070105     A*
004800070105     A            T2020058       3          TEXT('DTM-2005 QUAL. DATA       ')
004900070105     A            T2023808      12          TEXT('DTM-2380 DATA             ')
005000070105     A            T2023798       3          TEXT('DTM-2379 FORMATO DATA     ')
005100070105     A*
