000100070105     A          R TT05                      TEXT('IFCSUM D96A-TT05')
000200070105     A            T05PRG         4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300070105     A            T05TPR         4          TEXT('CHIAVE-TIPO RECORD')
000400070105     A            T05FLG         1          TEXT('FLAG USI VARI (ERRORI..)')
000500960328     A*
000600070105     A            T054451        3          TEXT('FTX-4451  CODICE TESTO     ')
000700070105     A            T054440       70          TEXT('FTX-4440  TESTO LIBERO     ')
000800070105     A            T0544401      70          TEXT('FTX-44401 TESTO LIBERO     ')
000900070105     A            T0544402      70          TEXT('FTX-44402 TESTO LIBERO     ')
001000070105     A            T0544403      70          TEXT('FTX-44403 TESTO LIBERO     ')
001100070105     A            T0544404      70          TEXT('FTX-44404 TESTO LIBERO     ')
