000100070105     A          R TT31                      TEXT('IFCSUM D96A-TT31')
000200070105     A            T31PRG         4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300070105     A            T31TPR         4          TEXT('CHIAVE-TIPO RECORD')
000400070105     A            T31FLG         1          TEXT('FLAG USI VARI (ERRORI..)')
000500960328     A*
000600070105     A            T313035        3          TEXT('NAD-3035 QUAL. DELLA PARTE')
000700070105     A            T313039       35          TEXT('NAD-3039 ID DELLA PARTE   ')
000800070105     A            T311131        3          TEXT('NAD-3055 TIPO CODICE      ')
000900070105     A            T313055        3          TEXT('NAD-3055 COD.AGENZIA      ')
001000070105     A            T313124A      35          TEXT('NAD-3124 NOME INDIR.LINEA ')
001100070105     A            T313124B      35          TEXT('NAD-3124 NOME INDIR.LINEA ')
001200070105     A            T313124C      35          TEXT('NAD-3124 NOME INDIR.LINEA ')
001300070105     A            T313124D      35          TEXT('NAD-3124 NOME INDIR.LINEA ')
001400070105     A            T313124E      35          TEXT('NAD-3124 NOME INDIR.LINEA ')
001500070105     A            T313036A      35          TEXT('NAD-3036 NOME DELLA PARTE ')
001501070105     A            T313036B      35          TEXT('NAD-3036 NOME DELLA PARTE ')
001502070105     A            T313036C      35          TEXT('NAD-3036 NOME DELLA PARTE ')
001503070105     A            T313036D      35          TEXT('NAD-3036 NOME DELLA PARTE ')
001504070105     A            T313036E      35          TEXT('NAD-3036 NOME DELLA PARTE ')
001700070105     A            T313045        3          TEXT('NAD-3045 COD.FORMATO      ')
001800070105     A            T313042A      35          TEXT('NAD-3042 VIA E NUMERO     ')
001801070105     A            T313042B      35          TEXT('NAD-3042 VIA E NUMERO     ')
001802070105     A            T313042C      35          TEXT('NAD-3042 VIA E NUMERO     ')
001803070105     A            T313042D      35          TEXT('NAD-3042 VIA E NUMERO     ')
001900070105     A            T313164       35          TEXT('NAD-3164 CITTA            ')
002000070105     A            T313229        9          TEXT('NAD-3229 PROVINCIA        ')
002100070105     A            T313251        9          TEXT('NAD-3251 C.A.P.           ')
002200070105     A            T313207        3          TEXT('NAD-3207 CODICE NAZIONE   ')
