000100960524     A*--------------------------------------------------------------*
000200961007     A*  TABELLA   EA      - ERRORI RITORNO DATE DI ARRIVO -         *
000300960524     A*--------------------------------------------------------------*
000400960524     A                                      REF(CNDIZION)
000500961007     A          R EDIDSEA                   TEXT('ERRORI RITORNO DATE ARRIVO')
000600961007     A            §EADES        25A         TEXT('DESCRIZIONE ERRORE')
000700961007     A            §EATPE         1A         TEXT('TIPO ERRORE: E=ECCEDENZA/M=MA-
000800961007     A                                      CA BOLLA/BLANK=NO ERRORE')
000900961007     A            §EAMOD         1A         TEXT('MOD.DA SUBFILE CONFERMA:S=SI/-
001000961007     A                                      BLANK=NO')
001100980327     A            §EASTA         3A         TEXT('STATO ERRORE LISTA LABARTA')
001200980327     A            §EACOD         3A         TEXT('CODICE ERRORE LISTA LABARTA')
001300980327     A            §EASTV         3A         TEXT('STATO ERRORE LISTA VGL')
001400980327     A            §EACDV         3A         TEXT('CODICE ERRORE LISTA VGL')
001500980326     A            §EASTS         1A         TEXT('S=ERRORE DA IGNORARE')
001600980326     A            §EACAN         1A         TEXT('S=PREVALE SU ANOMALIA SGN')
