000100960524     A*--------------------------------------------------------------*
000200070123     A*  TABELLA   PV   - CONTINUAZIONE TABELLA PT PARTNER ESTERO -  *
000300960524     A*--------------------------------------------------------------*
000400960524     A                                      REF(CNDIZION)
000500070123     A          R EDIDSPV                   TEXT('DATI PARTNER E.D.I. ESTERO')
000600070123      *
000700070123     A            §PVEMA        44          TEXT('INDIR MAIL X COMUN.INTERNE')
000800070123      *                               Nell'indirizzo se non presente la @ significa
000900070123      *                               che il dominio della Mail è: << @Bartolini.it >>
001000070131     A            §PVRFF         3          TEXT('TIPO QUALIFICATORE RFF X -
001100070131     A                                      IDENTIFICARE LA SPEDIZIONE')
001200070131     A            §PVRFS         1          TEXT('SE IL RIFERIMENTO È A LIVELLO-
001300070131     A                                       DI SEGNACOLLO')
001400070201     A            §PVRSE         1          TEXT('RIFERIMENTI A LIVELLO SEGNACO-
001500070201     A                                      LO SUCCESSIVI AL PRIMO')
001600070131     A            §PVRCU         3          TEXT('TIPO QUALIFICATORE RFF X -
001700070131     A                                      RIF.NUMERICO DELLA SPEDIZIONE')
001800070205     A            §PVPES         1          TEXT('PESO DA CNT-TOTALE SUL DETTAG-
001900070205     A                                      LIO SPEDIZIONE INVECE CHE DALLA SOM-
002000070205     A                                      MA DEI SINGOLI GID-MEA DI OGNI COLL-
002100070205     A                                      O')
002200070205     A            §PVCOL         1          TEXT('NUM. COLLI DA CNT TOTALE SUL -
002300070205     A                                      DETTAGLIO SPEDIZIONE ANZICHÈ DALLA -
002400070205     A                                      SOMMA DEI SINGOLI GID DI OGNI COLLO-
002500070205     A                                      ')
002600070206     A            §PVSIN         3          TEXT('FREE TEXT DECODIFICATO CON IL-
002700070206     A                                      (SIN) SE NON DEFINITO CON ALTRO')
002800070206     A            §PVICN         3          TEXT('FREE TEXT DECODIFICATO CON IL-
002900070206     A                                      (ICN) SE NON DEFINITO CON ALTRO')
003000070206     A            §PV2IN         1          TEXT('IL 2° ADDRESS 3042B COME DEFA-
003100070206     A                                      ULT VIENE CONCATENATO ALLA CITTÀ MA-
003200070206     A                                      , SE INDICATO (S) AL 1° INDIRIZZO')
003300070219     A            §PVINV         1          TEXT('INVIO E-MAIL =S IN PRESENZA D-
003400070219     A                                      I ERRORI O SEGNALAZIONI IN TRADUZIO-
003500070219     A                                      NE DEL MESSAGGIO')
003600071128     A            §PVCNIRMN      1          TEXT('FORZA NEL RIFERIMENTO NUMERIC-
003700071128     A                                      O IL NUMERO PASSATO NEL CNI.')
003800110907      * SERVIZIO A PAGAMENTO X INVIO MAIL AL DESTINATARIO SULLA CONSEGNA
003900110907     A            §PVSRVMAIL     1          TEXT('S=IL SERVIZIO È ABILITATO')
004000111221     A            §PVCNVSTS      1          TEXT('ATTIVA CONV.STATI FUORI STD')
004100111221     A            §PVIDENT      10          TEXT('IDENTIFICA STATI FUORI STD.-
004200111221     A                                      DA CONVERTIRE.')
004300120117      *-----
004301120117      *-   SUL MANIFEST DA DARE AL PARTNER SI INVIA AL POSTO DEL RFF+CU UN ALTRO
004302120117      *-   QUALIFICATORE PER INDICARE AUTOMATICAMENTE IL RIFERIMENTO ORIGINALE
004303120117      *-   SU UNA BOLLA DI RESO CHE ERA PRESENTE SULLA PRIMA BOLLA DI IMPORT INVIATA
004304120117      *-   DAL PARTNER. (IL PARTNER PUÒ RICONOSCERE COSÌ CHE SI TRATTA DI UN RESO E NON
004305120117      *-   DI UNA NOSTRA BOLLA DI EXPORT).
004400120117     A            §PVCURESO      1          TEXT('ATTIVA SU RESO,INVIO RIF.ORIG-
004401120117     A                                       PTN.ALFAN. PRESENTE SULLA PRIMA BO-
004402120117     A                                      LLA IN IMPORT')
004405120117     A            §PVCUQUAR      3          TEXT('QUALIF.DA SOSTITUIRE AL (CU)')
004406120117     A            §PVCUTIPR      1          TEXT('IL RIFER.È A=ALFA/N=NUMERICO')
004407120117      *-----
004408120117      *-   SUL MANIFEST DA DARE AL PARTNER SI INVIA AL POSTO DEL RFF+CU UN ALTRO
004409120117      *-   QUALIFICATORE PER INDICARE AUTOMATICAMENTE IL RIFERIMENTO ORIGINALE
004410120117      *-   SU UNA BOLLA GENERATA DA UN ORM RICHIESTO DAL PARTNER TRAMITE IL RIFERIMENTO
004411120117      *-   ALFA SU ORM. (IL PARTNER PUÒ RICONOSCERE COSÌ CHE SI TRATTA DI UN SUO ORM E NON
004412120117      *-   DI UNA NOSTRA BOLLA DI EXPORT).
004600120117     A            §PVCUORM       1          TEXT('ATTIVA SU MANIFEST EXPORT,INV-
004700120117     A                                      IO RIF.ALFA DEL ORM RICEVUTO DAL PA-
004800120117     A                                      RTNER')
004900120117     A            §PVCUQUAO      3          TEXT('QUALIF.DA SOSTITUIRE AL (CU)')
005100120117     A            §PVCUTIPO      1          TEXT('IL RIFER.È A=ALFA/N=NUMERICO')
005200120117      *-----
