000100960524     A*--------------------------------------------------------------*
000200101018     A*  TABELLA   PR   - CONTINUAZ.  PT PARTNER ESTERO           -  *
000300960524     A*--------------------------------------------------------------*
000400101018      *  IL CODICE DELLA TABELLA È RAPPRESENTATO DA 6 BYTES.
000500101018      *   ES.:SUM93A X IDENTIFICARE IL PGM DI TRADUZIONE DEI MSG IFCSUM 93A
000600101018     A*--------------------------------------------------------------*
000700101018     A          R EDIDSPR
000800070123      *
000900110318     A            §PRTRADUT     10          TEXT('NOME PGM TRADUZ.IMPORT')
001000101018      *
001100110318     A            §PRTRADEX     10          TEXT('NOME PGM TRADUZ.EXPORT')
001200110318      *
