000100960524     A*--------------------------------------------------------------*
000200960716     A*  TABELLA   TC      - TIPO INCASSI C/ASSEGNO EDI ESTERO -     *
000300960524     A*--------------------------------------------------------------*
000400960524     A                                      REF(CNDIZION)
000500960716     A          R EDIDSTC                   TEXT('EVENTI BARTOLINI')
000600960716     A            §TCTPM         1A         TEXT('TIPO ASSEGNO')
000700960716     A            §TCTPI         1A         TEXT('TIPO INTESTAZIONE')
