000100960524     A*--------------------------------------------------------------*
000200960607     A*  TABELLA   99      - DATI INDICE  E.D.I.  ESTERO -           *
000300960524     A*--------------------------------------------------------------*
000400960524     A                                      REF(CNDIZION)
000500960607     A          R EDIDS99                   TEXT('INDICE TAB. E.D.I. ESTERO')
000600960607     A            §99DES        60A         TEXT('DESCRIZIONE CODICE')
000700960607     A            §99PGM        10A         TEXT('PGM. MANUTENZIONE')
