000100960401     A          R EDIFT000                  TEXT('ESPORTAZ.DATI CONSEGNA SPEDI-
000200960401     A                                      ZIONI')
000300960401     A            MANDAT       660A         TEXT('CAMPO UNICO X ESPORTAZ. DATI')
