000100110524     A          R STANDARD80                TEXT('PER TRACCIATO COMPATTATO 80 -
000200110524     A                                      COLONNE')
000300110524      *
000400110524     A            RIGA80STD     80A         TEXT('RIGA DA 80 COLONNE')
000500110524      *
