000100960328     A          R LVT1                      TEXT('TESTATA LETT.VETTURA-LVT1')
000200960328     A            T1PRG          4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300960328     A            T1TPR          4          TEXT('CHIAVE-TIPO RECORD')
000400960328     A            T1FLG          1          TEXT('FLAG USI VARI (ERRORI..)')
000500960328     A*
000600960328     A            T12005         3          TEXT('DTM-2005 QUAL. DATA       ')
000700960329     A            T12380        12          TEXT('DTM-2380 DATA             ')
000800960328     A            T12379         3          TEXT('DTM-2379 FORMATO DATA     ')
000900960328     A*
001000960328     A            T1A005         3          TEXT('DTM-2005 QUAL. DATA       ')
001100960329     A            T1A380        12          TEXT('DTM-2380 DATA             ')
001200960328     A            T1A379         3          TEXT('DTM-2379 FORMATO DATA     ')
001300960328     A*
001400960328     A            T1B005         3          TEXT('DTM-2005 QUAL. DATA       ')
001500960329     A            T1B380        12          TEXT('DTM-2380 DATA             ')
001600960328     A            T1B379         3          TEXT('DTM-2379 FORMATO DATA     ')
001700960328     A*
001800960328     A            T1C005         3          TEXT('DTM-2005 QUAL. DATA       ')
001900960329     A            T1C380        12          TEXT('DTM-2380 DATA             ')
002000960328     A            T1C379         3          TEXT('DTM-2379 FORMATO DATA     ')
002100960328     A*
