000100980407      *--------------------------------------------------------------*
000200141014      * TABELLA DI GESTIONE PLATFORM LIST X PARTNER CON PIÙ LUOGHI X EXPORT
000300980407      *--------------------------------------------------------------*
000400090202     A
000500141014     A          R EDPFL000                  TEXT('DEFINIZIONE SEGM-EDI')
000600090202     A*
000700141021     A            PFLLINEAA      3S 0       TEXT('LINEA PARTNER')
000800141021     A                                      COLHDG('LINEA' 'PARTNER')
000900141014      *
001000141016     A            PFLLUOGO      20A         TEXT('IDENT.LUOGO')
001100141014     A                                      COLHDG('IDENT.LUOGO')
001200141016      *
001300141105      *                                X SEGMENTO LOC
001400141105     A            PFLDESCR      25A         TEXT('DESC.LOCALITA')
001500141105     A                                      COLHDG('DESC.LOCALITA')
001600100716     A*
001700141105      *                                X SEGMENTO NAD
001800141014     A            PFLCODPFL     17A         TEXT('COD.PLATFORM')
001900141014     A                                      COLHDG('COD.PLATFORM')
002000141017     A*
002100141021     A            PFLDTDEC       8S 0       TEXT('DATA DECORRENZA')
002200141021     A                                      COLHDG('DATA' 'DECOR.')
002300141017     A*
002400141021     A            PFLDTSCA       8S 0       TEXT('DATA SCADENZA')
002500141021     A                                      COLHDG('DATA' 'SCAD.')
002600141014     A*
