000100980407      *--------------------------------------------------------------*
000200090202      * DEFINIZIONE DEI SEGMENTI NELLO STANDARD EDI
000300980407      *--------------------------------------------------------------*
000400090202     A
000500090202     A          R EDSGM000                  TEXT('DEFINIZIONE SEGM-EDI')
000600090604     A*
000700090604     A            SGMNOMEMSG     6A         TEXT('NOME MESSAGGIO')
000800090604     A                                      COLHDG('NOME MESSAGGIO')
000900090202     A*
001000090604     A            SGMTIPODS      3A         TEXT('TIPI SEGMENTI DS')
001100090604     A                                      COLHDG('TIPI SEGMENTI DS')
001200090604     A*
001300090604     A            SGMCODICE      3A         TEXT('COD.SEGMENTO')
001400090604     A                                      COLHDG('COD.SEGMENTO')
001500090202      *
001600090202     A            SGMSEQUEN      3S 0       TEXT('SEQUENZA')
001700090202     A                                      COLHDG('SEQUENZA')
001800090202      *
001900090202     A            SGMPROGR       3S 0       TEXT('PROGRESSIVO')
002000090202     A                                      COLHDG('PROGRESSIVO')
002100090202      *
002200090202     A            SGMCATEGO      4A         TEXT('CATEGORIA')
002300090202     A                                      COLHDG('CATEGORIA')
002400090202      *
002500090202     A            SGMNCAMPO      4A         TEXT('NOME CAMPO')
002600090202     A                                      COLHDG('NOME CAMPO')
002700090202      *
002800090202     A            SGMOBBLIG      1A         TEXT('OBBLIGATORIO')
002900090202     A                                      COLHDG('OBBLIGATORIO')
003000090202      *
003100090202     A            SGMTIPOD       1A         TEXT('TIPO DATI')
003200090202     A                                      COLHDG('TIPO DATI')
003300090202      *                                     ('A'= ALFANUMERICO)
003400090202      *                                     ('N'= NUMERICO)
003500090202      *                                     ('D'= DS ALFA)
003600090202      *
003700090202     A            SGMLUNGH       5S 0       TEXT('LUNGHEZZA CAMPO')
003800090202     A                                      COLHDG('LUNGHEZZA CAMPO')
003900090202      *
004000090209     A            SGMDECIM       3S 0       TEXT('QUANTI DECIMALI')
004100090209     A                                      COLHDG('QUANTI DECIMALI')
004200090209      *
004300090202     A            SGMDESCR      40A         TEXT('DESCRIZIONE')
004400090202     A                                      COLHDG('DESCRIZIONE')
004500090202      *
004600090203     A            SGMDESCI      40A         TEXT('DESCR.ITALIANO')
004700090203     A                                      COLHDG('DESCR.ITALY')
004800090203      *
