000100090605     A          R EDSMSE00                  TEXT('MEASUREMENTS')
000200090203      *
000300090605     A            MSE6799        3          TEXT('QUALIFIER DELLA MISURA')
000400090203      *
000500090605     A            MSE6314       15S 0       TEXT('MEASURE')
000600090605     A            MSE6410        3          TEXT('MEASUREMENT UNIT CODE')
000700090605      *
000800090605     A            MSE6706       15S 0       TEXT('NR.UNITÀ DI TRASPORTO')
