000100090605     A          R EDSGDS00                  TEXT('DESCR.DELLA MERCE')
000200090203      *
000300090605     A            GDS7781        3          TEXT('SPECIF.DESCRIZIONE MERCE')
000400090203      *
000500090605     A            GDS70021      26          TEXT('DESCRIZIONE MERCE')
000600090605     A            GDS70022      26          TEXT('DESCRIZIONE MERCE')
000700090605     A            GDS70023      26          TEXT('DESCRIZIONE MERCE')
000800090605     A            GDS70024      26          TEXT('DESCRIZIONE MERCE')
000900090605     A            GDS70025      26          TEXT('DESCRIZIONE MERCE')
001000090605     A            GDS70026      26          TEXT('DESCRIZIONE MERCE')
001100090605     A            GDS70027      26          TEXT('DESCRIZIONE MERCE')
001200090605     A            GDS70028      26          TEXT('DESCRIZIONE MERCE')
001300090605     A            GDS70029      26          TEXT('DESCRIZIONE MERCE')
001400090605     A            GDS700210     26          TEXT('DESCRIZIONE MERCE')
001500090203      *
001600090605     A            GDS7020       35          TEXT('NR.ARTICOLO')
001700090605     A            GDS7023        3          TEXT('IDENTIFICATIVO ARTICOLO')
001800090605     A            GDS1131        3          TEXT('QUALIFICATORE DI LISTA')
001900090605      *
002000090605     A            GDS77871       6          TEXT('NATURA DI CARICO')
002100090605     A            GDS77872       6          TEXT('NATURA DI CARICO')
002200090605     A            GDS77873       6          TEXT('NATURA DI CARICO')
002300090605     A            GDS77874       6          TEXT('NATURA DI CARICO')
002400090605     A            GDS77875       6          TEXT('NATURA DI CARICO')
