000100090203     A          R EDSRFF00                  TEXT('REFERENCE')
000200090203      *
000300090203     A            RFF1153        3          TEXT('REFERENCE CODE QUALIFIER')
000400090605      *
000500090605     A            RFF1154       35          TEXT('REFERENCE IDENTIFIER')
000600090203     A            RFF1156        6          TEXT('DOCUMENT LINE IDENTIFIER')
000700090605      *
000800090605     A            RFF2001        6S 0       TEXT('DATA DEL RIFERIMENTO')
000900090605     A            RFF2002        4S 0       TEXT('ORA')
