000100090203     A          R EDSNAD00                  TEXT('NAME AND ADDRESS')
000200090203      *
000300090203     A            NAD3035        3          TEXT('QUALIFICATORE SEGMENTO')
000400090203     A            NAD3039       35          TEXT('PARTY IDENTIFIER')
000500090203     A            NAD113120     17          TEXT('CODE LIST IDENTIFICATION COD')
000600090203     A            NAD305520      3          TEXT('CODE LIST RESPONSIBLE AGENCY')
000700090203      *
000800090203     A            NAD31241      35          TEXT('NAME AND ADDRESS DESCRIPTION')
000900090203     A            NAD31242      35          TEXT('NAME AND ADDRESS DESCRIPTION')
001000090203     A            NAD31243      35          TEXT('NAME AND ADDRESS DESCRIPTION')
001100090203     A            NAD31244      35          TEXT('NAME AND ADDRESS DESCRIPTION')
001200090203     A            NAD31245      35          TEXT('NAME AND ADDRESS DESCRIPTION')
001300090203      *
001400090203     A            NAD30361      35          TEXT('PARTY NAME')
001500090203     A            NAD30362      35          TEXT('PARTY NAME')
001600090203     A            NAD30363      35          TEXT('PARTY NAME')
001700090203     A            NAD30364      35          TEXT('PARTY NAME')
001800090203     A            NAD30365      35          TEXT('PARTY NAME')
001900100730     A            NAD3045        3          TEXT('PARTY NAME FORMAT CODE')
002000090203      *
002100090203     A            NAD30421      35          TEXT('STREET AND NR.OR POST OFF')
002200090203     A            NAD30422      35          TEXT('STREET AND NR.OR POST OFF')
002300090203     A            NAD30423      35          TEXT('STREET AND NR.OR POST OFF')
002400090203     A            NAD30424      35          TEXT('STREET AND NR.OR POST OFF')
002500090203      *
002600090203     A            NAD3164       35          TEXT('CITY NAME')
002700090203      *
002800090203     A            NAD3229        9          TEXT('COUNTRY SUBDIVISION IDENT.')
002900090203     A            NAD113170     17          TEXT('CODE LIST IDENTIFICATION COD')
003000090203     A            NAD305570      3          TEXT('CODE LIST RESPONSIBLE AGENCY')
003100090203     A            NAD3228       70          TEXT('COUNTRY SUBDIVISION NAME')
003200090203     A            NAD3251       17          TEXT('POSTAL IDENTIFICATION CODE')
003300090203     A            NAD3207        3          TEXT('COUNTRY IDENTIFIER')
