000100100316     A          R EDSCNI00                  TEXT('CONSIGNMENT INFORMATION')
000200090203      *
000300100316     A            CNI1490        4S 0       TEXT('CONSOLIDATION ITEM NUMBER')
000400100316      *
000500100316     A            CNI1004       35          TEXT('DOCUMENT/MESSAGE NUMBER')
000600100316      *
000700100316     A            CNI1312        4S 0       TEXT('CONS.LOAD SEQUENCE NUMBER')
