000100100316     A          R EDSEQD00                  TEXT('EQUIPMENT DETAILS')
000200090203      *
000300100316     A            EQD8053        3          TEXT('EQUIPMENT QUALIFIER')
000400100316      *
000500100316     A            EQD8260       17          TEXT('EQUIPMENT IDENTIFICATION')
000600100316      *
