000100090203     A          R EDSRFF00                  TEXT('REFERENCE')
000200090203      *
000300090203     A            RFF1153        3          TEXT('REFERENCE CODE QUALIFIER')
000400090203     A            RFF1154       70          TEXT('REFERENCE IDENTIFIER')
000500090203     A            RFF1156        6          TEXT('DOCUMENT LINE IDENTIFIER')
000600090203     A            RFF1056        9          TEXT('VERSION IDENTIFIER')
000700090203     A            RFF1060        6          TEXT('REVISION IDENTIFIER')
