000100100712     A          R EDSSTS00                  TEXT('STATUS')
000200090203      *
000300100712     A            STS9015        3          TEXT('STATUS TYPE, CODED')
000301100712     A            STS113110      3          TEXT('CODE LIST IDENTIF. CODE')
000302100712     A            STS305510      3          TEXT('CODE LIST RESPON.AGENCY CODE')
000400090203      *
000401100712     A            STS9011        3          TEXT('STATUS EVENT, CODED')
000402100712     A            STS113120      3          TEXT('CODE LIST IDENTIF. CODE')
000403100712     A            STS305520      3          TEXT('CODE LIST RESPON.AGENCY CODE')
000404100712      *
000405100712     A            STS901330      3          TEXT('STATUS REASON, CODED')
000406100712     A            STS113130      3          TEXT('CODE LIST IDENTIF. CODE')
000407100712     A            STS305530      3          TEXT('CODE LIST RESPON.AGENCY CODE')
000900100712     A            STS901230     35          TEXT('STATUS REASON')
001100090203      *
001200100712     A            STS901340      3          TEXT('STATUS REASON, CODED')
001300100712     A            STS113140      3          TEXT('CODE LIST IDENTIF. CODE')
001400100712     A            STS305540      3          TEXT('CODE LIST RESPON.AGENCY CODE')
001500100712     A            STS901240     35          TEXT('STATUS REASON')
001600100712      *
001700100712     A            STS901350      3          TEXT('STATUS REASON, CODED')
001800100712     A            STS113150      3          TEXT('CODE LIST IDENTIF. CODE')
001900100712     A            STS305550      3          TEXT('CODE LIST RESPON.AGENCY CODE')
002000100712     A            STS901250     35          TEXT('STATUS REASON')
002100100712      *
002200100712     A            STS901360      3          TEXT('STATUS REASON, CODED')
002300100712     A            STS113160      3          TEXT('CODE LIST IDENTIF. CODE')
002400100712     A            STS305560      3          TEXT('CODE LIST RESPON.AGENCY CODE')
002500100712     A            STS901260     35          TEXT('STATUS REASON')
002600100712      *
002700100712     A            STS901370      3          TEXT('STATUS REASON, CODED')
002800100712     A            STS113170      3          TEXT('CODE LIST IDENTIF. CODE')
002900100712     A            STS305570      3          TEXT('CODE LIST RESPON.AGENCY CODE')
003000100712     A            STS901270     35          TEXT('STATUS REASON')
003100100712      *
