000100090203     A          R EDSTDT00                  TEXT('TRANSPORT INFORMATION')
000200110117      *
000300110117     A            TDT00H1        3          TEXT('NOME SEGMENTO')
000400110117     A            TDT00H2        2          TEXT('CODICE SEGMENTO')
000500090203      *
000600090203     A            TDT8051        3          TEXT('TRANSPORT CODE QUALIFIER')
000700100810      *
000800110117     A            TDT8028        3          TEXT('MEANS OF TRANSPORT IDENTIF')
