000100090203     A          R EDSDTM00                  TEXT('DATE & TIME')
000200110117      *
000300110117     A            DTM00H1        3          TEXT('NOME SEGMENTO')
000400110117     A            DTM00H2        2          TEXT('CODICE SEGMENTO')
000500090203      *
000600090203     A            DTM2005        3          TEXT('DATE OR TIME QUALIFIER')
000700090203     A            DTM2380       35          TEXT('DATE OR TIME OR PERIOD TEXT')
000800090203     A            DTM2379        3          TEXT('DATE OR TIME FORMAT CODE')
