000100100810     A          R EDSHAN00                  TEXT('HANDLING INSTRUCTIONS')
000200090203      *
000300100810     A            HAN4079        3          TEXT('HANDLING INSTRUCTIONS, CODED')
000400100810     A            HAN1131        3          TEXT('CODE LIST IDENTIF.CODE')
000500100810     A            HAN3055        3          TEXT('CODE LIST RESPONS AGENCY')
000600100810     A            HAN4078       70          TEXT('HANDLING INSTRUCTIONS')
000700100810      *
000800100810     A            HAN7419        4          TEXT('HAZARDOUS MATERIAL CLASS')
000900100810     A            HAN113110      3          TEXT('CODE LIST IDENTIFICATION')
001000100810     A            HAN305510      3          TEXT('CODE LIST RESPONSIBLE AGENCY')
001100090203      *
