000100090203     A          R EDSBGM00                  TEXT('BEGINNING OF MESSAGE')
000200090203      *
000300090203     A            BGM1001        3          TEXT('DOCUMENT NAME CODE')
000400100810     A            BGM1131        3          TEXT('CODE LIST IDENT.CODE')
000500090203     A            BGM3055        3          TEXT('CODE LIST RESPON.AGENCY CODE')
000600090203     A            BGM1000       35          TEXT('DOCUMENT NAME')
000700090203      *
000800090203     A            BGM1004       35          TEXT('DOCUMENT IDENTIFIER')
000900090203     A            BGM1225        3          TEXT('MESSAGE FUNCTION CODE')
001000090203     A            BGM4343        3          TEXT('RESPONSE TYPE CODE')
