000100100810     A          R EDSRNG00                  TEXT('RANGE DETAILS')
000200090203      *
000300100810     A            RNG6167        3          TEXT('RANGE TYPE QUALIFIER')
000400100810      *
000500100810     A            RNG6411        3          TEXT('MEASUREMENT UNIT CODE')
000600100810     A            RNG6162       18S 0       TEXT('RANGE MINIMUM QUANTITY')
000700100810     A            RNG6152       18S 0       TEXT('RANGE MAXIMUM QUANTITY')
