000100090203     A          R EDSCTA00                  TEXT('CONTACT INFORMATION')
000200090203      *
000300090203     A            CTA3139        3          TEXT('CONTACT FUNCTION CODE')
000400090203      *
000500090203     A            CTA3413       17          TEXT('CONTACT IDENTIFIER')
000600100810     A            CTA3412       35          TEXT('CONTACT NAME')
