000100090203     A          R EDSCOM00                  TEXT('OMMUNICATION CONTACT')
000200090203      *
000300090203     A            COM3148      512          TEXT('COMM. ADDRESS IDENTIFIER')
000400090203     A            COM3155        3          TEXT('COMM. MEANS TYPE CODE')
