000100100810     A          R EDSDIM00                  TEXT('DATE & TIME')
000200090203      *
000300100810     A            DIM6145        3          TEXT('DIMENSION QUALIFIER')
000400100810      *
000500100810     A            DIM6411        3          TEXT('MEASUREMENT UNIT CODE')
000600100810     A            DIM6168       15S 0       TEXT('LENGTH DIMENSION')
000700100810     A            DIM6140       15S 0       TEXT('WIDTH DIMENSION')
000800100810     A            DIM6008       15S 0       TEXT('HEIGHT DIMENSION')
