000100090209     A          R TRTCTAB00
000200090203      *
000300090209     A            TCTUNB        35          TEXT('UNB PARTICOLARE')
000400090209     A            TCTSGM         3          TEXT('TIPO SEGMENTO')
000500090209     A            TCTVALSGM     35          TEXT('VALORE SEGMENTO')
000600090209     A            TCTDATI       70          TEXT('DATI DECODIFICA VAB')
