000100960508     A          R ST00                      TEXT('TESTATA STATO CONSEGNE-ST00')
000200960708     A            TEPRG          4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300960708     A            TETPR          4          TEXT('CHIAVE-TIPO RECORD')
000400960708     A            TEFLG          1          TEXT('FLAG USI VARI (ERRORI..)')
000500960328     A*
000600961121     A            TE3035         3          TEXT('UNB-0007 QUALIF.MITTENTE')
000700960708     A            TE3036        35          TEXT('UNB-0004 MITTENTE MSG       ')
