000100960503     A          R TD15                      TEXT('DETTAGLIO LETT.VETTURA-TD15')
000200960503     A            DDPRG          4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300960503     A            DDTPR          4          TEXT('CHIAVE-TIPO RECORD')
000400960503     A            DDFLG          1          TEXT('FLAG USI VARI (ERRORI..)')
000500960328     A*
000600960503     A            DD3035         3          TEXT('NAD-3035 QUAL. DELLA PARTE')
000700960503     A            DD3039        17          TEXT('NAD-3039 ID DELLA PARTE   ')
000800960725     A            DD1131         3          TEXT('NAD-3055 TIPO CODICE      ')
000900960725     A            DD3055         3          TEXT('NAD-3055 COD.AGENZIA      ')
001000960725     A            DD3124        35          TEXT('NAD-3124 NON USATO        ')
001100960725     A            DDA124        35          TEXT('NAD-3124 NON USATO        ')
001200960725     A            DDB124        35          TEXT('NAD-3124 NON USATO        ')
001300960725     A            DDC124        35          TEXT('NAD-3124 NON USATO        ')
001400960725     A            DDD124        35          TEXT('NAD-3124 NON USATO        ')
001500960725     A            DD3036        35          TEXT('NAD-3036 NOME DELLA PARTE ')
001600960503     A            DDA036        35          TEXT('NAD-3036 NOME DELLA PARTE ')
001700960503     A            DD3042        35          TEXT('NAD-3042 VIA E NUMERO     ')
001800960503     A            DDA042        35          TEXT('NAD-3042 VIA E NUMERO     ')
001900960503     A            DD3164        35          TEXT('NAD-3164 CITTA            ')
002000960503     A            DD3229         9          TEXT('NAD-3229 PROVINCIA        ')
002100960503     A            DD3251         9          TEXT('NAD-3251 C.A.P.           ')
002200960819     A            DD3207         3          TEXT('NAD-3207 CODICE NAZIONE   ')
002300960503     A*
002400960503     A            DD3139         3          TEXT('CTA-3139 CONTACT FUNCTION ')
002500960503     A            DD3412        35          TEXT('CTA-3412 REPARTO/DIPENDENTE')
002600960503     A*
002700960503     A            DD3155         3          TEXT('COM-3155 QUALIF. COMUNICAZ.')
002800960503     A            DD3148        25          TEXT('COM-3148 NR. COMUNICAZIONE  ')
002900960503     A*
003000960503     A            DDA155         3          TEXT('COM-3155 QUALIF.TIPO COMUN.')
003100960503     A            DDA148        25          TEXT('COM-3148 NR. COMUNICAZIONE  ')
