000100960502     A          R TT20                      TEXT('TESTATA LETT.VETTURA-TT20')
000200960502     A            TEPRG          4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300960502     A            TETPR          4          TEXT('CHIAVE-TIPO RECORD')
000400960502     A            TEFLG          1          TEXT('FLAG USI VARI (ERRORI..)')
000500960502     A*
000600960502     A            TE8051         3          TEXT('TDT-8051 ISTRUZIONI TRASPOR.')
000700960725     A            TE8028        17          TEXT('TDT-8028 NON USATO')
000800960502     A            TE8067         3          TEXT('TDT-8051 COD.MODAL. TRASPOR.')
000900960502     A            TE3128        35          TEXT('TDT-3128 NOME VETTORE       ')
001000960502     A            TE8212        35          TEXT('TDT-8212 ID MEZZO DI TRASP. ')
001100960502     A            TE8453         3          TEXT('TDT-8453 NAZION. MEZZO DI TR')
001200960502     A*
001300960502     A            TE3227         3          TEXT('LOC-3227 QUALIF. LOCALITA   ')
001400960502     A            TE3225        25          TEXT('LOC-3227 LOCALITA           ')
001500960725     A            TE1131         3          TEXT('LOC-1131 TIPO CODICE ')
001600960725     A            TE3224        17          TEXT('LOC-3224 LOCALITA IN CHIARO ')
001700960502     A*
001800960502     A            TEA227         3          TEXT('LOC-3227 QUALIF. LOCALITA   ')
001900960502     A            TEA225        25          TEXT('LOC-3227 LOCALITA           ')
002000960725     A            TEA131         3          TEXT('LOC-1131 TIPO CODICE ')
002100960725     A            TEA224        17          TEXT('LOC-3224 LOCALITA IN CHIARO ')
002200960502     A*
002300960502     A            TEB227         3          TEXT('LOC-3227 QUALIF. LOCALITA   ')
002400960502     A            TEB225        25          TEXT('LOC-3227 LOCALITA           ')
002500960725     A            TEB131         3          TEXT('LOC-1131 TIPO CODICE ')
002600960725     A            TEB224        17          TEXT('LOC-3224 LOCALITA IN CHIARO ')
002700960328     A*
002800960502     A            TE2005         3          TEXT('DTM-2005 QUAL. DATA       ')
002900960502     A            TE2380        12          TEXT('DTM-2380 DATA             ')
003000960502     A            TE2379         3          TEXT('DTM-2379 FORMATO DATA     ')
003100960328     A*
003200960502     A            TEA005         3          TEXT('DTM-2005 QUAL. DATA       ')
003300960502     A            TEA380        12          TEXT('DTM-2380 DATA             ')
003400960502     A            TEA379         3          TEXT('DTM-2379 FORMATO DATA     ')
003500960328     A*
003600960502     A            TEB005         3          TEXT('DTM-2005 QUAL. DATA       ')
003700960502     A            TEB380        12          TEXT('DTM-2380 DATA             ')
003800960502     A            TEB379         3          TEXT('DTM-2379 FORMATO DATA     ')
003900960328     A*
