000100960502     A          R TT30                      TEXT('TESTATA  LETT.VETTURA-TT30')
000200960502     A            TGPRG          4          TEXT('CHIAVE-PROGRESSIVO DOCUMENTO')
000300960502     A            TGTPR          4          TEXT('CHIAVE-TIPO RECORD')
000400960502     A            TGFLG          1          TEXT('FLAG USI VARI (ERRORI..)')
000500930330     A*
000600960516     A            TG8053         3          TEXT('EQD-8053 QUALIF. EQUIPAGGIAM')
000700960516     A            TG8260        17          TEXT('EQD-8260 EQUIPAGGIAMENTO ')
000800960516     A            TG1131         3          TEXT('EQD-1131 TIPO CODICE     ')
000900960328     A*
001000960502     A            TG6350        15S 0       TEXT('EQN-6350 NUMERO DI PALLETS')
001100960502     A*
001200960502     A            TG9308        10          TEXT('SEL-9308 NUMERO PIOMBO ')
001300960502     A*
