000100960529     A*--------------------------------------------------------------*
000200960529     A* ---  IMPOSTAZIONE PARAMETRI -----                            *
000300960529     A*--------------------------------------------------------------*
000400020227     A          R TRTC831
000500960529     A*
000600020227     A            F83AAS         4S 0       TEXT('Anno di spedizione')
000700020227     A            F83LNP         3S 0       TEXT('Lnp di partenza')
000800020227     A            F83NRS         2S 0       TEXT('Numero di serie')
000900020227     A            F83NSP         7S 0       TEXT('Numero di spedizione')
001000020227     A            F83DFV         8S 0       TEXT('Data foglio viaggio')
