000100960924     A*--------------------------------------------------------------*
000200020620     A*  RIGHE (H) HEADER DI TESTATA DATI DI STATO BOLLE FEDEX       *
000300960924     A*--------------------------------------------------------------*
000400020620      *
000500020620     A          R TRTCF1H
000600020620      *
000700020620     A            F1HTYP         1A         TEXT('TIPO RECORD')
000800020620     A                                      COLHDG('RECORD ID')
000900020620     A            F1HACN         9A         TEXT('CUST.FEDEX ACCOUNT NR')
001000020620     A                                      COLHDG('ACCOUNT NUMBER')
001100020620     A            F1HANR        12A         TEXT('PACKAGE TRACKING NR')
001200020620     A                                      COLHDG('AIRBILL NUMBER')
001300020620     A            F1HSHD         8S 0       TEXT('DATE PACKAGE SHIPPED')
001400020620     A                                      COLHDG('SHIP DATE')
001500020620     A            F1HCMD         8S 0       TEXT('SCHEDULED DELIVARY DATE')
001600020620     A                                      COLHDG('COMMIT DATE')
001700020620     A            F1HCMT         4S 0       TEXT('SCHEDULED DELIVARY TIME')
001800020620     A                                      COLHDG('COMMIT TIME')
001900020620     A            F1HEXC         1A         TEXT('DATA EXCEPTION')
002000020620     A                                      COLHDG('EXCEPTION CODE')
002100020620     A            F1HEXP         6A         TEXT('FOR FEDEX USE ONLY')
002200020620     A                                      COLHDG('EXCEPTION PROCESS ID')
002300020620     A            F1HREF        24A         TEXT('CUSTOMER REFERENCE NUMBER')
002400020620     A                                      COLHDG('REFERENCE')
002500020620     A            F1HCUQ         2A         TEXT('INDICATOR OF STATUSING')
002600020620     A                                      COLHDG('CUSTOMER QUALIFIER')
002700020620     A            F1HFID         4S 0       TEXT('NEW TRACKING NR. FORM ID')
002800020620     A                                      COLHDG('FORM ID')
002900020620     A            F1HTRN         1A         TEXT('REQUESTOR')
003000020620     A                                      COLHDG('TRACKING INDICATOR')
003100020620     A            F1HSNA        30A         TEXT('NOME OF THE SHIPPER')
003200020620     A                                      COLHDG('SHIPPER NAME')
003300020620     A            F1HSCO        30A         TEXT('COMPANY NAME')
003400020620     A                                      COLHDG('SHIPPER COMPANY')
003500020620     A            F1HSAD        25A         TEXT('ADDRESS')
003600020620     A                                      COLHDG('SHIPPER ADDRESS')
003700020620     A            F1HSCI        30A         TEXT('CITY')
003800020620     A                                      COLHDG('SHIPPER CITY')
003900020620     A            F1HSST         2A         TEXT('STATE CODE')
004000020620     A                                      COLHDG('SHIPPER STATE')
004100020620     A            F1HSZC         9A         TEXT('POSTAL CODE')
004200020620     A                                      COLHDG('SHIPPER ZIPCODE')
004300020620     A            F1HSCN         2A         TEXT('COUNTRY CODE')
004400020620     A                                      COLHDG('SHIPPER COUNTRY')
004500020620     A            F1HRNA        30A         TEXT('RECIPIENT NAME')
004600020620     A                                      COLHDG('NAME OF RECIPIENT')
004700020620     A            F1HRCO        30A         TEXT('COMPANY NAME')
004800020620     A                                      COLHDG('RECIPIENT COMPANY')
004900020620     A            F1HRAD        25A         TEXT('ADDRESS')
005000020620     A                                      COLHDG('RECIPIENT ADDRESS')
005100020620     A            F1HRCI        30A         TEXT('CITY')
005200020620     A                                      COLHDG('RECIPIENT CITY')
005300020620     A            F1HRST         2A         TEXT('STATE CODE')
005400020620     A                                      COLHDG('RECIPIENT STATE')
005500020620     A            F1HRZC         9A         TEXT('POSTAL CODE')
005600020620     A                                      COLHDG('RECIPIENT ZIPCODE')
005700020620     A            F1HRCN         2A         TEXT('COUNTRY CODE')
005800020620     A                                      COLHDG('RECIPIENT COUNTRY')
005900020620     A            F1HSCD         2A         TEXT('TYPE OF SERVICE')
006000020620     A                                      COLHDG('SERVICE CODE')
006100020620     A            F1HINV         9A         TEXT('INVOICE')
006200020620     A                                      COLHDG('INVOICE')
006300020620     A            F1HTCH         9A         TEXT('TOTAL CHARGE FOR SHIPMENT')
006400020620     A                                      COLHDG('TOTAL CHARGE')
006500020620     A            F1HTQU         5A         TEXT('TOTAL PACKAGE QUANTITY')
006600020620     A                                      COLHDG('TOTAL QUANTITY')
006700020620     A            F1HTWE         7A         TEXT('TOTAL PACKAGE WEIGHT')
006800020620     A                                      COLHDG('TOTAL WEIGHT')
006900020620     A            F1HDVA         9A         TEXT('AMOUNT OF VALUE DECLARED')
007000020620     A                                      COLHDG('DECLARED VALUE')
007100020620     A            F1HOQU         1A         TEXT('TOTAL OVERSIZE PACKAGE QTY')
007200020620     A                                      COLHDG('OVERSIZE QUANTITY')
007300020620     A            F1HCFL         1A         TEXT('CODE FLAG')
007400020620     A                                      COLHDG('CODE FLAG')
007500020620     A            F1HDGO         1A         TEXT('DANGEROUS GOODS FLAG')
007600020620     A                                      COLHDG('DANGEROUS GOODS')
007700020620     A            F1HFIL       120A         TEXT('FILLER')
007800020620     A                                      COLHDG('FILLER')
