000100170412     A*%%TS  SD  20170412  165801  EDPAB       REL-V7R2M0  5770-WDS
000200170412     A*%%EC
000300170412     A                                      DSPSIZ(27 132 *DS4)
000400170412     A                                      CHGINPDFT
000500170412     A                                      PRINT
000600170412     A                                      HLPTITLE('AIUTO')
000700170412     A                                      HLPPNLGRP(LABEL TRTC93G)
000800170412     A                                      ALTHELP(CA01)
000900170412     A                                      CA03
001000170412     A                                      HELP
001100070221     A*
001200120117     A          R TC93D01
001300120117     A*%%TS  SD  20120117  105747  EDPAB       REL-V6R1M0  5761-WDS
001400120117     A          H                           HLPPNLGRP(H1CKEY TRTC93G)
001500120117     A                                      HLPARA(*FLD V1CKEY)
001600120116     A*--
001700120117     A            RSUT          20A  O  1  3
001800120117     A                                  1 50'* Manutenzione Tabelle Partner *'
001900120117     A                                      DSPATR(RI)
002000120117     A            V1CPGM        10A  O  1111
002100120117     A                                  1124DATE
002200120117     A                                      EDTCDE(Y)
002300120117     A            KNSIF         10A  O  2  3
002400120117     A            KNMUS         10A  O  2 14
002500120117     A                                  2 50'*       E.D.I.  Estero         *'
002600120117     A                                      DSPATR(UL)
002700120117     A                                      DSPATR(RI)
002800120117     A                                  2124TIME
002900120116     A*--
003000120117     A                                 12 33'Id.Partner (UNB) ?:'
003100120117     A            V1CKEY        35A  B 12 53TEXT('Identificativo Partner')
003200120117     A                                      DSPATR(CS)
003300120117     A                                 26  3'F3=Fine Lavoro'
003400160209     A          R TC93D02
003500160209     A*%%TS  SD  20160209  143342  EDPAB       REL-V7R1M0  5770-WDS
003600160209     A                                      CA12
003700160209     A                                      CF02
003800160209     A N04N01                               CA16
003900160209     A  04                                  CF05
004000160209     A  06                                  CF06
004100160209     A                                      CF08
004200160209     A          H                           HLPPNLGRP(H1CKEY TRTC93G)
004300160209     A                                      HLPARA(*FLD V2CKEY)
004400160209     A          H                           HLPPNLGRP(H2CKSC TRTC93G)
004500160209     A                                      HLPARA(*FLD V2CKSC)
004600160209     A          H                           HLPPNLGRP(H2CEXP TRTC93G)
004700160209     A                                      HLPARA(*FLD V2CEXP)
004800160209     A          H                           HLPPNLGRP(H2DKSC TRTC93G)
004900160209     A                                      HLPARA(*FLD V2DKSC)
005000160209     A          H                           HLPPNLGRP(H2CTPC TRTC93G)
005100160209     A                                      HLPARA(*FLD V2CTPC)
005200160209     A          H                           HLPPNLGRP(H2CSIG TRTC93G)
005300160209     A                                      HLPARA(*FLD V2CSIG)
005400160209     A          H                           HLPPNLGRP(H2CLNP TRTC93G)
005500160209     A                                      HLPARA(*FLD V2CLNP)
005600160209     A          H                           HLPPNLGRP(H2CLNP TRTC93G)
005700160209     A                                      HLPARA(*FLD V2DLNP)
005800160209     A          H                           HLPPNLGRP(H2CNRS TRTC93G)
005900160209     A                                      HLPARA(*FLD V2CNRS)
006000160209     A          H                           HLPPNLGRP(H2CNAZ TRTC93G)
006100160209     A                                      HLPARA(*FLD V2CNAZ)
006200160209     A          H                           HLPPNLGRP(H2CNAZ TRTC93G)
006300160209     A                                      HLPARA(*FLD V2DNAZ)
006400160209     A          H                           HLPPNLGRP(H2CCTM TRTC93G)
006500160209     A                                      HLPARA(*FLD V2CCTM)
006600160209     A          H                           HLPPNLGRP(H2CCTR TRTC93G)
006700160209     A                                      HLPARA(*FLD V2CCTR)
006800160209     A          H                           HLPPNLGRP(H2CMSQ TRTC93G)
006900160209     A                                      HLPARA(*FLD V2CMSQ)
007000160209     A          H                           HLPPNLGRP(H2CBS1 TRTC93G)
007100160209     A                                      HLPARA(*FLD V2CBS1)
007200160209     A          H                           HLPPNLGRP(H2CPLT TRTC93G)
007300160209     A                                      HLPARA(*FLD V2CPLT)
007400160209     A          H                           HLPPNLGRP(H2CLOC TRTC93G)
007500160209     A                                      HLPARA(*FLD V2CLOC)
007600160209     A          H                           HLPPNLGRP(H2CPLN TRTC93G)
007700160209     A                                      HLPARA(*FLD V2CPLN)
007800160209     A  28        $MSG          70   M
007900160209     A            RSUT          20A  O  1  3
008000160209     A  02                              1 31'*-NOTE-*'
008100160209     A                                      DSPATR(RI)
008200160209     A                                      COLOR(RED)
008300160209     A                                  1 49'** Manutenzione Tabelle Partner **'
008400160209     A                                      DSPATR(RI)
008500160209     A  01                              1 89'INSERIMENTO'
008600160209     A N01                              1 89'MANUTENZIONE'
008700160209     A            V2CPGM        10A  O  1111
008800160209     A                                  1124DATE
008900160209     A                                      EDTCDE(Y)
009000160209     A            KNSIF         10A  O  2  3
009100160209     A            KNMUS         10A  O  2 14
009200160209     A  04                              2111' ANNULLATO '
009300160209     A                                      DSPATR(RI)
009400160209     A                                  2124TIME
009500160209     A                                  4  8'Id.Partner(UNB)'
009600160209     A                                      DSPATR(HI)
009700160209     A            V2CKEY        35A  O  4 24TEXT('Identificativo partner')
009800160209     A                                  4 88' x Importazione Dati  '
009900160209     A                                      DSPATR(RI)
010000160209     A                                      DSPATR(HI)
010100160209     A                                  4111'dal'
010200160209     A            V2DADAT        8Y 0O  4115EDTCDE(Y)
010300160209     A                                  6 96'Tipo codice:'
010400160209     A                                      DSPATR(HI)
010500160209     A            V2CTPC         1A  B  6109TEXT('PARTNER/CLIENTE')
010600160209     A                                      DSPATR(CS)
010700160209     A                                      DSPATR(MDT)
010800160209     A                                      VALUES('P' 'C' 'X')
010900160209     A                                  6111'C=Cli/P=Ptn'
011000160209     A                                      DSPATR(HI)
011100160209     A                                  7  6' DATI PRINCIPALI  Cliente/Partner -
011200160209     A                                                                         -
011300160209     A                                            '
011400160209     A                                      DSPATR(HI)
011500160209     A                                      DSPATR(RI)
011600160209     A                                  7 86'Cod.x trasm.su server:'
011700160209     A            V2CFTP         7A  O  7109
011800160209     A  88                                  DSPATR(RI)
011900160209     A            V2TRSM         2A  O  7118
012000160209     A                                  8 10'Cod. IMPORT :'
012100160209     A            V2CKSC         7Y 0B  8 24TEXT('Codice cliente')
012200160209     A                                      EDTCDE(4)
012300160209     A  40                                  DSPATR(RI)
012400160209     A N40                                  DSPATR(CS)
012500160209     A  40                                  DSPATR(PC)
012600160209     A            V2DKSC        48A  O  8 33TEXT('Decodica cliente')
012700160209     A                                  9 15'EXPORT :'
012800160209     A            V2CEXP         7Y 0B  9 24TEXT('Codice Partner x Export')
012900160209     A                                      EDTCDE(4)
013000160209     A  50                                  DSPATR(RI)
013100160209     A N50                                  DSPATR(CS)
013200160209     A  50                                  DSPATR(PC)
013300160209     A            V2DEXP        48A  O  9 33TEXT('Decodica cliente')
013400160209     A                                  9 85'(invia Dispos.Giacenza su altra ma-
013500160209     A                                      il)'
013600160209     A                                 11  7'UNB da Naz/Mitt Det:'
013700160209     A            V2CPLN         1A  B 11 28DSPATR(CS)
013800160209     A                                      VALUES(' ' 'S')
013900160209     A                                 11 33'*blk/S=Naz.da 1°Mitt.Sped.'
014000160209     A                                 11 87'Data ultima fattura:'
014100160209     A            V2DULT         6Y 0O 11108EDTCDE(Y)
014200160209     A                                      DSPATR(HI)
014300160209     A                                 12 17'Nazione ?:'
014400160209     A            V2CNAZ         3A  B 12 28TEXT('Nazione')
014500160209     A  43                                  DSPATR(RI)
014600160209     A N43                                  DSPATR(CS)
014700160209     A  43                                  DSPATR(PC)
014800160209     A            V2DNAZ        25A  O 12 33TEXT('Decodifica linea di partenza')
014900160209     A                                 13 13'Linea par/arr:'
015000160209     A            V2CLNP         3Y 0B 13 28TEXT('Linea di partenza')
015100160209     A  41                                  DSPATR(RI)
015200160209     A N41                                  DSPATR(CS)
015300160209     A  41                                  DSPATR(PC)
015400160209     A                                      EDTCDE(4)
015500160209     A            V2DLNP        30A  O 13 33TEXT('Decodifica linea di partenza')
015600160209     A                                 13 65'Fil.di Gestione:'
015700160209     A            V2FGS          3Y 0B 13 83TEXT('Filiale di Gestione <> da LNP-
015800160209     A                                      ')
015900160209     A  51                                  DSPATR(RI)
016000160209     A N51                                  DSPATR(CS)
016100160209     A  51                                  DSPATR(PC)
016200160209     A                                      EDTCDE(4)
016300160209     A                                      CHECK(RZ)
016400160209     A            V2DFGS        30A  O 13 87TEXT('Decodifica linea di partenza')
016500160209     A                                 14 12'Codice tariffa:'
016600160209     A            V2CCTR         3A  B 14 28TEXT('Codice tariffa')
016700160209     A  45                                  DSPATR(RI)
016800160209     A N45                                  DSPATR(CS)
016900160209     A  45                                  DSPATR(PC)
017000160209     A                                 14 87'C.Cli.Tassaz.ORM:'
017100160209     A            V2OKSC         7Y 0B 14105EDTCDE(Z)
017200160209     A                                      DSPATR(CS)
017300160209     A                                      CHECK(RZ)
017400160209     A                                 14113'Tariffa ORM:'
017500160209     A            V2OCTR         3A  B 14126DSPATR(CS)
017600160209     A                                 15 10'Cod.tratt.merce?:'
017700160209     A            V2CCTM         2A  B 15 28TEXT('Codice Trattamento merce')
017800160209     A  44                                  DSPATR(RI)
017900160209     A N44                                  DSPATR(CS)
018000160209     A  44                                  DSPATR(PC)
018100160209     A                                 16 15'Nr di serie:'
018200160209     A            V2CNRS         2Y 0B 16 28TEXT('Numero di serie')
018300160209     A  42                                  DSPATR(RI)
018400160209     A N42                                  DSPATR(CS)
018500160209     A  42                                  DSPATR(PC)
018600160209     A                                      EDTCDE(4)
018700160209     A                                 16 87'Luogo di par/arr:'
018800160209     A            V2CLOC        25A  B 16105TEXT('Punto di partenza/arrivo')
018900160209     A  47                                  DSPATR(RI)
019000160209     A N47                                  DSPATR(CS)
019100160209     A  47                                  DSPATR(PC)
019200160209     A                                 17 16'Segnacollo:'
019300160209     A            V2CBS1         1A  B 17 28TEXT('Ricevo nostro numero segnacol-
019400160209     A                                      lo')
019500160209     A N48                                  DSPATR(CS)
019600160209     A  48                                  DSPATR(RI)
019700160209     A  48                                  DSPATR(PC)
019800160209     A                                      VALUES('S' ' ' 'E')
019900160209     A                                 17 33'S=BRT/E=Est/*blk=No'
020000160209     A                                 17 98'Platform List:'
020100160209     A            V2CPLT        17A  B 17113TEXT('Codice Platform list')
020200160209     A  46                                  DSPATR(RI)
020300160209     A N46                                  DSPATR(CS)
020400160209     A  46                                  DSPATR(PC)
020500160209     A                                 19  2'+----------------------------------
020600160209     A                                      ------------------------------------
020700160209     A                                      ------+'
020800160209     A                                      DSPATR(HI)
020900160209     A                                 20  2'|'
021000160209     A                                      DSPATR(HI)
021100160209     A                                 20  4'In DOWNLOAD:'
021200160209     A                                      DSPATR(HI)
021300160209     A                                 20 17'Qualif.PARTNER(UNB):'
021400160209     A            V2CMSQ         4A  B 20 38TEXT('Qualificatore utilizzato dal -
021500160209     A                                      Partner')
021600160209     A                                      DSPATR(CS)
021700160209     A                                 20 77'|'
021800160209     A                                      DSPATR(HI)
021900160209     A                                 21  2'|'
022000160209     A                                      DSPATR(HI)
022100160209     A                                 21  9'Msg compattato a 80 colonne:'
022200160209     A            V2COMPAT       1A  B 21 38DSPATR(CS)
022300160209     A                                      VALUES(' ' 'S')
022400160209     A                                 21 40'*blk/S=compatta il msg standard'
022500160209     A                                 21 77'|'
022600160209     A                                      DSPATR(HI)
022700160209     A                                 22  2'|'
022800160209     A                                      DSPATR(HI)
022900160209     A                                 22  8'Sigla Cli/Partner x NomeFile:'
023000160209     A            V2CSIG         2A  B 22 38TEXT('Sigla Cliente (Acronimo)')
023100160209     A  49                                  DSPATR(RI)
023200160209     A N49                                  DSPATR(CS)
023300160209     A  49                                  DSPATR(PC)
023400160209     A                                 22 41'Prefisso nome file x invio EDI'
023500160209     A                                 22 77'|'
023600160209     A                                      DSPATR(HI)
023700160209     A                                 23  2'|'
023800160209     A                                      DSPATR(HI)
023900160209     A                                 23  5'Invio a Server tramite NomeFile:'
024000160209     A            V2CNOMFILE     1A  B 23 38DSPATR(CS)
024100160209     A                                      VALUES(' ' 'S')
024200160209     A                                 23 40'*blk/S=Nome file ->Sigla+U/A SUM/S-
024300160209     A                                      TA'
024400160209     A                                 23 77'|'
024500160209     A                                      DSPATR(HI)
024600160209     A                                 24  2'|'
024700160209     A                                      DSPATR(HI)
024800160209     A                                 24 77'|'
024900160209     A                                      DSPATR(HI)
025000160209     A                                 25  2'+----------------------------------
025100160209     A                                      ------------------------------------
025200160209     A                                      ------+'
025300160209     A                                      DSPATR(HI)
025400160209     A                                 26  3'F3=Fine Lavoro'
025500160209     A                                 26 21'  F2=Note  '
025600160209     A  02                                  DSPATR(RI)
025700160209     A                                      COLOR(RED)
025800160209     A  04                             26 37'F5=Ripristino'
025900160209     A  06                             26 56'F6=Conferma'
026000160209     A N04N01                          26 73'F16=Annullamento'
026100160209     A                                 26 98'Enter=Avanzamento'
026200160209     A                                 26122'F12=Ritorno'
026300140624     A          R TC93D03
026400140624     A*%%TS  SD  20140624  101247  EDPAB       REL-V7R1M0  5770-WDS
026500140624     A                                      CA12
026600140624     A                                      CF02
026700140624     A N04N01                               CA16
026800140624     A  04                                  CF05
026900140624     A  06                                  CF06
027000140624     A          H                           HLPPNLGRP(H1CKEY TRTC93G)
027100140624     A                                      HLPARA(*FLD V3CKEY)
027200140624     A          H                           HLPPNLGRP(H3CCMR TRTC93G)
027300140624     A                                      HLPARA(*FLD V3CCMR)
027400140624     A          H                           HLPPNLGRP(H3CNFV TRTC93G)
027500140624     A                                      HLPARA(*FLD V3CNFV)
027600140624     A          H                           HLPPNLGRP(H3CDES TRTC93G)
027700140624     A                                      HLPARA(*FLD V3CDES)
027800140624     A          H                           HLPPNLGRP(H3CSS TRTC93G)
027900140624     A                                      HLPARA(*FLD V3CSS)
028000140624     A          H                           HLPPNLGRP(H3CCAS TRTC93G)
028100140624     A                                      HLPARA(*FLD V3CCAS)
028200140624     A          H                           HLPPNLGRP(H3CTB TRTC93G)
028300140624     A                                      HLPARA(*FLD V3CTB)
028400140624     A          H                           HLPPNLGRP(H3CWRK TRTC93G)
028500140624     A                                      HLPARA(*FLD V3CWRK)
028600140624     A          H                           HLPPNLGRP(H3CTC TRTC93G)
028700140624     A                                      HLPARA(*FLD V3CTC)
028800140624     A          H                           HLPPNLGRP(H3CLNA TRTC93G)
028900140624     A                                      HLPARA(*FLD V3CLNA)
029000140624     A          H                           HLPPNLGRP(H3CTS TRTC93G)
029100140624     A                                      HLPARA(*FLD V3CTS)
029200140624     A          H                           HLPPNLGRP(H3CNAS TRTC93G)
029300140624     A                                      HLPARA(*FLD V3CNAS)
029400140624     A          H                           HLPPNLGRP(H3CNSP TRTC93G)
029500140624     A                                      HLPARA(*FLD V3CNSP)
029600140624     A          H                           HLPPNLGRP(H3CLUN TRTC93G)
029700140624     A                                      HLPARA(*FLD V3CLUN)
029800140624     A          H                           HLPPNLGRP(H3CGR TRTC93G)
029900140624     A                                      HLPARA(*FLD V3CGR)
030000140624     A          H                           HLPPNLGRP(H3CEL1 TRTC93G)
030100140624     A                                      HLPARA(*FLD V3CEL1)
030200140624     A          H                           HLPPNLGRP(H3CLP1 TRTC93G)
030300140624     A                                      HLPARA(*FLD V3CLP1)
030400140624     A          H                           HLPPNLGRP(H3CLA1 TRTC93G)
030500140624     A                                      HLPARA(*FLD V3CLA1)
030600140624     A          H                           HLPPNLGRP(H3CNR1 TRTC93G)
030700140624     A                                      HLPARA(*FLD V3CNR1)
030800140624     A          H                           HLPPNLGRP(H3CSG1 TRTC93G)
030900140624     A                                      HLPARA(*FLD V3CSG1)
031000140624     A          H                           HLPPNLGRP(H3CPFA TRTC93G)
031100140624     A                                      HLPARA(*FLD V3CPFA)
031200140624     A          H                           HLPPNLGRP(H3CZN1 TRTC93G)
031300140624     A                                      HLPARA(*FLD V3CZN1)
031400140624     A  28        $MSG          70   M
031500140624     A            RSUT          20A  O  1  3
031600140624     A  02                              1 31'*-NOTE-*'
031700140624     A                                      DSPATR(RI)
031800140624     A                                      COLOR(RED)
031900140624     A                                  1 49'** Manutenzione Tabelle Partner **'
032000140624     A                                      DSPATR(RI)
032100140624     A  01                              1 89'INSERIMENTO'
032200140624     A N01                              1 89'MANUTENZIONE'
032300140624     A            V3CPGM        10A  O  1111
032400140624     A                                  1124DATE
032500140624     A                                      EDTCDE(Y)
032600140624     A            KNSIF         10A  O  2  2
032700140624     A            KNMUS         10A  O  2 13
032800140624     A                                  2 53'  U P L O A D    MANIFEST  '
032900140624     A                                      DSPATR(RI)
033000140624     A                                      DSPATR(HI)
033100140624     A  04                              2111' ANNULLATO '
033200140624     A                                      DSPATR(RI)
033300140624     A                                  2124TIME
033400140624     A                                  4  7'Id.Partner(UNB)'
033500140624     A                                      DSPATR(HI)
033600140624     A            V3CKEY        35A  O  4 23TEXT('Identificativo partner')
033700140624     A                                  4103'                          '
033800140624     A                                      DSPATR(RI)
033900140624     A                                  5102' '
034000140624     A                                      DSPATR(RI)
034100140624     A                                  5108'Attiva SUFFISSO'
034200140624     A                                      DSPATR(HI)
034300140624     A                                  5129' '
034400140624     A                                      DSPATR(RI)
034500140624     A                                  6102' '
034600140624     A                                      DSPATR(RI)
034700140624     A                                  6106' su TAB del Cliente '
034800140624     A                                      DSPATR(HI)
034900140624     A                                      DSPATR(UL)
035000140624     A                                  6129' '
035100140624     A                                      DSPATR(RI)
035200140624     A                                  7  2' IMPORT dal Cliente    <Ricezione -
035300140624     A                                      File Spedizioni> '
035400140624     A                                      DSPATR(HI)
035500140624     A                                      DSPATR(RI)
035600140624     A                                  7 64'Pt.Franco/Assegnato'
035700140624     A                                      DSPATR(UL)
035800140624     A                                      DSPATR(HI)
035900140624     A                                  7 84'*blk/F/A'
036000140624     A                                      DSPATR(UL)
036100140624     A                                  7102' '
036200140624     A                                      DSPATR(RI)
036300140624     A                                  7129' '
036400140624     A                                      DSPATR(RI)
036500140624     A                                  8  2'Numero CMR'
036600140624     A            V3CCMR         1A  B  8 20TEXT('Numero CMR ricevuto da Partne-
036700140624     A                                      r')
036800140624     A                                      VALUES('S' ' ')
036900140624     A                                      DSPATR(CS)
037000140624     A                                  8 22'Blk=N/S'
037100140624     A                                  8 30'(RFF1153-1154)'
037200140624     A                                  8 64'Dflt x Tipo Bolla assente'
037300140624     A            V3CPFA         1A  B  8 90DSPATR(CS)
037400140624     A                                      VALUES(' ' 'F' 'A')
037500140624     A                                  8102' '
037600140624     A                                      DSPATR(RI)
037700140624     A                                  8106'Serv.Speciali'
037800140624     A            V3CSS          2A  B  8124DSPATR(HI)
037900140624     A                                      DSPATR(CS)
038000140624     A                                  8129' '
038100140624     A                                      DSPATR(RI)
038200140624     A                                  9  2'Foglio Viaggio'
038300140624     A            V3CNFV         1A  B  9 20TEXT('Numero Foglio viaggio ricevut-
038400140624     A                                      o da partner')
038500140624     A                                      VALUES('S' ' ')
038600140624     A                                      DSPATR(CS)
038700140624     A                                  9 22'Blk=N/S'
038800140624     A                                  9 30'(RFF1153-1154)'
038900140624     A                                  9102' '
039000140624     A                                      DSPATR(RI)
039100140624     A                                  9106'Tipo Bolle'
039200140624     A            V3CTB          2A  B  9124DSPATR(HI)
039300140624     A                                      DSPATR(CS)
039400140624     A                                  9129' '
039500140624     A                                      DSPATR(RI)
039600140624     A                                 10  2'PLATFORM LIST di provenienza'
039700140624     A                                 10102' '
039800140624     A                                      DSPATR(RI)
039900140624     A                                 10106'Tipo Incasso'
040000140624     A            V3CTC          2A  B 10124DSPATR(HI)
040100140624     A                                      DSPATR(CS)
040200140624     A                                 10129' '
040300140624     A                                      DSPATR(RI)
040400140624     A                                 11  6'NAD+SF:'
040500140624     A            V3NADSF        1A  B 11 20TEXT('Numero Foglio viaggio ricevut-
040600140624     A                                      o da partner')
040700140624     A                                      VALUES('S' ' ')
040800140624     A                                      DSPATR(CS)
040900140624     A                                 11 22'Blk=N/S'
041000140624     A                                 11 30'(Utilizzata come RFF+FF in testata-
041100140624     A                                       msg)'
041200140624     A                                 11102' '
041300140624     A                                      DSPATR(RI)
041400140624     A                                 11106'Tipo Servizio'
041500140624     A            V3CTS          2A  B 11124DSPATR(HI)
041600140624     A                                      DSPATR(CS)
041700140624     A                                 11129' '
041800140624     A                                      DSPATR(RI)
041900140624     A                                 12102' '
042000140624     A                                      DSPATR(RI)
042100140624     A                                 12129' '
042200140624     A                                      DSPATR(RI)
042300140624     A                                 13103'                          '
042400140624     A                                      DSPATR(RI)
042500140624     A                                 13  2'Rif.Num=Bolla/ORM'
042600140624     A N38                                  DSPATR(HI)
042700140624     A  38                                  DSPATR(RI)
042800140624     A            V3CRES         1A  B 13 20TEXT('Numero Foglio viaggio ricevut-
042900140624     A                                      o da partner')
043000140624     A                                      VALUES('S' ' ')
043100140624     A                                      DSPATR(CS)
043200140624     A                                 13 22'Blk=N/S'
043300140624     A                                 13 30'(Reso o Sped.generata da ORM expor-
043400140624     A                                      t)'
043500140624     A N38                                  DSPATR(HI)
043600140624     A  38                                  DSPATR(RI)
043700140624     A                                 15  2'Cambia NAD+CN in'
043800140624     A            V3CDES         2A  B 15 19TEXT('Codice Trattamento merce')
043900140624     A                                      DSPATR(CS)
044000140624     A                                 15 22'Blk=Std'
044100140624     A                                 15 30'(NAD3035=DP/etc.)'
044200140624     A                                 15 53' Conferma x CMR '
044300140624     A N36                                  DSPATR(HI)
044400140624     A  36                                  DSPATR(RI)
044500140624     A            V3CWRK         1A  B 15 70TEXT('Numero Foglio viaggio ricevut-
044600140624     A                                      o da partner')
044700140624     A                                      VALUES('S' ' ')
044800140624     A                                      DSPATR(CS)
044900140624     A                                 15 72'Blk=N/S'
045000140624     A                                 15 81'------>'
045100140624     A N37                                  DSPATR(HI)
045200140624     A  37                                  DSPATR(RI)
045300140624     A                                 15 89'\Raggruppa sped.x destinatario'
045400140624     A N37                                  DSPATR(HI)
045500140624     A  37                                  DSPATR(RI)
045600140624     A            V3RAGDES       1A  B 15120TEXT('Numero Foglio viaggio ricevut-
045700140624     A                                      o da partner')
045800140624     A                                      VALUES('S' ' ')
045900140624     A N47                                  DSPATR(CS)
046000140624     A  47                                  DSPATR(PC)
046100140624     A  47                                  DSPATR(RI)
046200140624     A                                 15122'Blk=N/S'
046300140624     A                                 16 90'\ Nome CMR univoco x raggrup.'
046400140624     A N37                                  DSPATR(HI)
046500140624     A  37                                  DSPATR(RI)
046600140624     A            V3NOMCMR      10A  B 16120
046700140624     A N48                                  DSPATR(CS)
046800140624     A  48                                  DSPATR(PC)
046900140624     A  48                                  DSPATR(RI)
047000140624     A                                 17  2'Nat.Merce'
047100140624     A            V3CNAS         1A  B 17 20TEXT('Numero Foglio viaggio ricevut-
047200140624     A                                      o da partner')
047300140624     A                                      VALUES('S' ' ')
047400140624     A                                      DSPATR(CS)
047500140624     A                                 17 22'Blk=N/S'
047600140624     A                                 17 30'(FTX+AAA)'
047700140624     A                                 17 91'\......Nella stessa Giornata'
047800140624     A N37                                  DSPATR(HI)
047900140624     A  37                                  DSPATR(RI)
048000140624     A            V3INGIO        1A  B 17120TEXT('Numero Foglio viaggio ricevut-
048100140624     A                                      o da partner')
048200140624     A                                      VALUES('S' ' ')
048300140624     A N49                                  DSPATR(CS)
048400140624     A  49                                  DSPATR(PC)
048500140624     A  49                                  DSPATR(RI)
048600140624     A                                 17122'Blk=N/S'
048700140624     A                                 18  2'Gestione C/Ass'
048800140624     A            V3CCAS         1A  B 18 20TEXT('Numero Foglio viaggio ricevut-
048900140624     A                                      o da partner')
049000140624     A                                      VALUES('S' ' ')
049100140624     A                                      DSPATR(CS)
049200140624     A                                 18 22'Blk=N/S'
049300140624     A                                 18 30'(MOA5025-5004)'
049400140624     A                                 19  2'Peso in Grammi'
049500140624     A            V3CGR          1A  B 19 20DSPATR(CS)
049600140624     A                                      VALUES(' ' 'S')
049700140624     A                                 19 22'Blk=N/S'
049800140624     A                                 19102'Posizioni Barcode Disk B    '
049900140624     A                                      DSPATR(UL)
050000140624     A                                 20  2'Cli con 2°LNA'
050100140624     A            V3CLNA         1A  B 20 20TEXT('Numero Foglio viaggio ricevut-
050200140624     A                                      o da partner')
050300140624     A                                      VALUES('S' ' ')
050400140624     A                                      DSPATR(CS)
050500140624     A                                 20 22'Blk=N/S'
050600140624     A                                 20 54'N°Elem.0-10 su PCI o GIN(D96A)'
050700140624     A            V3CEL1         2Y 0B 20 85TEXT('Numero di elementi validi')
050800140624     A                                      EDTCDE(4)
050900140624     A N41                                  DSPATR(CS)
051000140624     A                                      COMP(LE 10)
051100140624     A  41                                  DSPATR(RI)
051200140624     A  41                                  DSPATR(PC)
051300140624     A                                 20102'Lnp'
051400140624     A            V3CLP1         2Y 0B 20107TEXT('Posizione iniziale lnp nel se-
051500140624     A                                      gnacollo passatoci')
051600140624     A                                      EDTCDE(4)
051700140624     A                                      DSPATR(CS)
051800140624     A                                 20110'0=nulla/1-20=Pos.Ini'
051900140624     A                                 21  2'Imp.da Assicurare'
052000140624     A            V3CIAS         1A  B 21 20TEXT('Numero Foglio viaggio ricevut-
052100140624     A                                      o da partner')
052200140624     A                                      VALUES('S' ' ')
052300140624     A                                      DSPATR(CS)
052400140624     A                                 21 22'Blk=N/S'
052500140624     A                                 21 54'x DiskC lng.max Barcode su VAT'
052600140624     A            V3CLUN         2Y 0B 21 85TEXT('Lunghezza max.Segnacollo su V-
052700140624     A                                      AT')
052800140624     A                                      EDTCDE(4)
052900140624     A                                      DSPATR(CS)
053000140624     A                                 21102'Lna'
053100140624     A            V3CLA1         2Y 0B 21107TEXT('Posizione iniziale lnA nel se-
053200140624     A                                      gnacollo passatoci')
053300140624     A                                      EDTCDE(4)
053400140624     A                                      DSPATR(CS)
053500140624     A                                 21110'0=nulla/1-20=Pos.Ini'
053600140624     A                                 22 54' Nr.Bolla su EDI x Legare VAX '
053700140624     A N35                                  DSPATR(HI)
053800140624     A  35                                  DSPATR(RI)
053900140624     A            V3CNSP         1A  B 22 85TEXT('NrBolla da EDI x legare files-
054000140624     A                                       BRT (VAX)')
054100140624     A                                      VALUES('S' ' ')
054200140624     A                                      DSPATR(CS)
054300140624     A                                 22 87'Blk=N/S'
054400140624     A                                 22102'Nrs'
054500140624     A            V3CNR1         2Y 0B 22107TEXT('Posizione iniziale nr.serie n-
054600140624     A                                      el segnacollo passato')
054700140624     A                                      EDTCDE(4)
054800140624     A                                      DSPATR(CS)
054900140624     A                                 22110'0=nulla/1-20=Pos.Ini'
055000140624     A                                 23102'Sgn'
055100140624     A            V3CSG1         2Y 0B 23107TEXT('Posizione iniziale nr segnaco-
055200140624     A                                      llo')
055300140624     A                                      EDTCDE(4)
055400140624     A N42                                  DSPATR(CS)
055500140624     A  42                                  DSPATR(RI)
055600140624     A  42                                  DSPATR(PC)
055700140624     A                                 23110'0=nulla/1-20=Pos.Ini'
055800140624     A                                 24102'Znc '
055900140624     A            V3CZN1         2Y 0B 24107TEXT('Posizione iniziale zona nel s-
056000140624     A                                      egnacollo passatoci')
056100140624     A                                      EDTCDE(4)
056200140624     A                                      DSPATR(CS)
056300140624     A                                 24110'0=nulla/1-20=Pos.Ini'
056400140624     A                                 26  3'F3=Fine Lavoro'
056500140624     A                                 26 21'  F2=Note  '
056600140624     A  02                                  DSPATR(RI)
056700140624     A                                      COLOR(RED)
056800140624     A  04                             26 37'F5=Ripristino'
056900140624     A  06                             26 56'F6=Conferma'
057000140624     A N04N01                          26 73'F16=Annullamento'
057100140624     A                                 26 98'Enter=Avanzamento'
057200140624     A                                 26122'F12=Ritorno'
057300161013     A          R TC93D06
057400161013     A*%%TS  SD  20161013  154238  EDPAB       REL-V7R1M0  5770-WDS
057500161013     A                                      CA12
057600161013     A                                      CF02
057700161013     A N04N01                               CA16
057800161013     A  04                                  CF05
057900161013     A  06                                  CF06
058000161013     A          H                           HLPPNLGRP(H1CKEY TRTC93G)
058100161013     A                                      HLPARA(*FLD V6CKEY)
058200161013     A          H                           HLPPNLGRP(H6CSGN TRTC93G)
058300161013     A                                      HLPARA(*FLD V6CSGN)
058400161013     A          H                           HLPPNLGRP(H6CLAB TRTC93G)
058500161013     A                                      HLPARA(*FLD V6CLAB)
058600161013     A          H                           HLPPNLGRP(H6CCM1 TRTC93G)
058700161013     A                                      HLPARA(*FLD V6CCM1)
058800161013     A          H                           HLPPNLGRP(H6CNF1 TRTC93G)
058900161013     A                                      HLPARA(*FLD V6CNF1)
059000161013     A          H                           HLPPNLGRP(H6CRFF TRTC93G)
059100161013     A                                      HLPARA(*FLD V6CRFF)
059200161013     A          H                           HLPPNLGRP(H6CDET TRTC93G)
059300161013     A                                      HLPARA(*FLD V6CDET)
059400161013     A          H                           HLPPNLGRP(H6CEL2 TRTC93G)
059500161013     A                                      HLPARA(*FLD V6CEL2)
059600161013     A          H                           HLPPNLGRP(H6CLP2 TRTC93G)
059700161013     A                                      HLPARA(*FLD V6CLP2)
059800161013     A          H                           HLPPNLGRP(H6CLA2 TRTC93G)
059900161013     A                                      HLPARA(*FLD V6CLA2)
060000161013     A          H                           HLPPNLGRP(H6CNR2 TRTC93G)
060100161013     A                                      HLPARA(*FLD V6CNR2)
060200161013     A          H                           HLPPNLGRP(H6CSG2 TRTC93G)
060300161013     A                                      HLPARA(*FLD V6CSG2)
060400161013     A          H                           HLPPNLGRP(H6CZN2 TRTC93G)
060500161013     A                                      HLPARA(*FLD V6CZN2)
060600161013     A  28        $MSG          70   M
060700161013     A            RSUT          20A  O  1  3
060800161013     A  02                              1 31'*-NOTE-*'
060900161013     A                                      DSPATR(RI)
061000161013     A                                      COLOR(RED)
061100161013     A            V6CSGN         1A  B  1 44TEXT('Ricalcolo nr.segnacollo')
061200161013     A                                      VALUES('S' ' ')
061300161013     A                                      DSPATR(ND)
061400161013     A                                      DSPATR(PR)
061500161013     A                                  1 49'** Manutenzione Tabelle Partner **'
061600161013     A                                      DSPATR(RI)
061700161013     A  01                              1 89'INSERIMENTO'
061800161013     A N01                              1 89'MANUTENZIONE'
061900161013     A            V6CPGM        10A  O  1111
062000161013     A                                  1124DATE
062100161013     A                                      EDTCDE(Y)
062200161013     A            KNSIF         10A  O  2  2
062300161013     A            KNMUS         10A  O  2 13
062400161013     A                                  2 50' D O W N L O A D '
062500161013     A                                      DSPATR(RI)
062600161013     A                                      DSPATR(HI)
062700161013     A                                  2 68'Delivery Date'
062800161013     A                                      DSPATR(UL)
062900161013     A                                      DSPATR(HI)
063000161013     A  04                              2111' ANNULLATO '
063100161013     A                                      DSPATR(RI)
063200161013     A                                  2124TIME
063300161013     A                                  4  7'Id.Partner(UNB)'
063400161013     A                                      DSPATR(HI)
063500161013     A            V6CKEY        35A  O  4 23TEXT('Identificativo partner')
063600161013     A                                  6  2' Invio DATE di CONSEGNA su IMPORT -
063700161013     A                                      del CLIENTE '
063800161013     A                                      DSPATR(HI)
063900161013     A                                      DSPATR(RI)
064000161013     A                                  6 51'IFTSTA (784)'
064100161013     A                                      DSPATR(HI)
064200161013     A                                  6 73'Invio Codici STATUS'
064300161013     A                                      DSPATR(HI)
064400161013     A                                  6 93'Alternativi'
064500161013     A                                      DSPATR(HI)
064600161013     A  51                                  DSPATR(RI)
064700161013     A            V6CLAB         1A  B  6105TEXT('Numero Foglio viaggio da rito-
064800161013     A                                      rnare')
064900161013     A                                      VALUES('S' ' ')
065000161013     A                                      DSPATR(CS)
065100161013     A                                  6107'Blk=N/S'
065200161013     A                                      DSPATR(HI)
065300161013     A                                  6115'(Lista Labarta)'
065400161013     A                                  8  2'Numero CMR'
065500161013     A            V6CCM1         1A  B  8 18TEXT('Numero CMR da ritornare')
065600161013     A                                      VALUES('S' ' ')
065700161013     A N43                                  DSPATR(CS)
065800161013     A  43                                  DSPATR(RI)
065900161013     A  43                                  DSPATR(PC)
066000161013     A                                  8 20'Blk=N/S'
066100161013     A                                  8 28'(RFF1153-1154)'
066200161013     A                                  9  2'Foglio Viaggio'
066300161013     A            V6CNF1         1A  B  9 18TEXT('Numero Foglio viaggio da rito-
066400161013     A                                      rnare')
066500161013     A                                      VALUES('S' ' ')
066600161013     A N44                                  DSPATR(CS)
066700161013     A  44                                  DSPATR(RI)
066800161013     A  44                                  DSPATR(PC)
066900161013     A                                  9 20'Blk=N/S'
067000161013     A                                  9 28'(RFF1153-1154)'
067100161013     A                                 10  2'Rif.dett.Sped.'
067200161013     A            V6CRFF         1A  B 10 18TEXT('Numero Foglio viaggio da rito-
067300161013     A                                      rnare')
067400161013     A                                      VALUES('C' ' ')
067500161013     A                                      DSPATR(CS)
067600161013     A                                 10 20'Blk=N.Sped.Ptn/C=N.CMR-AFB'
067700161013     A                                 10 48'(RFF1153-1154)'
067800161013     A                                 11  2'Invers.Riferim.'
067900161013     A            V6CTRD         1A  B 11 18TEXT('Inverte il dato del CNI con q-
068000161013     A                                      uello AGE')
068100161013     A                                      VALUES('S' ' ')
068200161013     A                                      DSPATR(CS)
068300161013     A                                 11 20'Blk=N/S'
068400161013     A                                 11 29'Inverte il riferimento del CNI con-
068500161013     A                                       quello del AGE'
068600161013     A                                 12  2'Rifer.Numerico'
068700161013     A            V6CRMN         1A  B 12 18TEXT('prende il RMN invece del RMA')
068800161013     A                                      VALUES('S' ' ')
068900161013     A                                      DSPATR(CS)
069000161013     A                                 12 20'Blk=N/S'
069100161013     A                                 12 29'Al posto del rifer.Alfanumerico ne-
069200161013     A                                      ll AGE'
069300161013     A                                 13  2'Date con orario'
069400161013     A            V6C203         1A  B 13 18TEXT('Inverte il dato del CNI con q-
069500161013     A                                      uello AGE')
069600161013     A                                      VALUES('S' ' ')
069700161013     A                                      DSPATR(CS)
069800161013     A                                 13 20'Blk=N/S'
069900161013     A                                 13 29'Invia le date forzatamente con ora-
070000161013     A                                       e minuti'
070100161013     A                                 14  2'Nome Firmatario'
070200161013     A            V6CFIRMA       1A  B 14 18TEXT('Nome Firmatario alla consegna-
070300161013     A                                      ')
070400161013     A                                      DSPATR(CS)
070500161013     A                                      VALUES('S' ' ' 'N')
070600161013     A                                 14 20'Blk=S/N'
070700161013     A                                 14 29'Invia NAD+AP:nome di chi ha ricevu-
070800161013     A                                      to la merce'
070900161013     A                                 15  2'Appunt/Superm.'
071000161013     A            V6CAPP         1A  B 15 18TEXT('Nome Firmatario alla consegna-
071100161013     A                                      ')
071200161013     A                                      DSPATR(CS)
071300161013     A                                      VALUES('S' ' ' 'N')
071400161013     A                                 15 20'Blk=S/N'
071500161013     A                                 15 29'N=NON inviare lo stato 20/210 gene-
071600161013     A                                      rato sul MIC e sulla Consegna'
071700161013     A                                 16  2'Invio Rif.Num.'
071800161013     A            V6CRCU         1A  B 16 18TEXT('Invia RFF+CU oltre a AGE su I-
071900161013     A                                      FTSTA dal numerico')
072000161013     A                                      DSPATR(CS)
072100161013     A                                      VALUES('S' ' ' 'N')
072200161013     A                                 16 20'Blk=N/S'
072300161013     A                                 16 29'S=Aggiunge  RFF+CU al RFF+AGE'
072400161013     A                                 17  2'FTX e NAD+AP..'
072500161013     A            V6FTXNAD       1A  B 17 18TEXT('Invia FTX prima del NAD come -
072600161013     A                                      da STANDARD EDIFACT')
072700161013     A                                      DSPATR(CS)
072800161013     A                                      VALUES('S' ' ' 'N')
072900161013     A                                 17 20'Blk=N/S'
073000161013     A                                 17 29'S=mette in sequenza STANDARD FTX e-
073100161013     A                                       NAD (Prima FTX)'
073200161013     A                                 18  2'NAD+CN destin.'
073300161013     A            V6NADCN        1A  B 18 18TEXT('Invia FTX prima del NAD come -
073400161013     A                                      da STANDARD EDIFACT')
073500161013     A                                      DSPATR(CS)
073600161013     A                                      VALUES('S' ' ' 'N')
073700161013     A                                 18 20'Blk=N/S'
073800161013     A                                 18 29'S=Invia la Ragione Sociale del Des-
073900161013     A                                      tinatario'
074000161013     A                                 18 73'-->'
074100161013     A                                      DSPATR(HI)
074200161013     A                                 18 77'Solo su STS di Consegna.....'
074300161013     A            V6CNSU21       1A  B 18107TEXT('Invia FTX prima del NAD come -
074400161013     A                                      da STANDARD EDIFACT')
074500161013     A                                      DSPATR(CS)
074600161013     A                                      VALUES('S' ' ' 'N')
074700161013     A                                 18110'Blk=N/S'
074800161013     A                                 19102'Posizioni Barcode Disk B    '
074900161013     A                                      DSPATR(UL)
075000161013     A                                 20102'Lnp'
075100161013     A            V6CLP2         2Y 0B 20107TEXT('Posizione iniziale lnp nel se-
075200161013     A                                      gnacollo passatoci')
075300161013     A                                      EDTCDE(4)
075400161013     A                                      DSPATR(CS)
075500161013     A  40                                  DSPATR(RI)
075600161013     A                                 20110'0=nulla/1-20=Pos.Ini'
075700161013     A                                 21102'Lna'
075800161013     A            V6CLA2         2Y 0B 21107TEXT('Posizione iniziale lnA nel se-
075900161013     A                                      gnacollo passatoci')
076000161013     A                                      EDTCDE(4)
076100161013     A                                      DSPATR(CS)
076200161013     A  40                                  DSPATR(RI)
076300161013     A                                 21110'0=nulla/1-20=Pos.Ini'
076400161013     A                                 22  2'Dett.Segnacolli'
076500161013     A            V6CDET         1A  B 22 18TEXT('Ritornare dettaglio segnacoll-
076600161013     A                                      i')
076700161013     A                                      VALUES('S' 'N' 'M')
076800161013     A N42                                  DSPATR(CS)
076900161013     A  42                                  DSPATR(RI)
077000161013     A  42                                  DSPATR(PC)
077100161013     A                                 22 20'N=Non Cons.Parz/S=Sempre/M=mai'
077200161013     A                                 22 51'(PCI7102)'
077300161013     A                                 22 61'Nr.elem.validi'
077400161013     A            V6CEL2         2Y 0B 22 76TEXT('Numero di elementi validi')
077500161013     A                                      EDTCDE(4)
077600161013     A                                      COMP(LE 10)
077700161013     A N45                                  DSPATR(CS)
077800161013     A  45                                  DSPATR(RI)
077900161013     A  45                                  DSPATR(PC)
078000161013     A                                 22 79'0/10'
078100161013     A                                 22102'Nrs'
078200161013     A            V6CNR2         2Y 0B 22107TEXT('Posizione iniziale nr.serie n-
078300161013     A                                      el segnacollo passato')
078400161013     A                                      EDTCDE(4)
078500161013     A                                      DSPATR(CS)
078600161013     A  40                                  DSPATR(RI)
078700161013     A                                 22110'0=nulla/1-20=Pos.Ini'
078800161013     A                                 23102'Sgn'
078900161013     A            V6CSG2         2Y 0B 23107TEXT('Posizione iniziale nr segnaco-
079000161013     A                                      llo')
079100161013     A                                      EDTCDE(4)
079200161013     A                                      DSPATR(CS)
079300161013     A  40                                  DSPATR(RI)
079400161013     A                                 23110'0=nulla/1-20=Pos.Ini'
079500161013     A                                 24102'Znc'
079600161013     A            V6CZN2         2Y 0B 24107TEXT('Posizione iniziale zona nel s-
079700161013     A                                      egnacollo passatoci')
079800161013     A                                      EDTCDE(4)
079900161013     A                                      DSPATR(CS)
080000161013     A  40                                  DSPATR(RI)
080100161013     A                                 24110'0=nulla/1-20=Pos.Ini'
080200161013     A                                 26  3'F3=Fine Lavoro'
080300161013     A                                 26 21'  F2=Note  '
080400161013     A  02                                  DSPATR(RI)
080500161013     A                                      COLOR(RED)
080600161013     A  04                             26 37'F5=Ripristino'
080700161013     A  06                             26 56'F6=Conferma'
080800161013     A N04N01                          26 73'F16=Annullamento'
080900161013     A                                 26 98'Enter=Avanzamento'
081000161013     A                                 26122'F12=Ritorno'
081100170412     A          R TC93D04
081200170412     A*%%TS  SD  20170412  165801  EDPAB       REL-V7R2M0  5770-WDS
081300170412     A                                      CA12
081400170412     A                                      CF02
081500170412     A N04N01                               CA16
081600170412     A  04                                  CF05
081700170412     A  06                                  CF06
081800170412     A          H                           HLPPNLGRP(H1CKEY TRTC93G)
081900170412     A                                      HLPARA(*FLD V4CKEY)
082000170412     A          H                           HLPPNLGRP(H4CCM2 TRTC93G)
082100170412     A                                      HLPARA(*FLD V4CCM2)
082200170412     A          H                           HLPPNLGRP(H4CSPC TRTC93G)
082300170412     A                                      HLPARA(*FLD V4CSPC)
082400170412     A          H                           HLPPNLGRP(H4CNF2 TRTC93G)
082500170412     A                                      HLPARA(*FLD V4CNF2)
082600170412     A          H                           HLPPNLGRP(H4VMAN TRTC93G)
082700170412     A                                      HLPARA(*FLD V4VMAN)
082800170412     A          H                           HLPPNLGRP(H4CLO1 TRTC93G)
082900170412     A                                      HLPARA(*FLD V4CLO1)
083000170412     A          H                           HLPPNLGRP(H4CLO2 TRTC93G)
083100170412     A                                      HLPARA(*FLD V4CLO2)
083200170412     A          H                           HLPPNLGRP(H4CISC TRTC93G)
083300170412     A                                      HLPARA(*FLD V4CISC)
083400170412     A          H                           HLPPNLGRP(H4CDT1 TRTC93G)
083500170412     A                                      HLPARA(*FLD V4CDT1)
083600170412     A          H                           HLPPNLGRP(H4CGGV TRTC93G)
083700170412     A                                      HLPARA(*FLD V4CGGV)
083800170412     A          H                           HLPPNLGRP(H4CEQD TRTC93G)
083900170412     A                                      HLPARA(*FLD V4CEQD)
084000170412     A          H                           HLPPNLGRP(H4CCN1 TRTC93G)
084100170412     A                                      HLPARA(*FLD V4CCN1)
084200170412     A          H                           HLPPNLGRP(H4CCN2 TRTC93G)
084300170412     A                                      HLPARA(*FLD V4CCN2)
084400170412     A          H                           HLPPNLGRP(H4CCN3 TRTC93G)
084500170412     A                                      HLPARA(*FLD V4CCN3)
084600170412     A          H                           HLPPNLGRP(H4CCN4 TRTC93G)
084700170412     A                                      HLPARA(*FLD V4CCN4)
084800170412     A          H                           HLPPNLGRP(H4CNSA TRTC93G)
084900170412     A                                      HLPARA(*FLD V4CNSA)
085000170412     A          H                           HLPPNLGRP(H4CSEC TRTC93G)
085100170412     A                                      HLPARA(*FLD V4CSEC)
085200170412     A          H                           HLPPNLGRP(H4CURESO TRTC93G)
085300170412     A                                      HLPARA(*FLD V4CURESO)
085400170412     A          H                           HLPPNLGRP(H4CUORM TRTC93G)
085500170412     A                                      HLPARA(*FLD V4CUORM)
085600170412     A          H                           HLPPNLGRP(H4CUTIPO TRTC93G)
085700170412     A                                      HLPARA(*FLD V4CUTIPO)
085800170412     A          H                           HLPPNLGRP(H4CUTIPR TRTC93G)
085900170412     A                                      HLPARA(*FLD V4CUTIPR)
086000170412     A          H                           HLPPNLGRP(H4CUQUR TRTC93G)
086100170412     A                                      HLPARA(*FLD V4CUQUR)
086200170412     A          H                           HLPPNLGRP(H4CUQUO TRTC93G)
086300170412     A                                      HLPARA(*FLD V4CUQUO)
086400170412     A          H                           HLPPNLGRP(H4CAGE TRTC93G)
086500170412     A                                      HLPARA(*FLD V4CAGE)
086600170412     A          H                           HLPPNLGRP(H4CVOL TRTC93G)
086700170412     A                                      HLPARA(*FLD V4CVOL)
086800170412     A          H                           HLPPNLGRP(H4CFTT TRTC93G)
086900170412     A                                      HLPARA(*FLD V4CFTT)
087000170412     A  28        $MSG          70   M
087100170412     A            RSUT          20A  O  1  3
087200170412     A  02                              1 31'*-NOTE-*'
087300170412     A                                      DSPATR(RI)
087400170412     A                                      COLOR(RED)
087500170412     A                                  1 49'** Manutenzione Tabelle Partner **'
087600170412     A                                      DSPATR(RI)
087700170412     A  01                              1 89'INSERIMENTO'
087800170412     A N01                              1 89'MANUTENZIONE'
087900170412     A            V4CPGM        10A  O  1111
088000170412     A                                  1124DATE
088100170412     A                                      EDTCDE(Y)
088200170412     A            KNSIF         10A  O  2  2
088300170412     A            KNMUS         10A  O  2 13
088400170412     A                                  2 52' D O W N L O A D   MANIFEST '
088500170412     A                                      DSPATR(RI)
088600170412     A                                      DSPATR(HI)
088700170412     A  04                              2111' ANNULLATO '
088800170412     A                                      DSPATR(RI)
088900170412     A                                  2124TIME
089000170412     A                                  4  8'Id.Partner UNB'
089100170412     A                                      DSPATR(HI)
089200170412     A            V4CKEY        35A  O  4 26TEXT('Identificativo partner')
089300170412     A                                  5102'___ Tipo Trsm/Stampa ____'
089400170412     A                                      DSPATR(RI)
089500170412     A                                  6  5' Invio MANIFEST al PARTNER <ns.EXP-
089600170412     A                                      ORT>    '
089700170412     A                                      DSPATR(HI)
089800170412     A                                      DSPATR(RI)
089900170412     A                                  6 49'IFCSUM (785)'
090000170412     A                                      DSPATR(HI)
090100170412     A                                  6102'|'
090200170412     A                                      DSPATR(RI)
090300170412     A                                  6126'|'
090400170412     A                                      DSPATR(RI)
090500170412     A                                  7  6'Data partenza'
090600170412     A            V4CDT1         1A  B  7 26TEXT('Trasmissione punto di partenz-
090700170412     A                                      a S/N')
090800170412     A                                      DSPATR(CS)
090900170412     A                                      VALUES('S' 'N')
091000170412     A                                      DSPATR(MDT)
091100170412     A                                  7 28'S/N'
091200170412     A                                  7 32'(DTM2005-2380)'
091300170412     A                                  7 47'gg.Viaggio'
091400170412     A            V4CGGV         2Y 0B  7 58EDTCDE(2)
091500170412     A                                      DSPATR(CS)
091600170412     A                                      CHECK(RZ)
091700170412     A                                      DSPATR(MDT)
091800170412     A                                  7 64'Punto di part.'
091900170412     A            V4CLO1         1A  B  7 80TEXT('Trasmissione punto di partenz-
092000170412     A                                      a S/N')
092100170412     A                                      DSPATR(CS)
092200170412     A                                      VALUES('S' 'N')
092300170412     A                                      DSPATR(MDT)
092400170412     A                                  7 82'S/N'
092500170412     A                                  7 86'(LOC3227-3225)'
092600170412     A                                  7102'|'
092700170412     A                                      DSPATR(RI)
092800170412     A            V4CFTT         1A  B  7104TEXT('Tipo trasmissione stampa boll-
092900170412     A                                      e')
093000170412     A                                      DSPATR(CS)
093100170412     A                                      DSPATR(MDT)
093200170412     A                                      VALUES(' ' 'W' 'Z' 'D' 'M' 'P' 'S' -
093300170412     A                                      'N')
093400170412     A                                  7106'(blk/M/W/Z/D/P/S/N)'
093500170412     A                                  7126'|'
093600170412     A                                      DSPATR(RI)
093700170412     A                                  8  6'Numero CMR'
093800170412     A            V4CCM2         1A  B  8 26TEXT('Trasmissione a Partner nr.CMR-
093900170412     A                                      ')
094000170412     A                                      DSPATR(CS)
094100170412     A                                      VALUES('S' 'N')
094200170412     A                                  8 28'S/N'
094300170412     A                                  8 32'(RFF1153-1154)'
094400170412     A                                  8 64'Punto di arrivo'
094500170412     A            V4CLO2         1A  B  8 80TEXT('Trasmissione punto di arrivo')
094600170412     A                                      DSPATR(CS)
094700170412     A                                      VALUES('S' 'N')
094800170412     A                                      DSPATR(MDT)
094900170412     A                                  8 82'S/N'
095000170412     A                                  8 86'(LOC3227-3225)'
095100170412     A                                  8102'|'
095200170412     A                                      DSPATR(RI)
095300170412     A                                  8126'|'
095400170412     A                                      DSPATR(RI)
095500170412     A                                  9  6'Foglio Viaggio'
095600170412     A            V4CNF2         1A  B  9 26TEXT('trasmissione a partner nr.fog-
095700170412     A                                      lio viaggio')
095800170412     A                                      DSPATR(CS)
095900170412     A                                      DSPATR(MDT)
096000170412     A                                      VALUES('S' 'N')
096100170412     A                                  9 28'S/N'
096200170412     A                                  9 32'(RFF1153-1154)'
096300170412     A                                  9 64'Tipo automezzo'
096400170412     A            V4CEQD         1A  B  9 80TEXT('Trasmissione punto di partenz-
096500170412     A                                      a S/N')
096600170412     A                                      DSPATR(CS)
096700170412     A                                      VALUES('S' 'N')
096800170412     A                                      DSPATR(MDT)
096900170412     A                                  9 82'S/N'
097000170412     A                                  9 86'(EQD8053-8260)'
097100170412     A                                  9102'|'
097200170412     A                                      DSPATR(RI)
097300170412     A                                  9104'Blk=Stampa'
097400170412     A                                  9126'|'
097500170412     A                                      DSPATR(RI)
097600170412     A                                 10  6'Tot.Spedizioni'
097700170412     A            V4CCN1         1A  B 10 26TEXT('trasmissione totale spedizion-
097800170412     A                                      i')
097900170412     A                                      DSPATR(CS)
098000170412     A                                      VALUES('S' 'N')
098100170412     A                                      DSPATR(MDT)
098200170412     A                                 10 28'S/N'
098300170412     A                                 10 32'(CNT6069-6066)'
098400170412     A                                 10102'|'
098500170412     A                                      DSPATR(RI)
098600170412     A                                 10104'M=tr.stp.Email no EDI'
098700170412     A                                 10126'|'
098800170412     A                                      DSPATR(RI)
098900170412     A                                 11  6'Tot.Colli'
099000170412     A            V4CCN2         1A  B 11 26TEXT('Trasmissione totale colli')
099100170412     A                                      DSPATR(CS)
099200170412     A                                      VALUES('S' 'N')
099300170412     A                                      DSPATR(MDT)
099400170412     A                                 11 28'S/N'
099500170412     A                                 11 32'(CNT6069-6066)'
099600170412     A                                 11 62'_______ TAB. Fuori Standard ______-
099700170412     A                                      ____'
099800170412     A                                      DSPATR(RI)
099900170412     A                                      DSPATR(UL)
100000170412     A                                 11102'|'
100100170412     A                                      DSPATR(RI)
100200170412     A                                 11104'W=EDI +        no stp'
100300170412     A                                 11126'|'
100400170412     A                                      DSPATR(RI)
100500170412     A                                 12  6'Tot.Peso Netto'
100600170412     A            V4CCN4         1A  B 12 26TEXT('Trasmissione totale peso nett-
100700170412     A                                      o')
100800170412     A                                      DSPATR(CS)
100900170412     A                                      DSPATR(MDT)
101000170412     A                                      VALUES('S' 'N')
101100170412     A                                 12 28'S/N'
101200170412     A                                 12 32'(CNT6069-6066)'
101300170412     A                                 12 62'|'
101400170412     A                                      DSPATR(RI)
101500170412     A                                 12 99'|'
101600170412     A                                      DSPATR(RI)
101700170412     A                                 12102'|'
101800170412     A                                      DSPATR(RI)
101900170412     A                                 12104'Z=EDI +        si stp'
102000170412     A                                 12126'|'
102100170412     A                                      DSPATR(RI)
102200170412     A                                 13  6'Tot.Peso Lordo'
102300170412     A            V4CCN3         1A  B 13 26TEXT('Trasmissione totale peso lord-
102400170412     A                                      o')
102500170412     A                                      DSPATR(CS)
102600170412     A                                      DSPATR(MDT)
102700170412     A                                      VALUES('S' 'N')
102800170412     A                                 13 28'S/N'
102900170412     A                                 13 32'(CNT6069-6066)'
103000170412     A                                 13 62'|'
103100170412     A                                      DSPATR(RI)
103200170412     A                                 13 64' Suff. x cod.Tab fuori STANDARD'
103300170412     A  59                                  COLOR(RED)
103400170412     A  59                                  DSPATR(RI)
103500170412     A            V4SUFTB        2A  B 13 96
103600170412     A N59                                  DSPATR(CS)
103700170412     A  59                                  COLOR(RED)
103800170412     A                                 13 99'|'
103900170412     A                                      DSPATR(RI)
104000170412     A                                 13102'|'
104100170412     A                                      DSPATR(RI)
104200170412     A                                 13104'D=Fedex(PC file)'
104300170412     A                                 13126'|'
104400170412     A                                      DSPATR(RI)
104500170412     A                                 14  6'Fa anche Fermo Dep.'
104600170412     A            V4CGWC         1A  B 14 26TEXT('Trasmissione totale peso lord-
104700170412     A                                      o')
104800170412     A                                      DSPATR(CS)
104900170412     A                                      DSPATR(MDT)
105000170412     A                                      VALUES('S' 'N')
105100170412     A                                 14 28'S/N (TSR7085) GWC'
105200170412     A                                 14 62'|'
105300170412     A                                      DSPATR(RI)
105400170412     A                                 14 99'|'
105500170412     A                                      DSPATR(RI)
105600170412     A                                 14102'|'
105700170412     A                                      DSPATR(RI)
105800170412     A                                 14104'P=Scan DPD +   no stp'
105900170412     A                                 14126'|'
106000170412     A                                      DSPATR(RI)
106100170412     A                                 15  6'Sped.con Secolo'
106200170412     A            V4CSEC         1A  B 15 26TEXT('Impostare secolo in nr.spediz-
106300170412     A                                      ione')
106400170412     A                                      DSPATR(CS)
106500170412     A                                      DSPATR(MDT)
106600170412     A                                      VALUES('S' 'N')
106700170412     A                                 15 28'S/N'
106800170412     A                                 15 32'(CNI1004)'
106900170412     A                                 15 62'+_________________________________-
107000170412     A                                      ___+'
107100170412     A                                      DSPATR(RI)
107200170412     A                                 15102'|'
107300170412     A                                      DSPATR(RI)
107400170412     A                                 15104'S=EDI+ScanDPD+ no stp'
107500170412     A                                 15126'|'
107600170412     A                                      DSPATR(RI)
107700170412     A                                 16  6'Nr.Sped. RFF+AGE'
107800170412     A            V4CNSA         1A  B 16 26TEXT('Numero spedizione in Agent s -
107900170412     A                                      Ref.')
108000170412     A                                      DSPATR(CS)
108100170412     A                                      DSPATR(MDT)
108200170412     A                                      VALUES('S' 'N')
108300170412     A                                 16 28'S/N'
108400170412     A                                 16 32'(RFF1154)'
108500170412     A                                 16 42'Nr.char'
108600170412     A            V4CAGE         2Y 0B 16 51DSPATR(CS)
108700170412     A                                      EDTCDE(2)
108800170412     A                                 16 54'in AGE'
108900170412     A                                 16102'|'
109000170412     A                                      DSPATR(RI)
109100170412     A                                 16104'N=NEE(GEL) +   si stp'
109200170412     A                                 16126'|'
109300170412     A                                      DSPATR(RI)
109400170412     A                                 17  6'x Reso Rif.Pt.Orig'
109500170412     A            V4CURESO       1A  B 17 26TEXT('Sostituire il RFF+CU ?')
109600170412     A                                      DSPATR(CS)
109700170412     A                                      DSPATR(MDT)
109800170412     A                                      VALUES('S' 'N')
109900170412     A                                 17 28'S/N'
110000170412     A                                 17 32'(RFF1153)'
110100170412     A                                 17 42'Sostit.RFF+CU con RFF+'
110200170412     A            V4CUQUR        3A  B 17 65TEXT('Qualificatore al posto del CU-
110300170412     A                                      ')
110400170412     A                                      DSPATR(CS)
110500170412     A                                 17 69'Tipo Rif.'
110600170412     A            V4CUTIPR       1A  B 17 79TEXT('ALFA/NUMERICO')
110700170412     A                                      DSPATR(CS)
110800170412     A                                      VALUES(' ' 'N')
110900170412     A                                 17 81'*blk=Alfa/N=Numerico'
111000170412     A                                 17102'|'
111100170412     A                                      DSPATR(RI)
111200170412     A                                 17126'|'
111300170412     A                                      DSPATR(RI)
111400170412     A                                 18  6'x ORM  Rif.Pt.Orig'
111500170412     A            V4CUORM        1A  B 18 26TEXT('Sostituire il RFF+CU ?')
111600170412     A                                      DSPATR(CS)
111700170412     A                                      DSPATR(MDT)
111800170412     A                                      VALUES('S' 'N')
111900170412     A                                 18 28'S/N'
112000170412     A                                 18 32'(RFF1153)'
112100170412     A                                 18 42'Sostit.RFF+CU con RFF+'
112200170412     A            V4CUQUO        3A  B 18 65TEXT('Qualificatore al posto del CU-
112300170412     A                                      ')
112400170412     A                                      DSPATR(CS)
112500170412     A                                 18 69'Tipo Rif.'
112600170412     A            V4CUTIPO       1A  B 18 79TEXT('ALFA/NUMERICO')
112700170412     A                                      DSPATR(CS)
112800170412     A                                      VALUES(' ' 'N')
112900170412     A                                 18 81'*blk=Alfa/N=Numerico'
113000170412     A                                 18102'+_______________________+'
113100170412     A                                      DSPATR(RI)
113200170412     A                                 19  6'Predict/ALERT Mail'
113300170412     A            V4SALERT       1A  B 19 26TEXT('Invio Ind.Mail o num.cell x S-
113400170412     A                                      MS  Alert consegna')
113500170412     A                                      DSPATR(CS)
113600170412     A                                      DSPATR(MDT)
113700170412     A                                      VALUES('S' 'N')
113800170412     A                                 19 28'S/N'
113900170412     A                                 19 32'(FTX+EML o FTX+SMS..)'
114000170412     A                                 20  6'Natura Merce'
114100170412     A            V4FTXAAA       1A  B 20 26TEXT('Invio Natura Merce (Free Text-
114200170412     A                                       + AAA)')
114300170412     A                                      DSPATR(CS)
114400170412     A                                      DSPATR(MDT)
114500170412     A                                      VALUES('S' ' ' 'N')
114600170412     A                                 20 28'S/N'
114700170412     A                                 20 32'(FTX+AAA...)'
114800170412     A                                 21  6'Vol.Dett.Sped.'
114900170412     A            V4CVOL         1A  B 21 26TEXT('Impostare secolo in nr.spediz-
115000170412     A                                      ione')
115100170412     A                                      DSPATR(CS)
115200170412     A                                      DSPATR(MDT)
115300170412     A                                      VALUES('S' 'N')
115400170412     A                                 21 28'S/N'
115500170412     A                                 21 32'(MEA6311-6314)'
115600170412     A                                 21101'Stampa NSped Compatto'
115700170412     A            V4CSPC         1A  B 21123TEXT('Impostare secolo in nr.spediz-
115800170412     A                                      ione')
115900170412     A                                      DSPATR(CS)
116000170412     A                                      DSPATR(MDT)
116100170412     A                                      VALUES('S' 'N')
116200170412     A                                 21125'S/N'
116300170412     A                                 22  6'Invio Qual.Colli'
116400170412     A            V4QUAPCI       3A  B 22 26TEXT('Qualificatore segmPCI su IFCS-
116500170412     A                                      UM download')
116600170412     A                                      DSPATR(CS)
116700170412     A                                      DSPATR(MDT)
116800170412     A                                 22 32'(PCI+xxx+..)'
116900170412     A                                 22101'Stampa  Vol.su MANTOT'
117000170412     A            V4VMAN         1A  B 22123TEXT('Stampa il Volume sul MANTOT')
117100170412     A                                      DSPATR(CS)
117200170412     A                                      DSPATR(MDT)
117300170412     A                                      VALUES('S' 'N' ' ')
117400170412     A                                 22125'S/N'
117500170412     A                                 23  6'Quanti BCode x PCI'
117600170412     A            V4XSEG         2A  B 23 26TEXT('Qualificatore segmPCI su IFCS-
117700170412     A                                      UM download')
117800170412     A                                      DSPATR(CS)
117900170412     A                                      DSPATR(MDT)
118000170412     A                                      CHECK(RZ)
118100170412     A                                      VALUES('  ' '01' '02' '03' '04' '05-
118200170412     A                                      ' '06' '07' '08' '09' '10')
118300170412     A                                 23 32'(PCI) da 1 a 10 max. x segmento'
118400170412     A                                 23 83'Invio dettaglio sped.'
118500170412     A                                 23105'a sped.completata'
118600170412     A            V4CISC         1A  B 23123TEXT('Invio dettaglio a Sped.Comple-
118700170412     A                                      ta')
118800170412     A                                      DSPATR(CS)
118900170412     A                                      DSPATR(MDT)
119000170412     A                                      VALUES('S' ' ')
119100170412     A                                 23125'*blk/S'
119200170412     A                                 26  3'F3=Fine Lavoro'
119300170412     A                                 26 21'  F2=Note  '
119400170412     A  02                                  DSPATR(RI)
119500170412     A                                      COLOR(RED)
119600170412     A  04                             26 37'F5=Ripristino'
119700170412     A  06                             26 56'F6=Conferma'
119800170412     A N04N01                          26 73'F16=Annullamento'
119900170412     A                                 26 98'Enter=Avanzamento'
120000170412     A                                 26122'F12=Ritorno'
120100120116     A          R TC93D07
120200120116     A*%%TS  SD  20120116  100622  EDPAB       REL-V6R1M0  5761-WDS
120300120116     A                                      CA12
120400120116     A                                      CF02
120500120116     A N04N01                               CA16
120600120116     A  04                                  CF05
120700130515     A  06                                  CF06
120800120116     A          H                           HLPPNLGRP(H1CKEY TRTC93G)
120900120116     A                                      HLPARA(*FLD V7CKEY)
121000120116     A          H                           HLPPNLGRP(H7CSGN TRTC93G)
121100120116     A                                      HLPARA(*FLD V7CSGN)
121200120116     A          H                           HLPPNLGRP(H7CDTA TRTC93G)
121300120116     A                                      HLPARA(*FLD V7CDTA)
121400120116     A          H                           HLPPNLGRP(H7CECC TRTC93G)
121500120116     A                                      HLPARA(*FLD V7CECC)
121600120116     A          H                           HLPPNLGRP(H7CDTB TRTC93G)
121700120116     A                                      HLPARA(*FLD V7CDTB)
121800120116     A          H                           HLPPNLGRP(H7CSGD TRTC93G)
121900120116     A                                      HLPARA(*FLD V7CSGD)
122000120116     A          H                           HLPPNLGRP(H7CATR TRTC93G)
122100120116     A                                      HLPARA(*FLD V7CATR)
122200120116     A          H                           HLPPNLGRP(H7CCNVSTS TRTC93G)
122300120116     A                                      HLPARA(*FLD V7CCNVSTS)
122400120116     A          H                           HLPPNLGRP(H7CIDENT TRTC93G)
122500120116     A                                      HLPARA(*FLD V7CIDENT)
122600120116     A  28        $MSG          70   M
122700120116     A            RSUT          20A  O  1  2
122800120116     A  02                              1 31'*-NOTE-*'
122900120116     A                                      DSPATR(RI)
123000120116     A                                      COLOR(RED)
123100120116     A            V7CSGN         1A  B  1 43TEXT('Ricalcolo nr.segnacollo')
123200120116     A                                      VALUES('S' ' ')
123300120116     A                                      DSPATR(ND)
123400120116     A                                      DSPATR(PR)
123500120116     A                                  1 49'** Manutenzione Tabelle Partner **'
123600120116     A                                      DSPATR(RI)
123700120116     A  01                              1 89'INSERIMENTO'
123800120116     A N01                              1 89'MANUTENZIONE'
123900120116     A            V7CPGM        10A  O  1111
124000120116     A                                  1124DATE
124100120116     A                                      EDTCDE(Y)
124200120116     A            KNSIF         10A  O  2  2
124300120116     A            KNMUS         10A  O  2 13
124400120116     A  04                              2111'ANNULLATO'
124500120116     A                                      DSPATR(RI)
124600120116     A                                  2124TIME
124700120116     A                                  4  7'Id.Partner(UNB)'
124800120116     A                                      DSPATR(HI)
124900120116     A            V7CKEY        35A  O  4 24TEXT('Identificativo partner')
125000120116     A                                  6 21'Arrival Trip Report'
125100120116     A                                      DSPATR(UL)
125200120116     A                                  6 42' IFTSTA ATR (781) '
125300120116     A                                      DSPATR(RI)
125400120116     A                                  7  2' D O W N L O A D '
125500120116     A                                      DSPATR(RI)
125600120116     A                                      DSPATR(HI)
125700120116     A                                  7 21' Invio DATE di ARRIVO merce al Cli-
125800120116     A                                      ente  <su NOSTRO IMPORT> '
125900120116     A                                      DSPATR(HI)
126000120116     A                                  7 81'Date Arrivo in Filiale:'
126100120116     A            V7CDTA         1A  B  7105TEXT('Numero CMR da ritornare')
126200120116     A                                      VALUES('S' ' ')
126300120116     A N40                                  DSPATR(CS)
126400120116     A  40                                  DSPATR(RI)
126500120116     A  40                                  DSPATR(PC)
126600120116     A                                  7108'blk=No/S=Si'
126700120116     A                                  8 76'Rilevare le Eccedenze......:'
126800120116     A            V7CECC         1A  B  8105TEXT('Numero CMR da ritornare')
126900120116     A                                      VALUES('S' ' ')
127000120116     A N41                                  DSPATR(CS)
127100120116     A  41                                  DSPATR(RI)
127200120116     A  41                                  DSPATR(PC)
127300120116     A                                  8108'blk=No/S=Si'
127400120116     A                                  9 76'Quali Spedizioni trasmettere'
127500120116     A            V7CDTB         1A  B  9105TEXT('Numero CMR da ritornare')
127600120116     A                                      VALUES('E' ' ')
127700120116     A N42                                  DSPATR(CS)
127800120116     A  42                                  DSPATR(RI)
127900120116     A  42                                  DSPATR(PC)
128000120116     A                                  9108'blk=Solo Negat/E=Entrambe'
128100120116     A                                 10 76'Con Dettaglio Segnacolli...:'
128200120116     A            V7CSGD         1A  B 10105TEXT('Numero CMR da ritornare')
128300120116     A N43                                  DSPATR(CS)
128400120116     A  43                                  DSPATR(RI)
128500120116     A  43                                  DSPATR(PC)
128600120116     A                                      VALUES('S' 'N' 'M')
128700120116     A                                 10108'N=Negativi/S=Sempre/M=Mai'
128800120116     A                                 11 21'Arrival Trip Report'
128900120116     A                                      DSPATR(UL)
129000120116     A                                 11 42' IFTSTA ATR (781) '
129100120116     A                                      DSPATR(RI)
129200120116     A                                 12  6' U P L O A D '
129300120116     A                                      DSPATR(RI)
129400120116     A                                      DSPATR(HI)
129500120116     A                                 12 22'Ricezione DATE ARRIVO merce dal Pa-
129600120116     A                                      rtner <su NOSTRO EXPORT>'
129700120116     A                                      DSPATR(HI)
129800120116     A                                 12 85'Attivare Ricezione:'
129900120116     A            V7CATR         1A  B 12105TEXT('Numero CMR da ritornare')
130000120116     A                                      VALUES('S' ' ')
130100120116     A N41                                  DSPATR(CS)
130200120116     A  41                                  DSPATR(RI)
130300120116     A  41                                  DSPATR(PC)
130400120116     A                                 12108'blk=No/S=Si'
130500120116     A                                 13  2'__________________________________-
130600120116     A                                      ___________________________________-
130700120116     A                                      ___________________________________-
130800120116     A                                      __________________________'
130900120116     A                                      DSPATR(UL)
131000120116     A                                 14  2'__________________________________-
131100120116     A                                      ___________________________________-
131200120116     A                                      ___________________________________-
131300120116     A                                      __________________________'
131400120116     A                                      DSPATR(UL)
131500120116     A                                      DSPATR(RI)
131600120116     A                                 16 29'     (File Codifica Conv. EDSTS00F-
131700120116     A                                      )                                  -
131800120116     A                                                '
131900120116     A                                      DSPATR(RI)
132000120116     A                                 17  2' RICEZ. STATUS fuori STD '
132100120116     A                                      DSPATR(RI)
132200120116     A N77                                  COLOR(WHT)
132300120116     A  77                                  COLOR(RED)
132400120116     A                                 17 29' '
132500120116     A                                      DSPATR(RI)
132600120116     A                                 17 31' Codifica particolare x STATUS ric-
132700120116     A                                      evuti dal Partner '
132800120116     A                                      DSPATR(UL)
132900120116     A                                      COLOR(RED)
133000120116     A                                 17 94' 784 e 781 '
133100120116     A                                      DSPATR(UL)
133200120116     A                                      COLOR(RED)
133300120116     A                                 17107' '
133400120116     A                                      DSPATR(RI)
133500120116     A                                 18  2'  IFTSTA  Consegne e ATR '
133600120116     A                                      DSPATR(RI)
133700120116     A N77                                  COLOR(WHT)
133800120116     A  77                                  COLOR(RED)
133900120116     A                                 18 29' '
134000120116     A                                      DSPATR(RI)
134100120116     A                                 18 35'Il Partner usa Codifica FUORI Stan-
134200120116     A                                      dard.:'
134300120116     A                                      DSPATR(HI)
134400120116     A            V7CCNVSTS      1A  B 18 77TEXT('ATTIVA CONVERSIONE STATUS')
134500120116     A                                      VALUES('S' ' ')
134600120116     A N41                                  DSPATR(CS)
134700120116     A  41                                  DSPATR(RI)
134800120116     A  41                                  DSPATR(PC)
134900120116     A                                 18 79'blk=No/S=Si'
135000120116     A N77                                  COLOR(WHT)
135100120116     A  77                                  COLOR(RED)
135200120116     A                                 18107' '
135300120116     A                                      DSPATR(RI)
135400120116     A                                 19 29' '
135500120116     A                                      DSPATR(RI)
135600120116     A                                 19107' '
135700120116     A                                      DSPATR(RI)
135800120116     A                                 20 29' '
135900120116     A                                      DSPATR(RI)
136000120116     A                                 20 38'Codice Identif.Codifica.:'
136100120116     A                                      DSPATR(HI)
136200120116     A            V7CIDENT      10A  B 20 64DSPATR(CS)
136300120116     A                                 20 77'blk=Dft -> UNB del Partner'
136400120116     A                                      DSPATR(HI)
136500120116     A                                 20107' '
136600120116     A                                      DSPATR(RI)
136700120116     A                                 21 29' '
136800120116     A                                      DSPATR(RI)
136900120116     A                                 21 43'(con un Codice Identificativo part-
137000120116     A                                      icolare si può Codificare'
137100120116     A                                 21107' '
137200120116     A                                      DSPATR(RI)
137300120116     A                                 22 29' '
137400120116     A                                      DSPATR(RI)
137500120116     A                                 22 44'un tipo di conversione Condivisibi-
137600120116     A                                      le su più UNB Partner)'
137700120116     A                                 22107' '
137800120116     A                                      DSPATR(RI)
137900120116     A                                 23 29' '
138000120116     A                                      DSPATR(RI)
138100120116     A                                 23107' '
138200120116     A                                      DSPATR(RI)
138300120116     A                                 24 29'                                  -
138400120116     A                                                                         -
138500120116     A                                                '
138600120116     A                                      DSPATR(RI)
138700120116     A                                 26  2'F3=Fine Lavoro'
138800120116     A                                 26 21'  F2=Note  '
138900120116     A  02                                  DSPATR(RI)
139000120116     A                                      COLOR(RED)
139100120116     A  04                             26 37'F5=Ripristino'
139200130515     A  06                             26 56'F6=Conferma'
139300120116     A N04N01                          26 73'F16=Annullamento'
139400120116     A                                 26 98'Enter=Avanzamento'
139500120116     A                                 26122'F12=Ritorno'
139600120116     A          R TC93D08
139700120116     A*%%TS  SD  20120116  100622  EDPAB       REL-V6R1M0  5761-WDS
139800120116     A                                      CA12
139900120116     A                                      CF02
140000120116     A N04N01                               CA16
140100120116     A  04                                  CF05
140200130515     A  06                                  CF06
140300120116     A          H                           HLPPNLGRP(H1CKEY TRTC93G)
140400120116     A                                      HLPARA(*FLD V8CKEY)
140500120116     A          H                           HLPPNLGRP(H8CRCU TRTC93G)
140600120116     A                                      HLPARA(*FLD V8CRCU)
140700120116     A          H                           HLPPNLGRP(H8CRFF TRTC93G)
140800120116     A                                      HLPARA(*FLD V8CRFF)
140900120116     A          H                           HLPPNLGRP(H8CRFS TRTC93G)
141000120116     A                                      HLPARA(*FLD V8CRFS)
141100120116     A          H                           HLPPNLGRP(H8CRSE TRTC93G)
141200120116     A                                      HLPARA(*FLD V8CRSE)
141300120116     A          H                           HLPPNLGRP(H8CPES TRTC93G)
141400120116     A                                      HLPARA(*FLD V8CPES)
141500120116     A          H                           HLPPNLGRP(H8CCOL TRTC93G)
141600120116     A                                      HLPARA(*FLD V8CCOL)
141700120116     A          H                           HLPPNLGRP(H8CSIN TRTC93G)
141800120116     A                                      HLPARA(*FLD V8CSIN)
141900120116     A          H                           HLPPNLGRP(H8CSIN TRTC93G)
142000120116     A                                      HLPARA(*FLD V8CICN)
142100120116     A          H                           HLPPNLGRP(H8C2IN TRTC93G)
142200120116     A                                      HLPARA(*FLD V8C2IN)
142300120116     A          H                           HLPPNLGRP(H8CINV TRTC93G)
142400120116     A                                      HLPARA(*FLD V8CINV)
142500120116     A          H                           HLPPNLGRP(H8EMAI TRTC93G)
142600120116     A                                      HLPARA(*FLD V8EMAI)
142700120116     A  28        $MSG          70   M
142800120116     A            RSUT          20A  O  1  3
142900120117     A  02                              1 31'*-NOTE-*'
143000120116     A                                      DSPATR(RI)
143100120116     A                                      COLOR(RED)
143200120116     A                                  1 49'** Manutenzione Tabelle Partner **'
143300120116     A                                      DSPATR(RI)
143400120116     A  01                              1 89'INSERIMENTO'
143500120116     A N01                              1 89'MANUTENZIONE'
143600120116     A            V8CPGM        10A  O  1111
143700120116     A                                  1124DATE
143800120116     A                                      EDTCDE(Y)
143900120116     A            KNSIF         10A  O  2  2
144000120116     A            KNMUS         10A  O  2 13
144100120116     A  04                              2111' ANNULLATO '
144200120116     A                                      DSPATR(RI)
144300120116     A                                  2124TIME
144400120116     A                                  4  7'Id.Partner(UNB)'
144500120116     A                                      DSPATR(HI)
144600120116     A            V8CKEY        35A  O  4 24TEXT('Identificativo partner')
144700120116     A                                  7  2' U P L O A D  IFCSUM D96A        '
144800120116     A                                      DSPATR(HI)
144900120116     A                                      DSPATR(RI)
145000120116     A                                  7 36'  IMPORT dal Cliente    <Ricezione-
145100120116     A                                       File Spedizioni>  VERSIONE std.96 '
145200120116     A                                      DSPATR(HI)
145300120116     A                                      DSPATR(RI)
145400120116     A                                  8  7'CNI: Forza in RMN il nr.CNI:'
145500120116     A            V8CCNI         1A  B  8 36DSPATR(CS)
145600120116     A                                      VALUES('N' 'S' ' ')
145700120116     A                                  8 40'(*blk=No/S=Si)'
145800120116     A                                  8 56'Prevale su altri rifer.'
145900120116     A                                  9  7'RFF: Rifer.Spediz.Num......:'
146000120116     A            V8CRCU         3A  B  9 36DSPATR(CS)
146100120116     A                                  9 40'(CU)'
146200120116     A                                 10  7'RFF: Rifer.Spediz.Alfa.....:'
146300120116     A            V8CRFF         3A  B 10 36DSPATR(CS)
146400120116     A                                 10 40'(AGE)'
146500120116     A                                 11  7'RFF: su 1°Collo da GID.....:'
146600120116     A            V8CRFS         1A  B 11 36DSPATR(CS)
146700120116     A                                      VALUES('N' 'S' ' ')
146800120116     A                                 11 40'(*blk=No/S=Si)'
146900120116     A                                 12  7'RFF: su colli seguenti GID.:'
147000120116     A            V8CRSE         1A  B 12 36DSPATR(CS)
147100120116     A                                      VALUES('N' 'S' ' ')
147200120116     A                                 12 40'(*blk=No/S=Si)'
147300120116     A                                 12 55'(su VABRMO x stamparli)'
147400120116     A                                 13  7'CNT: Peso testa Dett.Sped..:'
147500120116     A            V8CPES         1A  B 13 36DSPATR(CS)
147600120116     A                                      VALUES('N' 'S' ' ')
147700120116     A                                 13 40'(*blk=No/S=Si)'
147800120116     A                                 13 55'(*blk somma singoli colli MEA)'
147900120116     A                                 14  7'CNT: Colli testa Dett.Sped.:'
148000120116     A            V8CCOL         1A  B 14 36DSPATR(CS)
148100120116     A                                      VALUES('N' 'S' ' ')
148200120116     A                                 14 40'(*blk=No/S=Si)'
148300120116     A                                 14 55'(*blk somma singoli colli GID)'
148400120116     A                                 15  7'FTX: Tipi Testo sulle note.:'
148500120116     A            V8CSIN         3A  B 15 36DSPATR(CS)
148600120116     A                                 15 40'(SIN)'
148700120116     A            V8CICN         3A  B 15 48DSPATR(CS)
148800120116     A                                 15 52'(ICN)'
148900120116     A                                 16  7'NAD: 2°Indir.dopo 1°Indir..:'
149000120116     A            V8C2IN         1A  B 16 36DSPATR(CS)
149100120116     A                                      VALUES('N' 'S' ' ')
149200120116     A                                 16 40'(*blk=No/S=Si)'
149300120116     A                                 16 55'(*blk dopo Città)'
149400120116     A                                 20  2'__________________________________-
149500120116     A                                      ___________________________________-
149600120116     A                                      ___________________________________-
149700120116     A                                      __________________________'
149800120116     A                                      DSPATR(UL)
149900120116     A                                 21  2'__________________________________-
150000120116     A                                      ___________________________________-
150100120116     A                                      ___________________________________-
150200120116     A                                      __________________________'
150300120116     A                                      DSPATR(UL)
150400120116     A                                      DSPATR(RI)
150500120116     A                                 23  2' Invio MAIL DI ALERT '
150600120116     A                                      DSPATR(RI)
150700120116     A                                      DSPATR(HI)
150800120116     A                                 23 24'durante la TRADUZIONE dei MESSAGGI'
150900120116     A                                 23 60'[separare indirizzi con (;)]'
151000120116     A                                 24  8'Invia Mail..:'
151100120116     A                                      DSPATR(HI)
151200120116     A            V8CINV         1A  B 24 22DSPATR(CS)
151300120116     A                                      VALUES('N' 'S' ' ')
151400120116     A                                 24 24'blk=No/S=Si'
151500120116     A                                 24 38'Indirizzi...:'
151600120116     A                                      DSPATR(HI)
151700120116     A            V8EMAI        44A  B 24 52
151800120116     A N41                                  DSPATR(CS)
151900120116     A  41                                  DSPATR(RI)
152000120116     A  41                                  DSPATR(PC)
152100120116     A                                 24 97'@Bartolini.it'
152200120116     A                                 26  3'F3=Fine Lavoro'
152300120116     A                                 26 21'  F2=Note  '
152400120116     A  02                                  DSPATR(RI)
152500120116     A                                      COLOR(RED)
152600120116     A  04                             26 37'F5=Ripristino'
152700130515     A  06                             26 56'F6=Conferma'
152800120116     A N04N01                          26 73'F16=Annullamento'
152900120116     A                                 26 98'Enter=Avanzamento'
153000120116     A                                 26122'F12=Ritorno'
153100141114     A          R TC93PTN
153200141114     A*%%TS  SD  20141114  165028  EDPAB       REL-V7R1M0  5770-WDS
153300141114     A                                      CA12
153400141114     A                                      CF02
153500141114     A N04N01                               CA16
153600141114     A  04                                  CF05
153700141114     A  06                                  CF06
153800141114     A  28        $MSG          70   M
153900141114     A            RSUT          20A  O  1  2
154000141114     A  02                              1 31'*-NOTE-*'
154100141114     A                                      DSPATR(RI)
154200141114     A                                      COLOR(RED)
154300141114     A                                  1 50'* Manutenzione Tabelle Partner *'
154400141114     A                                      DSPATR(UL)
154500141114     A                                      DSPATR(RI)
154600141114     A  01                              1 89'INSERIMENTO'
154700141114     A N01                              1 89'MANUTENZIONE'
154800141114     A            VPTNPGM       10A  O  1111
154900141114     A                                  1124DATE
155000141114     A                                      EDTCDE(Y)
155100141114     A            KNSIF         10A  O  2  2
155200141114     A            KNMUS         10A  O  2 13
155300141114     A  04                              2111' ANNULLATO '
155400141114     A                                      DSPATR(RI)
155500141114     A                                  2124TIME
155600141114     A                                  4  7'Id.Partner(UNB)'
155700141114     A                                      DSPATR(HI)
155800141114     A            VPTNUNB       35A  O  4 24TEXT('Identificativo partner')
155900141114     A                                  4 63'Da Confermare da CMR'
156000141114     A                                      DSPATR(HI)
156100141114     A            VPTNCMR        2A  O  4 85DSPATR(RI)
156200141114     A                                  4 97'Unificante su cui Trasmettere'
156300141114     A                                      DSPATR(HI)
156400141114     A                                  5 14'Cliente'
156500141114     A                                      DSPATR(HI)
156600141114     A            VPTNCLI        7S 0O  5 24
156700141114     A                                  5 97'il MANIFEST (gli stati con 3k)'
156800141114     A                                      DSPATR(HI)
156900141114     A                                  6104' Cod.connex.  Server  '
157000141114     A                                      DSPATR(UL)
157100141114     A                                      DSPATR(RI)
157200141114     A                                  7 88' FTP_Clienti x trasmissioni   '
157300141114     A                                      DSPATR(RI)
157400141114     A                                      DSPATR(HI)
157500141114     A            VPTCONNEX      7Y 0B  7119DSPATR(HI)
157600141114     A                                      EDTCDE(Z)
157700141114     A                                      DSPATR(CS)
157800141114     A  53                                  ERRMSG('Manca il Codice di trasmiss-
157900141114     A                                      ione !!' 53)
158000141114     A                                  8 88' Impostare(S) x attivare trsm.'
158100141114     A                                      DSPATR(HI)
158200141114     A                                      DSPATR(RI)
158300141114     A            VPTXXX         1A  B  8119DSPATR(CS)
158400141114     A                                      DSPATR(HI)
158500141114     A                                      VALUES('S' ' ')
158600141114     A                                  8121'S/*blk'
158700141114     A                                      DSPATR(HI)
158800141114     A                                      DSPATR(RI)
158900141114     A                                  9  3' Contatti di Riferimento '
159000141114     A                                      DSPATR(HI)
159100141114     A                                      DSPATR(RI)
159200141114     A                                  9 89'(Utilizzato come UNIFICANTE di trs-
159300141114     A                                      m.)'
159400141114     A                                 10  4'Commerciale'
159500141114     A            VPTNCOM       40A  B 10 16DSPATR(CS)
159600141114     A                                 10 57'(ha attivato il traffico)'
159700141114     A                                 11  5'E-mail Cli'
159800141114     A            VPTNMAIL      40A  B 11 16DSPATR(CS)
159900141114     A                                 11 57'(da conttattare x EDI)'
160000141114     A                                 11 88'   Per generare gli stati di conse-
160100141114     A                                      gna   '
160200141114     A                                      DSPATR(RI)
160300141114     A                                      DSPATR(UL)
160400141114     A                                 12 88' '
160500141114     A                                      DSPATR(RI)
160600141114     A                                 12 90'Sulla 3K l''unificante è....:'
160700141114     A            VPT_3KKSU      7S 0O 12119DSPATR(HI)
160800141114     A                                 12127' '
160900141114     A                                      DSPATR(RI)
161000141114     A                                 13 88'                                  -
161100141114     A                                            '
161200141114     A                                      DSPATR(RI)
161300141114     A                                 15  5'Rx=Ricez.'
161400141114     A                                      DSPATR(UL)
161500141114     A                                 15 23' Dati RIEPILOGATIVI trasmissione/t-
161600141114     A                                      raduzione messaggi '
161700141114     A                                      DSPATR(HI)
161800141114     A                                      DSPATR(RI)
161900141114     A                                 15 90'Attenzione: in traduzione del msg -
162000141114     A                                      EDI'
162100141114     A                                      DSPATR(HI)
162200141114     A N66                                  DSPATR(ND)
162300141114     A                                 16  8'Tx=Trasm.'
162400141114     A                                      DSPATR(UL)
162500141114     A                                 16 90'vi sono particolarità su Segmenti/-
162600141114     A                                      qua'
162700141114     A                                      DSPATR(HI)
162800141114     A N66                                  DSPATR(ND)
162900141114     A                                 17 18'File Versione'
163000141114     A                                 17 43'pgm traduzione'
163100141114     A                                 17 62'tipo trasmissione'
163200141114     A                                 17 90'lificatori definiti nel EDSTBL00F -
163300141114     A                                      per'
163400141114     A                                      DSPATR(HI)
163500141114     A N66                                  DSPATR(ND)
163600141114     A                                 18  5'Rx'
163700141114     A                                      DSPATR(HI)
163800141114     A                                 18 10'Bolle'
163900141114     A            VRCZFB         6A  B 18 16DSPATR(CS)
164000141114     A  41                                  ERRMSG('Identificativo non presente-
164100141114     A                                       in tabella.' 41)
164200141114     A            ORCZFB        18A  O 18 23
164300141114     A            VRCZPB         6A  B 18 43DSPATR(CS)
164400141114     A  45                                  ERRMSG('Identificativo non presente-
164500141114     A                                       in tabella.' 45)
164600141114     A            ORCZPB        10A  O 18 50
164700141114     A            VRCZTB         6A  B 18 62DSPATR(CS)
164800141114     A  49                                  ERRMSG('Identificativo non presente-
164900141114     A                                       in tabella.' 49)
165000141114     A            ORCZTB        15A  O 18 69
165100141114     A                                 18 90'tradurre delle parti fuori Standar-
165200141114     A                                      d.'
165300141114     A                                      DSPATR(HI)
165400141114     A N66                                  DSPATR(ND)
165500141114     A                                 19  7'Tx'
165600141114     A                                      DSPATR(HI)
165700141114     A                                 19 10'Stati'
165800141114     A            VTRSFS         6A  B 19 16DSPATR(CS)
165900141114     A  44                                  ERRMSG('Identificativo non presente-
166000141114     A                                       in tabella.' 44)
166100141114     A            OTRSFS        18A  O 19 23
166200141114     A            VTRSPS         6A  B 19 43DSPATR(CS)
166300141114     A  48                                  ERRMSG('Identificativo non presente-
166400141114     A                                       in tabella.' 48)
166500141114     A            OTRSPS        10A  O 19 50
166600141114     A            VTRSTS         6A  B 19 62DSPATR(CS)
166700141114     A  52                                  ERRMSG('Identificativo non presente-
166800141114     A                                       in tabella.' 52)
166900141114     A            OTRSTS        15A  O 19 69
167000141114     A                                 20  7'Tx'
167100141114     A                                      DSPATR(HI)
167200141114     A                                 20 10'ORM'
167300141114     A            VTRSFO         6A  B 20 16DSPATR(CS)
167400141114     A  55                                  ERRMSG('Identificativo non presente-
167500141114     A                                       in tabella.' 55)
167600141114     A            OTRSFO        18A  O 20 23
167700141114     A            VTRSPO         6A  B 20 43DSPATR(CS)
167800141114     A  59                                  ERRMSG('Identificativo non presente-
167900141114     A                                       in tabella.' 59)
168000141114     A            OTRSPO        10A  O 20 50
168100141114     A            VTRSTO         6A  B 20 62DSPATR(CS)
168200141114     A  57                                  ERRMSG('Identificativo non presente-
168300141114     A                                       in tabella.' 57)
168400141114     A            OTRSTO        15A  O 20 69
168500141114     A                                 20 91'SND Lista ORM Parallela'
168600141114     A            VPOSNDPRTF     1A  B 20116DSPATR(CS)
168700141114     A  60                                  ERRMSG('Non è attivo alcun tradutto-
168800141114     A                                      re x invio File' 60)
168900141114     A                                      VALUES(' ' 'S')
169000141114     A                                 20119'*blk/S'
169100141114     A                                 21 95'come verifica al File inviato'
169200141114     A                                 22  7'Tx'
169300141114     A                                      DSPATR(HI)
169400141114     A                                 22 10'Bolle'
169500141114     A            VTRSFB         6A  B 22 16DSPATR(CS)
169600141114     A  42                                  ERRMSG('Identificativo non presente-
169700141114     A                                       in tabella.' 42)
169800141114     A            OTRSFB        18A  O 22 23
169900141114     A            VTRSPB         6A  B 22 43DSPATR(CS)
170000141114     A  46                                  ERRMSG('Identificativo non presente-
170100141114     A                                       in tabella.' 46)
170200141114     A            OTRSPB        10A  O 22 50
170300141114     A            VTRSTB         6A  B 22 62DSPATR(CS)
170400141114     A  50                                  ERRMSG('Identificativo non presente-
170500141114     A                                       in tabella.' 50)
170600141114     A            OTRSTB        15A  O 22 69
170700141114     A                                 23  5'Rx'
170800141114     A                                      DSPATR(HI)
170900141114     A                                 23 10'Stati'
171000141114     A            VRCZFS         6A  B 23 16DSPATR(CS)
171100141114     A  43                                  ERRMSG('Identificativo non presente-
171200141114     A                                       in tabella.' 43)
171300141114     A            ORCZFS        18A  O 23 23
171400141114     A            VRCZPS         6A  B 23 43DSPATR(CS)
171500141114     A  47                                  ERRMSG('Identificativo non presente-
171600141114     A                                       in tabella.' 47)
171700141114     A            ORCZPS        10A  O 23 50
171800141114     A            VRCZTS         6A  B 23 62DSPATR(CS)
171900141114     A  51                                  ERRMSG('Identificativo non presente-
172000141114     A                                       in tabella.' 51)
172100141114     A            ORCZTS        15A  O 23 69
172200141114     A                                 24  5'Rx'
172300141114     A                                      DSPATR(HI)
172400141114     A                                 24 10'ORM'
172500141114     A            VRCZFO         6A  B 24 16DSPATR(CS)
172600141114     A  54                                  ERRMSG('Identificativo non presente-
172700141114     A                                       in tabella.' 54)
172800141114     A            ORCZFO        18A  O 24 23
172900141114     A            VRCZPO         6A  B 24 43DSPATR(CS)
173000141114     A  58                                  ERRMSG('Identificativo non presente-
173100141114     A                                       in tabella.' 58)
173200141114     A            ORCZPO        10A  O 24 50
173300141114     A            VRCZTO         6A  B 24 62DSPATR(CS)
173400141114     A  56                                  ERRMSG('Identificativo non presente-
173500141114     A                                       in tabella.' 56)
173600141114     A            ORCZTO        15A  O 24 69
173700141114     A                                 26  3'F3=Fine Lavoro'
173800141114     A                                 26 21'  F2=Note  '
173900141114     A  02                                  DSPATR(RI)
174000141114     A                                      COLOR(RED)
174100141114     A  04                             26 37'F5=Ripristino'
174200141114     A  06                             26 56'F6=Conferma'
174300141114     A N04N01                          26 73'F16=Annullamento'
174400141114     A                                 26 98'Enter=Avanzamento'
174500141114     A                                 26122'F12=Ritorno'
174600120116     A          R TC93D05
174700120116     A*%%TS  SD  20120116  100622  EDPAB       REL-V6R1M0  5761-WDS
174800120116     A                                      CA12
174900120116     A                                      CF02
175000120116     A N04N01                               CA16
175100120116     A  04                                  CF05
175200120116     A                                      CF06
175300120116     A  08                                  CF08
175400120116     A          H                           HLPPNLGRP(H1CKEY TRTC93G)
175500120116     A                                      HLPARA(*FLD V5CKEY)
175600120116     A          H                           HLPPNLGRP(H5CFTT TRTC93G)
175700120116     A                                      HLPARA(*FLD V5CFTT)
175800120116     A          H                           HLPPNLGRP(H5CFLT TRTC93G)
175900120116     A                                      HLPARA(*FLD V5CFLT)
176000120116     A  28        $MSG          70   M
176100120116     A            RSUT          20A  O  1  3
176200120117     A  02                              1 31'*-NOTE-*'
176300120116     A                                      DSPATR(RI)
176400120116     A                                      COLOR(RED)
176500120116     A                                  1 49'** Manutenzione Tabelle Partner **'
176600120116     A                                      DSPATR(UL)
176700120116     A                                      DSPATR(RI)
176800120116     A  01                              1 89'INSERIMENTO'
176900120116     A N01                              1 89'MANUTENZIONE'
177000120116     A            V5CPGM        10A  O  1111
177100120116     A                                  1124DATE
177200120116     A                                      EDTCDE(Y)
177300120116     A            KNSIF         10A  O  2  2
177400120116     A            KNMUS         10A  O  2 13
177500120116     A  04                              2111' ANNULLATO '
177600120116     A                                      DSPATR(RI)
177700120116     A                                  2124TIME
177800120116     A                                  4  6'Id.Partner (UNB)'
177900120116     A                                      DSPATR(HI)
178000120116     A            V5CKEY        35A  O  4 24TEXT('Identificativo partner')
178100120116     A                                 11 34'        '
178200120116     A                                      DSPATR(RI)
178300120116     A                                 11 43'  T R A S M I S S I O N E     T A -
178400120116     A                                      B E L L A   '
178500120116     A                                      DSPATR(RI)
178600120116     A                                      DSPATR(HI)
178700120116     A                                 11 90'        '
178800120116     A                                      DSPATR(RI)
178900120116     A                                 12 33' '
179000120116     A                                      DSPATR(RI)
179100120116     A                                 12 98' '
179200120116     A                                      DSPATR(RI)
179300120116     A                                 13 33' '
179400120116     A                                      DSPATR(RI)
179500120116     A                                 13 98' '
179600120116     A                                      DSPATR(RI)
179700120116     A                                 14 33' '
179800120116     A                                      DSPATR(RI)
179900120116     A                                 14 38'Tipo trasmissione:'
180000120116     A            V5CFTT         1A  B 14 60TEXT('Trasmissione tabella PT')
180100120116     A                                      DSPATR(CS)
180200120116     A                                      VALUES(' ' '1' '2')
180300120116     A                                 14 64'blk=No/1=A tutti/2=Alla filiale'
180400120116     A                                 14 98' '
180500120116     A                                      DSPATR(RI)
180600120116     A                                 15 33' '
180700120116     A                                      DSPATR(RI)
180800120116     A                                 15 38'Codice filiale...:'
180900120116     A            V5CFLT         3Y 0B 15 58TEXT('Filiale a cui trasmettere')
181000120116     A                                      EDTCDE(4)
181100120116     A  40                                  DSPATR(RI)
181200120116     A N40                                  DSPATR(CS)
181300120116     A  40                                  DSPATR(PC)
181400120116     A                                 15 98' '
181500120116     A                                      DSPATR(RI)
181600120116     A                                 16 33' '
181700120116     A                                      DSPATR(RI)
181800120116     A                                 16 98' '
181900120116     A                                      DSPATR(RI)
182000120116     A                                 17 33' '
182100120116     A                                      DSPATR(RI)
182200120116     A                                 17 98' '
182300120116     A                                      DSPATR(RI)
182400120116     A                                 18 34'                                  -
182500120116     A                                                                    '
182600120116     A                                      DSPATR(RI)
182700120116     A                                 26  3'F3=Fine Lavoro'
182800120116     A                                 26 21'  F2=Note  '
182900120116     A  02                                  DSPATR(RI)
183000120116     A                                      COLOR(RED)
183100120116     A  04                             26 37'F5=Ripristino'
183200120116     A                                 26 56'F6=Conferma'
183300120116     A N04N01                          26 73'F16=Annullamento'
183400120116     A  08                             26 98' F8=Duplica UNB '
183500120116     A                                      DSPATR(RI)
183600120116     A                                 26122'F12=Ritorno'
183700070216     A          R TC93W01
183800070216     A*%%TS  SD  20070216  153856  EDPAB       REL-V5R3M0  5722-WDS
183900070216     A                                      CF06
184000070216     A                                      CA12
184100070216     A                                      OVERLAY
184200070216     A                                      WINDOW(4 5 15 65)
184300070216     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
184400070216     A                                          '))
184500070216     A                                  2  4' Duplica Tabella Partner '
184600070216     A                                      DSPATR(RI)
184700070216     A                                      DSPATR(HI)
184800070216     A                                  3  6'x Gestire una nuova Linea su un''a-
184900070216     A                                      ltra Nazione Mittente'
185000070216     A                                      DSPATR(UL)
185100070216     A                                      DSPATR(HI)
185200070216     A                                  6  4'UNB Partner'
185300070216     A                                      DSPATR(HI)
185400070216     A            W1UNB1        31A  O  6 18
185500070216     A            W1UNB2         4A  B  6 51DSPATR(CS)
185600070216     A  51                                  ERRMSG('Nazione/Partner già present-
185700070216     A                                      e' 51)
185800070216     A  53                                  ERRMSG('Inserire la Nazione Mittent-
185900070216     A                                      e x identificare nuovo UNB' 53)
186000070216     A                                  8 22'Cod.Cliente'
186100070216     A                                      DSPATR(HI)
186200070216     A            W1CKSC         7Y 0B  8 36DSPATR(CS)
186300070216     A                                      EDTCDE(Z)
186400070216     A                                  9 28'Linea'
186500070216     A                                      DSPATR(HI)
186600070216     A            W1CLNP         3Y 0B  9 36DSPATR(CS)
186700070216     A                                      EDTCDE(Z)
186800070216     A  52                                  ERRMSG('Linea già presente su altro-
186900070216     A                                       UNB' 52)
187000070216     A  55                                  ERRMSG('Linea di Partenza obbligato-
187100070216     A                                      ria' 55)
187200070216     A                                 10 26'Nazione'
187300070216     A                                      DSPATR(HI)
187400070216     A            W1CNAZ         3A  B 10 36DSPATR(CS)
187500070216     A  57                                  ERRMSG('Nazione obbligatoria' 57)
187600070216     A                                 14  4'F3=Fine'
187700070216     A                                 14 21'F6=Conferma duplica'
187800070216     A                                 14 52'F12=Annulla'
187900100205     A          R TC93W02
188000100205     A*%%TS  SD  20100205  114906  EDPAB       REL-V5R4M0  5722-WDS
188100100205     A                                      OVERLAY
188200100205     A                                      WINDOW(4 5 10 65)
188300100205     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
188400100205     A                                          '))
188500100205     A                                  2  4' x CAMBIO CODICE CLIENTE '
188600100205     A                                      DSPATR(RI)
188700100205     A                                      DSPATR(HI)
188800100205     A                                  3 16'  A  T  T  E  N  Z  I  O  N  E  '
188900100205     A                                      DSPATR(UL)
189000100205     A                                      DSPATR(HI)
189100100205     A                                  5  6' Bisogna ricordarsi di dare lo ste-
189200100205     A                                      sso codice nella '
189300100205     A                                      DSPATR(RI)
189400100205     A                                  6  6' Tabella 3K '
189500100205     A                                      DSPATR(RI)
189600100205     A                                      DSPATR(HI)
189700100205     A                                  6 19' al membro su cui generare i recor-
189800100205     A                                      ds  '
189900100205     A                                      DSPATR(RI)
190000100205     A                                  7  6' del TIVGD di tipo VC  .......  al-
190100100205     A                                      trimenti NON     '
190200100205     A                                      DSPATR(RI)
190300100205     A                                  8  6' saranno più inviati gli STATI di -
190400100205     A                                      Consegna !!!!!!! '
190500100205     A                                      DSPATR(RI)
190600110819     A          R TC93W03
190700110819     A*%%TS  SD  20110819  170253  EDPAB       REL-V6R1M0  5761-WDS
190800110819     A                                      WINDOW(4 5 10 65)
190900110819     A                                      OVERLAY
191000110819     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
191100110819     A                                          '))
191200110819     A                                  2  4' x i PARTNER occorre fare '
191300110819     A                                      DSPATR(RI)
191400110819     A                                      DSPATR(HI)
191500110819     A                                  3 16'  A  T  T  E  N  Z  I  O  N  E  '
191600110819     A                                      DSPATR(UL)
191700110819     A                                      DSPATR(HI)
191800110819     A                                  5  6' MANTENERE allineata la tabella de-
191900110819     A                                      i soli PARTNER   '
192000110819     A                                      DSPATR(RI)
192100110819     A                                  7  6' con decorrenze scadenze dei codic-
192200110819     A                                      i utilizzati !!! '
192300110819     A                                      DSPATR(RI)
192400110913     A**-------------------------------------------------------------**
192500110913     A          R TC93NOT
192600110913     A*%%TS  SD  20110913  171305  EDPAB       REL-V6R1M0  5761-WDS
192700110913     A                                      WINDOW(13 5 9 70)
192800110913     A                                      OVERLAY
192900110913     A                                      WDWBORDER((*COLOR RED) (*DSPATR RI)-
193000110913     A                                       (*CHAR '        '))
193100110913     A            NOTFREE       70A  O  2  1DSPATR(HI)
193200110913     A            NOT001        70A  B  3  1DSPATR(UL)
193300110913     A                                      CHECK(LC)
193400110913     A            NOT002        70A  B  4  1DSPATR(UL)
193500110913     A                                      CHECK(LC)
193600110913     A            NOT003        70A  B  5  1DSPATR(UL)
193700110913     A                                      CHECK(LC)
193800110913     A            NOT004        70A  B  6  1DSPATR(UL)
193900110913     A                                      CHECK(LC)
194000110913     A            NOT005        70A  B  7  1DSPATR(UL)
194100140429     A                                      CHECK(LC)
194200110913     A                                  8 54'Enter=Conferma'
194300110913     A                                      DSPATR(HI)
194400120116     A*--
194500120116     A*****-----  RSUT          20A  O  1  3
194600120116     A*****-----                        1 50'* Manutenzione Tabelle Partner *'
194700120116     A*****-----                            DSPATR(RI)
194800120116     A*****-----  V1CPGM        10A  O  1111
194900120116     A*****-----                        1124DATE
195000120116     A*****-----                            EDTCDE(Y)
195100120116     A*****-----  KNSIF         10A  O  2  2
195200120116     A*****-----  KNMUS         10A  O  2 13
195300120116     A*****-----                        2 50'*       E.D.I.  Estero         *'
195400120116     A*****-----                            DSPATR(UL)
195500120116     A*****-----                            DSPATR(RI)
195600120116     A*****-----                        2124TIME
195700120116     A*--
