000100040910             PGM        PARM(&KPJBA)
000200060119
000300040910             DCL        VAR(&KPJBA)  TYPE(*CHAR) LEN(502)
000400060119             DCL        VAR(&CLIU) TYPE(*CHAR) LEN(7)
000401101025             DCL        VAR(&reviS) TYPE(*CHAR) LEN(1)
000402101025             DCLF       FILE(QSYS/QAFDmbrl)
000404101025
000405101025             DSPFD      FILE(*LIBL/TIVAF00T) TYPE(*MBRLIST) +
000406101025                          OUTPUT(*OUTFILE) FILEATR(*PF) +
000407101025                          OUTFILE(QTEMP/§FPH)
000500040910
000600060119             CHGVAR     VAR(&CLIU) VALUE(%SST(&KPJBA 263 7))
000601101025             CHGVAR     VAR(&revis) VALUE(%SST(&KPJBA 270 1))
000700060119
000800101025             IF         COND(&revis *EQ ' ') THEN(DO)
000801101025
000802101025             OVRDBF     FILE(QAFDmbrl) TOFILE(QTEMP/§FPH)
000803101025
000804101025             IF         COND(&CLIU *EQ '0000000') THEN(DO)
000805101025READ:
000806101025             RCVF
000807101025             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDF))
000808101025
000809101026             IF         COND(&MLNAME *NE 'MREVISORI' *AND &MLNAME +
000810101026                          *NE '         ') THEN(DO)
000811101025
000900101025             RMVM       FILE(TIVAF01T) MBR(&MLNAME)
001000060119             MONMSG     MSGID(CPF0000)
001100101025             RMVM       FILE(TIVAF00T) MBR(&MLNAME)
001101101025             ENDDO
001201101025
001202101025             GOTO READ
001203101025
001204101025 ENDF:
001207101025
001208101025             ENDDO
001209101025             ENDDO
001210101025
001211101025
001212101025             IF         COND(&revis *EQ 'S') THEN(DO)
001213101026             RMVM       FILE(TIVAF00T) MBR(MREVISORI)
001214101025             MONMSG     MSGID(CPF0000)
001215101025             enddo
001300060119
001400040910             CALL       PGM(TRTC28R) PARM(&KPJBA)
001500000303
001600040910             ENDPGM
