000100960924     A*--------------------------------------------------------------*
000200020621     A*  RIGHE (D) DETAIL (93) MPS                                   *
000300960924     A*--------------------------------------------------------------*
000400020621      *    MULTICOLLO  (IN TESTATA C'È IL FIGLIO E QUI C'È IL MASTER)
000500020621     A          R TRTCF93D
000600020620      *
000700020621     A            F93MPS        12A         TEXT('MPS MASTER')
000800020621     A                                      COLHDG('MPS MASTER')
000900020621     A            F93FIL        98A         TEXT('FILLER')
001000020620     A                                      COLHDG('FILLER')
