000100960524     A*--------------------------------------------------------------*
000200050829     A*
000300960524     A*--------------------------------------------------------------*
000400111213     A          R TRTCT14R
000500050829     A            FLATREC     1950A         TEXT('RECORD FLAT FILE')
