000100960530      ***********************************************************************
000200130725      *   ESPORTA DATI BOLLE x DPD oltre gli SCAN  ESTERO    Export         *
000300130725      *     ?   - NUOVO TRACCIATO DPD -    ?
000400960530      ***********************************************************************
000500891004     H DECEDIT('0,') DATEDIT(*DMY/)
000600000207      *---------------------------------------------------------------------*
000700130828     FFNARB55L  iF   E           K DISK
000800000207      *---------------------------------------------------------------------*
000900000207      * Schiere
001000130828     D TRTC83        E DS                  EXTNAME(TRTC83DS1)
001100950428     D KPJBA         E DS
001200071213      *
001300020222     C*---------------------------------------------------------------------*
001400960530     C* Ciclo principale                                                   -*
001500960530     C*---------------------------------------------------------------------*
001600171108     c     Klinea195     klist
001700171108     c                   kfld                    linea195
001800130828     c                   kfld                    data0             8 0
001900130828      **
002000130828     C                   movel     'H'           flagHDE           1
002100130828     C                   clear                   KPJBU
002200130828     C                   call      'TRTC83R13'
002300130828     C                   PARM                    KPJBA
002400130828     C                   PARM                    flagHDE           1
002500130828      **
002600130828     c                   z-add     0             data0             8 0
002700171108     c                   z-add     195           linea195          3 0
002800171108     c     Klinea195     setll     fnarb55l
002900171108     c     Klinea195     reade     fnarb55l
003000130828      **
003100130828     c                   dow       not %Eof(fnarb55l)
003200130828     C                   movel     'D'           flagHDE           1
003300130828     C                   clear                   KPJBU
003400130828     c                   z-add     arbAAS        F83AAS
003500130828     c                   z-add     arbLNP        F83LNP
003600130828     c                   z-add     arbNRS        F83NRS
003700130828     c                   z-add     arbNSP        F83NSP
003800150617     c                   z-add     20150312      F83DFV
003900130828      *
004000130828     C                   movel     trtc83        kpjbu
004100130828     C                   call      'TRTC83R13'
004200010426     C                   PARM                    KPJBA
004300130826     C                   PARM                    flagHDE           1
004400130828      **
004500171108     c     Klinea195     reade     fnarb55l
004600130828     c                   enddo
004700130828      **
004800130828     C                   movel     'E'           flagHDE           1
004900130828     C                   clear                   KPJBU
005000130828     C                   call      'TRTC83R13'
005100130828     C                   PARM                    KPJBA
005200130828     C                   PARM                    flagHDE           1
005300130828      **
005400130828     c                   seton                                        LR
005500130826     C                   Return
005600130826     C*--------------------------------------------------------------*
