000100000000     H*--------------------------------------------------------------------------------------------*
000200120925     H* Pulizia archivio TIMAL10F - Log BartMailing
000300000000     H*--------------------------------------------------------------------------------------------*
000400000000     H DECEDIT('0,') DATEDIT(*DMY.)
000500000000     F*--------------------------------------------------------------------------------------------*
000600000000     F* Data base
000700000000     F*--------------------------------------------------------------------------------------------*
000800000000     C*--------------------------------------------------------------------------------------------*
000900000000     C* Main lines
001000000000     C*--------------------------------------------------------------------------------------------*
001100100202
001200100202     C*
001300100202     C* Definisco le opzioni con cui verranno d seguito utilizzate le istruzioni SQL
001400100202     C
001500100202     C/EXEC SQL
001600100202     C+ SET OPTION DYNUSRPRF = *OWNER, CLOSQLCSR = *ENDMOD
001700100202     C/END-EXEC
001800100202     C*
001900120925     C* Effettuo storicizzazione record d log (a stato OK)
002000120925     C* più vecchi d 6 mesi
002100100202     C/EXEC SQL
002200120925     C+  INSERT INTO TIMALSTO
002300120925     C+  SELECT * FROM timal10f
002400100202     C+  WHERE
002500150417     C+      date(maldaor) < curdate() - 8 month
002600100202     C+  and malsts = '1'
002700100202     C/END-EXEC
002800100202     C*
002900100202     C/EXEC SQL
003000120925     C+  DELETE FROM timal10f
003100100202     C+  WHERE
003200150417     C+      date(maldaor) < curdate() - 8 month
003300100202     C+  and malsts = '1'
003400100202     C/END-EXEC
003500100202     C*
003600040406     C                   SETON                                        LR
003700000000     C*
