000100960924     A*--------------------------------------------------------------*
000200030221     A*  RIGHE (D) DETAIL DI DETTAGLIO FATTURE     BOLLE FEDEX       *
000300960924     A*--------------------------------------------------------------*
000400020620      *
000500030303     A          R TRTCIDE1
000600020620      *
000700030303     A            DE1DET         1A         TEXT('DELIVERY -> D')
000800030303     A                                      COLHDG('DELIVERY')
000900030303     A            DE1SOF         2A         TEXT('SORT FIELD -> E1')
001000030221     A                                      COLHDG('SORT FIELD')
001100030303     A            DE1RID        10A         TEXT('RECORD ID -> PACKAGE')
001200030221     A                                      COLHDG('RECORD ID')
001300030303     A            DE1INN         9A         TEXT('INVOICE NR')
001400030221     A                                      COLHDG('INVOICE NR')
001500030303     A            DE1FL1         6A         TEXT('FILLER 1')
001600030221     A                                      COLHDG('FILLER 1')
001700030303     A            DE1TRN        12A         TEXT('TRACKING NR IDENTIFYING SHIP')
001800030221     A                                      COLHDG('TRACKING NR')
001900030303     A            DE1FL2         4A         TEXT('FILLER 2')
002000030221     A                                      COLHDG('FILLER 2')
002100030303      *-
002200030303     A            DE1PIE         5S 0       TEXT('NR.OF PIECES OF TRK.NBR.')
002300030303     A                                      COLHDG('NR.OF PIECES')
002400030303     A            DE1WEU         1A         TEXT('WEIGHT UNITS: -
002500030303     A                                      L=POUNDS -
002600030303     A                                      K=KILOGRAMS')
002700030303     A                                      COLHDG('WEIGHT UNITS')
002800030303     A            DE1BIW         7S 1       TEXT('BILLED WEIGHT')
002900030303     A                                      COLHDG('BILLED WEIGHT')
003000030303     A            DE1OPW         7S 1       TEXT('ORIGINAL PACKAGE WEIGHT')
003100030303     A                                      COLHDG('ORIGINAL PACK.WEIGHT')
003200030303     A            DE1DIL         3S 0       TEXT('DIM.LENGHT')
003300030303     A                                      COLHDG('DIM.LENGHT')
003400030303     A            DE1DIW         3S 0       TEXT('DIM.WIDHT')
003500030303     A                                      COLHDG('DIM.WIDHT')
003600030303     A            DE1DIH         3S 0       TEXT('DIM.HEIGHT')
003700030303     A                                      COLHDG('DIM.HEIGHT')
003800030303     A            DE1DIU         1A         TEXT('DIMENSION UNIT -
003900030303     A                                      I=INCHES -
004000030303     A                                      C=CENTIMETERS')
004100030303     A                                      COLHDG('DIMENSION UNIT')
004200030303     A            DE1DID         3S 0       TEXT('DIM.DIVISOR')
004300030303     A                                      COLHDG('DIM.DIVISOR')
004400030303     A            DE1DEV        15S 2       TEXT('DECLARED VALUE -
004500030303     A                                      ALWAIS POSITIVE')
004600030303     A                                      COLHDG('DECLARED VALUE')
004700030303     A            DE1CUV        15S 2       TEXT('CUSTOMS VALUE -
004800030303     A                                      ALWAIS POSITIVE')
004900030303     A                                      COLHDG('CUSTOMS VALUE')
005000030303     A            DE1CEN        15A         TEXT('CUSTOMS ENTRY NR -
005100030303     A                                      APPLICABLE FOR INT''I -
005200030303     A                                      DUTY/TAX ONLY')
005300030303     A                                      COLHDG('CUSTOMS ENTRY NR')
005400030303     A            DE1CDC         3A         TEXT('CURRENCY OF DV/CUSTOMS')
005500030303     A                                      COLHDG('CURRENCY')
005600030303     A            DE1DWF         1A         TEXT('DEFAULT WEIGHT FLAG: -
005700030303     A                                      Y=INDICATES DEFAULT WEIGHT WAS -
005800030303     A                                      APPLIED')
005900030303     A                                      COLHDG('DEF.WEIHT FLAG')
006000030303     A            DE1RTA        15S 2       TEXT('REVENUE THRESHOLD AMOUNT')
006100030303     A                                      COLHDG('REVENUE THRS AMOUNT')
006200030303     A            DE1CPN        25A         TEXT('CUSTOMER PO.NUMBER -
006300030303     A                                      (FOR GROUND SERVICE ONLY)')
006400030303     A                                      COLHDG('CUSTOMER PO.NR')
006500030303     A            DE1CDN        25A         TEXT('CUSTOMER DEPHT NUMBER -
006600030303     A                                      (FOR GROUND SERVICE ONLY)')
006700030303     A                                      COLHDG('CUSTOMER DEPHT NR')
006800030303     A            DE1CIN        25A         TEXT('CUSTOMER INVOICE NUMBER -
006900030303     A                                      (FOR GROUND SERVICE ONLY)')
007000030303     A                                      COLHDG('CUSTOMER INVOICE NR')
007100030303     A            DE1MUW         8A         TEXT('MULTIWEIGHT WEIGHT -
007200030303     A                                      (FOR GROUND SERVICE ONLY)')
007300030303     A                                      COLHDG('MULTIWEIGHT WEIGHT')
007400030303     A            DE1GTN        20A         TEXT('GROUND TRACKING NR -
007500030303     A                                      (FOR GROUND SERVICE ONLY)')
007600030303     A                                      COLHDG('GROUND TRACKING NR')
007700030303     A            DE1FWC         3A         TEXT('FISH & WILDLIFE CLEARENCE -
007800030303     A                                      PORT: (APPLICABLE TO CHARGE 352-> -
007900030303     A                                      TABLE 10)')
008000030303     A                                      COLHDG('FISH/WILDLIFE CLEAR')
008100030303     A            DE1CAL         3A         TEXT('CUSTOMS ADDITIONAL LINE -
008200030303     A                                      ITEMS (APPLICABLE TO CHARGE 350-> -
008300030303     A                                      TABLE 10)')
008400030303     A                                      COLHDG('CUSTOMS ADD. LINE')
