000100960924     A*--------------------------------------------------------------*
000200030221     A*  RIGHE (H) HEADER DI TESTATA FATTURA       BOLLE FEDEX       *
000300960924     A*--------------------------------------------------------------*
000400020620      *
000500030221     A          R TRTCIHA1
000600020620      *
000700030221     A            HA1HEA         1A         TEXT('HEADER -> H')
000800030221     A                                      COLHDG('HEADER')
000900030221     A            HA1SOF         2A         TEXT('SORT FIELD -> A1')
001000030221     A                                      COLHDG('SORT FIELD')
001100030221     A            HA1RID        10A         TEXT('RECORD ID -> INVOICE')
001200030221     A                                      COLHDG('RECORD ID')
001300030221     A            HA1INN         9A         TEXT('INVOICE NR')
001400030221     A                                      COLHDG('INVOICE NR')
001500030221     A            HA1FL1        22A         TEXT('FILLER 1')
001600030221     A                                      COLHDG('FILLER 1')
001700030221     A            HA1MEN         9A         TEXT('MASTER EDI NR ASSIGNED BY -
001800030221     A                                      FEDEX; NOT FOR SHIPPING')
001900030221     A                                      COLHDG('MASTER EDI NR')
002000030221     A            HA1FL2         3A         TEXT('FILLER 2')
002100030221     A                                      COLHDG('FILLER 2')
002200030221     A            HA1IND         8S 0       TEXT('INVOICE DATE YYYYMMDD')
002300030221     A                                      COLHDG('INVOICE DATE')
002400030221     A            HA1BAN         9A         TEXT('BILL-TO ACCOUNT NR')
002500030221     A                                      COLHDG('BILL-TO ACCOUNT NR')
002600030221     A            HA1FL3         3A         TEXT('FILLER 3')
002700030221     A                                      COLHDG('FILLER 3')
002800030221     A            HA1TIC        15S 2       TEXT('TOTALE INVOICE CHARGE')
002900030221     A                                      COLHDG('TOT INVOICE CHARGE')
003000030221     A            HA1CHS         1A         TEXT('CHARGE SIGN +/-')
003100030221     A                                      COLHDG('CHARGE SIGN')
003200030221     A            HA1CUC         3A         TEXT('CURRENCY CODE - BILLING -
003300030221     A                                      CURRENCY')
003400030221     A                                      COLHDG('CURRENCY CODE')
003500030221     A            HA1NTT         5S 0       TEXT('TOTAL NR. TRANSACTION ON THE -
003600030221     A                                      INVOICE')
003700030221     A                                      COLHDG('NR OF TRACK TRANS.')
003800030221     A            HA1GSA        25A         TEXT('GSA CONTRACT NR; APPLIES TO -
003900030221     A                                      U.S. GOVT.CUSTOMERS ONLY')
004000030221     A                                      COLHDG('GSA CONTRACT NR')
004100030221     A            HA1INT         1A         TEXT('INVOICE TYPE')
004200030221     A                                      COLHDG('INVOICE TYPE')
004300030221     A            HA1MC1         5A         TEXT('FOR FUTURE USE')
004400030221     A                                      COLHDG('INVOICE MSG CODE')
004500030221     A            HA1MC2         5A         TEXT('FOR FUTURE USE')
004600030221     A                                      COLHDG('INVOICE MSG CODE')
004700030221     A            HA1MC3         5A         TEXT('FOR FUTURE USE')
004800030221     A                                      COLHDG('INVOICE MSG CODE')
004900030221     A            HA1SEO         2A         TEXT('SETTLEMENT OPTION')
005000030221     A                                      COLHDG('SETTLEMENT OPTION')
005100030221     A            HA1FU1        32A         TEXT('FOR FEDEX USE ONLY')
005200030221     A                                      COLHDG('FOR FEDEX USE ONLY 1')
005300030221     A            HA1FU2         9A         TEXT('FOR FEDEX USE ONLY')
005400030221     A                                      COLHDG('FOR FEDEX USE ONLY 2')
005500030221     A            HA1FU3         2A         TEXT('FOR FEDEX USE ONLY')
005600030221     A                                      COLHDG('FOR FEDEX USE ONLY 3')
005700030221     A            HA1CSN        10A         TEXT('CUST.SERVICE NR; FOR -
005800030221     A                                      GROUND SERVICE ONLY')
005900030221     A                                      COLHDG('CUST.SERVICE NR')
006000030221     A            HA1FCC         3A         TEXT('100=EXPRESS ONLY -
006100030221     A                                            160=GROUND  ONLY -
006200030221     A                                            155=EXPRESS & GROUND INVOICE')
006300030221     A                                      COLHDG('FEDEX COMPANY CODE')
006400030221     A            HA1FL4        51A         TEXT('FILLER 4')
006500030221     A                                      COLHDG('FILLER 4')
