000100000000     A*--------------------------------------------------------------*
000200030401     A* FILE APPOGGIO X CVT. SPOOL IN FORMATO TXT *FCFC              *
000300000000     A*--------------------------------------------------------------*
000400030401     A          R TRTRCWWW                  TEXT('DATI SPOOL *FCFC')
000500030401     A            DATI         201A
