000100960924     A*--------------------------------------------------------------*
000200030221     A*  RIGHE (D) DETAIL DI DETTAGLIO FATTURE     BOLLE FEDEX       *
000300960924     A*--------------------------------------------------------------*
000400020620      *
000500030303     A          R TRTCIDZ1
000600020620      *
000700030303     A            DZ1DET         1A         TEXT('DELIVERY -> D')
000800030303     A                                      COLHDG('DELIVERY')
000900030303     A            DZ1SOF         2A         TEXT('SORT FIELD -> Z1')
001000030221     A                                      COLHDG('SORT FIELD')
001100030303     A            DZ1RID        10A         TEXT('RECORD ID -> TRAILER')
001200030221     A                                      COLHDG('RECORD ID')
001300030303     A            DZ1FL1        15A         TEXT('FILLER 1')
001400030303     A                                      COLHDG('FILLER 1')
001500030303     A            DZ1FL2        16A         TEXT('FILLER 2')
001600030303     A                                      COLHDG('FILLER 2')
001700030303     A            DZ1MEN         9A         TEXT('MASTER EDI NR')
001800030303     A                                      COLHDG('MASTER EDI NR')
001900030303     A            DZ1FL3         3A         TEXT('FILLER 3')
002000030303     A                                      COLHDG('FILLER 3')
002100030303     A            DZ1TIC         7S 0       TEXT('TOTAL INVOICE COUNT: TOTAL -
002200030303     A                                      NR OF INVOICE BILLED')
002300030303     A                                      COLHDG('TOTAL INVOICE COUNT')
002400030303     A            DZ1TTC         7S 0       TEXT('TOTAL TRANSACTION COUNT: -
002500030303     A                                      TOTAL NR OF TRACKING NUMBERS -
002600030303     A                                      BILLED')
002700030303     A                                      COLHDG('TOTAL TRANS.COUNT')
002800030303     A            DZ1TCD        15S 2       TEXT('TOTAL CHARGES DUE')
002900030303     A                                      COLHDG('TOTAL CHARGES DUE')
003000030303     A            DZ1CHS         1A         TEXT('CHARGE SIGN +/-')
003100030303     A                                      COLHDG('CHARGE SIGN')
003200030303     A            DZ1BCC         3A         TEXT('BILLED CURRENCY CODE')
003300030303     A                                      COLHDG('BILLED CURRENCY CODE')
003400030303     A            DZ1FL4       161A         TEXT('FILLER 4')
003500030303     A                                      COLHDG('FILLER 4')
003600030303      *---
