000100000000     H        1
000200000000     FQINLINE IP  F      80            DISK
000300000000     IQINLINE DD
000400000000     I                                        1  61 SNAPAR
000500000000     ISNAPAR    E DS
000600000000     C                     CALL 'SNARICCL'             55
000700000000     C                     PARM           SNAPAR
