000100960221     A*%%TS  SD  19960221  170127  EDPRE       REL-V2R3M0  5738-PW1
000200911217     A*  91/12/17  15:14:44    EDPDB       REL-R03M00  5728-PW1
000300960221     A*%%EC
000400960221     A                                      DSPSIZ(24 80 *DS3)
000500960221     A                                      REF(*LIBL/CNDIZION)
000600960221     A                                      CHGINPDFT
000700960221     A                                      MSGLOC(24)
000800960221     A                                      PRINT
000900960221     A                                      CA03
001000910918     A*  91/09/18  09:43:23    EDPDB       REL-R03M00  5728-PW1
001100960221     A          R R800D01
001200960221     A*%%TS  SD  19960221  170127  EDPRE       REL-V2R3M0  5738-PW1
001300960221     A                                      CF06
001400960221     A                                      CF21
001500960221     A            RSUT          20A  O  1  2
001600960221     A                                  1 25'* STAMPA RELAZIONI AZIONI/MENU''*'
001700960221     A                                      DSPATR(RI)
001800960221     A            NOMPGM        10A  O  1 62
001900960221     A                                  1 73DATE
002000960221     A                                      EDTCDE(Y)
002100960221     A            KNSIF         10A  O  2  2
002200960221     A            KNMUS         10A  O  2 13
002300960221     A                                  2 25'* --> MENU'' PRINCIPALE/PROFILO *'
002400960221     A                                      DSPATR(RI)
002500960221     A                                      DSPATR(UL)
002600960221     A                                  2 73TIME
002700960221     A                                 10 26'Codice Azione.........:'
002800960221     A            V1CAZN         4A  B 10 50TEXT('Codice Azione')
002900960221     A N40                                  DSPATR(CS)
003000960221     A N40                                  DSPATR(HI)
003100960221     A  40                                  DSPATR(RI)
003200960221     A  40                                  DSPATR(PC)
003300960221     A                                 14 26'Codice Menù...........:'
003400960221     A            V1CMNU         4A  B 14 50TEXT('Codice Menù')
003500960221     A N41                                  DSPATR(CS)
003600960221     A N41                                  DSPATR(HI)
003700960221     A  41                                  DSPATR(RI)
003800960221     A  41                                  DSPATR(PC)
003900960221     A                                 23  2'                                  -
004000960221     A                                                                         -
004100960221     A                                               '
004200960221     A                                      DSPATR(UL)
004300960221     A                                 24  2'F3=Fine Lavoro'
004400960221     A                                 24 33'F6=Conferma'
004500960221     A                                 24 67'F21=Pe.Batch.'
004600960221     A  28        $MSG          70   M      TEXT('Campo per visualizzazione mes-
004700960221     A                                      saggi di errore')
