000001070418     A*%%***********************************************************************
000002070418     A*%%TS  RD  20070418  142416  EDPMB       REL-V5R3M0  5722-WDS
000003070418     A*%%FI+10661100000110011110100000000000000000000000000000000000
000004070418     A*%%FI       0000000000000000000000000000000000000000000000000
000005070418     A*%%***********************************************************************
000006070418     A*  STAMPA STATISTICA ORM
000007070418     A*  LISTA DI CONTROLLO
000008070418     A*
000009070418     A*
000010070418      * ?  S E L E Z I O N I  D I  S T A M P A  ?
000011070418     A          R OR41S1C
000012070418     A*%%***********************************************************************
000013070418     A*%%RI 00000
000014070418     A*%%FS 001
000015070418     A*%%***********************************************************************
000016070418     A                                      SKIPB(002)
000017070418     A                                      SPACEA(002)
000018070418     A            RSUT          20A        1
000019070418     A                                    60
000020070418     A                                      'S T A T I S T I C A    O. R. M.'
000021070418     A                                   106
000022070418     A                                      'FIOR41R'
000023070418     A            WDATE          8S 0    121
000024070418     A                                      EDTWRD('  /  /    ')
000025070418     A            KNSIF     R              1
000026070418     A                                      REFFLD(KNSIF KPJBA)
000027070418     A                                      SPACEB(001)
000028070418     A            KNMUS     R             12
000029070418     A                                      REFFLD(KNMUS KPJBA)
000030070418     A                                   +36
000031070418     A                                      'L I S T A   D I   C O N T R O L L -
000032070418     A                                      O'
000033070418     A            WORA           6S 0    121
000034070418     A                                      EDTWRD('  :  :  ')
000035070418     A                                   121
000036070418     A                                      'PAG.'
000037070418     A                                      SPACEB(001)
000038070418     A                                   126
000039070418     A                                      PAGNBR
000040070418     A                                      EDTCDE(Z)
000041070418     A                                     1
000042070418     A                                      'Filiale selezione ...:'
000043070418     A                                      SPACEB(003)
000044070418     A            I40POEL        3S 0O    +1
000045070418     A            DESPO         25A  O    +1
000046070418     A                                     1
000047070418     A                                      'Data elaborazione dal:'
000048070418     A                                      SPACEB(001)
000049070418     A            DATADA         8S 0O    +1
000050070418     A                                      EDTWRD('  /  /    ')
000051070418     A                                    +2
000052070418     A                                      'al:'
000053070418     A            DATAAL         8S 0O    +1
000054070418     A                                      EDTWRD('  /  /    ')
000055070418     A                                     1
000056070418     A                                      'Tipo stampa .........:'
000057070418     A                                      SPACEB(001)
000058070418     A            I40TPST        1A  O    +1
000059070418     A                                    +2
000060070418     A                                      '(A=Analitica; S=Sintetica)'
000061070418     A                                     1
000062070418     A                                      'Lista di controllo ..:'
000063070418     A                                      SPACEB(001)
000064070418     A            I40STPC        1A  O    +1
000065070418     A                                    +2
000066070418     A                                      '(S=Si; N=No)'
000067070418     A  12                                 1
000068070418     A                                      'Tipo elaborazione ...:'
000069070418     A                                      SPACEB(001)
000070070418     A  12        I40TPEL        1A  O    24
000071070418     A  12                                27
000072070418     A                                      '(S=Solo Stampa; F=Stampa + File)'
000073070418     A*%%***********************************************************************
000074070418     A*%%SS
000075070418     A*%%CL 001
000076070418     A*%%CL 001
000077070418     A*%%CL 003
000078070418     A*%%CL 001
000079070418     A*%%CL 001
000080070418     A*%%CL 001
000081070418     A*%%CL 001
000082070418     A*%%CL 002
000083070418     A*%%***********************************************************************
000084070418      * ?  T E S T A T A    D I    S T A M P A  ?
000085070418     A          R OR41T1C
000086070418     A*%%***********************************************************************
000087070418     A*%%RI 00000
000088070418     A*%%FS 001
000089070418     A*%%***********************************************************************
000090070418     A                                      SKIPB(002)
000091070418     A            RSUT          20A        1
000092070418     A                                    60
000093070418     A                                      'S T A T I S T I C A    O. R. M.'
000094070418     A                                   106
000095070418     A                                      'FIOR41R'
000096070418     A            WDATE          8S 0    121
000097070418     A                                      EDTWRD('  /  /    ')
000098070418     A            KNSIF     R              1
000099070418     A                                      REFFLD(KNSIF KPJBA)
000100070418     A                                      SPACEB(001)
000101070418     A            KNMUS     R             12
000102070418     A                                      REFFLD(KNMUS KPJBA)
000103070418     A                                   +36
000104070418     A                                      'L I S T A   D I   C O N T R O L L -
000105070418     A                                      O'
000106070418     A            WORA           6S 0    121
000107070418     A                                      EDTWRD('  :  :  ')
000108070418     A                                     1
000109070418     A                                      'Elaborazione del'
000110070418     A                                      SPACEB(002)
000111070418     A            DSDATAP        8  0     18
000112070418     A                                      EDTWRD('  /  /    ')
000113070418     A                                    30
000114070418     A                                      'Filiale'
000115070418     A            DSPOEL         3  0     +1
000116070418     A            DESPOEL       23        +1
000117070418     A                                   121
000118070418     A                                      'PAG.'
000119070418     A                                   126
000120070418     A                                      PAGNBR
000121070418     A                                      EDTCDE(Z)
000122070418     A                                    69
000123070418     A                                      'Bollettati'
000124070418     A                                      SPACEB(002)
000125070418     A                                    81
000126070418     A                                      'Quadrati non bollettati'
000127070418     A                                   106
000128070418     A                                      'Modifiche'
000129070418     A                                     2
000130070418     A                                      'Numero ORM'
000131070418     A                                      SPACEB(001)
000132070418     A                                    +8
000133070418     A                                      'Rit'
000134070418     A                                    +2
000135070418     A                                      'Data Immiss.'
000136070418     A                                    +2
000137070418     A                                      'Commissionati'
000138070418     A                                    +2
000139070418     A                                      'Non eseguiti'
000140070418     A                                    +2
000141070418     A                                      'Non quadrati'
000142070418     A                                    +4
000143070418     A                                      'da oltre 1 giorno'
000144070418     A                                   105
000145070418     A                                      'Data ritiro'
000146070418     A                                   118
000147070418     A                                      'Non assegnati'
000148070418     A*%%***********************************************************************
000149070418     A*%%SS
000150070418     A*%%CL 001
000151070418     A*%%CL 002
000152070418     A*%%CL 002
000153070418     A*%%CL 001
000154070418     A*%%***********************************************************************
000155070418     A          R OR41D1C
000156070418     A*%%***********************************************************************
000157070418     A*%%RI 00000
000158070418     A*%%***********************************************************************
000159070418     A            ORMPOE         3S 0O     2
000160070418     A                                      SPACEB(001)
000161070418     A            ORMNSR         2S 0O    +1
000162070418     A                                      EDTCDE(Z)
000163070418     A            ORMNOR         7S 0O    +1
000164070418     A                                      EDTCDE(Z)
000165070418     A            ORMNRV         2S 0O    +1
000166070418     A                                      EDTCDE(Z)
000167070418     A            ORMPOR         3S 0O    +1
000168070418     A            W_ORMDAO       8S 0O    +2
000169070418     A                                      EDTWRD('  /  /    ')
000170070418     A            COMMIS         1A  O    45
000171070418     A            W_RORONE       1A  O   +11
000172070418     A            CAUONE         4A  O    +1
000173070418     A            W_RORNQD       1A  O   +11
000174070418     A            W_RORNBL       1A  O   +15
000175070418     A            W_RORMDR       1A  O   +18
000176070418     A            W_RORNAS       1A  O   +13
000177070418     A*%%***********************************************************************
000178070418     A*%%SS
000179070418     A*%%CL 001
000180070418     A*%%CP+999CRTPRTF
000181070418     A*%%CP+    FILE(GAITRAFIL/FIOR41P1)
000182070418     A*%%CP+    DEVTYPE(*SCS)
000183070418     A*%%CP+    PAGESIZE(*N 132)
000184070418     A*%%CP+    CPI(10)
000185070418     A*%%CP     OVRFLW(60)
000186070418     A*%%CS+999CRTPRTF
000187070418     A*%%CS+    FILE(QTEMP/QPRDRPT)
000188070418     A*%%CS+    DEVTYPE(*SCS)
000189070418     A*%%CS     PAGESIZE(*N 198)
000190070418     A*%%***********************************************************************
