000001140708     A*%%***********************************************************************
000002140708     A*%%TS  RD  20140708  105936  EDPMB       REL-V7R1M0  5770-WDS
000003140708     A*%%FI+10661100000110011110100000000000000000000000000000000000
000004140708     A*%%FI       0000000000000000000000000000000000000000000000000
000005140708     A*%%***********************************************************************
000006140708     A*  STAMPA STATISTICA ORM
000007140708     A*  LISTA DI CONTROLLO
000008140708     A*
000009140708     A*
000010140708      * ?  S E L E Z I O N I  D I  S T A M P A  ?
000011140708     A          R OR41S1C
000012140708     A*%%***********************************************************************
000013140708     A*%%RI 00000
000014140708     A*%%FS 001
000015140708     A*%%***********************************************************************
000016140708     A                                      SKIPB(002)
000017140708     A                                      SPACEA(002)
000018140708     A            RSUT          20A        1
000019140708     A                                    60
000020140708     A                                      'S T A T I S T I C A    O. R. M.'
000021140708     A                                   106
000022140708     A                                      'FIOR41R'
000023140708     A            WDATE          8S 0    121
000024140708     A                                      EDTWRD('  /  /    ')
000025140708     A            KNSIF     R              1
000026140708     A                                      REFFLD(KNSIF KPJBA)
000027140708     A                                      SPACEB(001)
000028140708     A            KNMUS     R             12
000029140708     A                                      REFFLD(KNMUS KPJBA)
000030140708     A                                   +36
000031140708     A                                      'L I S T A   D I   C O N T R O L L -
000032140708     A                                      O'
000033140708     A            WORA           6S 0    121
000034140708     A                                      EDTWRD('  :  :  ')
000035140708     A                                   121
000036140708     A                                      'PAG.'
000037140708     A                                      SPACEB(001)
000038140708     A                                   126
000039140708     A                                      PAGNBR
000040140708     A                                      EDTCDE(Z)
000041140708     A                                     1
000042140708     A                                      'Filiale selezione ...:'
000043140708     A                                      SPACEB(003)
000044140708     A            I40POEL        3S 0O    +1
000045140708     A            DESPO         25A  O    +1
000046140708     A                                     1
000047140708     A                                      'Data elaborazione dal:'
000048140708     A                                      SPACEB(001)
000049140708     A            DATADA         8S 0O    +1
000050140708     A                                      EDTWRD('  /  /    ')
000051140708     A                                    +2
000052140708     A                                      'al:'
000053140708     A            DATAAL         8S 0O    +1
000054140708     A                                      EDTWRD('  /  /    ')
000055140708     A                                     1
000056140708     A                                      'Tipo stampa .........:'
000057140708     A                                      SPACEB(001)
000058140708     A            I40TPST        1A  O    +1
000059140708     A                                    +2
000060140708     A                                      '(A=Analitica; S=Sintetica)'
000061140708     A                                     1
000062140708     A                                      'Lista di controllo ..:'
000063140708     A                                      SPACEB(001)
000064140708     A            I40STPC        1A  O    +1
000065140708     A                                    +2
000066140708     A                                      '(S=Si; N=No)'
000067140708     A  12                                 1
000068140708     A                                      'Tipo elaborazione ...:'
000069140708     A                                      SPACEB(001)
000070140708     A  12        I40TPEL        1A  O    24
000071140708     A  12                                27
000072140708     A                                      '(S=Solo Stampa; F=Stampa + File)'
000073140708     A*%%***********************************************************************
000074140708     A*%%SS
000075140708     A*%%CL 001
000076140708     A*%%CL 001
000077140708     A*%%CL 003
000078140708     A*%%CL 001
000079140708     A*%%CL 001
000080140708     A*%%CL 001
000081140708     A*%%CL 001
000082140708     A*%%CL 002
000083140708     A*%%***********************************************************************
000084140708      * ?  T E S T A T A    D I    S T A M P A  ?
000085140708     A          R OR41T1C
000086140708     A*%%***********************************************************************
000087140708     A*%%RI 00000
000088140708     A*%%FS 001
000089140708     A*%%***********************************************************************
000090140708     A                                      SKIPB(002)
000091140708     A            RSUT          20A        1
000092140708     A                                    60
000093140708     A                                      'S T A T I S T I C A    O. R. M.'
000094140708     A                                   106
000095140708     A                                      'FIOR41R'
000096140708     A            WDATE          8S 0    121
000097140708     A                                      EDTWRD('  /  /    ')
000098140708     A            KNSIF     R              1
000099140708     A                                      REFFLD(KNSIF KPJBA)
000100140708     A                                      SPACEB(001)
000101140708     A            KNMUS     R             12
000102140708     A                                      REFFLD(KNMUS KPJBA)
000103140708     A                                   +36
000104140708     A                                      'L I S T A   D I   C O N T R O L L -
000105140708     A                                      O'
000106140708     A            WORA           6S 0    121
000107140708     A                                      EDTWRD('  :  :  ')
000108140708     A                                     1
000109140708     A                                      'Elaborazione del'
000110140708     A                                      SPACEB(002)
000111140708     A            DSDATAP        8  0     18
000112140708     A                                      EDTWRD('  /  /    ')
000113140708     A                                    30
000114140708     A                                      'Filiale'
000115140708     A            DSPOEL         3  0     +1
000116140708     A            DESPOEL       23        +1
000117140708     A                                   121
000118140708     A                                      'PAG.'
000119140708     A                                   126
000120140708     A                                      PAGNBR
000121140708     A                                      EDTCDE(Z)
000122140708     A                                    69
000123140708     A                                      'Bollettati'
000124140708     A                                      SPACEB(002)
000125140708     A                                    81
000126140708     A                                      'Quadrati non bollettati'
000127140708     A                                   106
000128140708     A                                      'Modifiche'
000129140708     A                                     2
000130140708     A                                      'Numero ORM'
000131140708     A                                      SPACEB(001)
000132140708     A                                    +8
000133140708     A                                      'Rit'
000134140708     A                                    +2
000135140708     A                                      'Data Immiss.'
000136140708     A                                    +2
000137140708     A                                      'Comm.'
000138140708     A                                    +1
000139140708     A                                      'Alert'
000140140708     A                                    +2
000141140708     A                                      'Non eseguiti'
000142140708     A                                    +2
000143140708     A                                      'Non quadrati'
000144140708     A                                    +4
000145140708     A                                      'da oltre 1 giorno'
000146140708     A                                   105
000147140708     A                                      'Data ritiro'
000148140708     A                                   118
000149140708     A                                      'Non assegnati'
000150140708     A*%%***********************************************************************
000151140708     A*%%SS
000152140708     A*%%CL 001
000153140708     A*%%CL 002
000154140708     A*%%CL 002
000155140708     A*%%CL 001
000156140708     A*%%***********************************************************************
000157140708     A          R OR41D1C
000158140708     A*%%***********************************************************************
000159140708     A*%%RI 00000
000160140708     A*%%***********************************************************************
000161140708     A            ORMPOE         3S 0O     2
000162140708     A                                      SPACEB(001)
000163140708     A            ORMNSR         2S 0O    +1
000164140708     A                                      EDTCDE(Z)
000165140708     A            ORMNOR         7S 0O    +1
000166140708     A                                      EDTCDE(Z)
000167140708     A            ORMNRV         2S 0O    +1
000168140708     A                                      EDTCDE(Z)
000169140708     A            ORMPOR         3S 0O    +1
000170140708     A            W_ORMDAO       8S 0O    +2
000171140708     A                                      EDTWRD('  /  /    ')
000172140708     A            COMMIS         1A  O    40
000173140708     A            COMALERT       1A  O    47
000174140708     A            W_RORONE       1A  O    57
000175140708     A            CAUONE         4A  O    +1
000176140708     A            W_RORNQD       1A  O   +11
000177140708     A            W_RORNBL       1A  O   +15
000178140708     A            W_RORMDR       1A  O   +18
000179140708     A            W_RORNAS       1A  O   +13
000180140708     A*%%***********************************************************************
000181140708     A*%%SS
000182140708     A*%%CL 001
000183140708     A*%%CP+999CRTPRTF
000184140708     A*%%CP+    FILE(GAITRAFIL/FIOR41P1)
000185140708     A*%%CP+    DEVTYPE(*SCS)
000186140708     A*%%CP+    PAGESIZE(*N 132)
000187140708     A*%%CP+    CPI(12)
000188140708     A*%%CP     OVRFLW(60)
000189140708     A*%%CS+999CRTPRTF
000190140708     A*%%CS+    FILE(QTEMP/QPRDRPT)
000191140708     A*%%CS+    DEVTYPE(*SCS)
000192140708     A*%%CS     PAGESIZE(*N 198)
000193140708     A*%%***********************************************************************
