000100980622      *--------------------------------------------------------------*
000200010406      *  DS PER PGM DI ANNULLAMENTO/RIPRISTINO ORM
000300980622      *--------------------------------------------------------------*
000400971021     A                                      REF(CNDIZION)
000500010406     A          R D30REC                    TEXT('DS PER ANN./RIP. ORM')
000600980622      *********************************
000700980622      * C A M P  I   D I    I N P U T
000800980622      *********************************
000900980622      *
001000010406     A* I30MOD: F-SFLEGGA PER LA TRASMISSIONE DELLA C.A.
001100010406     A            I30MOD         1          TEXT('MODALITà PGM:"A"=ANNULLAMENTO-
001200990820     A                                      ; "R"=RIPRISTINO;"D"=DELET')
001300010406      * KEY ORM
001400010406     A            I30POE    R     S         REFFLD($FIL)
001500010406     A                                      TEXT('PUNTO OPERATIVO EMITTENTE')
001600010406     A            I30NSR    R     S         REFFLD($NRS)
001700010406     A            I30NOR    R     S         REFFLD($NRI)
001800010406     A            I30NRV    R     S         REFFLD($NVI)
001900980622      ***********************************
002000980622      * C A M P I    D I   O  U T P U T
002100980622      ***********************************
002200980622      * SEMPRE QUANDO SI PRESENTA UN ERRORE
002300010406     A            O30ERR         1A         TEXT('E=ERRORE')
002400010406     A            O30MSG        78A         TEXT('MESSAGGIO DI ERRORE')
