000010160513     A*%%TS  SD  20160513  125758  EDPMB       REL-V7R1M0  5770-WDS
000020160513     A*%%EC
000030160513     A                                      DSPSIZ(24 80 *DS3)
000040160513     A                                      CHGINPDFT(HI UL)
000050160513     A                                      PRINT
000060001030     A*---------------------------------------------------------------*
000070160513     A          R FIOR071
000080160513     A*%%TS  SD  20160513  125629  EDPMB       REL-V7R1M0  5770-WDS
000090160513     A                                      TEXT('Visualizzazione')
000100160513     A  08                                  CF01
000110160513     A  14                                  CF02
000120160513     A                                      CF05
000130160513     A  13                                  CF09
000140160513     A                                      CF12
000150160513     A  44                                  CF14
000160160513     A N01N15 40                            CF15
000170160513     A  09                                  CF16
000180160513     A N01                                  CF17
000190160513     A N01N15                               CF18
000200160513     A N01N15 41                            CF19
000210160513     A N01N15                               CF20
000220160513     A N01N15 43                            CF22
000230160513     A                                      CF24
000240160513     A  28        V1CMSG        78   M
000250160513     A            V1CTCO         1A  H
000260160513     A            V1DST          8S 0H
000270160513     A            V1CFCS         1A  H
000280160513     A            V1DDT          2A  H
000290160513     A            RSUT          20A  O  1  2
000300160513     A            VTCTIT        34A  O  1 25DSPATR(RI)
000310160513     A                                      DSPATR(UL)
000320160513     A            VTCPGM        10A  O  1 61
000330160513     A                                  1 73DATE
000340160513     A                                      EDTCDE(Y)
000350160513     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000360160513     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000370160513     A  01
000380160513     AO 15        V1MOD1        48A  O  2 24DSPATR(HI)
000390160513     A                                      DSPATR(UL)
000400160513     A N01N15     V1MOD         15A  O  2 33DSPATR(HI)
000410160513     A                                      DSPATR(UL)
000420160513     A N01N15     V1ANN          9A  O  2 51
000430160513     A N01N15                               COLOR(RED)
000440160513     A                                  2 73TIME
000450160513     A                                  3  2'Fase'
000460160513     A            V1FAO          3S 0O  3  7DSPATR(HI)
000470160513     A                                      DSPATR(RI)
000480160513     A            V1DFAO        30A  O  3 11DSPATR(HI)
000490160513     A                                      DSPATR(RI)
000500160513     A                                  4  2'Numero ORM'
000510160513     A            V1CPOE         3S 0O  4 13DSPATR(HI)
000520160513     A            V1NSR          2Y 0O  4 17EDTCDE(Z)
000530160513     A                                      DSPATR(HI)
000540160513     A            V1NOR          7Y 0O  4 20EDTCDE(Z)
000550160513     A                                      DSPATR(HI)
000560160513     A            V1NRV          2Y 0O  4 28EDTCDE(Z)
000570160513     A                                      DSPATR(HI)
000580160513     A            V1NPR         10A  O  4 31DSPATR(HI)
000590160513     A                                  4 43'Data'
000600160513     A            V1DAO          8Y 0O  4 48EDTWRD('  /  /    ')
000610160513     A                                      DSPATR(HI)
000620160513     A                                  4 61'Ora'
000630160513     A            V1OAO          6Y 0O  4 65DSPATR(HI)
000640160513     A                                      EDTWRD('  :  :  ')
000650160513     A                                  5  2'Tipo ORM'
000660160513     A            V1CTOR         1A  O  5 11DSPATR(HI)
000670160513     A            V1DTOR        15A  O  5 13DSPATR(HI)
000680160513     A  07                              5 43'Causale'
000690160513     A  07        V1CAU          2A  O  5 51
000700160513     A  07        V1DCAU        25A  O  5 54
000710160513     A                                  6  2'Mittente'
000720160513     A            V1CRA1         3Y 0O  6 11DSPATR(HI)
000730160513     A                                      EDTCDE(Z)
000740160513     A            V1CRA2         4Y 0O  6 15EDTCDE(Z)
000750160513     A                                      DSPATR(HI)
000760160513     A            V1CRA3         3Y 0O  6 20EDTCDE(Z)
000770160513     A                                      DSPATR(HI)
000780160513     A                                  6 43'Comunicazione'
000790160513     A            V1DTCO        15A  O  6 57DSPATR(HI)
000800160513     A            V1RSR         35A  O  7  2DSPATR(HI)
000810160513     A  04                              7 43'Numero'
000820160513     A  04        V1CPOS         3S 0O  7 50DSPATR(HI)
000830160513     A  04        V1ORS          7Y 0O  7 54EDTCDE(Z)
000840160513     A                                      DSPATR(HI)
000850160513     A  22                              7 63'Invio Partner'
000860160513     A  22        V1DFCS         4A  O  7 77DSPATR(HI)
000870160513     A            V1INR         35A  O  8  2DSPATR(HI)
000880160513     A  11                              8 43'ORM CON RICEVUTA DI RITIRO'
000890160513     A                                      DSPATR(RI)
000900160513     A            V1LOR         35A  O  9  2DSPATR(HI)
000910160513     A            V1PRR          2A  O  9 38DSPATR(HI)
000920160513     A            V1CAR          9A  O  9 41DSPATR(HI)
000930160513     A            V1NAR          3A  O  9 51DSPATR(HI)
000940160513     A  18        V1ESTE        20A  O  9 61
000950160513     A                                 10  2'Colli'
000960160513     A                                 10 11'Peso Kg'
000970160513     A                                 10 20'Bancali'
000980160513     A                                 10 30'Vol.MC'
000990160513     A                                 10 40'Sponda idr.'
001000160513     A                                 10 56'Ora'
001010160513     A                                 10 65'Data ritiro'
001020160513     A            V1NCL          5Y 0O 11  2EDTCDE(Z)
001030160513     A                                      DSPATR(HI)
001040160513     A            V1PKG          7Y 1O 11 10DSPATR(HI)
001050160513     A                                      EDTCDE(4)
001060160513     A            V1BNC          5Y 0O 11 21EDTCDE(Z)
001070160513     A                                      DSPATR(HI)
001080160513     A            V1VLM          5Y 3O 11 30DSPATR(HI)
001090160513     A                                      EDTCDE(4)
001100160513     A            V1SPI          2A  O 11 43DSPATR(HI)
001110160513     A            V1ORR          4Y 0O 11 55EDTWRD('  :  ')
001120160513     A                                      DSPATR(HI)
001130160513     A            V1DAR          8Y 0O 11 65EDTWRD('  /  /    ')
001140160513     A                                      DSPATR(HI)
001150160513     A                                 12  2'Orari di apertura'
001160160513     A            V1ORAAMDA      4Y 0O 12 21EDTWRD('  :  ')
001170160513     A                                      DSPATR(HI)
001180160513     A            V1ORAAMA       4Y 0O 12 28EDTWRD('  :  ')
001190160513     A                                      DSPATR(HI)
001200160513     A                                 12 35'-'
001210160513     A            V1ORAPMDA      4Y 0O 12 38EDTWRD('  :  ')
001220160513     A                                      DSPATR(HI)
001230160513     A            V1ORAPMA       4Y 0O 12 45EDTWRD('  :  ')
001240160513     A                                      DSPATR(HI)
001250160513     A                                 13  2'Referente'
001260160513     A            V1RER         35A  O 13 12DSPATR(HI)
001270160513     A                                 13 53'Telefono'
001280160513     A            V1TER         16A  O 13 62DSPATR(HI)
001290160513     A                                 14  2'Note'
001300160513     A            V1NOT1        35A  O 14  7DSPATR(HI)
001310160513     A            V1NOT2        35A  O 14 43DSPATR(HI)
001320160513     A                                 15  2'Pagamento'
001330160513     A            V1PAG          5A  O 15 12DSPATR(HI)
001340160513     A            V1DCOM        13A  O 15 24DSPATR(HI)
001350160513     A                                 15 43'Fil.ritiro'
001360160513     A            V1CPOR         3S 0O 15 54DSPATR(HI)
001370160513     A            V1DPOR        17A  O 15 58DSPATR(HI)
001380160513     A                                 16  2'Destinatario'
001390160513     A            V1CRC1         3Y 0O 16 15DSPATR(HI)
001400160513     A                                      EDTCDE(Z)
001410160513     A            V1CRC2         4Y 0O 16 19EDTCDE(Z)
001420160513     A                                      DSPATR(HI)
001430160513     A            V1CRC3         3Y 0O 16 24EDTCDE(Z)
001440160513     A                                      DSPATR(HI)
001450160513     A                                 16 43'Ordinante'
001460160513     A            V1COR1         3Y 0O 16 53DSPATR(HI)
001470160513     A                                      EDTCDE(Z)
001480160513     A            V1COR2         4Y 0O 16 57EDTCDE(Z)
001490160513     A                                      DSPATR(HI)
001500160513     A            V1COR3         3Y 0O 16 62EDTCDE(Z)
001510160513     A                                      DSPATR(HI)
001520160513     A            V1RSC         35A  O 17  2DSPATR(HI)
001530160513     A            V1RSO         35A  O 17 43DSPATR(HI)
001540160513     A            V1INC         35A  O 18  2DSPATR(HI)
001550160513     A            V1INO         35A  O 18 43DSPATR(HI)
001560160513     A            V1LOC         20A  O 19  2DSPATR(HI)
001570160513     A            V1PRC          2A  O 19 23DSPATR(HI)
001580160513     A            V1CAC          9A  O 19 26DSPATR(HI)
001590160513     A            V1NAC          3A  O 19 36DSPATR(HI)
001600160513     A            V1LOO         20A  O 19 43DSPATR(HI)
001610160513     A            V1PRO          2A  O 19 64DSPATR(HI)
001620160513     A            V1CAO          9A  O 19 67DSPATR(HI)
001630160513     A            V1NAO          3A  O 19 77DSPATR(HI)
001640160513     A                                 20  2'Natura merce'
001650160513     A            V1NAM         35A  O 20 15DSPATR(HI)
001660160513     A                                 20 51'Riferimento'
001670160513     A            V1RFA         15A  O 20 63DSPATR(HI)
001680160513     A                                 21  2'Fil.consegna'
001690160513     A            V1CPOC         3Y 0O 21 15DSPATR(HI)
001700160513     A                                      EDTCDE(Z)
001710160513     A            V1DPOC        20A  O 21 19DSPATR(HI)
001720160513     A                                 21 43'Cliente/Tariffa'
001730160513     A            V1KSC          7Y 0O 21 59EDTCDE(Z)
001740160513     A                                      DSPATR(HI)
001750160513     A            V1CTR          3A  O 21 67DSPATR(HI)
001760160513     A                                 22  2'Distinta'
001770160513     A            V1NDC          6Y 0O 22 11EDTCDE(Z)
001780160513     A                                      DSPATR(HI)
001790160513     A  05                                  DSPATR(RI)
001800160513     A                                 22 18'del'
001810160513     A            V1DDC          8Y 0O 22 22EDTWRD('  /  /    ')
001820160513     A                                      DSPATR(HI)
001830160513     A  05                                  DSPATR(RI)
001840160513     A                                 22 34'AUT'
001850160513     A            V1CPDC         7Y 0O 22 38EDTCDE(Z)
001860160513     A                                      DSPATR(HI)
001870160513     A  06                                  DSPATR(RI)
001880160513     A            V1DPDC        20A  O 22 46DSPATR(HI)
001890160513     A  06                                  DSPATR(RI)
001900160513     A                                 23  2'F5=Altri Dati'
001910160513     A  46                                  DSPATR(HI)
001920160513     A N46                                  COLOR(BLU)
001930160513     A N01N15                          23 22'F18=Note'
001940160513     A  42                                  DSPATR(HI)
001950160513     A N42                                  COLOR(BLU)
001960160513     A N01                             23 46'F17=Note AUT'
001970160513     A  48                                  DSPATR(HI)
001980160513     A N48                                  COLOR(BLU)
001990160513     A                                 23 64'F12=Ritorno'
002000160513     A                                      COLOR(BLU)
002010160513     A            VZFD01        61A  O 24  2COLOR(BLU)
002020160513     A            VZFD02        16A  O 24 64COLOR(BLU)
002030131028     A*---------------------------------------------------------------*
002040131119     A          R FIOR0712
002050131119     A*%%TS  SD  20131119  104956  EDPMB       REL-V7R1M0  5770-WDS
002060131119     A                                      WINDOW(12 5 10 56)
002070131119     A                                      CF12
002080131119     A                                      OVERLAY
002090131119     A                                  1  3'Bilico'
002100131119     A            V1BLC          5Y 0O  1 10EDTCDE(Z)
002110131119     A                                      DSPATR(HI)
002120131119     A                                  1 21'Autotreno'
002130131119     A            V1ATT          5Y 0O  1 31EDTCDE(Z)
002140131119     A                                      DSPATR(HI)
002150131119     A                                  1 42'Motrice'
002160131119     A            V1MTC          5Y 0O  1 50EDTCDE(Z)
002170131119     A                                      DSPATR(HI)
002180131119     A                                  3  3'Priorità'
002190131119     A            V1STO          1Y 0O  3 12EDTCDE(Z)
002200131119     A                                      DSPATR(HI)
002210131119     A            V1DSTO        15A  O  3 14
002220131119     A                                  5  3'Giro'
002230131119     A            V1CCGI        10A  O  5  8DSPATR(HI)
002240131119     A            V1DCGI        30A  O  5 19
002250131119     A                                  7  3'Fermo deposito'
002260131119     A            V1FFD          2A  O  7 18DSPATR(HI)
002270131119     A                                  9 45'F12=Ritorno'
002280131119     A                                      COLOR(BLU)
002290040220     A*---------------------------------------------------------------*
002300010223     A          R FIOR07S                   SFL
002310010223     A                                      TEXT('Subfile Variazioni')
002320010223     A            V2DAO          8S 0H
002330010223     A            V2DTVD         8S 0H
002340010223     A            V2SCEL         1A  B  7  3DSPATR(HI)
002350010223     A                                      VALUES('5' ' ')
002360010223     A            V2DTV          8Y 0O  7 46EDTWRD('  /  /    ')
002370010223     A            V2ORV          6Y 0O  7 57EDTWRD('  :  :  ')
002380010223     A            V2CPOR         3S 0O  7 66
002390010223     A            V2UTV         10A  O  7 70
002400010223     A            V2FAO          3S 0O  7  6
002410010223     A            V2DFAO        35A  O  7 10
002420040220     A*---------------------------------------------------------------*
002430150309     A          R FIOR07C                   SFLCTL(FIOR07S)
002440150309     A*%%TS  SD  20150309  122437  EDPMB       REL-V7R1M0  5770-WDS
002450150309     A                                      SFLSIZ(9999)
002460150309     A                                      SFLPAG(0016)
002470150309     A                                      TEXT('Control Variazioni')
002480150309     A                                      CF12
002490150309     A                                      OVERLAY
002500150309     A  20                                  SFLDSP
002510150309     A  21                                  SFLDSPCTL
002520150309     A N21                                  SFLCLR
002530150309     A  20                                  SFLEND(*MORE)
002540150309     A                                      SFLDROP(CF09)
002550150309     A            RECSF          4S 0H      SFLRCDNBR
002560150309     A            RSUT          20A  O  1  2
002570150309     A            VTCTIT        34A  O  1 25DSPATR(RI)
002580150309     A                                      DSPATR(UL)
002590150309     A            VTCPGM        10A  O  1 61
002600150309     A                                  1 72DATE
002610150309     A                                      EDTCDE(Y)
002620150309     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
002630150309     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
002640150309     A                                  2 72TIME
002650150309     A                                  6  2'Opz  F A S E                      -
002660150309     A                                                  Data       Ora    Fil. -
002670150309     A                                       Utente  '
002680150309     A                                      DSPATR(HI)
002690150309     A                                  5  2'5=Visualizza Variazione'
002700150309     A                                  4  2'Immettere le opzioni e premere inv-
002710150309     A                                      io'
002720150309     A                                  3  2'Numero ORM'
002730150309     A            V2CPOE         3S 0O  3 13
002740150309     A            V2NSR          2Y 0O  3 17EDTCDE(Z)
002750150309     A            V2NOR          7Y 0O  3 20EDTCDE(Z)
002760150309     A            V2NRV          2Y 0O  3 28EDTCDE(Z)
002770150309     A                                  2 32'STORICO VARIAZIONI'
002780150309     A                                      DSPATR(HI)
002790150309     A                                      DSPATR(RI)
002800150309     A                                  5 49'V  A  R  I  A  Z  I  O  N  E'
002810150309     A                                      DSPATR(HI)
002820150309     A                                      DSPATR(RI)
002830040220     A*---------------------------------------------------------------*
002840131211     A          R FIOR072
002850131211     A*%%TS  SD  20131211  140649  EDPMB       REL-V7R1M0  5770-WDS
002860131211     A                                      TEXT('Comandi Variazioni')
002870131211     A                                      OVERLAY
002880131211     A                                 24 69'F12=Ritorno'
002890131211     A                                      COLOR(BLU)
002900040220     A*---------------------------------------------------------------*
002910081125     A          R FIOR07SF                  SFL
002920081125     A*%%TS  SD  20081125  131008  EDPMB       REL-V5R4M0  5722-WDS
002930081125     A                                      TEXT('Subfile Fasi')
002940081125     A            V3DAO          8S 0H
002950081125     A            V3FAR          3S 0O  7  3
002960081125     A            V3DFAR        35A  O  7  7
002970081125     A            V3DAE          8Y 0O  7 46EDTWRD('  /  /    ')
002980081125     A            V3ORE          6Y 0O  7 57EDTWRD('  :  :  ')
002990081125     A            V3CPOG         3S 0O  7 66
003000081125     A            V3UTE         10A  O  7 70
003010081125     A                                  8  7'Causale'
003020081125     A N02                                  DSPATR(ND)
003030081125     A            V3CAR          2A  O  8 15
003040081125     A N02                                  DSPATR(ND)
003050081125     A            V3DCAR        35A  O  8 18
003060081125     A N02                                  DSPATR(ND)
003070081125     A                                  9  7'Distinta'
003080081125     A N10                                  DSPATR(ND)
003090081125     A            V3NDC          6Y 0O  9 16EDTCDE(Z)
003100081125     A N10                                  DSPATR(ND)
003110081125     A                                  9 23'del'
003120081125     A N10                                  DSPATR(ND)
003130081125     A            V3DDC          8Y 0O  9 27EDTWRD('  /  /    ')
003140081125     A N10                                  DSPATR(ND)
003150081125     A                                  9 38'Autotrasp.'
003160081125     A N10                                  DSPATR(ND)
003170081125     A            V3CPDR         7Y 0O  9 49
003180081125     A N10                                  DSPATR(ND)
003190081125     A                                      EDTCDE(Z)
003200081125     A            V3DPDR        23A  O  9 57
003210081125     A N10                                  DSPATR(ND)
003220081125     A                                  8 55'No addebito'
003230081125     A N17                                  DSPATR(ND)
003240040220     A*---------------------------------------------------------------*
003250150309     A          R FIOR07CF                  SFLCTL(FIOR07SF)
003260150309     A*%%TS  SD  20150309  122437  EDPMB       REL-V7R1M0  5770-WDS
003270150309     A                                      SFLSIZ(9999)
003280150309     A                                      SFLPAG(0005)
003290150309     A                                      TEXT('Control Fasi')
003300150309     A                                      CF12
003310150309     A                                      OVERLAY
003320150309     A  20                                  SFLDSP
003330150309     A  21                                  SFLDSPCTL
003340150309     A N21                                  SFLCLR
003350150309     A  20                                  SFLEND(*MORE)
003360150309     A                                      SFLDROP(CF09)
003370150309     A            RECSFF         4S 0H      SFLRCDNBR
003380150309     A            RSUT          20A  O  1  2
003390150309     A            VTCTIT        34A  O  1 25DSPATR(RI)
003400150309     A                                      DSPATR(UL)
003410150309     A            VTCPGM        10A  O  1 61
003420150309     A                                  1 72DATE
003430150309     A                                      EDTCDE(Y)
003440150309     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
003450150309     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
003460150309     A                                  2 35'STORICO FASI'
003470150309     A                                      DSPATR(HI)
003480150309     A                                      DSPATR(RI)
003490150309     A                                  2 72TIME
003500150309     A            V3CPOE         3S 0O  4 14
003510150309     A            V3NSR          2Y 0O  4 18EDTCDE(Z)
003520150309     A            V3NOR          7Y 0O  4 21EDTCDE(Z)
003530150309     A            V3NRV          2Y 0O  4 29EDTCDE(Z)
003540150309     A                                  6  2'   Fase eseguita                  -
003550150309     A                                                  Data       Ora    Fil. -
003560150309     A                                       Utente  '
003570150309     A                                      DSPATR(HI)
003580150309     A                                  4  3'Numero ORM'
003590150309     A                                  5 49'E  S  E  C  U  Z  I  O  N  E'
003600150309     A                                      DSPATR(HI)
003610150309     A                                      DSPATR(RI)
003620040220     A*---------------------------------------------------------------*
003630131211     A          R FIOR073
003640131211     A*%%TS  SD  20131211  140649  EDPMB       REL-V7R1M0  5770-WDS
003650131211     A                                      TEXT('Comandi Fasi+')
003660131211     A                                      OVERLAY
003670131211     A                                 24 69'F12=Ritorno'
003680131211     A                                      COLOR(BLU)
003690131211     A                                 24 34'F9=Altri dati'
003700131211     A                                      COLOR(BLU)
003710040220     A*---------------------------------------------------------------*
003720140303     A          R FIOR07SP                  SFL
003730140303     A*%%TS  SD  20140303  103617  EDPMB       REL-V7R1M0  5770-WDS
003740140303     A                                      TEXT('Subfile Proposte')
003750140303     A            V4DAO          8S 0H
003760140303     A            V4DTVD         8S 0H
003770140303     A            V4SCEL         1A  B  7  3DSPATR(HI)
003780140303     A                                      VALUES('5' ' ')
003790140303     A            V4FAO          3S 0O  7  6
003800140303     A            V4DFAO        30A  O  7 10
003810140303     A            V4DTV          8Y 0O  7 42EDTWRD('  /  /    ')
003820140303     A            V4ORV          6Y 0O  7 53EDTWRD('  :  :  ')
003830140303     A            V4CPOR         3S 0O  7 62
003840140303     A            V4UTV         10A  O  7 66
003850140303     A            V4STA         10A  O  8  5
003860140303     A N03                                  DSPATR(ND)
003870140303     A                                  8 16'il'
003880140303     A N03                                  DSPATR(ND)
003890140303     A            V4DTE          8Y 0O  8 19EDTWRD('  /  /    ')
003900140303     A N03                                  DSPATR(ND)
003910140303     A                                  8 30'alle'
003920140303     A N03                                  DSPATR(ND)
003930140303     A            V4ORE          6Y 0O  8 35EDTWRD('  :  :  ')
003940140303     A N03                                  DSPATR(ND)
003950140303     A                                  8 44'da'
003960140303     A N03                                  DSPATR(ND)
003970140303     A            V4UTE         10A  O  8 47
003980140303     A N03                                  DSPATR(ND)
003990140303     A            V4STA1         3A  O  7 77
004000040220     A*---------------------------------------------------------------*
004010150309     A          R FIOR07CP                  SFLCTL(FIOR07SP)
004020150309     A*%%TS  SD  20150309  122437  EDPMB       REL-V7R1M0  5770-WDS
004030150309     A                                      SFLSIZ(9999)
004040150309     A                                      SFLPAG(0008)
004050150309     A                                      TEXT('Control Proposte')
004060150309     A                                      CF12
004070150309     A                                      OVERLAY
004080150309     A  20                                  SFLDSP
004090150309     A  21                                  SFLDSPCTL
004100150309     A N21                                  SFLCLR
004110150309     A  20                                  SFLEND(*MORE)
004120150309     A                                      SFLDROP(CF09)
004130150309     A            RECSFP         4S 0H      SFLRCDNBR
004140150309     A            RSUT          20A  O  1  2
004150150309     A            VTCTIT        34A  O  1 25DSPATR(RI)
004160150309     A                                      DSPATR(UL)
004170150309     A            VTCPGM        10A  O  1 61
004180150309     A                                  1 72DATE
004190150309     A                                      EDTCDE(Y)
004200150309     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004210150309     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004220150309     A                                  2 27'STORICO PROPOSTE VARIAZIONI'
004230150309     A                                      DSPATR(HI)
004240150309     A                                      DSPATR(RI)
004250150309     A                                  2 72TIME
004260150309     A            V4CPOE         3S 0O  3 13
004270150309     A            V4NSR          2Y 0O  3 17EDTCDE(Z)
004280150309     A            V4NOR          7Y 0O  3 20EDTCDE(Z)
004290150309     A            V4NRV          2Y 0O  3 28EDTCDE(Z)
004300150309     A                                  4  2'Immettere le opzioni e premere inv-
004310150309     A                                      io'
004320150309     A                                  5  2'5=Visualizza Proposte Variazioni'
004330150309     A                                  6  2'Opz   F A S E                     -
004340150309     A                                              Data       Ora    Fil.  Ute-
004350150309     A                                      nte      '
004360150309     A                                      DSPATR(HI)
004370150309     A                                  3  2'Numero ORM'
004380040220     A*---------------------------------------------------------------*
004390140303     A          R FIOR074
004400140303     A*%%TS  SD  20140303  103617  EDPMB       REL-V7R1M0  5770-WDS
004410140303     A                                      TEXT('Comandi Proposte')
004420140303     A                                      OVERLAY
004430140303     A                                 24 69'F12=Ritorno'
004440140303     A                                      COLOR(BLU)
004450140303     A                                 24 34'F9=Altri dati'
004460140303     A                                      COLOR(BLU)
004470040220     A*---------------------------------------------------------------*
004480150309     A          R FIOR075
004490150309     A*%%TS  SD  20150309  122437  EDPMB       REL-V7R1M0  5770-WDS
004500150309     A                                      CF12
004510150309     A                                      OVERLAY
004520150309     A            RSUT          20A  O  1  2
004530150309     A            VTCTIT        34A  O  1 25DSPATR(RI)
004540150309     A                                      DSPATR(UL)
004550150309     A            VTCPGM        10A  O  1 61
004560150309     A                                  1 72DATE
004570150309     A                                      EDTCDE(Y)
004580150309     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004590150309     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004600150309     A                                  2 27'STORICO PROPOSTE VARIAZIONI'
004610150309     A                                      DSPATR(HI)
004620150309     A                                      DSPATR(RI)
004630150309     A                                  2 72TIME
004640150309     A            V4CPOE         3S 0O  3 13DSPATR(HI)
004650150309     A            V4NSR          2Y 0O  3 17DSPATR(HI)
004660150309     A                                      EDTCDE(Z)
004670150309     A            V4NOR          7Y 0O  3 20DSPATR(HI)
004680150309     A                                      EDTCDE(Z)
004690150309     A            V4NRV          2Y 0O  3 28DSPATR(HI)
004700150309     A                                      EDTCDE(Z)
004710150309     A                                  4  2'Immettere le opzioni e premere inv-
004720150309     A                                      io'
004730150309     A                                  5  2'5=Visualizza Proposte Variazioni'
004740150309     A                                  6  2'Opz   F A S E            Data Prop-
004750150309     A                                      osta     Ora Prop.  Fil.Prop.  Uten-
004760150309     A                                      te Prop. '
004770150309     A                                      DSPATR(HI)
004780150309     A                                 10 20'N O N   E S I S T O N O   P R O P -
004790150309     A                                      O S T E'
004800150309     A                                      DSPATR(HI)
004810150309     A                                      DSPATR(BL)
004820150309     A                                 24 69'F12=Ritorno'
004830150309     A                                      COLOR(BLU)
004840150309     A                                  3  2'Numero ORM'
004850150309     A                                      DSPATR(HI)
004860090223     A**-------------------------------------------------------------**
004870090223     A          R FIOR07APS                 SFL
004880090223     A*%%TS  SD  20090223  095039  EDPMB       REL-V5R4M0  5722-WDS
004890090223     A                                  3  1'Persona contattata:'
004900090223     A            WAPPREF   R        O  3 21REFFLD(FNORA000/ORAREF *LIBL/FNORA0-
004910090223     A                                      0F)
004920090223     A                                  4  1'In data...........:'
004930090223     A            WAPPDATA  R        O  4 21REFFLD(FNORA000/ORADATA *LIBL/FNORA-
004940090223     A                                      00F)
004950090223     A                                      EDTCDE(Y)
004960090223     A                                  4 33'Alle ore:'
004970090223     A            WAPPORA   R        O  4 43REFFLD(FNORA000/ORAORA *LIBL/FNORA0-
004980090223     A                                      0F)
004990090223     A                                  5  1'Da................:'
005000090223     A            WAPPUTE   R        O  5 21REFFLD(FNORA000/ORAUTE *LIBL/FNORA0-
005010090223     A                                      0F)
005020090223     A                                  6  1'Annotazioni.......:'
005030090223     A            WAPPNOTA1 R  -35   O  6 21REFFLD(FNORA000/ORANOTE *LIBL/FNORA-
005040090223     A                                      00F)
005050090223     A            WAPPNOTA2 R  -35   O  7 21REFFLD(FNORA000/ORANOTE *LIBL/FNORA-
005060090223     A                                      00F)
005070090223     A**-------------------------------------------------------------**
005080090223     A          R FIOR07APC                 SFLCTL(FIOR07APS)
005090090223     A*%%TS  SD  20090223  093332  EDPMB       REL-V5R4M0  5722-WDS
005100090223     A                                      CF12
005110090223     A                                      OVERLAY
005120090223     A  20                                  SFLDSP
005130090223     A  21                                  SFLDSPCTL
005140090223     A N21                                  SFLCLR
005150090223     A  31                                  SFLEND(*MORE)
005160090223     A                                      SFLSIZ(0030)
005170090223     A                                      SFLPAG(0001)
005180090223     A                                      WINDOW(FIOR07APZ)
005190090223     A            RECSFA         4S 0H      SFLRCDNBR
005200090223     A                                  1 16'INFORMAZIONI APPUNTAMENTO'
005210090223     A                                      DSPATR(HI)
005220090223     A                                      DSPATR(UL)
005230090223     A**-------------------------------------------------------------**
005240131211     A          R FIOR07APZ
005250131211     A*%%TS  SD  20131211  140649  EDPMB       REL-V7R1M0  5770-WDS
005260131211     A                                      WINDOW(7 10 9 55 *NOMSGLIN)
005270131211     A                                      OVERLAY
005280131211     A                                      WDWBORDER((*COLOR PNK))
005290131211     A                                  9 44'F12=Ritorno'
005300131211     A                                      COLOR(BLU)
