000100160226     A*%%TS  SD  20160226  090407  EDPMB       REL-V7R1M0  5770-WDS
000200160226     A*%%EC
000300160226     A                                      DSPSIZ(24 80 *DS3)
000400160226     A                                      CHGINPDFT(HI UL)
000500160226     A                                      INDARA
000600160226     A**-------------------------------------------------------------**
000700160226     A          R OR91W01
000800160226     A*%%TS  SD  20160226  090407  EDPMB       REL-V7R1M0  5770-WDS
000900160226     A                                      CA03
001000160226     A                                      CF06
001100160226     A                                      OVERLAY
001200160226     A                                      WINDOW(8 10 12 55 *NOMSGLIN *NORSTC-
001300160226     A                                      SR)
001400160226     A  28        W01MSG        50   M
001500160226     A                                  2 19'Estrazione File ORM'
001600160226     A                                      DSPATR(RI)
001700160226     A                                  4  1'Filiale Ritiro ?:'
001800160226     A            W01POR         3A  B  4 19CHECK(RB)
001900160226     A  50                                  DSPATR(PC)
002000160226     A            W01PORD       20   O  4 23COLOR(BLU)
002100160226     A                                  5  1'Data Ritiro ....:'
002200160226     A            W01DAR         8Y 0B  5 19CHECK(RZ)
002300160226     A  51                                  DSPATR(PC)
002400160226     A                                      EDTCDE(Y)
002500160226     A                                  7  1'Nella libreria GAITRAAZM verranno -
002600160226     A                                      creati i file: '
002700160226     A                                      COLOR(BLU)
002800160226     A                                  8  2'WFORMT0F'
002900160226     A                                      DSPATR(HI)
003000160226     A                                  8 11'- Testate ORM'
003100160226     A                                  9  2'WFORMF0F'
003200160226     A                                      DSPATR(HI)
003300160226     A                                  9 11'- Fasi ORM'
003400160226     A                                 11  1'F3=Fine'
003500160226     A                                      COLOR(BLU)
003600160226     A                                 11 43'F6=Conferma'
003700160226     A                                      COLOR(BLU)
003800160226     A**-------------------------------------------------------------**
003900160226     A          R ASSUME
004000160226     A                                      ASSUME
004100160226     A                                  3  4' '
