000100170518      *--------------------------------------------------------------*
000200170518      *  Parametri per Statistica ORM < 5 kg. - Anticipati           *
000300170518      *--------------------------------------------------------------*
000400170518     A          R FIOR89REC                 TEXT('Stat.ORM < 5 Kg')
000500170518      *-----------------
000600170518      * INPUT
000700170518      *-----------------
000800170518     A            IOR89FIL       3S 0       TEXT('Filiale')
000900170518     A            IOR89DATAI     8S 0       TEXT('Data Immissione inizio')
001000170518     A            IOR89DATAF     8S 0       TEXT('Data Immissione fine')
001100170518      *-----------------
001200170518      * OUTPUT
001300170518      *-----------------
001400170518     A            OOR89ERR       1A         TEXT('1=Errore')
001500170518     A            OOR89MSG      78A         TEXT('Messaggio Errore')
