000010031127     A*%%TS  SD  20031127  095049  EDPGA       REL-V4R4M0  5769-PW1
000020990510     A****************************************************************
000030031127     A*%%EC
000040031127     A                                      DSPSIZ(24 80 *DS3)
000050031127     A                                      CHGINPDFT(HI UL)
000060031127     A                                      PRINT
000070970903     A*---------------------------------------------------------------*
000080031127     A          R FIOR931
000090031127     A*%%TS  SD  20031127  095049  EDPGA       REL-V4R4M0  5769-PW1
000100031127     A                                      CA03
000110031127     A                                      CF06
000120031127     A                                      OVERLAY
000130031127     A  28        V1CMSG        78   M
000140031127     A            RSUT          20A  O  1  2
000150031127     A            VTCPGM        10A  O  1 61
000160031127     A                                  1 72DATE
000170031127     A                                      EDTCDE(Y)
000180031127     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000190031127     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000200031127     A                                  2 72TIME
000210031127     A                                  9 24'P.O. in gestione:'
000220031127     A            V1CFGS         3Y 0B  9 42CHECK(RZ)
000230031127     A                                      DSPATR(HI)
000240031127     A  40                                  DSPATR(PC)
000250031127     A            V1DFGS        15A  O  9 46
000260031127     A                                 24  2'F3=Fine Lavoro'
000270031127     A                                 24 34'F6=Elabora'
000280031127     A                                      DSPATR(HI)
000290031127     A                                  1 30'Elenco Anagr.Ritiri Fissi'
000300031127     A                                      DSPATR(UL)
000310031127     A                                      DSPATR(RI)
000320031127     A                                  2 36'non utilizzati'
000330031127     A                                      DSPATR(UL)
000340031127     A                                      DSPATR(RI)
