000001141212     A*%%***********************************************************************
000002141212     A*%%TS  RD  20141212  100739  EDPMB       REL-V7R1M0  5770-WDS
000003141212     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004141212     A*%%FI       0000000000000000000000000000000000000000000000000
000005141212     A*%%***********************************************************************
000006141212     A*  STAMPA STATISTICA ORM
000007141212     A*
000008141212     A*
000009141212      * ?  S E L E Z I O N I  D I  S T A M P A  ?
000010141212     A          R OR41S1
000011141212     A*%%***********************************************************************
000012141212     A*%%RI 00000
000013141212     A*%%FS 001
000014141212     A*%%***********************************************************************
000015141212     A                                      SKIPB(002)
000016141212     A                                      SPACEA(002)
000017141212     A            RSUT          20A        1
000018141212     A                                    60
000019141212     A                                      'S T A T I S T I C A    O. R. M.'
000020141212     A                                   120
000021141212     A                                      'FIOR41R'
000022141212     A            WDATE          8S 0    135
000023141212     A                                      EDTWRD('  /  /    ')
000024141212     A            KNSIF     R              1
000025141212     A                                      REFFLD(KNSIF KPJBA)
000026141212     A                                      SPACEB(001)
000027141212     A            KNMUS     R             12
000028141212     A                                      REFFLD(KNMUS KPJBA)
000029141212     A            WORA           6S 0    135
000030141212     A                                      EDTWRD('  :  :  ')
000031141212     A                                   135
000032141212     A                                      'PAG.'
000033141212     A                                      SPACEB(001)
000034141212     A                                   140
000035141212     A                                      PAGNBR
000036141212     A                                      EDTCDE(Z)
000037141212     A                                     1
000038141212     A                                      'Filiale selezione ...:'
000039141212     A                                      SPACEB(003)
000040141212     A            I40POEL        3S 0O    +1
000041141212     A            DESPO         25A  O    +1
000042141212     A                                     1
000043141212     A                                      'Data elaborazione dal:'
000044141212     A                                      SPACEB(001)
000045141212     A            DATADA         8S 0O    +1
000046141212     A                                      EDTWRD('  /  /    ')
000047141212     A                                    +2
000048141212     A                                      'al:'
000049141212     A            DATAAL         8S 0O    +1
000050141212     A                                      EDTWRD('  /  /    ')
000051141212     A                                     1
000052141212     A                                      'Tipo stampa .........:'
000053141212     A                                      SPACEB(001)
000054141212     A            I40TPST        1A  O    +1
000055141212     A                                    +2
000056141212     A                                      '(A=Analitica; S=Sintetica)'
000057141212     A                                     1
000058141212     A                                      'Lista di controllo ..:'
000059141212     A                                      SPACEB(001)
000060141212     A            I40STPC        1A  O    +1
000061141212     A                                    +2
000062141212     A                                      '(S=Si; N=No)'
000063141212     A  12                                 1
000064141212     A                                      'Tipo elaborazione ...:'
000065141212     A                                      SPACEB(001)
000066141212     A  12        I40TPEL        1A  O    24
000067141212     A  12                                27
000068141212     A                                      '(S=Solo Stampa; F=Stampa + File)'
000069141212     A*%%***********************************************************************
000070141212     A*%%SS
000071141212     A*%%CL 001
000072141212     A*%%CL 001
000073141212     A*%%CL 003
000074141212     A*%%CL 001
000075141212     A*%%CL 001
000076141212     A*%%CL 001
000077141212     A*%%CL 001
000078141212     A*%%CL 002
000079141212     A*%%***********************************************************************
000080141212     A*
000081141212      * ?  T E S T A T A    D I    S T A M P A  ?
000082141212     A          R OR41T1
000083141212     A*%%***********************************************************************
000084141212     A*%%RI 00000
000085141212     A*%%FS 001
000086141212     A*%%***********************************************************************
000087141212     A                                      SKIPB(002)
000088141212     A            RSUT          20A        1
000089141212     A                                    60
000090141212     A                                      'S T A T I S T I C A    O. R. M.'
000091141212     A                                   120
000092141212     A                                      'FIOR41R'
000093141212     A            WDATE          8S 0    135
000094141212     A                                      EDTWRD('  /  /    ')
000095141212     A  15N17                             57
000096141212     A                                      'SOLO ORM COMMISSIONATI CON TELEFON-
000097141212     A                                      ATE'
000098141212     A                                      SPACEB(001)
000099141212     A  17                                60
000100141212     A                                      'SOLO ORM COMMISSIONATI CON ALERT'
000101141212     A                                      SPACEB(001)
000102141212     A            KNSIF     R              1
000103141212     A                                      REFFLD(KNSIF KPJBA)
000104141212     A                                      SPACEB(001)
000105141212     A            KNMUS     R             12
000106141212     A                                      REFFLD(KNMUS KPJBA)
000107141212     A            WORA           6S 0    135
000108141212     A                                      EDTWRD('  :  :  ')
000109141212     A*%%***********************************************************************
000110141212     A*%%SS
000111141212     A*%%CL 001
000112141212     A*%%CL 001
000113141212     A*%%CL 001
000114141212     A*%%***********************************************************************
000115141212     A          R OR41T2
000116141212     A*%%***********************************************************************
000117141212     A*%%RI 00000
000118141212     A*%%***********************************************************************
000119141212     A                                      SPACEB(001)
000120141212     A N13                                 1
000121141212     A                                      'Elaborazione del'
000122141212     A N13        DSDATAP        8  0     18
000123141212     A                                      EDTWRD('  /  /    ')
000124141212     A                                   135
000125141212     A                                      'PAG.'
000126141212     A                                   140
000127141212     A                                      PAGNBR
000128141212     A                                      EDTCDE(Z)
000129141212     A*%%***********************************************************************
000130141212     A*%%SS
000131141212     A*%%***********************************************************************
000132141212     A          R OR41T3
000133141212     A*%%***********************************************************************
000134141212     A*%%RI 00000
000135141212     A*%%***********************************************************************
000136141212     A                                      SPACEB(001)
000137141212     A  13        P_RORPOE       3  0      1
000138141212     A  13        DESPOEL       23         5
000139141212     A                                    42
000140141212     A                                      'Distretto'
000141141212     A            P_RORDIS       1A  O    +1
000142141212     A            DESCRDIS      20A  O    +1
000143141212     A                                    +3
000144141212     A                                      'Area'
000145141212     A            P_RORARE       3S 0O    +1
000146141212     A            DESCRARE      20A  O    +1
000147141212     A*%%***********************************************************************
000148141212     A*%%SS
000149141212     A*%%***********************************************************************
000150141212     A          R OR41T4
000151141212     A*%%***********************************************************************
000152141212     A*%%RI 00000
000153141212     A*%%FS 001
000154141212     A*%%***********************************************************************
000155141212     A                                      SPACEB(002)
000156141212     A                                    60
000157141212     A                                      'Eseguiti'
000158141212     A                                    70
000159141212     A                                      'N o n'
000160141212     A                                    87
000161141212     A                                      'Bollettati'
000162141212     A                                    99
000163141212     A                                      'Quadrati non bollettati'
000164141212     A                                   124
000165141212     A                                      'Modifiche'
000166141212     A                                   137
000167141212     A                                      'N o n'
000168141212     A                                    31
000169141212     A                                      'Immessi'
000170141212     A                                      SPACEB(001)
000171141212     A                                    39
000172141212     A                                      'Da Eseguire'
000173141212     A                                    51
000174141212     A                                      'Eseguiti'
000175141212     A                                    60
000176141212     A                                      'Anomali'
000177141212     A                                    69
000178141212     A                                      'Eseguiti'
000179141212     A                                    81
000180141212     A                                      '%'
000181141212     A                                    86
000182141212     A                                      'Non quadrati'
000183141212     A                                   102
000184141212     A                                      'da oltre 1 giorno'
000185141212     A                                   123
000186141212     A                                      'Data ritiro'
000187141212     A                                   135
000188141212     A                                      'Assegnati'
000189141212     A*%%***********************************************************************
000190141212     A*%%SS
000191141212     A*%%CL 001
000192141212     A*%%***********************************************************************
000193141212     A          R OR41D1
000194141212     A*%%***********************************************************************
000195141212     A*%%RI 00000
000196141212     A*%%***********************************************************************
000197141212     A                                      SPACEB(001)
000198141212     A N13        P_RORPOE       3  0      2
000199141212     A N13        DESPOEL       23         6
000200141212     A  13                                 2
000201141212     A                                      'Elaborazione del'
000202141212     A  13        DSDATAP        8  0     19
000203141212     A                                      EDTWRD('  /  /    ')
000204141212     A            P_ROROIM       5S 0O    32
000205141212     A                                      EDTCDE(Z)
000206141212     A            P_RORODE       5S 0O    43
000207141212     A                                      EDTCDE(Z)
000208141212     A            P_ROROES       5S 0O    53
000209141212     A                                      EDTCDE(Z)
000210141212     A            P_ROROEA       5S 0O    61
000211141212     A                                      EDTCDE(Z)
000212141212     A            P_RORONE       5S 0O    71
000213141212     A                                      EDTCDE(Z)
000214141212     A            PERONE         5S 2O    79
000215141212     A                                      EDTCDE(2)
000216141212     A            P_RORNQD       5S 0O    90
000217141212     A                                      EDTCDE(Z)
000218141212     A            P_RORNBL       5S 0O   108
000219141212     A                                      EDTCDE(Z)
000220141212     A            P_RORMDR       5S 0O   126
000221141212     A                                      EDTCDE(Z)
000222141212     A            P_RORNAS       5S 0O   137
000223141212     A                                      EDTCDE(Z)
000224141212     A*%%***********************************************************************
000225141212     A*%%SS
000226141212     A*%%***********************************************************************
000227141212     A          R OR41D1B
000228141212     A*%%***********************************************************************
000229141212     A*%%RI 00000
000230141212     A*%%***********************************************************************
000231141212     A                                      SPACEB(001)
000232141212     A                                     6
000233141212     A                                      'Di cui commiss.con TEL'
000234141212     A            P_RORODE       5S 0O    43
000235141212     A                                      EDTCDE(Z)
000236141212     A            P_ROROES       5S 0O    53
000237141212     A                                      EDTCDE(Z)
000238141212     A            P_ROROEA       5S 0O    61
000239141212     A                                      EDTCDE(Z)
000240141212     A            P_RORONE       5S 0O    71
000241141212     A                                      EDTCDE(Z)
000242141212     A            PERONE         5S 2O    79
000243141212     A                                      EDTCDE(2)
000244141212     A            P_RORNQD       5S 0O    90
000245141212     A                                      EDTCDE(Z)
000246141212     A            P_RORNBL       5S 0O   108
000247141212     A                                      EDTCDE(Z)
000248141212     A            P_RORMDR       5S 0O   126
000249141212     A                                      EDTCDE(Z)
000250141212     A            P_RORNAS       5S 0O   137
000251141212     A                                      EDTCDE(Z)
000252141212     A*%%***********************************************************************
000253141212     A*%%SS
000254141212     A*%%***********************************************************************
000255141212     A          R OR41D1A
000256141212     A*%%***********************************************************************
000257141212     A*%%RI 00000
000258141212     A*%%***********************************************************************
000259141212     A                                      SPACEB(001)
000260141212     A                                     6
000261141212     A                                      'Di cui commiss.con ALERT'
000262141212     A            P_RORODE       5S 0O    43
000263141212     A                                      EDTCDE(Z)
000264141212     A            P_ROROES       5S 0O    53
000265141212     A                                      EDTCDE(Z)
000266141212     A            P_ROROEA       5S 0O    61
000267141212     A                                      EDTCDE(Z)
000268141212     A            P_RORONE       5S 0O    71
000269141212     A                                      EDTCDE(Z)
000270141212     A            PERONE         5S 2O    79
000271141212     A                                      EDTCDE(2)
000272141212     A            P_RORNQD       5S 0O    90
000273141212     A                                      EDTCDE(Z)
000274141212     A            P_RORNBL       5S 0O   108
000275141212     A                                      EDTCDE(Z)
000276141212     A            P_RORMDR       5S 0O   126
000277141212     A                                      EDTCDE(Z)
000278141212     A            P_RORNAS       5S 0O   137
000279141212     A                                      EDTCDE(Z)
000280141212     A*%%***********************************************************************
000281141212     A*%%SS
000282141212     A*%%***********************************************************************
000283141212     A          R OR41A1
000284141212     A*%%***********************************************************************
000285141212     A*%%RI 00000
000286141212     A*%%FS 001
000287141212     A*%%***********************************************************************
000288141212     A                                      SPACEB(002)
000289141212     A                                     2
000290141212     A                                      'Affidabilità'
000291141212     A*%%***********************************************************************
000292141212     A*%%SS
000293141212     A*%%***********************************************************************
000294141212     A          R OR41A11
000295141212     A*%%***********************************************************************
000296141212     A*%%RI 00000
000297141212     A*%%***********************************************************************
000298141212     A                                      SPACEB(001)
000299141212     A                                     3
000300141212     A                                      'Anticipo'
000301141212     A            P_RORDAN       5S 0O    43
000302141212     A                                      EDTCDE(Z)
000303141212     A            P_ROREAN       5S 0O    53
000304141212     A                                      EDTCDE(Z)
000305141212     A            P_RORAAN       5S 0O    61
000306141212     A                                      EDTCDE(Z)
000307141212     A            P_RORNAN       5S 0O    71
000308141212     A                                      EDTCDE(Z)
000309141212     A*%%***********************************************************************
000310141212     A*%%SS
000311141212     A*%%***********************************************************************
000312141212     A          R OR41A12
000313141212     A*%%***********************************************************************
000314141212     A*%%RI 00000
000315141212     A*%%***********************************************************************
000316141212     A                                      SPACEB(001)
000317141212     A                                     3
000318141212     A                                      'In tempo'
000319141212     A            P_RORDIT       5S 0O    43
000320141212     A                                      EDTCDE(Z)
000321141212     A            P_ROREIT       5S 0O    53
000322141212     A                                      EDTCDE(Z)
000323141212     A            P_RORAIT       5S 0O    61
000324141212     A                                      EDTCDE(Z)
000325141212     A            P_RORNIT       5S 0O    71
000326141212     A                                      EDTCDE(Z)
000327141212     A*%%***********************************************************************
000328141212     A*%%SS
000329141212     A*%%***********************************************************************
000330141212     A          R OR41A13
000331141212     A*%%***********************************************************************
000332141212     A*%%RI 00000
000333141212     A*%%***********************************************************************
000334141212     A                                      SPACEB(001)
000335141212     A                                     3
000336141212     A                                      '1 gg.ritardo'
000337141212     A            P_RORDR1       5S 0O    43
000338141212     A                                      EDTCDE(Z)
000339141212     A            P_RORER1       5S 0O    53
000340141212     A                                      EDTCDE(Z)
000341141212     A            P_RORAR1       5S 0O    61
000342141212     A                                      EDTCDE(Z)
000343141212     A            P_RORNR1       5S 0O    71
000344141212     A                                      EDTCDE(Z)
000345141212     A*%%***********************************************************************
000346141212     A*%%SS
000347141212     A*%%***********************************************************************
000348141212     A          R OR41A14
000349141212     A*%%***********************************************************************
000350141212     A*%%RI 00000
000351141212     A*%%***********************************************************************
000352141212     A                                      SPACEB(001)
000353141212     A                                     3
000354141212     A                                      '2 gg.ritardo'
000355141212     A            P_RORDR2       5S 0O    43
000356141212     A                                      EDTCDE(Z)
000357141212     A            P_RORER2       5S 0O    53
000358141212     A                                      EDTCDE(Z)
000359141212     A            P_RORAR2       5S 0O    61
000360141212     A                                      EDTCDE(Z)
000361141212     A            P_RORNR2       5S 0O    71
000362141212     A                                      EDTCDE(Z)
000363141212     A*%%***********************************************************************
000364141212     A*%%SS
000365141212     A*%%***********************************************************************
000366141212     A          R OR41A15
000367141212     A*%%***********************************************************************
000368141212     A*%%RI 00000
000369141212     A*%%***********************************************************************
000370141212     A                                      SPACEB(001)
000371141212     A                                     3
000372141212     A                                      'Oltre'
000373141212     A            P_RORDRO       5S 0O    43
000374141212     A                                      EDTCDE(Z)
000375141212     A            P_RORERO       5S 0O    53
000376141212     A                                      EDTCDE(Z)
000377141212     A            P_RORARO       5S 0O    61
000378141212     A                                      EDTCDE(Z)
000379141212     A            P_RORNRO       5S 0O    71
000380141212     A                                      EDTCDE(Z)
000381141212     A*%%***********************************************************************
000382141212     A*%%SS
000383141212     A*%%***********************************************************************
000384141212     A          R OR41A29
000385141212     A*%%***********************************************************************
000386141212     A*%%RI 00000
000387141212     A*%%FS 001
000388141212     A*%%***********************************************************************
000389141212     A                                      SPACEB(002)
000390141212     A            DESCAU09A     25A  O     2
000391141212     A            P_RORA09       5S 0O    61
000392141212     A                                      EDTCDE(Z)
000393141212     A*%%***********************************************************************
000394141212     A*%%SS
000395141212     A*%%***********************************************************************
000396141212     A          R OR41A2
000397141212     A*%%***********************************************************************
000398141212     A*%%RI 00000
000399141212     A*%%FS 001
000400141212     A*%%***********************************************************************
000401141212     A                                      SPACEB(002)
000402141212     A                                     2
000403141212     A                                      'Causali mancato ritiro'
000404141212     A*%%***********************************************************************
000405141212     A*%%SS
000406141212     A*%%***********************************************************************
000407141212     A          R OR41A21
000408141212     A*%%***********************************************************************
000409141212     A*%%RI 00000
000410141212     A*%%***********************************************************************
000411141212     A                                      SPACEB(001)
000412141212     A            DESCAU01A     25A  O     3
000413141212     A            P_RORA01       5S 0O    61
000414141212     A                                      EDTCDE(Z)
000415141212     A*%%***********************************************************************
000416141212     A*%%SS
000417141212     A*%%***********************************************************************
000418141212     A          R OR41A22
000419141212     A*%%***********************************************************************
000420141212     A*%%RI 00000
000421141212     A*%%***********************************************************************
000422141212     A                                      SPACEB(001)
000423141212     A            DESCAU02A     25A  O     3
000424141212     A            P_RORA02       5S 0O    61
000425141212     A                                      EDTCDE(Z)
000426141212     A*%%***********************************************************************
000427141212     A*%%SS
000428141212     A*%%***********************************************************************
000429141212     A          R OR41A23
000430141212     A*%%***********************************************************************
000431141212     A*%%RI 00000
000432141212     A*%%***********************************************************************
000433141212     A                                      SPACEB(001)
000434141212     A            DESCAU03A     25A  O     3
000435141212     A            P_RORA03       5S 0O    61
000436141212     A                                      EDTCDE(Z)
000437141212     A*%%***********************************************************************
000438141212     A*%%SS
000439141212     A*%%***********************************************************************
000440141212     A          R OR41A24
000441141212     A*%%***********************************************************************
000442141212     A*%%RI 00000
000443141212     A*%%***********************************************************************
000444141212     A                                      SPACEB(001)
000445141212     A            DESCAU04A     25A  O     3
000446141212     A            P_RORA04       5S 0O    61
000447141212     A                                      EDTCDE(Z)
000448141212     A*%%***********************************************************************
000449141212     A*%%SS
000450141212     A*%%***********************************************************************
000451141212     A          R OR41A25
000452141212     A*%%***********************************************************************
000453141212     A*%%RI 00000
000454141212     A*%%***********************************************************************
000455141212     A                                      SPACEB(001)
000456141212     A            DESCAU05A     25A  O     3
000457141212     A            P_RORA05       5S 0O    61
000458141212     A                                      EDTCDE(Z)
000459141212     A*%%***********************************************************************
000460141212     A*%%SS
000461141212     A*%%***********************************************************************
000462141212     A          R OR41A26
000463141212     A*%%***********************************************************************
000464141212     A*%%RI 00000
000465141212     A*%%***********************************************************************
000466141212     A                                      SPACEB(001)
000467141212     A            DESCAU06A     25A  O     3
000468141212     A            P_RORA06       5S 0O    61
000469141212     A                                      EDTCDE(Z)
000470141212     A*%%***********************************************************************
000471141212     A*%%SS
000472141212     A*%%***********************************************************************
000473141212     A          R OR41A27
000474141212     A*%%***********************************************************************
000475141212     A*%%RI 00000
000476141212     A*%%***********************************************************************
000477141212     A                                      SPACEB(001)
000478141212     A            DESCAU07A     25A  O     3
000479141212     A            P_RORA07       5S 0O    61
000480141212     A                                      EDTCDE(Z)
000481141212     A*%%***********************************************************************
000482141212     A*%%SS
000483141212     A*%%***********************************************************************
000484141212     A          R OR41A28
000485141212     A*%%***********************************************************************
000486141212     A*%%RI 00000
000487141212     A*%%***********************************************************************
000488141212     A                                      SPACEB(001)
000489141212     A            DESCAU08A     25A  O     3
000490141212     A            P_RORA08       5S 0O    61
000491141212     A                                      EDTCDE(Z)
000492141212     A*%%***********************************************************************
000493141212     A*%%SS
000494141212     A*%%***********************************************************************
000495141212     A          R OR41A210
000496141212     A*%%***********************************************************************
000497141212     A*%%RI 00000
000498141212     A*%%***********************************************************************
000499141212     A                                      SPACEB(001)
000500141212     A            DESCAU10A     25A  O     3
000501141212     A            P_RORA10       5S 0O    61
000502141212     A                                      EDTCDE(Z)
000503141212     A*%%***********************************************************************
000504141212     A*%%SS
000505141212     A*%%***********************************************************************
000506141212     A          R OR41A211
000507141212     A*%%***********************************************************************
000508141212     A*%%RI 00000
000509141212     A*%%***********************************************************************
000510141212     A                                      SPACEB(001)
000511141212     A            DESCAU11A     25A  O     3
000512141212     A            P_RORA11       5S 0O    61
000513141212     A                                      EDTCDE(Z)
000514141212     A*%%***********************************************************************
000515141212     A*%%SS
000516141212     A*%%***********************************************************************
000517141212     A          R OR41A212
000518141212     A*%%***********************************************************************
000519141212     A*%%RI 00000
000520141212     A*%%***********************************************************************
000521141212     A                                      SPACEB(001)
000522141212     A            DESCAU12A     25A  O     3
000523141212     A            P_RORA12       5S 0O    61
000524141212     A                                      EDTCDE(Z)
000525141212     A*%%***********************************************************************
000526141212     A*%%SS
000527141212     A*%%***********************************************************************
000528141212     A          R OR41A213
000529141212     A*%%***********************************************************************
000530141212     A*%%RI 00000
000531141212     A*%%***********************************************************************
000532141212     A                                      SPACEB(001)
000533141212     A            DESCAU13A     25A  O     3
000534141212     A            P_RORA13       5S 0O    61
000535141212     A                                      EDTCDE(Z)
000536141212     A*%%***********************************************************************
000537141212     A*%%SS
000538141212     A*%%***********************************************************************
000539141212     A          R OR41A214
000540141212     A*%%***********************************************************************
000541141212     A*%%RI 00000
000542141212     A*%%***********************************************************************
000543141212     A                                      SPACEB(001)
000544141212     A            DESCAU14A     25A  O     3
000545141212     A            P_RORA14       5S 0O    61
000546141212     A                                      EDTCDE(Z)
000547141212     A*%%***********************************************************************
000548141212     A*%%SS
000549141212     A*%%***********************************************************************
000550141212     A          R OR41A215
000551141212     A*%%***********************************************************************
000552141212     A*%%RI 00000
000553141212     A*%%***********************************************************************
000554141212     A                                      SPACEB(001)
000555141212     A            DESCAU15A     25A  O     3
000556141212     A            P_RORA15       5S 0O    61
000557141212     A                                      EDTCDE(Z)
000558141212     A*%%***********************************************************************
000559141212     A*%%SS
000560141212     A*%%***********************************************************************
000561141212     A          R OR41A3
000562141212     A*%%***********************************************************************
000563141212     A*%%RI 00000
000564141212     A*%%***********************************************************************
000565141212     A                                      SPACEB(001)
000566141212     A*%%***********************************************************************
000567141212     A*%%SS
000568141212     A*%%***********************************************************************
000569141212     A          R OR41A31
000570141212     A*%%***********************************************************************
000571141212     A*%%RI 00000
000572141212     A*%%***********************************************************************
000573141212     A                                      SPACEB(001)
000574141212     A            DESCAU01N     25A  O     3
000575141212     A            P_RORN01       5S 0O    71
000576141212     A                                      EDTCDE(Z)
000577141212     A*%%***********************************************************************
000578141212     A*%%SS
000579141212     A*%%***********************************************************************
000580141212     A          R OR41A32
000581141212     A*%%***********************************************************************
000582141212     A*%%RI 00000
000583141212     A*%%***********************************************************************
000584141212     A                                      SPACEB(001)
000585141212     A            DESCAU02N     25A  O     3
000586141212     A            P_RORN02       5S 0O    71
000587141212     A                                      EDTCDE(Z)
000588141212     A*%%***********************************************************************
000589141212     A*%%SS
000590141212     A*%%***********************************************************************
000591141212     A          R OR41A33
000592141212     A*%%***********************************************************************
000593141212     A*%%RI 00000
000594141212     A*%%***********************************************************************
000595141212     A                                      SPACEB(001)
000596141212     A            DESCAU03N     25A  O     3
000597141212     A            P_RORN03       5S 0O    71
000598141212     A                                      EDTCDE(Z)
000599141212     A*%%***********************************************************************
000600141212     A*%%SS
000601141212     A*%%***********************************************************************
000602141212     A          R OR41A34
000603141212     A*%%***********************************************************************
000604141212     A*%%RI 00000
000605141212     A*%%***********************************************************************
000606141212     A                                      SPACEB(001)
000607141212     A            DESCAU04N     25A  O     3
000608141212     A            P_RORN04       5S 0O    71
000609141212     A                                      EDTCDE(Z)
000610141212     A*%%***********************************************************************
000611141212     A*%%SS
000612141212     A*%%***********************************************************************
000613141212     A          R OR41A35
000614141212     A*%%***********************************************************************
000615141212     A*%%RI 00000
000616141212     A*%%***********************************************************************
000617141212     A                                      SPACEB(001)
000618141212     A            DESCAU05N     25A  O     3
000619141212     A            P_RORN05       5S 0O    71
000620141212     A                                      EDTCDE(Z)
000621141212     A*%%***********************************************************************
000622141212     A*%%SS
000623141212     A*%%***********************************************************************
000624141212     A          R OR41A36
000625141212     A*%%***********************************************************************
000626141212     A*%%RI 00000
000627141212     A*%%***********************************************************************
000628141212     A                                      SPACEB(001)
000629141212     A            DESCAU06N     25A  O     3
000630141212     A            P_RORN06       5S 0O    71
000631141212     A                                      EDTCDE(Z)
000632141212     A*%%***********************************************************************
000633141212     A*%%SS
000634141212     A*%%***********************************************************************
000635141212     A          R OR41A37
000636141212     A*%%***********************************************************************
000637141212     A*%%RI 00000
000638141212     A*%%***********************************************************************
000639141212     A                                      SPACEB(001)
000640141212     A            DESCAU07N     25A  O     3
000641141212     A            P_RORN07       5S 0O    71
000642141212     A                                      EDTCDE(Z)
000643141212     A*%%***********************************************************************
000644141212     A*%%SS
000645141212     A*%%***********************************************************************
000646141212     A          R OR41A38
000647141212     A*%%***********************************************************************
000648141212     A*%%RI 00000
000649141212     A*%%***********************************************************************
000650141212     A                                      SPACEB(001)
000651141212     A            DESCAU08N     25A  O     3
000652141212     A            P_RORN08       5S 0O    71
000653141212     A                                      EDTCDE(Z)
000654141212     A*%%***********************************************************************
000655141212     A*%%SS
000656141212     A*%%***********************************************************************
000657141212     A          R OR41A39
000658141212     A*%%***********************************************************************
000659141212     A*%%RI 00000
000660141212     A*%%***********************************************************************
000661141212     A                                      SPACEB(001)
000662141212     A            DESCAU09N     25A  O     3
000663141212     A            P_RORN09       5S 0O    71
000664141212     A                                      EDTCDE(Z)
000665141212     A*%%***********************************************************************
000666141212     A*%%SS
000667141212     A*%%***********************************************************************
000668141212     A          R OR41A310
000669141212     A*%%***********************************************************************
000670141212     A*%%RI 00000
000671141212     A*%%***********************************************************************
000672141212     A                                      SPACEB(001)
000673141212     A            DESCAU10N     25A  O     3
000674141212     A            P_RORN10       5S 0O    71
000675141212     A                                      EDTCDE(Z)
000676141212     A*%%***********************************************************************
000677141212     A*%%SS
000678141212     A*%%***********************************************************************
000679141212     A          R OR41A4
000680141212     A*%%***********************************************************************
000681141212     A*%%RI 00000
000682141212     A*%%FS 001
000683141212     A*%%***********************************************************************
000684141212     A                                      SPACEB(002)
000685141212     A                                     2
000686141212     A                                      'Affidati ad altre filiali'
000687141212     A            P_ROROCO       5S 0O    +5
000688141212     A                                      EDTCDE(Z)
000689141212     A*%%***********************************************************************
000690141212     A*%%SS
000691141212     A*%%***********************************************************************
000692141212     A          R OR41A5
000693141212     A*%%***********************************************************************
000694141212     A*%%RI 00000
000695141212     A*%%FS 001
000696141212     A*%%***********************************************************************
000697141212     A                                      SPACEB(002)
000698141212     A                                     2
000699141212     A                                      'Tipo cliente'
000700141212     A*%%***********************************************************************
000701141212     A*%%SS
000702141212     A*%%***********************************************************************
000703141212     A          R OR41A51
000704141212     A*%%***********************************************************************
000705141212     A*%%RI 00000
000706141212     A*%%***********************************************************************
000707141212     A                                      SPACEB(001)
000708141212     A                                     3
000709141212     A                                      'Codificato'
000710141212     A            P_RORICO       5S 0O    32
000711141212     A                                      EDTCDE(Z)
000712141212     A*%%***********************************************************************
000713141212     A*%%SS
000714141212     A*%%***********************************************************************
000715141212     A          R OR41A52
000716141212     A*%%***********************************************************************
000717141212     A*%%RI 00000
000718141212     A*%%***********************************************************************
000719141212     A                                      SPACEB(001)
000720141212     A                                     3
000721141212     A                                      'Non codificato'
000722141212     A            P_RORINC       5S 0O    32
000723141212     A                                      EDTCDE(Z)
000724141212     A*%%***********************************************************************
000725141212     A*%%SS
000726141212     A*%%***********************************************************************
000727141212     A          R OR41A6
000728141212     A*%%***********************************************************************
000729141212     A*%%RI 00000
000730141212     A*%%FS 001
000731141212     A*%%***********************************************************************
000732141212     A                                      SPACEB(002)
000733141212     A                                     2
000734141212     A                                      'Tipo comunicazione'
000735141212     A*%%***********************************************************************
000736141212     A*%%SS
000737141212     A*%%***********************************************************************
000738141212     A          R OR41A61
000739141212     A*%%***********************************************************************
000740141212     A*%%RI 00000
000741141212     A*%%***********************************************************************
000742141212     A                                      SPACEB(001)
000743141212     A                                     3
000744141212     A                                      'Fissi'
000745141212     A            P_RORIFI       5S 0O    32
000746141212     A                                      EDTCDE(Z)
000747141212     A            P_RORIFIAN     5S 0O    61
000748141212     A                                      EDTCDE(Z)
000749141212     A            P_RORIFINE     5S 0O    71
000750141212     A                                      EDTCDE(Z)
000751141212     A*%%***********************************************************************
000752141212     A*%%SS
000753141212     A*%%***********************************************************************
000754141212     A          R OR41A62
000755141212     A*%%***********************************************************************
000756141212     A*%%RI 00000
000757141212     A*%%***********************************************************************
000758141212     A                                      SPACEB(001)
000759141212     A                                     3
000760141212     A                                      'Via telefono'
000761141212     A            P_RORICE       5S 0O    32
000762141212     A                                      EDTCDE(Z)
000763141212     A            P_RORICEAN     5S 0O    61
000764141212     A                                      EDTCDE(Z)
000765141212     A            P_RORICENE     5S 0O    71
000766141212     A                                      EDTCDE(Z)
000767141212     A*%%***********************************************************************
000768141212     A*%%SS
000769141212     A*%%***********************************************************************
000770141212     A          R OR41A63
000771141212     A*%%***********************************************************************
000772141212     A*%%RI 00000
000773141212     A*%%***********************************************************************
000774141212     A                                      SPACEB(001)
000775141212     A                                     3
000776141212     A                                      'Internet'
000777141212     A            P_RORIIN       5S 0O    32
000778141212     A                                      EDTCDE(Z)
000779141212     A            P_RORIINAN     5S 0O    61
000780141212     A                                      EDTCDE(Z)
000781141212     A            P_RORIINNE     5S 0O    71
000782141212     A                                      EDTCDE(Z)
000783141212     A*%%***********************************************************************
000784141212     A*%%SS
000785141212     A*%%***********************************************************************
000786141212     A          R OR41A64
000787141212     A*%%***********************************************************************
000788141212     A*%%RI 00000
000789141212     A*%%***********************************************************************
000790141212     A                                      SPACEB(001)
000791141212     A                                     3
000792141212     A                                      'VAS'
000793141212     A            P_RORIVA       5S 0O    32
000794141212     A                                      EDTCDE(Z)
000795141212     A            P_RORIVAAN     5S 0O    61
000796141212     A                                      EDTCDE(Z)
000797141212     A            P_RORIVANE     5S 0O    71
000798141212     A                                      EDTCDE(Z)
000799141212     A*%%***********************************************************************
000800141212     A*%%SS
000801141212     A*%%***********************************************************************
000802141212     A          R OR41A65
000803141212     A*%%***********************************************************************
000804141212     A*%%RI 00000
000805141212     A*%%***********************************************************************
000806141212     A                                      SPACEB(001)
000807141212     A                                     3
000808141212     A                                      'Via Mail'
000809141212     A            P_RORICC       5S 0O    32
000810141212     A                                      EDTCDE(Z)
000811141212     A            P_RORICCAN     5S 0O    61
000812141212     A                                      EDTCDE(Z)
000813141212     A            P_RORICCNE     5S 0O    71
000814141212     A                                      EDTCDE(Z)
000815141212     A*%%***********************************************************************
000816141212     A*%%SS
000817141212     A*%%***********************************************************************
000818141212      * ?  F I N E    S T A M P A  ?
000819141212     A          R OR41E1
000820141212     A*%%***********************************************************************
000821141212     A*%%RI 00000
000822141212     A*%%FS 001
000823141212     A*%%***********************************************************************
000824141212     A                                      SPACEB(002)
000825141212     A                                    52
000826141212     A                                      '***   FINE  STAMPA   ***'
000827141212     A*%%***********************************************************************
000828141212     A*%%SS
000829141212     A*%%CP+999CRTPRTF
000830141212     A*%%CP+    FILE(GAITRAFIL/FIOR41P)
000831141212     A*%%CP+    DEVTYPE(*SCS)
000832141212     A*%%CP+    PAGESIZE(*N 192)
000833141212     A*%%CP+    CPI(12)
000834141212     A*%%CP     OVRFLW(60)
000835141212     A*%%CS+999CRTPRTF
000836141212     A*%%CS+    FILE(QTEMP/QPRDRPT)
000837141212     A*%%CS+    DEVTYPE(*SCS)
000838141212     A*%%CS     PAGESIZE(*N 198)
000839141212     A*%%***********************************************************************
