000001140610     A*%%***********************************************************************
000002140610     A*%%TS  RD  20140610  101441  EDPMB       REL-V7R1M0  5770-WDS
000003140610     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004140610     A*%%FI       0000000000000000000000000000000000000000000000000
000005140610     A*%%***********************************************************************
000006140610     A*  STAMPA STATISTICA ORM
000007140610     A*
000008140610     A*
000009140610      * ?  S E L E Z I O N I  D I  S T A M P A  ?
000010140610     A          R OR43S1
000011140610     A*%%***********************************************************************
000012140610     A*%%RI 00000
000013140610     A*%%FS 001
000014140610     A*%%***********************************************************************
000015140610     A                                      SKIPB(002)
000016140610     A            RSUT          20A        1
000017140610     A                                   +40
000018140610     A                                      'S T A T I S T I C A    O. R. M.   -
000019140610     A                                       P E R    C L I E N T E'
000020140610     A                                   150
000021140610     A                                      'FIOR43R'
000022140610     A            WDATE          8S 0    185
000023140610     A                                      EDTWRD('  /  /    ')
000024140610     A            KNSIF     R              1
000025140610     A                                      REFFLD(KNSIF KPJBA)
000026140610     A                                      SPACEB(001)
000027140610     A            KNMUS     R             12
000028140610     A                                      REFFLD(KNMUS KPJBA)
000029140610     A            WORA           6S 0    185
000030140610     A                                      EDTWRD('  :  :  ')
000031140610     A                                   185
000032140610     A                                      'PAG.'
000033140610     A                                      SPACEB(001)
000034140610     A                                   190
000035140610     A                                      PAGNBR
000036140610     A                                      EDTCDE(Z)
000037140610     A                                     1
000038140610     A                                      'Filiale emissione .....:'
000039140610     A                                      SPACEB(003)
000040140610     A            I42POE         3S 0O    +1
000041140610     A            DI42POE       25A  O    +1
000042140610     A                                     1
000043140610     A                                      'Filiale ritiro ........:'
000044140610     A                                      SPACEB(001)
000045140610     A            I42POR         3S 0O    +1
000046140610     A            DI42POR       25A  O    +1
000047140610     A                                     1
000048140610     A                                      'Data immissione ORM dal:'
000049140610     A                                      SPACEB(001)
000050140610     A            DATADAL        8S 0O    26
000051140610     A                                      EDTWRD('  /  /    ')
000052140610     A                                    38
000053140610     A                                      'al:'
000054140610     A            DATAAL         8S 0O    42
000055140610     A                                      EDTWRD('  /  /    ')
000056140610     A                                     1
000057140610     A                                      'Tipo comunicazione ....:'
000058140610     A                                      SPACEB(001)
000059140610     A            I42TCO         1A  O    26
000060140610     A            DESTCO        25A  O    +3
000061140610     A  13                                 1
000062140610     A                                      'ORM Commissionati .....:'
000063140610     A                                      SPACEB(001)
000064140610     A  13        COMM          30A  O    26
000065140610     A  13                                 1
000066140610     A                                      'ORM con Alert .........:'
000067140610     A                                      SPACEB(001)
000068140610     A  13        ALERT         30A  O    26
000069140610     A  12                                 1
000070140610     A                                      'Creazione file ........:'
000071140610     A                                      SPACEB(001)
000072140610     A  12        FILE           2A  O    26
000073140610     A                                     1
000074140610     A                                      '------------ C L I E N T E --------
000075140610     A                                      -----'
000076140610     A                                      SPACEB(001)
000077140610     A                                    42
000078140610     A                                      'Tutti i luoghi'
000079140610     A                                    58
000080140610     A                                      'Mittente'
000081140610     A                                    68
000082140610     A                                      'Ordinante'
000083140610     A                                    79
000084140610     A                                      'Destinatario'
000085140610     A            CLI11          3S 0O     2
000086140610     A                                      EDTCDE(Z)
000087140610     A                                      SPACEB(001)
000088140610     A            CLI12          4S 0O     6
000089140610     A                                      EDTCDE(Z)
000090140610     A            CLI13          3A  O    11
000091140610     A            RAG1          25A  O    15
000092140610     A            ALL1S          2A  O    47
000093140610     A            MIT1           1A  O    61
000094140610     A            ORD1           1A  O    72
000095140610     A            DES1           1A  O    84
000096140610     A            CLI21          3S 0O     2
000097140610     A                                      SPACEB(001)
000098140610     A                                      EDTCDE(Z)
000099140610     A            CLI22          4S 0O     6
000100140610     A                                      EDTCDE(Z)
000101140610     A            CLI23          3A  O    11
000102140610     A            RAG2          25A  O    15
000103140610     A            ALL2S          2A  O    47
000104140610     A            MIT2           1A  O    61
000105140610     A            ORD2           1A  O    72
000106140610     A            DES2           1A  O    84
000107140610     A            CLI31          3S 0O     2
000108140610     A                                      SPACEB(001)
000109140610     A                                      EDTCDE(Z)
000110140610     A            CLI32          4S 0O     6
000111140610     A                                      EDTCDE(Z)
000112140610     A            CLI33          3A  O    11
000113140610     A            RAG3          25A  O    15
000114140610     A            ALL3S          2A  O    47
000115140610     A            MIT3           1A  O    61
000116140610     A            ORD3           1A  O    72
000117140610     A            DES3           1A  O    84
000118140610     A            CLI41          3S 0O     2
000119140610     A                                      SPACEB(001)
000120140610     A                                      EDTCDE(Z)
000121140610     A            CLI42          4S 0O     6
000122140610     A                                      EDTCDE(Z)
000123140610     A            CLI43          3A  O    11
000124140610     A            RAG4          25A  O    15
000125140610     A            ALL4S          2A  O    47
000126140610     A            MIT4           1A  O    61
000127140610     A            ORD4           1A  O    72
000128140610     A            DES4           1A  O    84
000129140610     A            CLI51          3S 0O     2
000130140610     A                                      SPACEB(001)
000131140610     A                                      EDTCDE(Z)
000132140610     A            CLI52          4S 0O     6
000133140610     A                                      EDTCDE(Z)
000134140610     A            CLI53          3A  O    11
000135140610     A            RAG5          25A  O    15
000136140610     A            ALL5S          2A  O    47
000137140610     A            MIT5           1A  O    61
000138140610     A            ORD5           1A  O    72
000139140610     A            DES5           1A  O    84
000140140610     A                                     1
000141140610     A                                      '-------------- F A S I ------------
000142140610     A                                      -----'
000143140610     A                                      SKIPB(035)
000144140610     A                                    50
000145140610     A                                      '------ C A U S A L I -------'
000146140610     A            FAR01          3A  O     1
000147140610     A                                      SPACEB(001)
000148140610     A            DFAR01        35A  O    +1
000149140610     A            CMR01          2A  O   +10
000150140610     A            DCMR01        25A  O    +1
000151140610     A            FAR02          3A  O     1
000152140610     A                                      SPACEB(001)
000153140610     A            DFAR02        35A  O    +1
000154140610     A            CMR02          2A  O   +10
000155140610     A            DCMR02        25A  O    +1
000156140610     A            FAR03          3A  O     1
000157140610     A                                      SPACEB(001)
000158140610     A            DFAR03        35A  O    +1
000159140610     A            CMR03          2A  O   +10
000160140610     A            DCMR03        25A  O    +1
000161140610     A            FAR04          3A  O     1
000162140610     A                                      SPACEB(001)
000163140610     A            DFAR04        35A  O    +1
000164140610     A            CMR04          2A  O   +10
000165140610     A            DCMR04        25A  O    +1
000166140610     A            FAR05          3A  O     1
000167140610     A                                      SPACEB(001)
000168140610     A            DFAR05        35A  O    +1
000169140610     A            CMR05          2A  O   +10
000170140610     A            DCMR05        25A  O    +1
000171140610     A            FAR06          3A  O     1
000172140610     A                                      SPACEB(001)
000173140610     A            DFAR06        35A  O    +1
000174140610     A            CMR06          2A  O   +10
000175140610     A            DCMR06        25A  O    +1
000176140610     A            FAR07          3A  O     1
000177140610     A                                      SPACEB(001)
000178140610     A            DFAR07        35A  O    +1
000179140610     A            CMR07          2A  O   +10
000180140610     A            DCMR07        25A  O    +1
000181140610     A            FAR08          3A  O     1
000182140610     A                                      SPACEB(001)
000183140610     A            DFAR08        35A  O    +1
000184140610     A            CMR08          2A  O   +10
000185140610     A            DCMR08        25A  O    +1
000186140610     A            FAR09          3A  O     1
000187140610     A                                      SPACEB(001)
000188140610     A            DFAR09        35A  O    +1
000189140610     A            CMR09          2A  O   +10
000190140610     A            DCMR09        25A  O    +1
000191140610     A            FAR10          3A  O     1
000192140610     A                                      SPACEB(001)
000193140610     A            DFAR10        35A  O    +1
000194140610     A            CMR10          2A  O   +10
000195140610     A            DCMR10        25A  O    +1
000196140610     A            FAR11          3A  O     1
000197140610     A                                      SPACEB(001)
000198140610     A            DFAR11        35A  O    +1
000199140610     A            CMR11          2A  O   +10
000200140610     A            DCMR11        25A  O    +1
000201140610     A            FAR12          3A  O     1
000202140610     A                                      SPACEB(001)
000203140610     A            DFAR12        35A  O    +1
000204140610     A            CMR12          2A  O   +10
000205140610     A            DCMR12        25A  O    +1
000206140610     A            FAR13          3A  O     1
000207140610     A                                      SPACEB(001)
000208140610     A            DFAR13        35A  O    +1
000209140610     A            CMR13          2A  O   +10
000210140610     A            DCMR13        25A  O    +1
000211140610     A            FAR14          3A  O     1
000212140610     A                                      SPACEB(001)
000213140610     A            DFAR14        35A  O    +1
000214140610     A            CMR14          2A  O   +10
000215140610     A            DCMR14        25A  O    +1
000216140610     A            FAR15          3A  O     1
000217140610     A                                      SPACEB(001)
000218140610     A            DFAR15        35A  O    +1
000219140610     A            CMR15          2A  O   +10
000220140610     A            DCMR15        25A  O    +1
000221140610     A*%%***********************************************************************
000222140610     A*%%SS
000223140610     A*%%CL 001
000224140610     A*%%CL 001
000225140610     A*%%CL 003
000226140610     A*%%CL 001
000227140610     A*%%CL 001
000228140610     A*%%CL 001
000229140610     A*%%CL 001
000230140610     A*%%CL 001
000231140610     A*%%CL 001
000232140610     A*%%CL 001
000233140610     A*%%CL 001
000234140610     A*%%CL 001
000235140610     A*%%CL 001
000236140610     A*%%CL 001
000237140610     A*%%CL 001
000238140610     A*%%CL 016
000239140610     A*%%CL 001
000240140610     A*%%CL 001
000241140610     A*%%CL 001
000242140610     A*%%CL 001
000243140610     A*%%CL 001
000244140610     A*%%CL 001
000245140610     A*%%CL 001
000246140610     A*%%CL 001
000247140610     A*%%CL 001
000248140610     A*%%CL 001
000249140610     A*%%CL 001
000250140610     A*%%CL 001
000251140610     A*%%CL 001
000252140610     A*%%CL 001
000253140610     A*%%CL 001
000254140610     A*%%***********************************************************************
000255140610     A*
000256140610      * ?  T E S T A T A    D I    S T A M P A  ?
000257140610     A*%%***********************************************************************
000258140610     A*%%NP
000259140610     A*%%***********************************************************************
000260140610     A          R OR43T1
000261140610     A*%%***********************************************************************
000262140610     A*%%RI 00000
000263140610     A*%%***********************************************************************
000264140610     A                                      SKIPB(001)
000265140610     A            RSUT          20A        1
000266140610     A                                      SPACEB(001)
000267140610     A                                    66
000268140610     A                                      'S T A T I S T I C A    O. R. M.   -
000269140610     A                                       P E R    C L I E N T E'
000270140610     A                                   150
000271140610     A                                      'FIOR43R'
000272140610     A            WDATE          8S 0    185
000273140610     A                                      EDTWRD('  /  /    ')
000274140610     A            KNSIF     R              1
000275140610     A                                      REFFLD(KNSIF KPJBA)
000276140610     A                                      SPACEB(001)
000277140610     A            KNMUS     R             12
000278140610     A                                      REFFLD(KNMUS KPJBA)
000279140610     A            WORA           6S 0    185
000280140610     A                                      EDTWRD('  :  :  ')
000281140610     A                                   185
000282140610     A                                      'PAG.'
000283140610     A                                      SPACEB(001)
000284140610     A                                   190
000285140610     A                                      PAGNBR
000286140610     A                                      EDTCDE(Z)
000287140610     A*%%***********************************************************************
000288140610     A*%%SS
000289140610     A*%%CL 001
000290140610     A*%%CL 001
000291140610     A*%%CL 001
000292140610     A*%%***********************************************************************
000293140610     A          R OR43T2
000294140610     A*%%***********************************************************************
000295140610     A*%%RI 00000
000296140610     A*%%FS 001
000297140610     A*%%***********************************************************************
000298140610     A                                      SPACEB(002)
000299140610     A                                     1
000300140610     A                                      'Filiale emissione'
000301140610     A                                      HIGHLIGHT
000302140610     A            P_ROCPOE       3  0     +1
000303140610     A                                      HIGHLIGHT
000304140610     A            DESPOE        23        +1
000305140610     A                                      HIGHLIGHT
000306140610     A*%%***********************************************************************
000307140610     A*%%SS
000308140610     A*%%***********************************************************************
000309140610     A          R OR43T4
000310140610     A*%%***********************************************************************
000311140610     A*%%RI 00000
000312140610     A*%%FS 001
000313140610     A*%%***********************************************************************
000314140610     A                                      SPACEB(002)
000315140610     A                                     2
000316140610     A                                      'Filiale Ritiro'
000317140610     A                                    34
000318140610     A                                      'Totale'
000319140610     A                                    47
000320140610     A                                      '-----------------------------------
000321140610     A                                      ------------------------------ Fase-
000322140610     A                                      /causale ---------------------------
000323140610     A                                      ------------------------------------
000324140610     A                                      -------------'
000325140610     A                                    34
000326140610     A                                      'O.R.M.'
000327140610     A                                      SPACEB(001)
000328140610     A                                    49
000329140610     A                                      '900'
000330140610     A                                    57
000331140610     A                                      '910'
000332140610     A                                    65
000333140610     A                                      '600'
000334140610     A                                    71
000335140610     A                                      '999/80'
000336140610     A                                    80
000337140610     A                                      '999/91'
000338140610     A                                    89
000339140610     A                                      '999/92'
000340140610     A                                    98
000341140610     A                                      '999/94'
000342140610     A                                   107
000343140610     A                                      '999/95'
000344140610     A                                   116
000345140610     A                                      '999/96'
000346140610     A                                   125
000347140610     A                                      '999/97'
000348140610     A                                   134
000349140610     A                                      '500/01'
000350140610     A                                   143
000351140610     A                                      '500/02'
000352140610     A                                   152
000353140610     A                                      '500/04'
000354140610     A                                   163
000355140610     A                                      '400'
000356140610     A                                   171
000357140610     A                                      '390'
000358140610     A                                   179
000359140610     A                                      '300'
000360140610     A                                   187
000361140610     A                                      '100'
000362140610     A                                   195
000363140610     A                                      '050'
000364140610     A*%%***********************************************************************
000365140610     A*%%SS
000366140610     A*%%CL 001
000367140610     A*%%***********************************************************************
000368140610     A          R OR43D1
000369140610     A*%%***********************************************************************
000370140610     A*%%RI 00000
000371140610     A*%%FS 001
000372140610     A*%%***********************************************************************
000373140610     A                                      SPACEB(002)
000374140610     A            P_ROCPOR       3  0      2
000375140610     A            DESPOR        23         6
000376140610     A            P_ROCTOT       5S 0O    34
000377140610     A                                      EDTCDE(Z)
000378140610     A            P_ROC900       5S 0O    47
000379140610     A                                      EDTCDE(Z)
000380140610     A            P_ROC910       5S 0O    55
000381140610     A                                      EDTCDE(Z)
000382140610     A            P_ROC600       5S 0O    63
000383140610     A                                      EDTCDE(Z)
000384140610     A            P_ROC99980     5S 0O    72
000385140610     A                                      EDTCDE(Z)
000386140610     A            P_ROC99991     5S 0O    81
000387140610     A                                      EDTCDE(Z)
000388140610     A            P_ROC99992     5S 0O    90
000389140610     A                                      EDTCDE(Z)
000390140610     A            P_ROC99994     5S 0O    99
000391140610     A                                      EDTCDE(Z)
000392140610     A            P_ROC99995     5S 0O   108
000393140610     A                                      EDTCDE(Z)
000394140610     A            P_ROC99996     5S 0O   117
000395140610     A                                      EDTCDE(Z)
000396140610     A            P_ROC99997     5S 0O   126
000397140610     A                                      EDTCDE(Z)
000398140610     A            P_ROC50001     5S 0O   135
000399140610     A                                      EDTCDE(Z)
000400140610     A            P_ROC50002     5S 0O   144
000401140610     A                                      EDTCDE(Z)
000402140610     A            P_ROC50004     5S 0O   153
000403140610     A                                      EDTCDE(Z)
000404140610     A            P_ROC400       5S 0O   161
000405140610     A                                      EDTCDE(Z)
000406140610     A            P_ROC390       5S 0O   169
000407140610     A                                      EDTCDE(Z)
000408140610     A            P_ROC300       5S 0O   177
000409140610     A                                      EDTCDE(Z)
000410140610     A            P_ROC100       5S 0O   185
000411140610     A                                      EDTCDE(Z)
000412140610     A            P_ROC050       5S 0O   193
000413140610     A                                      EDTCDE(Z)
000414140610     A*%%***********************************************************************
000415140610     A*%%SS
000416140610     A*%%***********************************************************************
000417140610     A          R OR43A1
000418140610     A*%%***********************************************************************
000419140610     A*%%RI 00000
000420140610     A*%%***********************************************************************
000421140610     A                                      SPACEB(001)
000422140610     A                                     9
000423140610     A                                      'Affidabilità'
000424140610     A*%%***********************************************************************
000425140610     A*%%SS
000426140610     A*%%***********************************************************************
000427140610     A          R OR43A11
000428140610     A*%%***********************************************************************
000429140610     A*%%RI 00000
000430140610     A*%%***********************************************************************
000431140610     A                                      SPACEB(001)
000432140610     A                                    10
000433140610     A                                      'Anticipo'
000434140610     A            P_ROC900A      5S 0O    47
000435140610     A                                      EDTCDE(Z)
000436140610     A            P_ROC910A      5S 0O    55
000437140610     A                                      EDTCDE(Z)
000438140610     A*%%***********************************************************************
000439140610     A*%%SS
000440140610     A*%%***********************************************************************
000441140610     A          R OR43A12
000442140610     A*%%***********************************************************************
000443140610     A*%%RI 00000
000444140610     A*%%***********************************************************************
000445140610     A                                      SPACEB(001)
000446140610     A                                    10
000447140610     A                                      'In tempo'
000448140610     A            P_ROC900T      5S 0O    47
000449140610     A                                      EDTCDE(Z)
000450140610     A            P_ROC910T      5S 0O    55
000451140610     A                                      EDTCDE(Z)
000452140610     A*%%***********************************************************************
000453140610     A*%%SS
000454140610     A*%%***********************************************************************
000455140610     A          R OR43A13
000456140610     A*%%***********************************************************************
000457140610     A*%%RI 00000
000458140610     A*%%***********************************************************************
000459140610     A                                      SPACEB(001)
000460140610     A                                    10
000461140610     A                                      '1 gg.ritardo'
000462140610     A            P_ROC9001      5S 0O    47
000463140610     A                                      EDTCDE(Z)
000464140610     A            P_ROC9101      5S 0O    55
000465140610     A                                      EDTCDE(Z)
000466140610     A*%%***********************************************************************
000467140610     A*%%SS
000468140610     A*%%***********************************************************************
000469140610     A          R OR43A14
000470140610     A*%%***********************************************************************
000471140610     A*%%RI 00000
000472140610     A*%%***********************************************************************
000473140610     A                                      SPACEB(001)
000474140610     A                                    10
000475140610     A                                      '2 gg.ritardo'
000476140610     A            P_ROC9002      5S 0O    47
000477140610     A                                      EDTCDE(Z)
000478140610     A            P_ROC9102      5S 0O    55
000479140610     A                                      EDTCDE(Z)
000480140610     A*%%***********************************************************************
000481140610     A*%%SS
000482140610     A*%%***********************************************************************
000483140610     A          R OR43A15
000484140610     A*%%***********************************************************************
000485140610     A*%%RI 00000
000486140610     A*%%***********************************************************************
000487140610     A                                      SPACEB(001)
000488140610     A                                    10
000489140610     A                                      'Oltre'
000490140610     A            P_ROC900O      5S 0O    47
000491140610     A                                      EDTCDE(Z)
000492140610     A            P_ROC910O      5S 0O    55
000493140610     A                                      EDTCDE(Z)
000494140610     A*%%***********************************************************************
000495140610     A*%%SS
000496140610     A*%%***********************************************************************
000497140610     A          R OR43TA
000498140610     A*%%***********************************************************************
000499140610     A*%%RI 00000
000500140610     A*%%***********************************************************************
000501140610     A                                      SPACEB(001)
000502140610     A                                     1
000503140610     A                                      '-----------------------------------
000504140610     A                                      ------------------------------------
000505140610     A                                      ------------------------------------
000506140610     A                                      ------------------------------------
000507140610     A                                      ------------------------------------
000508140610     A                                      ------------------------'
000509140610     A                                     2
000510140610     A                                      'Totale Area:'
000511140610     A                                      SPACEB(001)
000512140610     A                                      HIGHLIGHT
000513140610     A            WARE           3S 0O    17
000514140610     A                                      HIGHLIGHT
000515140610     A            DESCRARE      10A  O    21
000516140610     A                                      HIGHLIGHT
000517140610     A            TATOT          5S 0O    34
000518140610     A                                      EDTCDE(Z)
000519140610     A            TA900          5S 0O    47
000520140610     A                                      EDTCDE(Z)
000521140610     A            TA910          5S 0O    55
000522140610     A                                      EDTCDE(Z)
000523140610     A            TA600          5S 0O    63
000524140610     A                                      EDTCDE(Z)
000525140610     A            TA99980        5S 0O    72
000526140610     A                                      EDTCDE(Z)
000527140610     A            TA99991        5S 0O    81
000528140610     A                                      EDTCDE(Z)
000529140610     A            TA99992        5S 0O    90
000530140610     A                                      EDTCDE(Z)
000531140610     A            TA99994        5S 0O    99
000532140610     A                                      EDTCDE(Z)
000533140610     A            TA99995        5S 0O   108
000534140610     A                                      EDTCDE(Z)
000535140610     A            TA99996        5S 0O   117
000536140610     A                                      EDTCDE(Z)
000537140610     A            TA99997        5S 0O   126
000538140610     A                                      EDTCDE(Z)
000539140610     A            TA50001        5S 0O   135
000540140610     A                                      EDTCDE(Z)
000541140610     A            TA50002        5S 0O   144
000542140610     A                                      EDTCDE(Z)
000543140610     A            TA50004        5S 0O   153
000544140610     A                                      EDTCDE(Z)
000545140610     A            TA400          5S 0O   161
000546140610     A                                      EDTCDE(Z)
000547140610     A            TA390          5S 0O   169
000548140610     A                                      EDTCDE(Z)
000549140610     A            TA300          5S 0O   177
000550140610     A                                      EDTCDE(Z)
000551140610     A            TA100          5S 0O   185
000552140610     A                                      EDTCDE(Z)
000553140610     A            TA050          5S 0O   193
000554140610     A                                      EDTCDE(Z)
000555140610     A                                     1
000556140610     A                                      '-----------------------------------
000557140610     A                                      ------------------------------------
000558140610     A                                      ------------------------------------
000559140610     A                                      ------------------------------------
000560140610     A                                      ------------------------------------
000561140610     A                                      ------------------------'
000562140610     A                                      SPACEB(001)
000563140610     A*%%***********************************************************************
000564140610     A*%%SS
000565140610     A*%%CL 001
000566140610     A*%%CL 001
000567140610     A*%%***********************************************************************
000568140610     A          R OR43TD
000569140610     A*%%***********************************************************************
000570140610     A*%%RI 00000
000571140610     A*%%FS 002
000572140610     A*%%***********************************************************************
000573140610     A                                      SPACEB(003)
000574140610     A                                     1
000575140610     A                                      '==================================-
000576140610     A                                      ===================================-
000577140610     A                                      ===================================-
000578140610     A                                      ===================================-
000579140610     A                                      ===================================-
000580140610     A                                      ========================'
000581140610     A                                     2
000582140610     A                                      'Tot.Distretto:'
000583140610     A                                      SPACEB(001)
000584140610     A                                      HIGHLIGHT
000585140610     A            WDIS           1A  O    18
000586140610     A                                      HIGHLIGHT
000587140610     A            DESCRDIS      10A  O    21
000588140610     A                                      HIGHLIGHT
000589140610     A            TDTOT          5S 0O    34
000590140610     A                                      EDTCDE(Z)
000591140610     A            TD900          5S 0O    47
000592140610     A                                      EDTCDE(Z)
000593140610     A            TD910          5S 0O    55
000594140610     A                                      EDTCDE(Z)
000595140610     A            TD600          5S 0O    63
000596140610     A                                      EDTCDE(Z)
000597140610     A            TD99980        5S 0O    72
000598140610     A                                      EDTCDE(Z)
000599140610     A            TD99991        5S 0O    81
000600140610     A                                      EDTCDE(Z)
000601140610     A            TD99992        5S 0O    90
000602140610     A                                      EDTCDE(Z)
000603140610     A            TD99994        5S 0O    99
000604140610     A                                      EDTCDE(Z)
000605140610     A            TD99995        5S 0O   108
000606140610     A                                      EDTCDE(Z)
000607140610     A            TD99996        5S 0O   117
000608140610     A                                      EDTCDE(Z)
000609140610     A            TD99997        5S 0O   126
000610140610     A                                      EDTCDE(Z)
000611140610     A            TD50001        5S 0O   135
000612140610     A                                      EDTCDE(Z)
000613140610     A            TD50002        5S 0O   144
000614140610     A                                      EDTCDE(Z)
000615140610     A            TD50004        5S 0O   153
000616140610     A                                      EDTCDE(Z)
000617140610     A            TD400          5S 0O   161
000618140610     A                                      EDTCDE(Z)
000619140610     A            TD390          5S 0O   169
000620140610     A                                      EDTCDE(Z)
000621140610     A            TD300          5S 0O   177
000622140610     A                                      EDTCDE(Z)
000623140610     A            TD100          5S 0O   185
000624140610     A                                      EDTCDE(Z)
000625140610     A            TD050          5S 0O   193
000626140610     A                                      EDTCDE(Z)
000627140610     A                                     1
000628140610     A                                      '==================================-
000629140610     A                                      ===================================-
000630140610     A                                      ===================================-
000631140610     A                                      ===================================-
000632140610     A                                      ===================================-
000633140610     A                                      ========================'
000634140610     A                                      SPACEB(001)
000635140610     A*%%***********************************************************************
000636140610     A*%%SS
000637140610     A*%%CL 001
000638140610     A*%%CL 001
000639140610     A*%%***********************************************************************
000640140610     A          R OR43TG
000641140610     A*%%***********************************************************************
000642140610     A*%%RI 00000
000643140610     A*%%***********************************************************************
000644140610     A                                      SPACEB(001)
000645140610     A                                     1
000646140610     A                                      '==================================-
000647140610     A                                      ===================================-
000648140610     A                                      ===================================-
000649140610     A                                      ===================================-
000650140610     A                                      ===================================-
000651140610     A                                      ========================'
000652140610     A                                     2
000653140610     A                                      'TOTALE GENERALE:'
000654140610     A                                      SPACEB(001)
000655140610     A            TGTOT          5S 0O    34
000656140610     A                                      EDTCDE(Z)
000657140610     A            TG900          5S 0O    47
000658140610     A                                      EDTCDE(Z)
000659140610     A            TG910          5S 0O    55
000660140610     A                                      EDTCDE(Z)
000661140610     A            TG600          5S 0O    63
000662140610     A                                      EDTCDE(Z)
000663140610     A            TG99980        5S 0O    72
000664140610     A                                      EDTCDE(Z)
000665140610     A            TG99991        5S 0O    81
000666140610     A                                      EDTCDE(Z)
000667140610     A            TG99992        5S 0O    90
000668140610     A                                      EDTCDE(Z)
000669140610     A            TG99994        5S 0O    99
000670140610     A                                      EDTCDE(Z)
000671140610     A            TG99995        5S 0O   108
000672140610     A                                      EDTCDE(Z)
000673140610     A            TG99996        5S 0O   117
000674140610     A                                      EDTCDE(Z)
000675140610     A            TG99997        5S 0O   126
000676140610     A                                      EDTCDE(Z)
000677140610     A            TG50001        5S 0O   135
000678140610     A                                      EDTCDE(Z)
000679140610     A            TG50002        5S 0O   144
000680140610     A                                      EDTCDE(Z)
000681140610     A            TG50004        5S 0O   153
000682140610     A                                      EDTCDE(Z)
000683140610     A            TG400          5S 0O   161
000684140610     A                                      EDTCDE(Z)
000685140610     A            TG390          5S 0O   169
000686140610     A                                      EDTCDE(Z)
000687140610     A            TG300          5S 0O   177
000688140610     A                                      EDTCDE(Z)
000689140610     A            TG100          5S 0O   185
000690140610     A                                      EDTCDE(Z)
000691140610     A            TG050          5S 0O   193
000692140610     A                                      EDTCDE(Z)
000693140610     A*%%***********************************************************************
000694140610     A*%%SS
000695140610     A*%%CL 001
000696140610     A*%%***********************************************************************
000697140610      * ?  F I N E    S T A M P A  ?
000698140610     A          R OR43E1
000699140610     A*%%***********************************************************************
000700140610     A*%%RI 00000
000701140610     A*%%FS+001 ==============================================================
000702140610     A*%%FS+    ==============================================================
000703140610     A*%%FS+    ==============================================================
000704140610     A*%%FS     ============
000705140610     A*%%FS 003
000706140610     A*%%***********************************************************************
000707140610     A                                      SPACEB(005)
000708140610     A                                    80
000709140610     A                                      '***   FINE  STAMPA   ***'
000710140610     A*%%***********************************************************************
000711140610     A*%%SS
000712140610     A*%%CP+999CRTPRTF
000713140610     A*%%CP+    FILE(GAITRAFIL/FIOR43P)
000714140610     A*%%CP+    DEVTYPE(*SCS)
000715140610     A*%%CP+    PAGESIZE(*N 198)
000716140610     A*%%CP+    CPI(15)
000717140610     A*%%CP     OVRFLW(64)
000718140610     A*%%CS+999CRTPRTF
000719140610     A*%%CS+    FILE(QTEMP/QPRDRPT)
000720140610     A*%%CS+    DEVTYPE(*SCS)
000721140610     A*%%CS     PAGESIZE(*N 198)
000722140610     A*%%***********************************************************************
