000010080505     A*%%TS  SD  20080505  092647  EDPGA       REL-V5R4M0  5722-WDS
000020080505     A*%%EC
000030080505     A                                      DSPSIZ(24 80 *DS3)
000040080505     A                                      CHGINPDFT(HI UL)
000050080505     A                                      PRINT
000060040302     A*------------------------------------*
000070080505     A          R OR09D01
000080080505     A*%%TS  SD  20080505  092647  EDPGA       REL-V5R4M0  5722-WDS
000090080505     A                                      CA03
000100080505     A                                      CF06
000110080505     A N06                                  CF18
000120080505     A                                      OVERLAY
000130080505     A  28        V1CMSG        78   M
000140080505     A            RSUT          20A  O  1  2DSPATR(HI)
000150080505     A                                  1 28'  STAMPA PROSPETTO ORM  '
000160080505     A                                      DSPATR(UL)
000170080505     A                                      DSPATR(RI)
000180080505     A            VTCPGM        10A  O  1 58DSPATR(HI)
000190080505     A                                  1 72DATE
000200080505     A                                      EDTCDE(Y)
000210080505     A                                      DSPATR(HI)
000220080505     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000230080505     A                                      DSPATR(HI)
000240080505     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000250080505     A                                      DSPATR(HI)
000260080505     A                                  2 72TIME
000270080505     A                                      DSPATR(HI)
000280080505     A                                  7 12'Filiale Gestione.:'
000290080505     A            V1CFGS         3Y 0B  7 31
000300080505     A  05                                  DSPATR(HI)
000310080505     A  40                                  DSPATR(PC)
000320080505     A N05                                  DSPATR(PR)
000330080505     A            V1DFGS        20A  O  7 39
000340080505     A                                  9 12'Data distinta....:'
000350080505     A            V1CDDC         8Y 0B  9 31CHECK(RZ)
000360080505     A                                      EDTCDE(Y)
000370080505     A  43                                  DSPATR(PC)
000380080505     A                                 15 12'Nr.distinta dal.?:'
000390080505     A            V1NDCDA        6A  B 15 31
000400080505     A  41                                  DSPATR(PC)
000410080505     A                                      CHECK(RZ)
000420080505     A                                 17 12'             al..:'
000430080505     A            V1NDCAL        6Y 0B 17 31CHECK(RB)
000440080505     A                                      EDTCDE(Z)
000450080505     A  42                                  DSPATR(PC)
000460080505     A                                 17 39'(999999=Tutte)'
000470080505     A                                 11 12'Tipo Distinta ...:'
000480080505     A N10                                  DSPATR(ND)
000490080505     A            V1CTPM         1A  B 11 31VALUES('P' 'M' ' ')
000500080505     A                                      DSPATR(HI)
000510080505     A N10                                  DSPATR(ND)
000520080505     A N10                                  DSPATR(PR)
000530080505     A                                 11 38'"P"=Parcel/"M"=Messaggerie/" "=Tut-
000540080505     A                                      te'
000550080505     A N10                                  DSPATR(ND)
000560080505     A                                 13 12'Tipo Uscita .....:'
000570080505     A N11                                  DSPATR(ND)
000580080505     A            V1CFPP         1A  B 13 31
000590080505     A N11                                  DSPATR(ND)
000600080505     A N11                                  DSPATR(PR)
000610080505     A N47                                  DSPATR(HI)
000620080505     A  47                                  DSPATR(PC)
000630080505     A  47                                  DSPATR(RI)
000640080505     A                                      VALUES('P' 'M')
000650080505     A                                 13 38'"M"=Mattina/"P"=Pomeriggio'
000660080505     A N11                                  DSPATR(ND)
000670080505     A                                 24 27'F3=Fine'
000680080505     A                                      DSPATR(HI)
000690080505     A                                 24 44'F6=Conferma'
000700080505     A                                      DSPATR(HI)
000710080505     A N06                             24 64'F18=Cambio Fil.'
000720080505     A                                      DSPATR(HI)
