000001080108     A*%%***********************************************************************
000002080108     A*%%TS  RD  20080108  135156  EDPMB       REL-V5R4M0  5722-WDS
000003080108     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004080108     A*%%FI       0000000000000000000000000000000000000000000000000
000005080108     A*%%***********************************************************************
000006080108      *---------------------------------------------------------------*
000007080108     A          R PRIPAG
000008080108     A*%%***********************************************************************
000009080108     A*%%RI 00000
000010080108     A*%%FS 001
000011080108     A*%%***********************************************************************
000012080108     A                                      SKIPB(002)
000013080108     A            RSUT          20A  O     1
000014080108     A                                   +38
000015080108     A                                      'S T A M P A'
000016080108     A                                      HIGHLIGHT
000017080108     A                                    +4
000018080108     A                                      'A N A G R A F I C A'
000019080108     A                                      HIGHLIGHT
000020080108     A                                    +4
000021080108     A                                      'C L I E N T I'
000022080108     A                                      HIGHLIGHT
000023080108     A                                    +4
000024080108     A                                      'R I T I R O'
000025080108     A                                      HIGHLIGHT
000026080108     A                                   167
000027080108     A                                      DATE(*YY)
000028080108     A                                      EDTCDE(Y)
000029080108     A                                    +1
000030080108     A                                      '- FIOR11R -'
000031080108     A                                   190
000032080108     A                                      'PAG.'
000033080108     A                                    +0
000034080108     A                                      PAGNBR
000035080108     A                                      EDTCDE(2)
000036080108     A                                     1
000037080108     A                                      '-----------------------------------
000038080108     A                                      ------------------------------------
000039080108     A                                      ------------------------------------
000040080108     A                                      ------------------------------------
000041080108     A                                      ------------------------------------
000042080108     A                                      ------------------------'
000043080108     A                                      SPACEB(005)
000044080108     A                                    67
000045080108     A                                      'P a r a m e t r i'
000046080108     A                                      SPACEB(004)
000047080108     A                                    88
000048080108     A                                      'd i'
000049080108     A                                    +4
000050080108     A                                      'E l a b o r a z i o n e'
000051080108     A                                    59
000052080108     A                                      'Ordinamento per'
000053080108     A                                      SPACEB(004)
000054080108     A                                      HIGHLIGHT
000055080108     A            PORDIN        21A  O    +1
000056080108     A                                      HIGHLIGHT
000057080108     A            PORDI2        35A  O    +1
000058080108     A                                    59
000059080108     A                                      'Filiale Gestione Cliente .....:'
000060080108     A                                      SPACEB(002)
000061080108     A            R11POA         3S 0O    +1
000062080108     A                                      HIGHLIGHT
000063080108     A                                      EDTCDE(Z)
000064080108     A            PDESCP        20A  O    +3
000065080108     A N15                                59
000066080108     A                                      'Tipo Anagrafica ..............:'
000067080108     A                                      SPACEB(002)
000068080108     A N15        R11TAC         1A  O    +1
000069080108     A                                      HIGHLIGHT
000070080108     A N15        PTIPOA        20A  O    +5
000071080108     A                                    59
000072080108     A                                      'Frequenza Ritiro .............:'
000073080108     A                                      SPACEB(002)
000074080108     A            R11TCR         1A  O    +1
000075080108     A                                      HIGHLIGHT
000076080108     A            PTIPOR        20A  O    +5
000077080108     A                                    59
000078080108     A                                      'Codice Piano dei Conti .......:'
000079080108     A                                      SPACEB(002)
000080080108     A            R11KSC         7S 0O    91
000081080108     A                                      EDTCDE(Z)
000082080108     A                                      HIGHLIGHT
000083080108     A            PDESKSC       30A  O    +1
000084080108     A  15                                59
000085080108     A                                      'Solo Clienti con Giro Ritiro .:'
000086080108     A                                      SPACEB(002)
000087080108     A  15        R11SOL         1A  O    91
000088080108     A                                      HIGHLIGHT
000089080108     A  15        PSOLOZ        35A  O    97
000090080108     A  15                                59
000091080108     A                                      'Giro di Ritiro ...............:'
000092080108     A                                      SPACEB(002)
000093080108     A  15        R11POCGI       3S 0O    +1
000094080108     A  15        R11CGI        10A  O    +1
000095080108     A                                      HIGHLIGHT
000096080108     A  15        PDESCGI       25A  O    +1
000097080108     A                                     1
000098080108     A                                      '-----------------------------------
000099080108     A                                      ------------------------------------
000100080108     A                                      ------------------------------------
000101080108     A                                      ------------------------------------
000102080108     A                                      ------------------------------------
000103080108     A                                      ------------------------'
000104080108     A                                      SPACEB(003)
000105080108     A*%%***********************************************************************
000106080108     A*%%SS
000107080108     A*%%CL 005
000108080108     A*%%CL 004
000109080108     A*%%CL 004
000110080108     A*%%CL 002
000111080108     A*%%CL 002
000112080108     A*%%CL 002
000113080108     A*%%CL 002
000114080108     A*%%CL 002
000115080108     A*%%CL 002
000116080108     A*%%CL 003
000117080108     A*%%***********************************************************************
000118080108      *---------------------------------------------------------------*
000119080108     A          R TESTA
000120080108     A*%%***********************************************************************
000121080108     A*%%RI 00000
000122080108     A*%%FS 001
000123080108     A*%%***********************************************************************
000124080108     A                                      SKIPB(002)
000125080108     A                                      SPACEA(001)
000126080108     A            RSUT          20A  O     1
000127080108     A                                   +38
000128080108     A                                      'S T A M P A'
000129080108     A                                      HIGHLIGHT
000130080108     A                                    +4
000131080108     A                                      'A N A G R A F I C A'
000132080108     A                                      HIGHLIGHT
000133080108     A                                    +4
000134080108     A                                      'C L I E N T I'
000135080108     A                                      HIGHLIGHT
000136080108     A                                    +4
000137080108     A                                      'R I T I R O'
000138080108     A                                      HIGHLIGHT
000139080108     A                                   167
000140080108     A                                      DATE(*YY)
000141080108     A                                      EDTCDE(Y)
000142080108     A                                    +1
000143080108     A                                      '- FIOR11R -'
000144080108     A                                   190
000145080108     A                                      'PAG.'
000146080108     A                                    +0
000147080108     A                                      PAGNBR
000148080108     A                                      EDTCDE(2)
000149080108     A                                     1
000150080108     A                                      '-----------------------------------
000151080108     A                                      ------------------------------------
000152080108     A                                      ------------------------------------
000153080108     A                                      ------------------------------------
000154080108     A                                      ------------------------------------
000155080108     A                                      ------------------------'
000156080108     A                                      SPACEB(002)
000157080108     A*%%***********************************************************************
000158080108     A*%%SS
000159080108     A*%%CL 002
000160080108     A*%%CL 001
000161080108     A*%%***********************************************************************
000162080108      *---------------------------------------------------------------*
000163080108     A          R DETT
000164080108     A*%%***********************************************************************
000165080108     A*%%RI 00000
000166080108     A*%%***********************************************************************
000167080108     A                                      SPACEB(001)
000168080108     A            ACRCRO        10S 0O     1
000169080108     A                                      HIGHLIGHT
000170080108     A            ACRRSR        48A  O    +2
000171080108     A                                    +1
000172080108     A                                      'Ref.:'
000173080108     A            PREFER        23A  O    +1
000174080108     A                                    +1
000175080108     A                                      'Tel.:'
000176080108     A            ACRTEL        16A  O    98
000177080108     A                                   116
000178080108     A                                      'NatM:'
000179080108     A            ACRNTM        35A  O   122
000180080108     A                                    +1
000181080108     A                                      'Note:'
000182080108     A            ACRNO1        35A  O    +1
000183080108     A                                     1
000184080108     A                                      'T.Anagr:'
000185080108     A                                      SPACEB(001)
000186080108     A            ACRTAC         1A  O    +1
000187080108     A            ACRINR        35A  O    13
000188080108     A            ACRCAR         9A  O    +1
000189080108     A                                    +4
000190080108     A                                      'Sponda:'
000191080108     A            ACRSPI         1A  O    +1
000192080108     A                                    +3
000193080108     A                                      'Contatto x ORM COMMISSIONATO:'
000194080108     A            PCOMM          2A  O    +1
000195080108     A                                    +3
000196080108     A                                      'Mail:'
000197080108     A            PEMAIL        40A  O    +1
000198080108     A            ACRNO2        35A  O   164
000199080108     A                                     1
000200080108     A                                      'Fr.Rit.:'
000201080108     A                                      SPACEB(001)
000202080108     A            ACRTCR         1A  O    +1
000203080108     A            ACRLOR        35A  O    13
000204080108     A            ACRPRR         2A  O    +1
000205080108     A            ACRNAR         3A  O    +1
000206080108     A                                    +7
000207080108     A                                      'Codici:'
000208080108     A                                    +1
000209080108     A                                      'Ord'
000210080108     A            ACRCCO        10S 0O    +1
000211080108     A                                      EDTCDE(Z)
000212080108     A                                    +1
000213080108     A                                      'PdC'
000214080108     A            ACRKSC         7S 0O    +1
000215080108     A                                      EDTCDE(Z)
000216080108     A            PCTR           3A  O    +1
000217080108     A                                    +9
000218080108     A                                      'F.Im:'
000219080108     A                                    +1
000220080108     A                                      'Cl'
000221080108     A            ACRFCL         1A  O    +1
000222080108     A                                      HIGHLIGHT
000223080108     A                                    +2
000224080108     A                                      'Bn'
000225080108     A            ACRFBN         1A  O    +1
000226080108     A                                      HIGHLIGHT
000227080108     A                                    +2
000228080108     A                                      'Pe'
000229080108     A            ACRFPK         1A  O    +1
000230080108     A                                      HIGHLIGHT
000231080108     A                                    +2
000232080108     A                                      'Vo'
000233080108     A            ACRFMC         1A  O    +1
000234080108     A                                      HIGHLIGHT
000235080108     A                                    +2
000236080108     A                                      'Bi'
000237080108     A            ACRFBL         1A  O    +1
000238080108     A                                      HIGHLIGHT
000239080108     A                                    +2
000240080108     A                                      'Mo'
000241080108     A            ACRFMT         1A  O    +1
000242080108     A                                      HIGHLIGHT
000243080108     A                                    +2
000244080108     A                                      'Au'
000245080108     A            ACRFAT         1A  O    +1
000246080108     A                                      HIGHLIGHT
000247080108     A*%%***********************************************************************
000248080108     A*%%SS
000249080108     A*%%CL 001
000250080108     A*%%CL 001
000251080108     A*%%***********************************************************************
000252080108      *---------------------------------------------------------------*
000253080108     A          R GIRO
000254080108     A*%%***********************************************************************
000255080108     A*%%RI 00000
000256080108     A*%%***********************************************************************
000257080108     A                                      SPACEB(001)
000258080108     A                                    13
000259080108     A                                      'Giri Ritiro:'
000260080108     A                                    +2
000261080108     A                                      'Standard:'
000262080108     A            PPOCGI1   R        O    +1
000263080108     A                                      REFFLD(ACR1POCGI  FNACR10F)
000264080108     A            PCGI1     R        O    +1
000265080108     A                                      REFFLD(ACR1CGI    FNACR10F)
000266080108     A            PDCGI1    R             +1
000267080108     A                                      REFFLD(GRGDES     FIGRG00F)
000268080108     A                                    +2
000269080108     A                                      'Oltre:'
000270080108     A            PPOCGI2   R        O    +1
000271080108     A                                      REFFLD(ACR1POCGI  FNACR10F)
000272080108     A            PCGI2     R        O    +1
000273080108     A                                      REFFLD(ACR1CGI    FNACR10F)
000274080108     A            PDCGI2    R             +1
000275080108     A                                      REFFLD(GRGDES     FIGRG00F)
000276080108     A                                    +2
000277080108     A                                      'Sotto:'
000278080108     A            PPOCGI3   R        O    +1
000279080108     A                                      REFFLD(ACR1POCGI  FNACR10F)
000280080108     A            PCGI3     R        O    +1
000281080108     A                                      REFFLD(ACR1CGI    FNACR10F)
000282080108     A            PDCGI3    R             +1
000283080108     A                                      REFFLD(GRGDES     FIGRG00F)
000284080108     A*%%***********************************************************************
000285080108     A*%%SS
000286080108     A*%%***********************************************************************
000287080108      *---------------------------------------------------------------*
000288080108     A          R VUOTO
000289080108     A*%%***********************************************************************
000290080108     A*%%RI 00000
000291080108     A*%%***********************************************************************
000292080108     A                                      SPACEB(001)
000293080108     A*%%***********************************************************************
000294080108     A*%%SS
000295080108     A*%%***********************************************************************
000296080108      *---------------------------------------------------------------*
000297080108     A          R FINEST
000298080108     A*%%***********************************************************************
000299080108     A*%%RI 00000
000300080108     A*%%***********************************************************************
000301080108     A                                      SPACEB(001)
000302080108     A                                     1
000303080108     A                                      '****'
000304080108     A                                    +2
000305080108     A                                      'FINE STAMPA'
000306080108     A                                    +2
000307080108     A                                      '****'
000308080108     A*%%***********************************************************************
000309080108     A*%%SS
000310080108     A*%%CP+999CRTPRTF
000311080108     A*%%CP+    FILE(GAITRAFIL/FIOR11P)
000312080108     A*%%CP+    DEVTYPE(*SCS)
000313080108     A*%%CP+    PAGESIZE(*N 198)
000314080108     A*%%CP+    CPI(15)
000315080108     A*%%CP+    MAXRCDS(*NOMAX)
000316080108     A*%%CP     USRDTA(AN.CLI.RIT)
000317080108     A*%%CS+999CRTPRTF
000318080108     A*%%CS+    FILE(QTEMP/QPRDRPT)
000319080108     A*%%CS+    DEV(LJ4000CED)
000320080108     A*%%CS+    DEVTYPE(*SCS)
000321080108     A*%%CS+    PAGESIZE(*N 198)
000322080108     A*%%CS     CPI(15)
000323080108     A*%%***********************************************************************
