000100140416     A          R FIOR900                   TEXT('ORM: Reperisce mail/sms -
000200140416     A                                      input')
000300131007
000400140416     A            IOR90TLA       1A         TEXT('"L" = Elabora e chiude in LR -
000500140416     A                                      "C" = NON elabora e chiude in LR -
000600140416     A                                      " " = Elabora e chiude in RT')
000700140416     A            IOR90RCDM      2A         TEXT('Tipo rcd x reperire mail')
000800140416     A            IOR90RCDS      2A         TEXT('Tipo rcd x reperire sms')
000900140416     A            IOR90POE       3S 0       TEXT('Filiale Emissione')
001000140416     A            IOR90NSR       2S 0       TEXT('Serie')
001100140416     A            IOR90NOR       7S 0       TEXT('Numero ORM')
001200140416     A            IOR90NRV       2S 0       TEXT('Viaggio')
001300140416     A            OOR90ERR       1A         TEXT('N = Dato non trovato')
001400140416     A            OOR90MAIL     60A         TEXT('Mail')
001500140416     A            OOR90SMS      16A         TEXT('N.Cellulare x SMS')
