000100950517     A*--------------------------------------------------------------*
000200070724     A* DS parametri preparazione distinta ORM  AUTOMATICA           *
000300950517     A*--------------------------------------------------------------*
000400070724     A          R OR68REC                   TEXT('DS Preparazione distinta')
000500070724
000600070724      * CAMPI IN INPUT
000700070724
000800070724     A            OR68CMTI       1          TEXT('COMMIT S=COMMIT N=NON COMMIT')
000900070724     A            OR68FGSI       3S 0       TEXT('Filiale in gestione')
001000070724     A            OR68DFVI       8S 0       TEXT('Data distinta')
001100070724     A            OR68FPPI       1          TEXT('Tipo uscita distinta')
001200070724     A            OR68TPMI       1          TEXT('P=PARCEL/M=MESSAGGERIE -
001300070724     A                                      BLANKS= TUTTE')
001400071010     A            OR68ALLEGA     1          TEXT('E=ESCLUDI ORM CON ALLEGATI -
001500071010     A                                      I=SELEZIONA SOLO ORM CON ALLEGATI-
001600071010     A                                       " " = TUTTI')
001601161108     A            OR68FINOA      1          TEXT('E=ESCLUDI ORM PESO FINO A  -
001602161108     A                                      I=SELEZIONA SOLO ORM PESO FINO A -
001603161108     A                                       " " = TUTTI')
001700070724
001800070724      * CAMPI IN OUTPUT
001900070724
002000070724     A            OR68ERRO       1          TEXT('Codice ERRORE')
002100070724     A            OR68PAG        3S 0       TEXT('PAGINA X STAMPA')
002200070724     A            OR68RIGA       3S 0       TEXT('RIGA X STAMPA')
