000100001130      *--------------------------------------------------------------*
000200080606      *  DS PARAMETRI RICEVUTI SE RICHIAMATO DA ALTRO PGM            *
000300001130      *--------------------------------------------------------------*
000400080610     A          R FIOR60                    TEXT('DS ASSEGNAZ.MANUALE')
000500080610
000600080610     A            O60PGM        10A         TEXT('PGM CHIAMANTE')
000700080610      * OPZ. DI SCELTA
000800080610     A            O60OPZ         1A         TEXT('OPZIONE DI SELEZIONE')
000900080610
001000080610     A            O60FGS         3S 0       TEXT('FILIALE DI GESTIONE')
001100080610
001200080610     A            O60NFV         6S 0       TEXT('NR.DISTINTA')
001300080606      * DATA DEL
001400080610     A            O60DFV         8S 0       TEXT('DATA DAL AAAAMMGG')
001500080606     A                                      COLHDG('DAL' 'AAAAMMGG')
001600080610      * FLG DI ERRORE
001700080610     A            O60ERR         1A         TEXT('BLANK= NO ERRORI')
001800080610
