000100021212      *--------------------------------------------------------------*
000200060517      * DS per passaggio parametri Variazione P.D.C.                 *
000300021212      *--------------------------------------------------------------*
000400060517     A          R TNTA73DS                  TEXT('DS X PASSAGGIO PARAMETRI')
000500060517     A            I73KCC         4S 0       TEXT('CAPOCONTO ')
000600060517     A            I73KSC         7S 0       TEXT('SOTTOCONTO')
000700060517     A            I73RAG        48          TEXT('Ragione Sociale')
000800060517     A            I73DUV         8S 0       TEXT('DATA ULTIMA VARIAZIONE')
