000100100803      */*PRM mbr(*none) size(1 0 0)
000200100803      */*END
000300100803      *---------------------------------------------------------------*
000400100803      *?Invio e-mail di invio materiale illustrativo                 ?*
000500100803      *---------------------------------------------------------------*
000600100803     A                                      REF(TRTCM1DS)
000700100803      *
000800100803     A          R TRMK24S
000900100803     A                                      TEXT('Parm x e-mail di inv-
001000100803     A                                      io materiale illustrativo')
001100100803      *
001200100803     A            IMK24TLT  R               REFFLD(CPSCLT     TICPS00F)
001300100805     A            IMK24LIN  R               REFFLD(LINISO2    AZLIN00F)
001400100910     A            IMK24TDE  R               REFFLD($FLA       CNDIZION)
001500100910     A                                      TEXT('TIPO DESTINATARIO: +
001600100910     A                                            C=Cliente, +
001700100910     A                                            P=Potenziale')
001800100910     A            IMK24CDE  R               REFFLD($CPO       CNDIZION)
001900100910     A                                      TEXT('COD. DESTINATARIO (C-
002000100910     A                                      LIENTE O POTENZIALE)')
002100100908     A            IMK24MAI  R  120          REFFLD(低M1DST   )
002200100910     A            IMK24RST  R  120          REFFLD($RST       CNDIZION)
002300100908     A            IMK24OBJ  R   58          REFFLD(低M1VAR   )
002400100908     A                                      TEXT('OGGETTO E-MAIL')
002500100803     A            IMK24CMM  R               REFFLD($CMM       CNDIZION)
002600100908     A                                      TEXT('CODICE COMMERCIALE F-
002700100908     A                                      IRMA')
002800100806     A            IMK24RIG       3  0       TEXT('RIGA IN CUI POSIZION-
002900100806     A                                      ARE LA WINDOW')
003000100806     A            IMK24COL       3  0       TEXT('COLONNA IN CUI POSIZ-
003100100806     A                                      IONARE LA WINDOW')
003200100803      *
003300100915     A*//         OMK24MITT R               REFFLD(低M1MITT  )
003400100908     A            OMK24TLT  R               REFFLD(CPSCLT     TICPS00F)
003500100915     A            OMK24LIN  R               REFFLD(LINISO2    AZLIN00F)
003600100908     A            OMK24MAI  R  120          REFFLD(低M1DST   )
003700100901     A            OMK24OBJ  R   58          REFFLD(低M1VAR   )
003800100805     A                                      TEXT('OGGETTO E-MAIL')
003900100908     A            OMK24RST  R  120          REFFLD($RST       CNDIZION)
004000100908     A            OMK24CMM  R               REFFLD($CMM       CNDIZION)
004100100908     A                                      TEXT('CODICE COMMERCIALE F-
004200100908     A                                      IRMA')
004300100915     A            OMK24CMD  R               REFFLD($CMD       CNDIZION)
004400100915     A                                      TEXT('DECOD. COMMERCIALE F-
004500100915     A                                      IRMA')
004600100803      *
004700100803     A            OMK24FXX       2          TEXT('Tasto Funzionale di -
004800100908     A                                      uscita: 06=F6, 12=F12.')
004900100803     A            OMK24ERR  R               REFFLD($FLA       CNDIZION)
005000100803     A                                      TEXT('*on = Errore')
005100100803     A            OMK24MSG      78A
005200100803     A                                      TEXT('Messaggio di errore')
