000010160908     A*%%TS  SD  20160908  104526  EDPMB       REL-V7R1M0  5770-WDS
000020091027     A*** FILE : TRMK02D *--------------------------------------------*
000030920415     A*      GESTIONE ANAGRAFICA CLIENTI POTENZIALI                   *
000040920423     A***------------------------------------------------------------**
000050160908     A*%%EC
000060160908     A                                      DSPSIZ(24 80 *DS3)
000070160908     A                                      PRINT
000080120703     A**-------------------------------------------------------------**
000090160908     A          R MK02D01
000100160908     A*%%TS  SD  20160908  104526  EDPMB       REL-V7R1M0  5770-WDS
000110160908     A                                      CA03
000120160908     A N59                                  CA12
000130160908     A N02                                  CF06
000140160908     A                                      CF18
000150160908     A                                      CF14
000160160908     A                                      CF02
000170160908     A                                      CF05
000180160908     A  06                                  CF22
000190160908     A  12                                  CF20
000200160908     A                                      CF19
000210160908     A  28        VIDMSG        78   M
000220160908     A            RSUT          20A  O  1  2TEXT('DESCRIZIONE DITTA')
000230160908     A            VIDTES        37A  O  1 24DSPATR(UL)
000240160908     A                                      DSPATR(RI)
000250160908     A                                  1 63'TRMK02R'
000260160908     A                                  1 72DATE
000270160908     A                                      EDTCDE(Y)
000280160908     A            KNSIF         10A  O  2  2
000290160908     A            KNMUS         10A  O  2 14
000300160908     A  02                              2 35'INTERROGAZIONE'
000310160908     A                                      DSPATR(RI)
000320160908     A N10N02                           2 35'VARIAZIONE'
000330160908     A                                      DSPATR(RI)
000340160908     A  10N02                           2 38'IMMISSIONE'
000350160908     A                                      DSPATR(RI)
000360160908     A                                  2 72TIME
000370160908     A                                  4  2'Ins.Anagrafica'
000380160908     A            VIDDAC         8Y 0O  4 17DSPATR(HI)
000390160908     A                                      EDTWRD('  /  /    ')
000400160908     A                                  4 34'1°Contatto'
000410160908     A            VIDDPC         8Y 0O  4 45DSPATR(HI)
000420160908     A                                      EDTWRD('  /  /    ')
000430160908     A            VIDDFLS       20A  O  4 60DSPATR(RI)
000440160908     A                                  6  2'Codice ...........:'
000450160908     A            VIDCP1         3S 0O  6 22DSPATR(HI)
000460160908     A            VIDCP2         8S 0O  6 26DSPATR(HI)
000470160908     A                                  7  2'Ragione Sociale ..:'
000480160908     A            VIDRAG        48A  B  7 22
000490160908     A  02                                  DSPATR(PR)
000500160908     A  40                                  DSPATR(PC)
000510160908     A N02                                  DSPATR(UL)
000520160908     A                                      DSPATR(HI)
000530160908     A                                  8  2'Indirizzo ........:'
000540160908     A            VIDVIA        35A  B  8 22
000550160908     A  02                                  DSPATR(PR)
000560160908     A  41                                  DSPATR(PC)
000570160908     A N02                                  DSPATR(UL)
000580160908     A                                      DSPATR(HI)
000590160908     A            VIDCAP         9A  B  9 22
000600160908     A  44                                  DSPATR(PC)
000610160908     A  02                                  DSPATR(PR)
000620160908     A N02                                  DSPATR(UL)
000630160908     A                                      DSPATR(HI)
000640160908     A            VIDCIT        35A  B  9 32
000650160908     A  02                                  DSPATR(PR)
000660160908     A  42                                  DSPATR(PC)
000670160908     A N02                                  DSPATR(UL)
000680160908     A                                      DSPATR(HI)
000690160908     A            VIDPRV         2A  B  9 69
000700160908     A  02                                  DSPATR(PR)
000710160908     A  43                                  DSPATR(PC)
000720160908     A N02                                  DSPATR(UL)
000730160908     A                                      DSPATR(HI)
000740160908     A            VIDNAZ         3A  B  9 73
000750160908     A  45                                  DSPATR(PC)
000760160908     A  02                                  DSPATR(PR)
000770160908     A N02                                  DSPATR(UL)
000780160908     A                                      DSPATR(HI)
000790160908     A                                 10  2'Codice Fiscale ...:'
000800160908     A            VIDCDF        16A  B 10 22
000810160908     A  56                                  DSPATR(PC)
000820160908     A  02                                  DSPATR(PR)
000830160908     A N02                                  DSPATR(UL)
000840160908     A                                      DSPATR(HI)
000850160908     A                                 10 42'P.IVA:'
000860160908     A            VIDIVAIT      14A  B 10 49
000870160908     A  66                                  DSPATR(PC)
000880160908     A  02                                  DSPATR(PR)
000890160908     A N02                                  DSPATR(UL)
000900160908     A                                      DSPATR(HI)
000910160908     A            VIDIVAEU       2A  B 10 64
000920160908     A  02                                  DSPATR(PR)
000930160908     A N02                                  DSPATR(UL)
000940160908     A                                      DSPATR(HI)
000950160908     A                                 12  2'Telefono .........:'
000960160908     A            VIDTEL        16A  B 12 22
000970160908     A  02                                  DSPATR(PR)
000980160908     A  46                                  DSPATR(PC)
000990160908     A N02                                  DSPATR(UL)
001000160908     A                                      DSPATR(HI)
001010160908     A                                 12 42'Fax .:'
001020160908     A            VIDFAX        16A  B 12 49
001030160908     A  02                                  DSPATR(PR)
001040160908     A  47                                  DSPATR(PC)
001050160908     A N02                                  DSPATR(UL)
001060160908     A                                      DSPATR(HI)
001070160908     A                                 13  2'Resp.Trasporti'
001080160908     A            VIDRSP1       60A  O 13 17DSPATR(HI)
001090160908     A                                 15  2'Cat.Merceologica ?:'
001100160908     A            VIDSCT         5A  B 15 22
001110160908     A  48                                  DSPATR(PC)
001120160908     A  02                                  DSPATR(PR)
001130160908     A N02                                  DSPATR(UL)
001140160908     A                                      CHECK(RZ)
001150160908     A                                      DSPATR(HI)
001160160908     A            DESSCT        46A  O 15 28DSPATR(HI)
001170160908     A                                 16  2'Descr. Prodotto:'
001180160908     A            VIDDETP       60A  B 16 19DSPATR(HI)
001190160908     A  02                                  DSPATR(PR)
001200160908     A N02                                  DSPATR(UL)
001210160908     A            VIDFATD       61A  O 17  2
001220160908     A                                 17 66'Sede/Fil'
001230160908     A            VIDFSF         4A  B 17 75
001240160908     A  67                                  DSPATR(PC)
001250160908     A                                      VALUES('SEDE' 'FIL ')
001260160908     A  02                                  DSPATR(PR)
001270160908     A N02                                  DSPATR(UL)
001280160908     A                                      DSPATR(HI)
001290160908     A            VIDDSPT       45A  O 18  2
001300160908     A                                 18 56'Importanza cliente'
001310160908     A            VIDCIC         1A  O 18 75DSPATR(HI)
001320160908     A                                 19  2'Anno Inizio Attività:'
001330160908     A            VIDANNOIA      4A  O 19 24DSPATR(HI)
001340160908     A                                 20  2'Commerciale .....?:'
001350160908     A            VIDCMM         7A  B 20 22
001360160908     A  50                                  DSPATR(PC)
001370160908     A  02                                  DSPATR(PR)
001380160908     A N02                                  DSPATR(UL)
001390160908     A                                      CHECK(RZ)
001400160908     A                                      DSPATR(HI)
001410160908     A            DESCMM        25A  O 20 30
001420160908     A                                 21  2'Fil.Gestione ....?:'
001430160908     A            VIDFLT         3A  B 21 22
001440160908     A  02                                  DSPATR(PR)
001450160908     A                                      CHECK(RZ)
001460160908     A  49                                  DSPATR(PC)
001470160908     A N02                                  DSPATR(UL)
001480160908     A                                      DSPATR(HI)
001490160908     A            DESFLT        20A  O 21 30
001500160908     A  06                             23  2'F22=Richiesta Contatto'
001510160908     A                                      COLOR(BLU)
001520160908     A                                 23 43'F5=Attività'
001530160908     A N77                                  COLOR(BLU)
001540160908     A  77                                  COLOR(PNK)
001550160908     A  12                             23 58'F20=Codici collegati'
001560160908     A                                      COLOR(BLU)
001570160908     A                                 24  2'F3=Fine'
001580160908     A                                      COLOR(BLU)
001590160908     A                                 24 13'F2=Rubrica'
001600160908     A N78                                  COLOR(BLU)
001610160908     A  78                                  COLOR(PNK)
001620160908     A N02                             24 27'F6=Conferma'
001630160908     A                                      COLOR(BLU)
001640160908     A                                 24 43'F14=InfoComm.'
001650160908     A N11                                  COLOR(BLU)
001660160908     A  11                                  COLOR(PNK)
001670160908     A                                 24 58'F18=Note'
001680160908     A N79                                  COLOR(BLU)
001690160908     A  79                                  COLOR(PNK)
001700160908     A N59                             24 69'F12=Ritorno'
001710160908     A                                      COLOR(BLU)
001720160908     A                                 23 27'F19=Variazioni'
001730160908     A N80                                  COLOR(BLU)
001740160908     A  80                                  COLOR(PNK)
