000001110531     A*%%***********************************************************************
000002110531     A*%%TS  RD  20110531  102556  EDPGA       REL-V6R1M0  5761-WDS
000003110531     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004110531     A*%%FI       0000000000000000000000000000000000000000000000000
000005110531     A*%%***********************************************************************
000006110531      */*PRM devtype(*SCS) pagesize(66 198 *rowcol) lpi(6) cpi(15)
000007110531      */*PRM ovrflw(62) usrdta('Agenda')
000008110531      */*END
000009110531      *======================================================================*
000010110531      *  STAMPA AGENDA COMMERCIALE                                           *
000011110531      *======================================================================*
000012110531     A                                      INDARA
000013110531      *---------------------
000014110531     A          R MK89PAGINA
000015110531     A*%%***********************************************************************
000016110531     A*%%RI 00000
000017110531     A*%%***********************************************************************
000018110531     A                                      SKIPB(001)
000019110531     A                                     1
000020110531     A                                      ' '
000021110531     A*%%***********************************************************************
000022110531     A*%%SS
000023110531     A*%%***********************************************************************
000024110531      *---------------------
000025110531     A          R MK89SEPARA
000026110531     A*%%***********************************************************************
000027110531     A*%%RI 00000
000028110531     A*%%***********************************************************************
000029110531     A                                      SPACEB(001)
000030110531     A            WRKRIGA      198A        1
000031110531     A*%%***********************************************************************
000032110531     A*%%SS
000033110531     A*%%***********************************************************************
000034110531      *---------------------
000035110531     A          R MK89TESTA
000036110531     A*%%***********************************************************************
000037110531     A*%%RI 00000
000038110531     A*%%***********************************************************************
000039110531     A                                      SPACEB(001)
000040110531     A            RSUT          20A        1
000041110531     A            TITOLO        66A       63
000042110531     A                                      HIGHLIGHT
000043110531     A            NOMEPGM       10A  O   154
000044110531     A            DATAELA        8S 0    172
000045110531     A                                      EDTWRD('  /  /    ')
000046110531     A                                   187
000047110531     A                                      'PAG.'
000048110531     A                                   192
000049110531     A                                      PAGNBR
000050110531     A                                      EDTCDE(Z)
000051110531      *
000052110531     A            KNSIF     R              1
000053110531     A                                      REFFLD(KNSIF KPJBA)
000054110531     A                                      SPACEB(001)
000055110531     A            KNMUS     R             12
000056110531     A                                      REFFLD(KNMUS KPJBA)
000057110531     A N12                                29
000058110531     A                                      'Commerciale:'
000059110531     A N12        PCODCMM        7S 0O    42
000060110531     A                                      EDTCDE(Z)
000061110531     A                                      HIGHLIGHT
000062110531     A N12        PDESCMM       25A  O    50
000063110531     A                                      HIGHLIGHT
000064110531     A N14                                77
000065110531     A                                      'Dal:'
000066110531     A N14        PDATAI         8S 0O    82
000067110531     A                                      EDTCDE(Y)
000068110531     A N14                                93
000069110531     A                                      'Al:'
000070110531     A N14        PDATAF         8S 0O    97
000071110531     A                                      EDTCDE(Y)
000072110531     A N11                                +9
000073110531     A                                      'Attività'
000074110531     A N11        PINCOMI        7A  O    +1
000075110531     A            PTATIO        39A  O    +1
000076110531     A            ORAELA         6S 0O   174
000077110531     A                                      EDTWRD('  :  :  ')
000078110531     A*%%***********************************************************************
000079110531     A*%%SS
000080110531     A*%%CL 001
000081110531     A*%%***********************************************************************
000082110531      *---------------------
000083110531     A          R MK89INTCOL
000084110531     A*%%***********************************************************************
000085110531     A*%%RI 00000
000086110531     A*%%***********************************************************************
000087110531     A                                      SPACEB(001)
000088110531     A                                    15
000089110531     A                                      'C L I E N T E'
000090110531     A                                    54
000091110531     A                                      'COD.CLI'
000092110531     A                                    69
000093110531     A                                      'TRATTATIVA'
000094110531     A                                    86
000095110531     A                                      'CAT.MERCEOLOGICA'
000096110531     A                                   105
000097110531     A                                      'INFO COMMERCIALI'
000098110531     A                                   127
000099110531     A                                      'Appuntamento preso da'
000100110531     A                                   154
000101110531     A                                      'NOTE'
000102110531     A*%%***********************************************************************
000103110531     A*%%SS
000104110531     A*%%***********************************************************************
000105110531      *---------------------
000106110531     A          R MK89GIORNO
000107110531     A*%%***********************************************************************
000108110531     A*%%RI 00000
000109110531     A*%%***********************************************************************
000110110531     A                                      SPACEB(001)
000111110531     A                                     1
000112110531     A                                      'Attività del Giorno:'
000113110531     A                                      UNDERLINE
000114110531     A            PDATA          8S 0O    +1
000115110531     A                                      EDTCDE(Y)
000116110531     A                                      UNDERLINE
000117110531     A*%%***********************************************************************
000118110531     A*%%SS
000119110531     A*%%***********************************************************************
000120110531      *---------------------
000121110531     A          R MK89RIGA
000122110531     A*%%***********************************************************************
000123110531     A*%%RI 00000
000124110531     A*%%***********************************************************************
000125110531     A                                      SPACEB(001)
000126110531     A            PDESTAT        3A  O     1
000127110531     A  10                                  HIGHLIGHT
000128110531     A            PORA           4S 0O     6
000129110531     A                                      EDTWRD(' 0:  ')
000130110531     A            PRAGSOC       40A  O    13
000131110531     A                                      HIGHLIGHT
000132110531     A            PCODKSC        7S 0O    +1
000133110531     A                                      EDTCDE(Z)
000134110531     A            PNRV           7S 0O    63
000135110531     A                                      EDTCDE(Z)
000136110531     A            PTPV           1A  O    72
000137110531     A                                      HIGHLIGHT
000138110531     A            POFFERTA       3A  O    76
000139110531     A                                      HIGHLIGHT
000140110531     A            PDESCAT       15A  O    86
000141110531     A            PFATCPO       22A  O   103
000142110531     A            PDESCO3       25A  O   127
000143110531     A            PNOTA01       45A  O   154
000144110531      *
000145110531     A            PCAUSALE       2A  O     2
000146110531     A                                      SPACEB(001)
000147110531     A            PVIA          35A  O    13
000148110531     A            PFATNRV       22A  O    63
000149110531     A                                    88
000150110531     A                                      'Imp.Cli'
000151110531     A            PCLV           1A  O    96
000152110531     A                                      HIGHLIGHT
000153110531     A            PSPEDCPO      22A  O   103
000154110531     A            PNOTA02       45A  O   154
000155110531      *
000156110531     A            PCAP           5A  O    13
000157110531     A                                      SPACEB(001)
000158110531     A            PLOC          40A  O    19
000159110531     A            PSPEDNRV      22A  O    63
000160110531     A            PNOTA03       45A  O   154
000161110531      *
000162110531     A                                    13
000163110531     A                                      'Tel.'
000164110531     A                                      SPACEB(001)
000165110531     A            PTEL          16A  O    18
000166110531     A            PRESPTRA      25A  O    35
000167110531     A            PAUSCNRV      23A  O    63
000168110531     A            PNOTA04       45A  O   154
000169110531     A*%%***********************************************************************
000170110531     A*%%SS
000171110531     A*%%CL 001
000172110531     A*%%CL 001
000173110531     A*%%CL 001
000174110531     A*%%***********************************************************************
000175110531     A          R MK89CONC
000176110531     A*%%***********************************************************************
000177110531     A*%%RI 00000
000178110531     A*%%***********************************************************************
000179110531     A                                      SPACEB(001)
000180110531     A            PCONC        186A  O    13
000181110531     A*%%***********************************************************************
000182110531     A*%%SS
000183110531     A*%%***********************************************************************
000184110531      *---------------------
000185110531     A          R MK89AFF
000186110531     A*%%***********************************************************************
000187110531     A*%%RI 00000
000188110531     A*%%***********************************************************************
000189110531     A                                      SPACEB(001)
000190110531     A            PAFFIANCA    196A  O     3
000191110531     A*%%***********************************************************************
000192110531     A*%%SS
000193110531     A*%%***********************************************************************
000194110531      *---------------------
000195110531     A          R MK89RIGAUF
000196110531     A*%%***********************************************************************
000197110531     A*%%RI 00000
000198110531     A*%%***********************************************************************
000199110531     A                                      SPACEB(001)
000200110531     A            PDESTATU       3A  O     1
000201110531     A                                      HIGHLIGHT
000202110531     A            PATTUFF       60A  O    13
000203110531     A            PNOTA01       45A  O   154
000204110531     A            PNOTA02       45A  O   154
000205110531     A                                      SPACEB(001)
000206110531     A*%%***********************************************************************
000207110531     A*%%SS
000208110531     A*%%CL 001
000209110531     A*%%***********************************************************************
000210110531      *---------------------
000211110531     A          R MK89RIGCON
000212110531     A*%%***********************************************************************
000213110531     A*%%RI 00000
000214110531     A*%%***********************************************************************
000215110531     A                                      SPACEB(001)
000216110531     A                                     1
000217110531     A                                      'TELEFONATE ESEGUITE'
000218110531     A                                      HIGHLIGHT
000219110531     A                                    38
000220110531     A                                      '|'
000221110531     A                                      SPACEB(002)
000222110531     A                                    40
000223110531     A                                      'NUMERO'
000224110531     A                                    47
000225110531     A                                      '|'
000226110531     A            CAUSA01        5A  O    48
000227110531     A                                    53
000228110531     A                                      '|'
000229110531     A            CAUSA02        5A  O    54
000230110531     A                                    59
000231110531     A                                      '|'
000232110531     A            CAUSA03        5A  O    60
000233110531     A                                    65
000234110531     A                                      '|'
000235110531     A            CAUSA04        5A  O    66
000236110531     A                                    71
000237110531     A                                      '|'
000238110531     A            CAUSA05        5A  O    72
000239110531     A                                    77
000240110531     A                                      '|'
000241110531     A            CAUSA06        5A  O    78
000242110531     A                                    83
000243110531     A                                      '|'
000244110531     A            CAUSA07        5A  O    84
000245110531     A                                    89
000246110531     A                                      '|'
000247110531     A            CAUSA08        5A  O    90
000248110531     A                                    95
000249110531     A                                      '|'
000250110531     A            CAUSA09        5A  O    96
000251110531     A                                   101
000252110531     A                                      '|'
000253110531     A            CAUSA10        5A  O   102
000254110531     A                                   107
000255110531     A                                      '|'
000256110531     A            CAUSA11        5A  O   108
000257110531     A                                   113
000258110531     A                                      '|'
000259110531     A            CAUSA12        5A  O   114
000260110531     A                                   119
000261110531     A                                      '|'
000262110531     A            CAUSA13        5A  O   120
000263110531     A                                   125
000264110531     A                                      '|'
000265110531     A            CAUSA14        5A  O   126
000266110531     A                                   131
000267110531     A                                      '|'
000268110531     A            CAUSA15        5A  O   132
000269110531     A                                   137
000270110531     A                                      '|'
000271110531     A            CAUSA16        5A  O   138
000272110531     A                                   143
000273110531     A                                      '|'
000274110531     A            CAUSA17        5A  O   144
000275110531     A                                   149
000276110531     A                                      '|'
000277110531     A            CAUSA18        5A  O   150
000278110531     A                                   155
000279110531     A                                      '|'
000280110531     A            CAUSA19        5A  O   156
000281110531     A                                   161
000282110531     A                                      '|'
000283110531     A            CAUSA20        5A  O   162
000284110531     A                                   167
000285110531     A                                      '|'
000286110531     A            CAUSA21        5A  O   168
000287110531     A                                   173
000288110531     A                                      '|'
000289110531     A            CAUSA22        5A  O   174
000290110531     A                                   179
000291110531     A                                      '|'
000292110531     A            CAUSA23        5A  O   180
000293110531     A                                   185
000294110531     A                                      '|'
000295110531     A            CAUSA24        5A  O   186
000296110531     A                                   191
000297110531     A                                      '|'
000298110531     A                                     5
000299110531     A                                      'POTENZIALI MAI TRATTATI'
000300110531     A                                      SPACEB(001)
000301110531     A                                    38
000302110531     A                                      '|'
000303110531     A            RCATEPM        6S 0O    40
000304110531     A                                      EDTCDE(Z)
000305110531     A                                      HIGHLIGHT
000306110531     A                                    47
000307110531     A                                      '|'
000308110531     A            QTAPM01        5S 0O    48
000309110531     A                                      EDTCDE(Z)
000310110531     A                                      HIGHLIGHT
000311110531     A                                    53
000312110531     A                                      '|'
000313110531     A            QTAPM02        5S 0O    54
000314110531     A                                      EDTCDE(Z)
000315110531     A                                      HIGHLIGHT
000316110531     A                                    59
000317110531     A                                      '|'
000318110531     A            QTAPM03        5S 0O    60
000319110531     A                                      EDTCDE(Z)
000320110531     A                                      HIGHLIGHT
000321110531     A                                    65
000322110531     A                                      '|'
000323110531     A            QTAPM04        5S 0O    66
000324110531     A                                      EDTCDE(Z)
000325110531     A                                      HIGHLIGHT
000326110531     A                                    71
000327110531     A                                      '|'
000328110531     A            QTAPM05        5S 0O    72
000329110531     A                                      EDTCDE(Z)
000330110531     A                                      HIGHLIGHT
000331110531     A                                    77
000332110531     A                                      '|'
000333110531     A            QTAPM06        5S 0O    78
000334110531     A                                      EDTCDE(Z)
000335110531     A                                      HIGHLIGHT
000336110531     A                                    83
000337110531     A                                      '|'
000338110531     A            QTAPM07        5S 0O    84
000339110531     A                                      EDTCDE(Z)
000340110531     A                                      HIGHLIGHT
000341110531     A                                    89
000342110531     A                                      '|'
000343110531     A            QTAPM08        5S 0O    90
000344110531     A                                      EDTCDE(Z)
000345110531     A                                      HIGHLIGHT
000346110531     A                                    95
000347110531     A                                      '|'
000348110531     A            QTAPM09        5S 0O    96
000349110531     A                                      EDTCDE(Z)
000350110531     A                                      HIGHLIGHT
000351110531     A                                   101
000352110531     A                                      '|'
000353110531     A            QTAPM10        5S 0O   102
000354110531     A                                      EDTCDE(Z)
000355110531     A                                      HIGHLIGHT
000356110531     A                                   107
000357110531     A                                      '|'
000358110531     A            QTAPM11        5S 0O   108
000359110531     A                                      EDTCDE(Z)
000360110531     A                                      HIGHLIGHT
000361110531     A                                   113
000362110531     A                                      '|'
000363110531     A            QTAPM12        5S 0O   114
000364110531     A                                      EDTCDE(Z)
000365110531     A                                      HIGHLIGHT
000366110531     A                                   119
000367110531     A                                      '|'
000368110531     A            QTAPM13        5S 0O   120
000369110531     A                                      EDTCDE(Z)
000370110531     A                                      HIGHLIGHT
000371110531     A                                   125
000372110531     A                                      '|'
000373110531     A            QTAPM14        5S 0O   126
000374110531     A                                      EDTCDE(Z)
000375110531     A                                      HIGHLIGHT
000376110531     A                                   131
000377110531     A                                      '|'
000378110531     A            QTAPM15        5S 0O   132
000379110531     A                                      EDTCDE(Z)
000380110531     A                                      HIGHLIGHT
000381110531     A                                   137
000382110531     A                                      '|'
000383110531     A            QTAPM16        5S 0O   138
000384110531     A                                      EDTCDE(Z)
000385110531     A                                      HIGHLIGHT
000386110531     A                                   143
000387110531     A                                      '|'
000388110531     A            QTAPM17        5S 0O   144
000389110531     A                                      EDTCDE(Z)
000390110531     A                                      HIGHLIGHT
000391110531     A                                   149
000392110531     A                                      '|'
000393110531     A            QTAPM18        5S 0O   150
000394110531     A                                      EDTCDE(Z)
000395110531     A                                      HIGHLIGHT
000396110531     A                                   155
000397110531     A                                      '|'
000398110531     A            QTAPM19        5S 0O   156
000399110531     A                                      EDTCDE(Z)
000400110531     A                                      HIGHLIGHT
000401110531     A                                   161
000402110531     A                                      '|'
000403110531     A            QTAPM20        5S 0O   162
000404110531     A                                      EDTCDE(Z)
000405110531     A                                      HIGHLIGHT
000406110531     A                                   167
000407110531     A                                      '|'
000408110531     A            QTAPM21        5S 0O   168
000409110531     A                                      EDTCDE(Z)
000410110531     A                                      HIGHLIGHT
000411110531     A                                   173
000412110531     A                                      '|'
000413110531     A            QTAPM22        5S 0O   174
000414110531     A                                      EDTCDE(Z)
000415110531     A                                      HIGHLIGHT
000416110531     A                                   179
000417110531     A                                      '|'
000418110531     A            QTAPM23        5S 0O   180
000419110531     A                                      EDTCDE(Z)
000420110531     A                                      HIGHLIGHT
000421110531     A                                   185
000422110531     A                                      '|'
000423110531     A            QTAPM24        5S 0O   186
000424110531     A                                      EDTCDE(Z)
000425110531     A                                      HIGHLIGHT
000426110531     A                                   191
000427110531     A                                      '|'
000428110531     A                                     5
000429110531     A                                      'POTENZIALI GIA''TRATTATI '
000430110531     A                                      SPACEB(001)
000431110531     A                                    38
000432110531     A                                      '|'
000433110531     A            RCATEPG        6S 0O    40
000434110531     A                                      EDTCDE(Z)
000435110531     A                                      HIGHLIGHT
000436110531     A                                    47
000437110531     A                                      '|'
000438110531     A            QTAPG01        5S 0O    48
000439110531     A                                      EDTCDE(Z)
000440110531     A                                      HIGHLIGHT
000441110531     A                                    53
000442110531     A                                      '|'
000443110531     A            QTAPG02        5S 0O    54
000444110531     A                                      EDTCDE(Z)
000445110531     A                                      HIGHLIGHT
000446110531     A                                    59
000447110531     A                                      '|'
000448110531     A            QTAPG03        5S 0O    60
000449110531     A                                      EDTCDE(Z)
000450110531     A                                      HIGHLIGHT
000451110531     A                                    65
000452110531     A                                      '|'
000453110531     A            QTAPG04        5S 0O    66
000454110531     A                                      EDTCDE(Z)
000455110531     A                                      HIGHLIGHT
000456110531     A                                    71
000457110531     A                                      '|'
000458110531     A            QTAPG05        5S 0O    72
000459110531     A                                      EDTCDE(Z)
000460110531     A                                      HIGHLIGHT
000461110531     A                                    77
000462110531     A                                      '|'
000463110531     A            QTAPG06        5S 0O    78
000464110531     A                                      EDTCDE(Z)
000465110531     A                                      HIGHLIGHT
000466110531     A                                    83
000467110531     A                                      '|'
000468110531     A            QTAPG07        5S 0O    84
000469110531     A                                      EDTCDE(Z)
000470110531     A                                      HIGHLIGHT
000471110531     A                                    89
000472110531     A                                      '|'
000473110531     A            QTAPG08        5S 0O    90
000474110531     A                                      EDTCDE(Z)
000475110531     A                                      HIGHLIGHT
000476110531     A                                    95
000477110531     A                                      '|'
000478110531     A            QTAPG09        5S 0O    96
000479110531     A                                      EDTCDE(Z)
000480110531     A                                      HIGHLIGHT
000481110531     A                                   101
000482110531     A                                      '|'
000483110531     A            QTAPG10        5S 0O   102
000484110531     A                                      EDTCDE(Z)
000485110531     A                                      HIGHLIGHT
000486110531     A                                   107
000487110531     A                                      '|'
000488110531     A            QTAPG11        5S 0O   108
000489110531     A                                      EDTCDE(Z)
000490110531     A                                      HIGHLIGHT
000491110531     A                                   113
000492110531     A                                      '|'
000493110531     A            QTAPG12        5S 0O   114
000494110531     A                                      EDTCDE(Z)
000495110531     A                                      HIGHLIGHT
000496110531     A                                   119
000497110531     A                                      '|'
000498110531     A            QTAPG13        5S 0O   120
000499110531     A                                      EDTCDE(Z)
000500110531     A                                      HIGHLIGHT
000501110531     A                                   125
000502110531     A                                      '|'
000503110531     A            QTAPG14        5S 0O   126
000504110531     A                                      EDTCDE(Z)
000505110531     A                                      HIGHLIGHT
000506110531     A                                   131
000507110531     A                                      '|'
000508110531     A            QTAPG15        5S 0O   132
000509110531     A                                      EDTCDE(Z)
000510110531     A                                      HIGHLIGHT
000511110531     A                                   137
000512110531     A                                      '|'
000513110531     A            QTAPG16        5S 0O   138
000514110531     A                                      EDTCDE(Z)
000515110531     A                                      HIGHLIGHT
000516110531     A                                   143
000517110531     A                                      '|'
000518110531     A            QTAPG17        5S 0O   144
000519110531     A                                      EDTCDE(Z)
000520110531     A                                      HIGHLIGHT
000521110531     A                                   149
000522110531     A                                      '|'
000523110531     A            QTAPG18        5S 0O   150
000524110531     A                                      EDTCDE(Z)
000525110531     A                                      HIGHLIGHT
000526110531     A                                   155
000527110531     A                                      '|'
000528110531     A            QTAPG19        5S 0O   156
000529110531     A                                      EDTCDE(Z)
000530110531     A                                      HIGHLIGHT
000531110531     A                                   161
000532110531     A                                      '|'
000533110531     A            QTAPG20        5S 0O   162
000534110531     A                                      EDTCDE(Z)
000535110531     A                                      HIGHLIGHT
000536110531     A                                   167
000537110531     A                                      '|'
000538110531     A            QTAPG21        5S 0O   168
000539110531     A                                      EDTCDE(Z)
000540110531     A                                      HIGHLIGHT
000541110531     A                                   173
000542110531     A                                      '|'
000543110531     A            QTAPG22        5S 0O   174
000544110531     A                                      EDTCDE(Z)
000545110531     A                                      HIGHLIGHT
000546110531     A                                   179
000547110531     A                                      '|'
000548110531     A            QTAPG23        5S 0O   180
000549110531     A                                      EDTCDE(Z)
000550110531     A                                      HIGHLIGHT
000551110531     A                                   185
000552110531     A                                      '|'
000553110531     A            QTAPG24        5S 0O   186
000554110531     A                                      EDTCDE(Z)
000555110531     A                                      HIGHLIGHT
000556110531     A                                   191
000557110531     A                                      '|'
000558110531     A                                     5
000559110531     A                                      'POTENZIALI PERSI        '
000560110531     A                                      SPACEB(001)
000561110531     A                                    38
000562110531     A                                      '|'
000563110531     A            RCATEPP        6S 0O    40
000564110531     A                                      EDTCDE(Z)
000565110531     A                                      HIGHLIGHT
000566110531     A                                    47
000567110531     A                                      '|'
000568110531     A            QTAPP01        5S 0O    48
000569110531     A                                      EDTCDE(Z)
000570110531     A                                      HIGHLIGHT
000571110531     A                                    53
000572110531     A                                      '|'
000573110531     A            QTAPP02        5S 0O    54
000574110531     A                                      EDTCDE(Z)
000575110531     A                                      HIGHLIGHT
000576110531     A                                    59
000577110531     A                                      '|'
000578110531     A            QTAPP03        5S 0O    60
000579110531     A                                      EDTCDE(Z)
000580110531     A                                      HIGHLIGHT
000581110531     A                                    65
000582110531     A                                      '|'
000583110531     A            QTAPP04        5S 0O    66
000584110531     A                                      EDTCDE(Z)
000585110531     A                                      HIGHLIGHT
000586110531     A                                    71
000587110531     A                                      '|'
000588110531     A            QTAPP05        5S 0O    72
000589110531     A                                      EDTCDE(Z)
000590110531     A                                      HIGHLIGHT
000591110531     A                                    77
000592110531     A                                      '|'
000593110531     A            QTAPP06        5S 0O    78
000594110531     A                                      EDTCDE(Z)
000595110531     A                                      HIGHLIGHT
000596110531     A                                    83
000597110531     A                                      '|'
000598110531     A            QTAPP07        5S 0O    84
000599110531     A                                      EDTCDE(Z)
000600110531     A                                      HIGHLIGHT
000601110531     A                                    89
000602110531     A                                      '|'
000603110531     A            QTAPP08        5S 0O    90
000604110531     A                                      EDTCDE(Z)
000605110531     A                                      HIGHLIGHT
000606110531     A                                    95
000607110531     A                                      '|'
000608110531     A            QTAPP09        5S 0O    96
000609110531     A                                      EDTCDE(Z)
000610110531     A                                      HIGHLIGHT
000611110531     A                                   101
000612110531     A                                      '|'
000613110531     A            QTAPP10        5S 0O   102
000614110531     A                                      EDTCDE(Z)
000615110531     A                                      HIGHLIGHT
000616110531     A                                   107
000617110531     A                                      '|'
000618110531     A            QTAPP11        5S 0O   108
000619110531     A                                      EDTCDE(Z)
000620110531     A                                      HIGHLIGHT
000621110531     A                                   113
000622110531     A                                      '|'
000623110531     A            QTAPP12        5S 0O   114
000624110531     A                                      EDTCDE(Z)
000625110531     A                                      HIGHLIGHT
000626110531     A                                   119
000627110531     A                                      '|'
000628110531     A            QTAPP13        5S 0O   120
000629110531     A                                      EDTCDE(Z)
000630110531     A                                      HIGHLIGHT
000631110531     A                                   125
000632110531     A                                      '|'
000633110531     A            QTAPP14        5S 0O   126
000634110531     A                                      EDTCDE(Z)
000635110531     A                                      HIGHLIGHT
000636110531     A                                   131
000637110531     A                                      '|'
000638110531     A            QTAPP15        5S 0O   132
000639110531     A                                      EDTCDE(Z)
000640110531     A                                      HIGHLIGHT
000641110531     A                                   137
000642110531     A                                      '|'
000643110531     A            QTAPP16        5S 0O   138
000644110531     A                                      EDTCDE(Z)
000645110531     A                                      HIGHLIGHT
000646110531     A                                   143
000647110531     A                                      '|'
000648110531     A            QTAPP17        5S 0O   144
000649110531     A                                      EDTCDE(Z)
000650110531     A                                      HIGHLIGHT
000651110531     A                                   149
000652110531     A                                      '|'
000653110531     A            QTAPP18        5S 0O   150
000654110531     A                                      EDTCDE(Z)
000655110531     A                                      HIGHLIGHT
000656110531     A                                   155
000657110531     A                                      '|'
000658110531     A            QTAPP19        5S 0O   156
000659110531     A                                      EDTCDE(Z)
000660110531     A                                      HIGHLIGHT
000661110531     A                                   161
000662110531     A                                      '|'
000663110531     A            QTAPP20        5S 0O   162
000664110531     A                                      EDTCDE(Z)
000665110531     A                                      HIGHLIGHT
000666110531     A                                   167
000667110531     A                                      '|'
000668110531     A            QTAPP21        5S 0O   168
000669110531     A                                      EDTCDE(Z)
000670110531     A                                      HIGHLIGHT
000671110531     A                                   173
000672110531     A                                      '|'
000673110531     A            QTAPP22        5S 0O   174
000674110531     A                                      EDTCDE(Z)
000675110531     A                                      HIGHLIGHT
000676110531     A                                   179
000677110531     A                                      '|'
000678110531     A            QTAPP23        5S 0O   180
000679110531     A                                      EDTCDE(Z)
000680110531     A                                      HIGHLIGHT
000681110531     A                                   185
000682110531     A                                      '|'
000683110531     A            QTAPP24        5S 0O   186
000684110531     A                                      EDTCDE(Z)
000685110531     A                                      HIGHLIGHT
000686110531     A                                   191
000687110531     A                                      '|'
000688110531     A                                     5
000689110531     A                                      'CLIENTI'
000690110531     A                                      SPACEB(002)
000691110531     A                                    38
000692110531     A                                      '|'
000693110531     A            RCATECFT       6S 0O    40
000694110531     A                                      EDTCDE(Z)
000695110531     A                                      HIGHLIGHT
000696110531     A                                    47
000697110531     A                                      '|'
000698110531     A            QTACF01        5S 0O    48
000699110531     A                                      EDTCDE(Z)
000700110531     A                                      HIGHLIGHT
000701110531     A                                    53
000702110531     A                                      '|'
000703110531     A            QTACF02        5S 0O    54
000704110531     A                                      EDTCDE(Z)
000705110531     A                                      HIGHLIGHT
000706110531     A                                    59
000707110531     A                                      '|'
000708110531     A            QTACF03        5S 0O    60
000709110531     A                                      EDTCDE(Z)
000710110531     A                                      HIGHLIGHT
000711110531     A                                    65
000712110531     A                                      '|'
000713110531     A            QTACF04        5S 0O    66
000714110531     A                                      EDTCDE(Z)
000715110531     A                                      HIGHLIGHT
000716110531     A                                    71
000717110531     A                                      '|'
000718110531     A            QTACF05        5S 0O    72
000719110531     A                                      EDTCDE(Z)
000720110531     A                                      HIGHLIGHT
000721110531     A                                    77
000722110531     A                                      '|'
000723110531     A            QTACF06        5S 0O    78
000724110531     A                                      EDTCDE(Z)
000725110531     A                                      HIGHLIGHT
000726110531     A                                    83
000727110531     A                                      '|'
000728110531     A            QTACF07        5S 0O    84
000729110531     A                                      EDTCDE(Z)
000730110531     A                                      HIGHLIGHT
000731110531     A                                    89
000732110531     A                                      '|'
000733110531     A            QTACF08        5S 0O    90
000734110531     A                                      EDTCDE(Z)
000735110531     A                                      HIGHLIGHT
000736110531     A                                    95
000737110531     A                                      '|'
000738110531     A            QTACF09        5S 0O    96
000739110531     A                                      EDTCDE(Z)
000740110531     A                                      HIGHLIGHT
000741110531     A                                   101
000742110531     A                                      '|'
000743110531     A            QTACF10        5S 0O   102
000744110531     A                                      EDTCDE(Z)
000745110531     A                                      HIGHLIGHT
000746110531     A                                   107
000747110531     A                                      '|'
000748110531     A            QTACF11        5S 0O   108
000749110531     A                                      EDTCDE(Z)
000750110531     A                                      HIGHLIGHT
000751110531     A                                   113
000752110531     A                                      '|'
000753110531     A            QTACF12        5S 0O   114
000754110531     A                                      EDTCDE(Z)
000755110531     A                                      HIGHLIGHT
000756110531     A                                   119
000757110531     A                                      '|'
000758110531     A            QTACF13        5S 0O   120
000759110531     A                                      EDTCDE(Z)
000760110531     A                                      HIGHLIGHT
000761110531     A                                   125
000762110531     A                                      '|'
000763110531     A            QTACF14        5S 0O   126
000764110531     A                                      EDTCDE(Z)
000765110531     A                                      HIGHLIGHT
000766110531     A                                   131
000767110531     A                                      '|'
000768110531     A            QTACF15        5S 0O   132
000769110531     A                                      EDTCDE(Z)
000770110531     A                                      HIGHLIGHT
000771110531     A                                   137
000772110531     A                                      '|'
000773110531     A            QTACF16        5S 0O   138
000774110531     A                                      EDTCDE(Z)
000775110531     A                                      HIGHLIGHT
000776110531     A                                   143
000777110531     A                                      '|'
000778110531     A            QTACF17        5S 0O   144
000779110531     A                                      EDTCDE(Z)
000780110531     A                                      HIGHLIGHT
000781110531     A                                   149
000782110531     A                                      '|'
000783110531     A            QTACF18        5S 0O   150
000784110531     A                                      EDTCDE(Z)
000785110531     A                                      HIGHLIGHT
000786110531     A                                   155
000787110531     A                                      '|'
000788110531     A            QTACF19        5S 0O   156
000789110531     A                                      EDTCDE(Z)
000790110531     A                                      HIGHLIGHT
000791110531     A                                   161
000792110531     A                                      '|'
000793110531     A            QTACF20        5S 0O   162
000794110531     A                                      EDTCDE(Z)
000795110531     A                                      HIGHLIGHT
000796110531     A                                   167
000797110531     A                                      '|'
000798110531     A            QTACF21        5S 0O   168
000799110531     A                                      EDTCDE(Z)
000800110531     A                                      HIGHLIGHT
000801110531     A                                   173
000802110531     A                                      '|'
000803110531     A            QTACF22        5S 0O   174
000804110531     A                                      EDTCDE(Z)
000805110531     A                                      HIGHLIGHT
000806110531     A                                   179
000807110531     A                                      '|'
000808110531     A            QTACF23        5S 0O   180
000809110531     A                                      EDTCDE(Z)
000810110531     A                                      HIGHLIGHT
000811110531     A                                   185
000812110531     A                                      '|'
000813110531     A            QTACF24        5S 0O   186
000814110531     A                                      EDTCDE(Z)
000815110531     A                                      HIGHLIGHT
000816110531     A                                   191
000817110531     A                                      '|'
000818110531     A                                     5
000819110531     A                                      'ALTRE TELEFONATE'
000820110531     A                                      SPACEB(002)
000821110531     A                                     8
000822110531     A                                      'POTENZ. DENTRO TRATTATIVA'
000823110531     A                                      SPACEB(001)
000824110531     A                                    38
000825110531     A                                      '|'
000826110531     A            RCATEPT        6S 0O    40
000827110531     A                                      EDTCDE(Z)
000828110531     A                                      HIGHLIGHT
000829110531     A                                    47
000830110531     A                                      '|'
000831110531     A            QTAPT01        5S 0O    48
000832110531     A                                      EDTCDE(Z)
000833110531     A                                      HIGHLIGHT
000834110531     A                                    53
000835110531     A                                      '|'
000836110531     A            QTAPT02        5S 0O    54
000837110531     A                                      EDTCDE(Z)
000838110531     A                                      HIGHLIGHT
000839110531     A                                    59
000840110531     A                                      '|'
000841110531     A            QTAPT03        5S 0O    60
000842110531     A                                      EDTCDE(Z)
000843110531     A                                      HIGHLIGHT
000844110531     A                                    65
000845110531     A                                      '|'
000846110531     A            QTAPT04        5S 0O    66
000847110531     A                                      EDTCDE(Z)
000848110531     A                                      HIGHLIGHT
000849110531     A                                    71
000850110531     A                                      '|'
000851110531     A            QTAPT05        5S 0O    72
000852110531     A                                      EDTCDE(Z)
000853110531     A                                      HIGHLIGHT
000854110531     A                                    77
000855110531     A                                      '|'
000856110531     A            QTAPT06        5S 0O    78
000857110531     A                                      EDTCDE(Z)
000858110531     A                                      HIGHLIGHT
000859110531     A                                    83
000860110531     A                                      '|'
000861110531     A            QTAPT07        5S 0O    84
000862110531     A                                      EDTCDE(Z)
000863110531     A                                      HIGHLIGHT
000864110531     A                                    89
000865110531     A                                      '|'
000866110531     A            QTAPT08        5S 0O    90
000867110531     A                                      EDTCDE(Z)
000868110531     A                                      HIGHLIGHT
000869110531     A                                    95
000870110531     A                                      '|'
000871110531     A            QTAPT09        5S 0O    96
000872110531     A                                      EDTCDE(Z)
000873110531     A                                      HIGHLIGHT
000874110531     A                                   101
000875110531     A                                      '|'
000876110531     A            QTAPT10        5S 0O   102
000877110531     A                                      EDTCDE(Z)
000878110531     A                                      HIGHLIGHT
000879110531     A                                   107
000880110531     A                                      '|'
000881110531     A            QTAPT11        5S 0O   108
000882110531     A                                      EDTCDE(Z)
000883110531     A                                      HIGHLIGHT
000884110531     A                                   113
000885110531     A                                      '|'
000886110531     A            QTAPT12        5S 0O   114
000887110531     A                                      EDTCDE(Z)
000888110531     A                                      HIGHLIGHT
000889110531     A                                   119
000890110531     A                                      '|'
000891110531     A            QTAPT13        5S 0O   120
000892110531     A                                      EDTCDE(Z)
000893110531     A                                      HIGHLIGHT
000894110531     A                                   125
000895110531     A                                      '|'
000896110531     A            QTAPT14        5S 0O   126
000897110531     A                                      EDTCDE(Z)
000898110531     A                                      HIGHLIGHT
000899110531     A                                   131
000900110531     A                                      '|'
000901110531     A            QTAPT15        5S 0O   132
000902110531     A                                      EDTCDE(Z)
000903110531     A                                      HIGHLIGHT
000904110531     A                                   137
000905110531     A                                      '|'
000906110531     A            QTAPT16        5S 0O   138
000907110531     A                                      EDTCDE(Z)
000908110531     A                                      HIGHLIGHT
000909110531     A                                   143
000910110531     A                                      '|'
000911110531     A            QTAPT17        5S 0O   144
000912110531     A                                      EDTCDE(Z)
000913110531     A                                      HIGHLIGHT
000914110531     A                                   149
000915110531     A                                      '|'
000916110531     A            QTAPT18        5S 0O   150
000917110531     A                                      EDTCDE(Z)
000918110531     A                                      HIGHLIGHT
000919110531     A                                   155
000920110531     A                                      '|'
000921110531     A            QTAPT19        5S 0O   156
000922110531     A                                      EDTCDE(Z)
000923110531     A                                      HIGHLIGHT
000924110531     A                                   161
000925110531     A                                      '|'
000926110531     A            QTAPT20        5S 0O   162
000927110531     A                                      EDTCDE(Z)
000928110531     A                                      HIGHLIGHT
000929110531     A                                   167
000930110531     A                                      '|'
000931110531     A            QTAPT21        5S 0O   168
000932110531     A                                      EDTCDE(Z)
000933110531     A                                      HIGHLIGHT
000934110531     A                                   173
000935110531     A                                      '|'
000936110531     A            QTAPT22        5S 0O   174
000937110531     A                                      EDTCDE(Z)
000938110531     A                                      HIGHLIGHT
000939110531     A                                   179
000940110531     A                                      '|'
000941110531     A            QTAPT23        5S 0O   180
000942110531     A                                      EDTCDE(Z)
000943110531     A                                      HIGHLIGHT
000944110531     A                                   185
000945110531     A                                      '|'
000946110531     A            QTAPT24        5S 0O   186
000947110531     A                                      EDTCDE(Z)
000948110531     A                                      HIGHLIGHT
000949110531     A                                   191
000950110531     A                                      '|'
000951110531     A                                     8
000952110531     A                                      'PERSI   DENTRO TRATTATIVA'
000953110531     A                                      SPACEB(001)
000954110531     A                                    38
000955110531     A                                      '|'
000956110531     A            RCATEPPT       6S 0O    40
000957110531     A                                      EDTCDE(Z)
000958110531     A                                      HIGHLIGHT
000959110531     A                                    47
000960110531     A                                      '|'
000961110531     A            QTAPPT01       5S 0O    48
000962110531     A                                      EDTCDE(Z)
000963110531     A                                      HIGHLIGHT
000964110531     A                                    53
000965110531     A                                      '|'
000966110531     A            QTAPPT02       5S 0O    54
000967110531     A                                      EDTCDE(Z)
000968110531     A                                      HIGHLIGHT
000969110531     A                                    59
000970110531     A                                      '|'
000971110531     A            QTAPPT03       5S 0O    60
000972110531     A                                      EDTCDE(Z)
000973110531     A                                      HIGHLIGHT
000974110531     A                                    65
000975110531     A                                      '|'
000976110531     A            QTAPPT04       5S 0O    66
000977110531     A                                      EDTCDE(Z)
000978110531     A                                      HIGHLIGHT
000979110531     A                                    71
000980110531     A                                      '|'
000981110531     A            QTAPPT05       5S 0O    72
000982110531     A                                      EDTCDE(Z)
000983110531     A                                      HIGHLIGHT
000984110531     A                                    77
000985110531     A                                      '|'
000986110531     A            QTAPPT06       5S 0O    78
000987110531     A                                      EDTCDE(Z)
000988110531     A                                      HIGHLIGHT
000989110531     A                                    83
000990110531     A                                      '|'
000991110531     A            QTAPPT07       5S 0O    84
000992110531     A                                      EDTCDE(Z)
000993110531     A                                      HIGHLIGHT
000994110531     A                                    89
000995110531     A                                      '|'
000996110531     A            QTAPPT08       5S 0O    90
000997110531     A                                      EDTCDE(Z)
000998110531     A                                      HIGHLIGHT
000999110531     A                                    95
001000110531     A                                      '|'
001001110531     A            QTAPPT09       5S 0O    96
001002110531     A                                      EDTCDE(Z)
001003110531     A                                      HIGHLIGHT
001004110531     A                                   101
001005110531     A                                      '|'
001006110531     A            QTAPPT10       5S 0O   102
001007110531     A                                      EDTCDE(Z)
001008110531     A                                      HIGHLIGHT
001009110531     A                                   107
001010110531     A                                      '|'
001011110531     A            QTAPPT11       5S 0O   108
001012110531     A                                      EDTCDE(Z)
001013110531     A                                      HIGHLIGHT
001014110531     A                                   113
001015110531     A                                      '|'
001016110531     A            QTAPPT12       5S 0O   114
001017110531     A                                      EDTCDE(Z)
001018110531     A                                      HIGHLIGHT
001019110531     A                                   119
001020110531     A                                      '|'
001021110531     A            QTAPPT13       5S 0O   120
001022110531     A                                      EDTCDE(Z)
001023110531     A                                      HIGHLIGHT
001024110531     A                                   125
001025110531     A                                      '|'
001026110531     A            QTAPPT14       5S 0O   126
001027110531     A                                      EDTCDE(Z)
001028110531     A                                      HIGHLIGHT
001029110531     A                                   131
001030110531     A                                      '|'
001031110531     A            QTAPPT15       5S 0O   132
001032110531     A                                      EDTCDE(Z)
001033110531     A                                      HIGHLIGHT
001034110531     A                                   137
001035110531     A                                      '|'
001036110531     A            QTAPPT16       5S 0O   138
001037110531     A                                      EDTCDE(Z)
001038110531     A                                      HIGHLIGHT
001039110531     A                                   143
001040110531     A                                      '|'
001041110531     A            QTAPPT17       5S 0O   144
001042110531     A                                      EDTCDE(Z)
001043110531     A                                      HIGHLIGHT
001044110531     A                                   149
001045110531     A                                      '|'
001046110531     A            QTAPPT18       5S 0O   150
001047110531     A                                      EDTCDE(Z)
001048110531     A                                      HIGHLIGHT
001049110531     A                                   155
001050110531     A                                      '|'
001051110531     A            QTAPPT19       5S 0O   156
001052110531     A                                      EDTCDE(Z)
001053110531     A                                      HIGHLIGHT
001054110531     A                                   161
001055110531     A                                      '|'
001056110531     A            QTAPPT20       5S 0O   162
001057110531     A                                      EDTCDE(Z)
001058110531     A                                      HIGHLIGHT
001059110531     A                                   167
001060110531     A                                      '|'
001061110531     A            QTAPPT21       5S 0O   168
001062110531     A                                      EDTCDE(Z)
001063110531     A                                      HIGHLIGHT
001064110531     A                                   173
001065110531     A                                      '|'
001066110531     A            QTAPPT22       5S 0O   174
001067110531     A                                      EDTCDE(Z)
001068110531     A                                      HIGHLIGHT
001069110531     A                                   179
001070110531     A                                      '|'
001071110531     A            QTAPPT23       5S 0O   180
001072110531     A                                      EDTCDE(Z)
001073110531     A                                      HIGHLIGHT
001074110531     A                                   185
001075110531     A                                      '|'
001076110531     A            QTAPPT24       5S 0O   186
001077110531     A                                      EDTCDE(Z)
001078110531     A                                      HIGHLIGHT
001079110531     A                                   191
001080110531     A                                      '|'
001081110531     A                                     8
001082110531     A                                      'CLIENTI DENTRO TRATTATIVA'
001083110531     A                                      SPACEB(001)
001084110531     A                                    38
001085110531     A                                      '|'
001086110531     A            RCATECT        6S 0O    40
001087110531     A                                      EDTCDE(Z)
001088110531     A                                      HIGHLIGHT
001089110531     A                                    47
001090110531     A                                      '|'
001091110531     A            QTACT01        5S 0O    48
001092110531     A                                      EDTCDE(Z)
001093110531     A                                      HIGHLIGHT
001094110531     A                                    53
001095110531     A                                      '|'
001096110531     A            QTACT02        5S 0O    54
001097110531     A                                      EDTCDE(Z)
001098110531     A                                      HIGHLIGHT
001099110531     A                                    59
001100110531     A                                      '|'
001101110531     A            QTACT03        5S 0O    60
001102110531     A                                      EDTCDE(Z)
001103110531     A                                      HIGHLIGHT
001104110531     A                                    65
001105110531     A                                      '|'
001106110531     A            QTACT04        5S 0O    66
001107110531     A                                      EDTCDE(Z)
001108110531     A                                      HIGHLIGHT
001109110531     A                                    71
001110110531     A                                      '|'
001111110531     A            QTACT05        5S 0O    72
001112110531     A                                      EDTCDE(Z)
001113110531     A                                      HIGHLIGHT
001114110531     A                                    77
001115110531     A                                      '|'
001116110531     A            QTACT06        5S 0O    78
001117110531     A                                      EDTCDE(Z)
001118110531     A                                      HIGHLIGHT
001119110531     A                                    83
001120110531     A                                      '|'
001121110531     A            QTACT07        5S 0O    84
001122110531     A                                      EDTCDE(Z)
001123110531     A                                      HIGHLIGHT
001124110531     A                                    89
001125110531     A                                      '|'
001126110531     A            QTACT08        5S 0O    90
001127110531     A                                      EDTCDE(Z)
001128110531     A                                      HIGHLIGHT
001129110531     A                                    95
001130110531     A                                      '|'
001131110531     A            QTACT09        5S 0O    96
001132110531     A                                      EDTCDE(Z)
001133110531     A                                      HIGHLIGHT
001134110531     A                                   101
001135110531     A                                      '|'
001136110531     A            QTACT10        5S 0O   102
001137110531     A                                      EDTCDE(Z)
001138110531     A                                      HIGHLIGHT
001139110531     A                                   107
001140110531     A                                      '|'
001141110531     A            QTACT11        5S 0O   108
001142110531     A                                      EDTCDE(Z)
001143110531     A                                      HIGHLIGHT
001144110531     A                                   113
001145110531     A                                      '|'
001146110531     A            QTACT12        5S 0O   114
001147110531     A                                      EDTCDE(Z)
001148110531     A                                      HIGHLIGHT
001149110531     A                                   119
001150110531     A                                      '|'
001151110531     A            QTACT13        5S 0O   120
001152110531     A                                      EDTCDE(Z)
001153110531     A                                      HIGHLIGHT
001154110531     A                                   125
001155110531     A                                      '|'
001156110531     A            QTACT14        5S 0O   126
001157110531     A                                      EDTCDE(Z)
001158110531     A                                      HIGHLIGHT
001159110531     A                                   131
001160110531     A                                      '|'
001161110531     A            QTACT15        5S 0O   132
001162110531     A                                      EDTCDE(Z)
001163110531     A                                      HIGHLIGHT
001164110531     A                                   137
001165110531     A                                      '|'
001166110531     A            QTACT16        5S 0O   138
001167110531     A                                      EDTCDE(Z)
001168110531     A                                      HIGHLIGHT
001169110531     A                                   143
001170110531     A                                      '|'
001171110531     A            QTACT17        5S 0O   144
001172110531     A                                      EDTCDE(Z)
001173110531     A                                      HIGHLIGHT
001174110531     A                                   149
001175110531     A                                      '|'
001176110531     A            QTACT18        5S 0O   150
001177110531     A                                      EDTCDE(Z)
001178110531     A                                      HIGHLIGHT
001179110531     A                                   155
001180110531     A                                      '|'
001181110531     A            QTACT19        5S 0O   156
001182110531     A                                      EDTCDE(Z)
001183110531     A                                      HIGHLIGHT
001184110531     A                                   161
001185110531     A                                      '|'
001186110531     A            QTACT20        5S 0O   162
001187110531     A                                      EDTCDE(Z)
001188110531     A                                      HIGHLIGHT
001189110531     A                                   167
001190110531     A                                      '|'
001191110531     A            QTACT21        5S 0O   168
001192110531     A                                      EDTCDE(Z)
001193110531     A                                      HIGHLIGHT
001194110531     A                                   173
001195110531     A                                      '|'
001196110531     A            QTACT22        5S 0O   174
001197110531     A                                      EDTCDE(Z)
001198110531     A                                      HIGHLIGHT
001199110531     A                                   179
001200110531     A                                      '|'
001201110531     A            QTACT23        5S 0O   180
001202110531     A                                      EDTCDE(Z)
001203110531     A                                      HIGHLIGHT
001204110531     A                                   185
001205110531     A                                      '|'
001206110531     A            QTACT24        5S 0O   186
001207110531     A                                      EDTCDE(Z)
001208110531     A                                      HIGHLIGHT
001209110531     A                                   191
001210110531     A                                      '|'
001211110531     A                                    38
001212110531     A                                      '|'
001213110531     A                                      SPACEB(002)
001214110531     A                                    40
001215110531     A                                      'NUMERO'
001216110531     A                                    47
001217110531     A                                      '|'
001218110531     A N20                                50
001219110531     A                                      'di cui altri commerciali'
001220110531     A N20                                77
001221110531     A                                      '|'
001222110531     A                                     5
001223110531     A                                      'RICHIAMI POST OFFERTA'
001224110531     A                                      SPACEB(001)
001225110531     A                                   +12
001226110531     A                                      '|'
001227110531     A            RCATEPOST      6S 0O    40
001228110531     A                                      EDTCDE(Z)
001229110531     A                                      HIGHLIGHT
001230110531     A                                    47
001231110531     A                                      '|'
001232110531     A N20        TOTTEPOA       6S 0O    60
001233110531     A                                      EDTCDE(Z)
001234110531     A                                      HIGHLIGHT
001235110531     A N20                                77
001236110531     A                                      '|'
001237110531     A                                     5
001238110531     A                                      'CALDI'
001239110531     A                                      SPACEB(001)
001240110531     A                                   +28
001241110531     A                                      '|'
001242110531     A            RCATECALDI     6S 0O    40
001243110531     A                                      EDTCDE(Z)
001244110531     A                                      HIGHLIGHT
001245110531     A                                    47
001246110531     A                                      '|'
001247110531     A N20        TOTTECALDA     6S 0O    60
001248110531     A                                      EDTCDE(Z)
001249110531     A                                      HIGHLIGHT
001250110531     A N20                                77
001251110531     A                                      '|'
001252110531     A                                     5
001253110531     A                                      SPACEB(001)
001254110531     A                                      'POST VENDITA'
001255110531     A                                   +21
001256110531     A                                      '|'
001257110531     A            RCATEPOSVE     6S 0O    40
001258110531     A                                      EDTCDE(Z)
001259110531     A                                      HIGHLIGHT
001260110531     A                                    47
001261110531     A                                      '|'
001262110531     A N20        RCATEPV32A     6S 0O    60
001263110531     A                                      EDTCDE(Z)
001264110531     A                                      HIGHLIGHT
001265110531     A N20                                77
001266110531     A                                      '|'
001267110531     A*** N20                                50
001268110531     A***                                      'Clienti di altri'
001269110531     A*** N20        TOTTEPOA       6S 0O    74
001270110531     A***                                      EDTCDE(Z)
001271110531     A***                                      HIGHLIGHT
001272110531     A                                     5
001273110531     A                                      'MANTENIMENTI TELEFONICI'
001274110531     A                                      SPACEB(001)
001275110531     A                                   +10
001276110531     A                                      '|'
001277110531     A            RCATEMANTE     6S 0O    40
001278110531     A                                      EDTCDE(Z)
001279110531     A                                      HIGHLIGHT
001280110531     A                                    47
001281110531     A                                      '|'
001282110531     A N20        RCATEPC40A     6S 0O    60
001283110531     A                                      EDTCDE(Z)
001284110531     A                                      HIGHLIGHT
001285110531     A N20                                77
001286110531     A                                      '|'
001287110531     A                                    22
001288110531     A                                      'TOTALE'
001289110531     A                                      SPACEB(001)
001290110531     A                                      HIGHLIGHT
001291110531     A                                    38
001292110531     A                                      '|'
001293110531     A            RCATELESE      6S 0O    40
001294110531     A                                      EDTCDE(Z)
001295110531     A                                      HIGHLIGHT
001296110531     A                                    47
001297110531     A                                      '|'
001298110531     A                                     1
001299110531     A                                      'APPUNTAMENTI PRESI'
001300110531     A                                      SPACEB(002)
001301110531     A                                      HIGHLIGHT
001302110531     A                                    38
001303110531     A                                      '|'
001304110531     A                                      SPACEB(001)
001305110531     A                                    40
001306110531     A                                      'NUMERO'
001307110531     A                                    47
001308110531     A                                      '|'
001309110531     A                                    53
001310110531     A                                      'di cui PRIMO APP.TO'
001311110531     A                                    77
001312110531     A                                      '|'
001313110531     A                                     5
001314110531     A                                      'NUOVO                   '
001315110531     A                                      SPACEB(001)
001316110531     A                                    +9
001317110531     A                                      '|'
001318110531     A            RCAAPPTN       6S 0O    40
001319110531     A                                      EDTCDE(Z)
001320110531     A                                      HIGHLIGHT
001321110531     A                                    47
001322110531     A                                      '|'
001323110531     A            RCAPATN        6S 0O    60
001324110531     A                                      EDTCDE(Z)
001325110531     A                                      HIGHLIGHT
001326110531     A                                    77
001327110531     A                                      '|'
001328110531     A                                    82
001329110531     A                                      '% 1° App.ti NUOVI su TOTALE Tel. a-
001330110531     A                                       POTENZIALI + PERSI'
001331110531     A            INCIDE         9S 2O    +1
001332110531     A                                      HIGHLIGHT
001333110531     A                                      EDTWRD('     0 ,  ')
001334110531     A                                     5
001335110531     A                                      'INCREMENTO'
001336110531     A                                      SPACEB(001)
001337110531     A                                   +23
001338110531     A                                      '|'
001339110531     A            RCAAPPTI       6S 0O    40
001340110531     A                                      EDTCDE(Z)
001341110531     A                                      HIGHLIGHT
001342110531     A                                    47
001343110531     A                                      '|'
001344110531     A            RCAPATI        6S 0O    60
001345110531     A                                      EDTCDE(Z)
001346110531     A                                      HIGHLIGHT
001347110531     A                                    77
001348110531     A                                      '|'
001349110531     A                                     5
001350110531     A                                      'AUMENTO/SCONTO          '
001351110531     A                                      SPACEB(001)
001352110531     A                                    +9
001353110531     A                                      '|'
001354110531     A            RCAAPPTA       6S 0O    40
001355110531     A                                      EDTCDE(Z)
001356110531     A                                      HIGHLIGHT
001357110531     A                                    47
001358110531     A                                      '|'
001359110531     A            RCAPATA        6S 0O    60
001360110531     A                                      EDTCDE(Z)
001361110531     A                                      HIGHLIGHT
001362110531     A                                    77
001363110531     A                                      '|'
001364110531     A                                     5
001365110531     A                                      'MANTENIMENTO           '
001366110531     A                                      SPACEB(001)
001367110531     A                                   +10
001368110531     A                                      '|'
001369110531     A            RCAAPPTM       6S 0O    40
001370110531     A                                      EDTCDE(Z)
001371110531     A                                      HIGHLIGHT
001372110531     A                                    47
001373110531     A                                      '|'
001374110531     A            RCAPATM        6S 0O    60
001375110531     A                                      EDTCDE(Z)
001376110531     A                                      HIGHLIGHT
001377110531     A                                    77
001378110531     A                                      '|'
001379110531     A                                     5
001380110531     A                                      'INCASSO           '
001381110531     A                                      SPACEB(001)
001382110531     A                                   +15
001383110531     A                                      '|'
001384110531     A            RCAAPPTC       6S 0O    40
001385110531     A                                      EDTCDE(Z)
001386110531     A                                      HIGHLIGHT
001387110531     A                                    47
001388110531     A                                      '|'
001389110531     A            RCAPATC        6S 0O    60
001390110531     A                                      EDTCDE(Z)
001391110531     A                                      HIGHLIGHT
001392110531     A                                    77
001393110531     A                                      '|'
001394110531     A                                     5
001395110531     A                                      'RESTYLING TARIFFA '
001396110531     A                                      SPACEB(001)
001397110531     A                                   +15
001398110531     A                                      '|'
001399110531     A            RCAAPPTR       6S 0O    40
001400110531     A                                      EDTCDE(Z)
001401110531     A                                      HIGHLIGHT
001402110531     A                                    47
001403110531     A                                      '|'
001404110531     A            RCAPATR        6S 0O    60
001405110531     A                                      EDTCDE(Z)
001406110531     A                                      HIGHLIGHT
001407110531     A                                    77
001408110531     A                                      '|'
001409110531     A                                    22
001410110531     A                                      'TOTALE'
001411110531     A                                      SPACEB(001)
001412110531     A                                      HIGHLIGHT
001413110531     A                                    38
001414110531     A                                      '|'
001415110531     A            TOTAPPPR       6S 0O    40
001416110531     A                                      EDTCDE(Z)
001417110531     A                                      HIGHLIGHT
001418110531     A                                    47
001419110531     A                                      '|'
001420110531     A            TOTAPPPR1      6S 0O    60
001421110531     A                                      EDTCDE(Z)
001422110531     A                                      HIGHLIGHT
001423110531     A                                    77
001424110531     A                                      '|'
001425110531     A                                    38
001426110531     A                                      '|'
001427110531     A                                      SPACEB(002)
001428110531     A                                    40
001429110531     A                                      'NUMERO'
001430110531     A                                    47
001431110531     A                                      '|'
001432110531     A            CAUINE01       5A  O    48
001433110531     A                                    53
001434110531     A                                      '|'
001435110531     A            CAUINE02       5A  O    54
001436110531     A                                    59
001437110531     A                                      '|'
001438110531     A            CAUINE03       5A  O    60
001439110531     A                                    65
001440110531     A                                      '|'
001441110531     A            CAUINE04       5A  O    66
001442110531     A                                    71
001443110531     A                                      '|'
001444110531     A            CAUINE05       5A  O    72
001445110531     A                                    77
001446110531     A                                      '|'
001447110531     A            CAUINE06       5A  O    78
001448110531     A                                    83
001449110531     A                                      '|'
001450110531     A            CAUINE07       5A  O    84
001451110531     A                                    89
001452110531     A                                      '|'
001453110531     A            CAUINE08       5A  O    90
001454110531     A                                    95
001455110531     A                                      '|'
001456110531     A            CAUINE09       5A  O    96
001457110531     A                                   101
001458110531     A                                      '|'
001459110531     A            CAUINE10       5A  O   102
001460110531     A                                   107
001461110531     A                                      '|'
001462110531     A            CAUINE11       5A  O   108
001463110531     A                                   113
001464110531     A                                      '|'
001465110531     A            CAUINE12       5A  O   114
001466110531     A                                   119
001467110531     A                                      '|'
001468110531     A            CAUINE13       5A  O   120
001469110531     A                                   125
001470110531     A                                      '|'
001471110531     A            CAUINE14       5A  O   126
001472110531     A                                   131
001473110531     A                                      '|'
001474110531     A            CAUINE15       5A  O   132
001475110531     A                                   137
001476110531     A                                      '|'
001477110531     A            CAUINE16       5A  O   138
001478110531     A                                   143
001479110531     A                                      '|'
001480110531     A            CAUINE17       5A  O   144
001481110531     A                                   149
001482110531     A                                      '|'
001483110531     A            CAUINE18       5A  O   150
001484110531     A                                   155
001485110531     A                                      '|'
001486110531     A            CAUINE19       5A  O   156
001487110531     A                                   161
001488110531     A                                      '|'
001489110531     A            CAUINE20       5A  O   162
001490110531     A                                   167
001491110531     A                                      '|'
001492110531     A            CAUINE21       5A  O   168
001493110531     A                                   173
001494110531     A                                      '|'
001495110531     A            CAUINE22       5A  O   174
001496110531     A                                   179
001497110531     A                                      '|'
001498110531     A            CAUINE23       5A  O   180
001499110531     A                                   185
001500110531     A                                      '|'
001501110531     A            CAUINE24       5A  O   186
001502110531     A                                   191
001503110531     A                                      '|'
001504110531     A                                     1
001505110531     A                                      'ATTIVITÀ SCADUTE AL'
001506110531     A                                      SPACEB(001)
001507110531     A                                      HIGHLIGHT
001508110531     A N14        PDATAF         8S 0O    22
001509110531     A                                      EDTCDE(Y)
001510110531     A                                      HIGHLIGHT
001511110531     A                                    38
001512110531     A                                      '|'
001513110531     A            RCAINEVASE     6S 0O    40
001514110531     A                                      EDTCDE(Z)
001515110531     A                                      HIGHLIGHT
001516110531     A                                    47
001517110531     A                                      '|'
001518110531     A            QTAIN01        5S 0O    48
001519110531     A                                      EDTCDE(Z)
001520110531     A                                      HIGHLIGHT
001521110531     A                                    53
001522110531     A                                      '|'
001523110531     A            QTAIN02        5S 0O    54
001524110531     A                                      EDTCDE(Z)
001525110531     A                                      HIGHLIGHT
001526110531     A                                    59
001527110531     A                                      '|'
001528110531     A            QTAIN03        5S 0O    60
001529110531     A                                      EDTCDE(Z)
001530110531     A                                      HIGHLIGHT
001531110531     A                                    65
001532110531     A                                      '|'
001533110531     A            QTAIN04        5S 0O    66
001534110531     A                                      EDTCDE(Z)
001535110531     A                                      HIGHLIGHT
001536110531     A                                    71
001537110531     A                                      '|'
001538110531     A            QTAIN05        5S 0O    72
001539110531     A                                      EDTCDE(Z)
001540110531     A                                      HIGHLIGHT
001541110531     A                                    77
001542110531     A                                      '|'
001543110531     A            QTAIN06        5S 0O    78
001544110531     A                                      EDTCDE(Z)
001545110531     A                                      HIGHLIGHT
001546110531     A                                    83
001547110531     A                                      '|'
001548110531     A            QTAIN07        5S 0O    84
001549110531     A                                      EDTCDE(Z)
001550110531     A                                      HIGHLIGHT
001551110531     A                                    89
001552110531     A                                      '|'
001553110531     A            QTAIN08        5S 0O    90
001554110531     A                                      EDTCDE(Z)
001555110531     A                                      HIGHLIGHT
001556110531     A                                    95
001557110531     A                                      '|'
001558110531     A            QTAIN09        5S 0O    96
001559110531     A                                      EDTCDE(Z)
001560110531     A                                      HIGHLIGHT
001561110531     A                                   101
001562110531     A                                      '|'
001563110531     A            QTAIN10        5S 0O   102
001564110531     A                                      EDTCDE(Z)
001565110531     A                                      HIGHLIGHT
001566110531     A                                   107
001567110531     A                                      '|'
001568110531     A            QTAIN11        5S 0O   108
001569110531     A                                      EDTCDE(Z)
001570110531     A                                      HIGHLIGHT
001571110531     A                                   113
001572110531     A                                      '|'
001573110531     A            QTAIN12        5S 0O   114
001574110531     A                                      EDTCDE(Z)
001575110531     A                                      HIGHLIGHT
001576110531     A                                   119
001577110531     A                                      '|'
001578110531     A            QTAIN13        5S 0O   120
001579110531     A                                      EDTCDE(Z)
001580110531     A                                      HIGHLIGHT
001581110531     A                                   125
001582110531     A                                      '|'
001583110531     A            QTAIN14        5S 0O   126
001584110531     A                                      EDTCDE(Z)
001585110531     A                                      HIGHLIGHT
001586110531     A                                   131
001587110531     A                                      '|'
001588110531     A            QTAIN15        5S 0O   132
001589110531     A                                      EDTCDE(Z)
001590110531     A                                      HIGHLIGHT
001591110531     A                                   137
001592110531     A                                      '|'
001593110531     A            QTAIN16        5S 0O   138
001594110531     A                                      EDTCDE(Z)
001595110531     A                                      HIGHLIGHT
001596110531     A                                   143
001597110531     A                                      '|'
001598110531     A            QTAIN17        5S 0O   144
001599110531     A                                      EDTCDE(Z)
001600110531     A                                      HIGHLIGHT
001601110531     A                                   149
001602110531     A                                      '|'
001603110531     A            QTAIN18        5S 0O   150
001604110531     A                                      EDTCDE(Z)
001605110531     A                                      HIGHLIGHT
001606110531     A                                   155
001607110531     A                                      '|'
001608110531     A            QTAIN19        5S 0O   156
001609110531     A                                      EDTCDE(Z)
001610110531     A                                      HIGHLIGHT
001611110531     A                                   161
001612110531     A                                      '|'
001613110531     A            QTAIN20        5S 0O   162
001614110531     A                                      EDTCDE(Z)
001615110531     A                                      HIGHLIGHT
001616110531     A                                   167
001617110531     A                                      '|'
001618110531     A            QTAIN21        5S 0O   168
001619110531     A                                      EDTCDE(Z)
001620110531     A                                      HIGHLIGHT
001621110531     A                                   173
001622110531     A                                      '|'
001623110531     A            QTAIN22        5S 0O   174
001624110531     A                                      EDTCDE(Z)
001625110531     A                                      HIGHLIGHT
001626110531     A                                   179
001627110531     A                                      '|'
001628110531     A            QTAIN23        5S 0O   180
001629110531     A                                      EDTCDE(Z)
001630110531     A                                      HIGHLIGHT
001631110531     A                                   185
001632110531     A                                      '|'
001633110531     A            QTAIN24        5S 0O   186
001634110531     A                                      EDTCDE(Z)
001635110531     A                                      HIGHLIGHT
001636110531     A                                   191
001637110531     A                                      '|'
001638110531     A N20                                 1
001639110531     A                                      'ALTRE ATTIVITÀ UFFICIO'
001640110531     A                                      SPACEB(002)
001641110531     A                                      HIGHLIGHT
001642110531     A N20                                14
001643110531     A                                      'Ferie/Assenze:'
001644110531     A                                      SPACEB(001)
001645110531     A N20                                29
001646110531     A                                      'giorni'
001647110531     A N20        RCAFERIEGG     3S 0O    43
001648110531     A                                      EDTCDE(Z)
001649110531     A                                      HIGHLIGHT
001650110531     A N20                                48
001651110531     A                                      'hh:mm '
001652110531     A N20        RCAFERIEHH     5S 2O    56
001653110531     A                                      EDTWRD('   :  ')
001654110531     A                                      HIGHLIGHT
001655110531     A N20                                14
001656110531     A                                      'Riunioni d''area  hh:mm'
001657110531     A                                      SPACEB(001)
001658110531     A N20        RCAUFRA        5S 2O    40
001659110531     A                                      EDTWRD('   :  ')
001660110531     A                                      HIGHLIGHT
001661110531     A N20                                14
001662110531     A                                      'Riunioni Comm.   hh:mm'
001663110531     A                                      SPACEB(001)
001664110531     A N20        RCAUFRC        5S 2O    40
001665110531     A                                      EDTWRD('   :  ')
001666110531     A                                      HIGHLIGHT
001667110531     A N20                                14
001668110531     A                                      'Ufficio          hh:mm'
001669110531     A                                      SPACEB(001)
001670110531     A N20        RCAUFUF        5S 2O    40
001671110531     A                                      EDTWRD('   :  ')
001672110531     A                                      HIGHLIGHT
001673110531     A                                     1
001674110531     A                                      'APPUNTAMENTI ESEGUITI'
001675110531     A                                      SPACEB(002)
001676110531     A                                      HIGHLIGHT
001677110531     A                                     5
001678110531     A                                      'NUOVO'
001679110531     A                                      SPACEB(001)
001680110531     A            RCAAPTN        6S 0O    40
001681110531     A                                      EDTCDE(Z)
001682110531     A                                      HIGHLIGHT
001683110531     A                                     5
001684110531     A                                      'INCREMENTO'
001685110531     A                                      SPACEB(001)
001686110531     A            RCAAPTI        6S 0O    40
001687110531     A                                      EDTCDE(Z)
001688110531     A                                      HIGHLIGHT
001689110531     A                                     5
001690110531     A                                      'AUMENTO/SCONTO    '
001691110531     A                                      SPACEB(001)
001692110531     A            RCAAPTA        6S 0O    40
001693110531     A                                      EDTCDE(Z)
001694110531     A                                      HIGHLIGHT
001695110531     A                                     5
001696110531     A                                      'MANTENIMENTO'
001697110531     A                                      SPACEB(001)
001698110531     A            RCAAPTM        6S 0O    40
001699110531     A                                      EDTCDE(Z)
001700110531     A                                      HIGHLIGHT
001701110531     A                                     5
001702110531     A                                      'INCASSO'
001703110531     A                                      SPACEB(001)
001704110531     A            RCAAPTC        6S 0O    40
001705110531     A                                      EDTCDE(Z)
001706110531     A                                      HIGHLIGHT
001707110531     A                                     5
001708110531     A                                      'RESTYLING TARIFFA'
001709110531     A                                      SPACEB(001)
001710110531     A            RCAAPTR        6S 0O    40
001711110531     A                                      EDTCDE(Z)
001712110531     A                                      HIGHLIGHT
001713110531     A                                    22
001714110531     A                                      'TOTALE'
001715110531     A                                      SPACEB(001)
001716110531     A                                      HIGHLIGHT
001717110531     A            TOTAPPES       6S 0O    40
001718110531     A                                      EDTCDE(Z)
001719110531     A                                      HIGHLIGHT
001720110531     A                                     1
001721110531     A                                      'AFFIANCAMENTI ESEGUITI'
001722110531     A                                      SPACEB(002)
001723110531     A                                      HIGHLIGHT
001724110531     A                                     5
001725110531     A                                      'NUOVO'
001726110531     A                                      SPACEB(001)
001727110531     A            RCAAFTN        6S 0O    40
001728110531     A                                      EDTCDE(Z)
001729110531     A                                      HIGHLIGHT
001730110531     A                                     5
001731110531     A                                      'INCREMENTO'
001732110531     A                                      SPACEB(001)
001733110531     A            RCAAFTI        6S 0O    40
001734110531     A                                      EDTCDE(Z)
001735110531     A                                      HIGHLIGHT
001736110531     A                                     5
001737110531     A                                      'AUMENTO/SCONTO    '
001738110531     A                                      SPACEB(001)
001739110531     A            RCAAFTA        6S 0O    40
001740110531     A                                      EDTCDE(Z)
001741110531     A                                      HIGHLIGHT
001742110531     A                                     5
001743110531     A                                      'MANTENIMENTO'
001744110531     A                                      SPACEB(001)
001745110531     A            RCAAFTM        6S 0O    40
001746110531     A                                      EDTCDE(Z)
001747110531     A                                      HIGHLIGHT
001748110531     A                                     5
001749110531     A                                      'INCASSO'
001750110531     A                                      SPACEB(001)
001751110531     A            RCAAFTC        6S 0O    40
001752110531     A                                      EDTCDE(Z)
001753110531     A                                      HIGHLIGHT
001754110531     A                                     5
001755110531     A                                      'RESTYLING TARIFFA'
001756110531     A                                      SPACEB(001)
001757110531     A            RCAAFTR        6S 0O    40
001758110531     A                                      EDTCDE(Z)
001759110531     A                                      HIGHLIGHT
001760110531     A                                    22
001761110531     A                                      'TOTALE'
001762110531     A                                      SPACEB(001)
001763110531     A                                      HIGHLIGHT
001764110531     A            TOTAFFES       6S 0O    40
001765110531     A                                      EDTCDE(Z)
001766110531     A                                      HIGHLIGHT
001767110531     A*%%***********************************************************************
001768110531     A*%%SS
001769110531     A*%%CL 002
001770110531     A*%%CL 001
001771110531     A*%%CL 001
001772110531     A*%%CL 001
001773110531     A*%%CL 002
001774110531     A*%%CL 002
001775110531     A*%%CL 001
001776110531     A*%%CL 001
001777110531     A*%%CL 001
001778110531     A*%%CL 002
001779110531     A*%%CL 001
001780110531     A*%%CL 001
001781110531     A*%%CL 001
001782110531     A*%%CL 001
001783110531     A*%%CL 001
001784110531     A*%%CL 002
001785110531     A*%%CL 001
001786110531     A*%%CL 001
001787110531     A*%%CL 001
001788110531     A*%%CL 001
001789110531     A*%%CL 001
001790110531     A*%%CL 001
001791110531     A*%%CL 001
001792110531     A*%%CL 001
001793110531     A*%%CL 002
001794110531     A*%%CL 001
001795110531     A*%%CL 002
001796110531     A*%%CL 001
001797110531     A*%%CL 001
001798110531     A*%%CL 001
001799110531     A*%%CL 001
001800110531     A*%%CL 002
001801110531     A*%%CL 001
001802110531     A*%%CL 001
001803110531     A*%%CL 001
001804110531     A*%%CL 001
001805110531     A*%%CL 001
001806110531     A*%%CL 001
001807110531     A*%%CL 001
001808110531     A*%%CL 002
001809110531     A*%%CL 001
001810110531     A*%%CL 001
001811110531     A*%%CL 001
001812110531     A*%%CL 001
001813110531     A*%%CL 001
001814110531     A*%%CL 001
001815110531     A*%%CL 001
001816110531     A*%%***********************************************************************
001817110531      *---------------------
001818110531     A          R MK89RIGPRE
001819110531     A*%%***********************************************************************
001820110531     A*%%RI 00000
001821110531     A*%%***********************************************************************
001822110531     A                                      SPACEB(001)
001823110531     A                                     1
001824110531     A                                      'COMMERCIALE'
001825110531     A                                      HIGHLIGHT
001826110531     A                                   +14
001827110531     A                                      '|'
001828110531     A                                   +20
001829110531     A                                      'A P P U N T A M E N T I'
001830110531     A                                    81
001831110531     A                                      '|'
001832110531     A                                   115
001833110531     A                                      'T E L E F O N A T E'
001834110531     A                                   188
001835110531     A                                      '|'
001836110531     A                                   190
001837110531     A                                      'OFFERTE'
001838110531     A                                   198
001839110531     A                                      '|'
001840110531     A                                    26
001841110531     A                                      '|'
001842110531     A                                      SPACEB(001)
001843110531     A                                    +0
001844110531     A                                      'Totale|'
001845110531     A                                    +2
001846110531     A                                      'N'
001847110531     A                                    +4
001848110531     A                                      '|'
001849110531     A                                    +2
001850110531     A                                      'I'
001851110531     A                                    +4
001852110531     A                                      '|'
001853110531     A                                    +2
001854110531     A                                      'A'
001855110531     A                                    +4
001856110531     A                                      '|'
001857110531     A                                    +2
001858110531     A                                      'M'
001859110531     A                                    +4
001860110531     A                                      '|'
001861110531     A                                    +2
001862110531     A                                      'C'
001863110531     A                                    +4
001864110531     A                                      '|'
001865110531     A                                    +2
001866110531     A                                      'R'
001867110531     A                                    +4
001868110531     A                                      '|Totale| 19 | 20 | 21 | 22 | 24 | -
001869110531     A                                      25 | 26 | 27 | 28 | 30 | 31 | 32 | -
001870110531     A                                      33 | 44 | 60 | 70 | 71 | 73 | 74 | -
001871110531     A                                      75 '
001872110531     A                                    +0
001873110531     A                                      '|'
001874110531     A                                   192
001875110531     A                                      '80 '
001876110531     A                                   198
001877110531     A                                      '|'
001878110531     A*%%***********************************************************************
001879110531     A*%%SS
001880110531     A*%%CL 001
001881110531     A*%%***********************************************************************
001882110531      *---------------------
001883110531     A          R MK89RIGPR1
001884110531     A*%%***********************************************************************
001885110531     A*%%RI 00000
001886110531     A*%%***********************************************************************
001887110531     A                                      SPACEB(001)
001888110531     A            WRKRIGA1     198A        1
001889110531     A            RPADRG        25A  O     1
001890110531     A                                      SPACEB(001)
001891110531     A                                    +0
001892110531     A                                      '|'
001893110531     A            TOTAPP         6S 0O    +0
001894110531     A                                      EDTCDE(Z)
001895110531     A                                      HIGHLIGHT
001896110531     A                                    +0
001897110531     A                                      '|'
001898110531     A            RPAAPPN        3S 0O    +0
001899110531     A                                      EDTCDE(Z)
001900110531     A                                      HIGHLIGHT
001901110531     A  30                                +0
001902110531     A                                      '/'
001903110531     A  30        RPAAFFN        3S 0O    +0
001904110531     A                                      EDTCDE(Z)
001905110531     A                                      HIGHLIGHT
001906110531     A                                    +0
001907110531     A                                      '|'
001908110531     A            RPAAPPI        3S 0O    +0
001909110531     A                                      EDTCDE(Z)
001910110531     A                                      HIGHLIGHT
001911110531     A  31                                +0
001912110531     A                                      '/'
001913110531     A  31        RPAAFFI        3S 0O    +0
001914110531     A                                      EDTCDE(Z)
001915110531     A                                      HIGHLIGHT
001916110531     A                                    +0
001917110531     A                                      '|'
001918110531     A            RPAAPPA        3S 0O    +0
001919110531     A                                      EDTCDE(Z)
001920110531     A                                      HIGHLIGHT
001921110531     A  32                                +0
001922110531     A                                      '/'
001923110531     A  32        RPAAFFA        3S 0O    +0
001924110531     A                                      EDTCDE(Z)
001925110531     A                                      HIGHLIGHT
001926110531     A                                    +0
001927110531     A                                      '|'
001928110531     A            RPAAPPM        3S 0O    +0
001929110531     A                                      EDTCDE(Z)
001930110531     A                                      HIGHLIGHT
001931110531     A  33                                +0
001932110531     A                                      '/'
001933110531     A  33        RPAAFFM        3S 0O    +0
001934110531     A                                      EDTCDE(Z)
001935110531     A                                      HIGHLIGHT
001936110531     A                                    +0
001937110531     A                                      '|'
001938110531     A            RPAAPPC        3S 0O    +0
001939110531     A                                      EDTCDE(Z)
001940110531     A                                      HIGHLIGHT
001941110531     A  34                                +0
001942110531     A                                      '/'
001943110531     A  34        RPAAFFC        3S 0O    +0
001944110531     A                                      EDTCDE(Z)
001945110531     A                                      HIGHLIGHT
001946110531     A                                    +0
001947110531     A                                      '|'
001948110531     A            RPAAPPR        3S 0O    +0
001949110531     A                                      EDTCDE(Z)
001950110531     A                                      HIGHLIGHT
001951110531     A  35                                +0
001952110531     A                                      '/'
001953110531     A  35        RPAAFFR        3S 0O    +0
001954110531     A                                      EDTCDE(Z)
001955110531     A                                      HIGHLIGHT
001956110531     A                                    +0
001957110531     A                                      '|'
001958110531     A            TOTTEL         6S 0O    +0
001959110531     A                                      EDTCDE(Z)
001960110531     A                                      HIGHLIGHT
001961110531     A                                    +0
001962110531     A                                      '|'
001963110531     A            RPATC19        4S 0O    +0
001964110531     A                                      EDTCDE(Z)
001965110531     A                                      HIGHLIGHT
001966110531     A                                    +0
001967110531     A                                      '|'
001968110531     A            RPATC20        4S 0O    +0
001969110531     A                                      EDTCDE(Z)
001970110531     A                                      HIGHLIGHT
001971110531     A                                    +0
001972110531     A                                      '|'
001973110531     A            RPATC21        4S 0O    +0
001974110531     A                                      EDTCDE(Z)
001975110531     A                                      HIGHLIGHT
001976110531     A                                    +0
001977110531     A                                      '|'
001978110531     A            RPATC22        4S 0O    +0
001979110531     A                                      EDTCDE(Z)
001980110531     A                                      HIGHLIGHT
001981110531     A                                    +0
001982110531     A                                      '|'
001983110531     A            RPATC24        4S 0O    +0
001984110531     A                                      EDTCDE(Z)
001985110531     A                                      HIGHLIGHT
001986110531     A                                    +0
001987110531     A                                      '|'
001988110531     A            RPATC25        4S 0O    +0
001989110531     A                                      EDTCDE(Z)
001990110531     A                                      HIGHLIGHT
001991110531     A                                    +0
001992110531     A                                      '|'
001993110531     A            RPATC26        4S 0O    +0
001994110531     A                                      EDTCDE(Z)
001995110531     A                                      HIGHLIGHT
001996110531     A                                    +0
001997110531     A                                      '|'
001998110531     A            RPATC27        4S 0O    +0
001999110531     A                                      EDTCDE(Z)
002000110531     A                                      HIGHLIGHT
002001110531     A                                    +0
002002110531     A                                      '|'
002003110531     A            RPATC28        4S 0O    +0
002004110531     A                                      EDTCDE(Z)
002005110531     A                                      HIGHLIGHT
002006110531     A                                    +0
002007110531     A                                      '|'
002008110531     A            RPATC30        4S 0O    +0
002009110531     A                                      EDTCDE(Z)
002010110531     A                                      HIGHLIGHT
002011110531     A                                    +0
002012110531     A                                      '|'
002013110531     A            RPATC31        4S 0O    +0
002014110531     A                                      EDTCDE(Z)
002015110531     A                                      HIGHLIGHT
002016110531     A                                    +0
002017110531     A                                      '|'
002018110531     A            RPATC32        4S 0O    +0
002019110531     A                                      EDTCDE(Z)
002020110531     A                                      HIGHLIGHT
002021110531     A                                    +0
002022110531     A                                      '|'
002023110531     A            RPATC33        4S 0O    +0
002024110531     A                                      EDTCDE(Z)
002025110531     A                                      HIGHLIGHT
002026110531     A                                    +0
002027110531     A                                      '|'
002028110531     A            RPATC44        4S 0O    +0
002029110531     A                                      EDTCDE(Z)
002030110531     A                                      HIGHLIGHT
002031110531     A                                    +0
002032110531     A                                      '|'
002033110531     A            RPATC60        4S 0O    +0
002034110531     A                                      EDTCDE(Z)
002035110531     A                                      HIGHLIGHT
002036110531     A                                    +0
002037110531     A                                      '|'
002038110531     A            RPATC70        4S 0O    +0
002039110531     A                                      EDTCDE(Z)
002040110531     A                                      HIGHLIGHT
002041110531     A                                    +0
002042110531     A                                      '|'
002043110531     A            RPATC71        4S 0O    +0
002044110531     A                                      EDTCDE(Z)
002045110531     A                                      HIGHLIGHT
002046110531     A                                    +0
002047110531     A                                      '|'
002048110531     A            RPATC73        4S 0O    +0
002049110531     A                                      EDTCDE(Z)
002050110531     A                                      HIGHLIGHT
002051110531     A                                    +0
002052110531     A                                      '|'
002053110531     A            RPATC74        4S 0O    +0
002054110531     A                                      EDTCDE(Z)
002055110531     A                                      HIGHLIGHT
002056110531     A                                    +0
002057110531     A                                      '|'
002058110531     A            RPATC75        4S 0O    +0
002059110531     A                                      EDTCDE(Z)
002060110531     A                                      HIGHLIGHT
002061110531     A                                   188
002062110531     A                                      '|'
002063110531     A            RPAOFF         4S 0O    +2
002064110531     A                                      EDTCDE(Z)
002065110531     A                                      HIGHLIGHT
002066110531     A                                    +3
002067110531     A                                      '|'
002068110531     A*%%***********************************************************************
002069110531     A*%%SS
002070110531     A*%%CL 001
002071110531     A*%%***********************************************************************
002072110531      *---------------------
002073110531     A          R MK89FINE1
002074110531     A*%%***********************************************************************
002075110531     A*%%RI 00000
002076110531     A*%%FS 002
002077110531     A*%%***********************************************************************
002078110531     A                                      SPACEB(003)
002079110531     A                                     1
002080110531     A                                      'Legenda Causali :'
002081110531     A                                      SPACEB(001)
002082110531     A                                      HIGHLIGHT
002083110531     A                                      UNDERLINE
002084110531     A*%%***********************************************************************
002085110531     A*%%SS
002086110531     A*%%CL 001
002087110531     A*%%***********************************************************************
002088110531     A          R MK89FINE2
002089110531     A*%%***********************************************************************
002090110531     A*%%RI 00000
002091110531     A*%%***********************************************************************
002092110531     A            PCODCC1        2A  O     1
002093110531     A                                      SPACEB(002)
002094110531     A            PDESCC1       35A  O    +1
002095110531     A            PCODCC2        2A  O    52
002096110531     A            PDESCC2       35A  O    +1
002097110531     A            PCODCC3        2A  O   101
002098110531     A            PDESCC3       35A  O    +1
002099110531     A*%%***********************************************************************
002100110531     A*%%SS
002101110531     A*%%CL 002
002102110531     A*%%***********************************************************************
002103110531      *---------------------
002104110531     A          R MK89FINE
002105110531     A*%%***********************************************************************
002106110531     A*%%RI 00000
002107110531     A*%%***********************************************************************
002108110531     A                                     1
002109110531     A                                      'Parametri di lancio:'
002110110531     A                                      SPACEB(004)
002111110531     A                                      HIGHLIGHT
002112110531     A                                      UNDERLINE
002113110531     A                                     1
002114110531     A                                      'Tipo Elaborazione..............:'
002115110531     A                                      SPACEB(002)
002116110531     A            I88TCPE        1A  O    +3
002117110531     A                                    +2
002118110531     A                                      '(C=Consuntiva, P=Preventiva, E=Ent-
002119110531     A                                      rambe)'
002120110531     A  09                                 1
002121110531     A                                      'Area...........................:'
002122110531     A                                      SPACEB(001)
002123110531     A  09        I88CAR         3S 0O    +3
002124110531     A                                      EDTCDE(L)
002125110531     A  09        PDESCAR       25A  O    +0
002126110531     A                                     1
002127110531     A                                      'Commerciale Unificante.........:'
002128110531     A                                      SPACEB(001)
002129110531     A            I88CMMU        7S 0O    +3
002130110531     A            PDESCMMU      25A  O    +1
002131110531     A                                     1
002132110531     A                                      'Data Elaborazione Consuntiva da:'
002133110531     A                                      SPACEB(001)
002134110531     A            PDATAIC        8S 0O    +3
002135110531     A                                      EDTWRD('  /  /   0')
002136110531     A                                    +2
002137110531     A                                      'al:'
002138110531     A            PDATAFC        8S 0O    +2
002139110531     A                                      EDTWRD('  /  /   0')
002140110531     A                                     1
002141110531     A                                      'Data Elaborazione Preventiva da:'
002142110531     A                                      SPACEB(001)
002143110531     A            PDATAIP        8S 0O    +3
002144110531     A                                      EDTWRD('  /  /   0')
002145110531     A                                    +2
002146110531     A                                      'al:'
002147110531     A            PDATAFP        8S 0O    +2
002148110531     A                                      EDTWRD('  /  /   0')
002149110531     A                                     1
002150110531     A                                      'Stampare dettaglio Agenda .....:'
002151110531     A                                      SPACEB(001)
002152110531     A            I88DETT        1A  O    +3
002153110531     A                                    +2
002154110531     A                                      '(S/N)'
002155110531     A                                     3
002156110531     A                                      'SELEZIONE Commerciali .......:'
002157110531     A                                      SPACEB(001)
002158110531     A            I88DSCMMIE     1A  O    +3
002159110531     A                                    +2
002160110531     A                                      '(I=Interno, E=Esterno,  =Tutti)'
002161110531     A                                     3
002162110531     A                                      'Includi/Ometti Tipi Attività.:'
002163110531     A                                      SPACEB(001)
002164110531     A            I88DSTAT       1A  O    +3
002165110531     A                                    +2
002166110531     A                                      '(I/O)'
002167110531     A            I88TAT1        1A  O    +4
002168110531     A            I88TAT2        1A  O    +1
002169110531     A            I88TAT3        1A  O    +1
002170110531     A            I88TAT4        1A  O    +1
002171110531     A            I88TAT5        1A  O    +1
002172110531     A                                     1
002173110531     A                                      'Stampa Totali per Commerciale..:'
002174110531     A                                      SPACEB(001)
002175110531     A            I88TOTC        1A  O    +3
002176110531     A                                    +2
002177110531     A                                      '(S/N)'
002178110531     A                                     3
002179110531     A                                      'Selezione Commerciali........:'
002180110531     A                                      SPACEB(001)
002181110531     A            I88CSCMMIE     1A  O    +3
002182110531     A                                    +2
002183110531     A                                      '(I=Interno, E=Esterno,  =Tutti)'
002184110531     A                                     1
002185110531     A                                      'Stampa totali generali.........:'
002186110531     A                                      SPACEB(001)
002187110531     A            I88TOTG        1A  O    +3
002188110531     A                                    +2
002189110531     A                                      '(S/N)'
002190110531     A                                     3
002191110531     A                                      'Selezione Commerciali .......:'
002192110531     A                                      SPACEB(001)
002193110531     A            I88TSCMMIE     1A  O    +3
002194110531     A                                    +2
002195110531     A                                      '(I=Interno, E=Esterno,  =Tutti)'
002196110531     A*%%***********************************************************************
002197110531     A*%%SS
002198110531     A*%%CL 004
002199110531     A*%%CL 002
002200110531     A*%%CL 001
002201110531     A*%%SN I88CAR     999
002202110531     A*%%CL 001
002203110531     A*%%CL 001
002204110531     A*%%CL 001
002205110531     A*%%CL 001
002206110531     A*%%CL 001
002207110531     A*%%CL 001
002208110531     A*%%CL 001
002209110531     A*%%CL 001
002210110531     A*%%CL 001
002211110531     A*%%CL 001
002212110531     A*%%***********************************************************************
002213110531     A          R MK89FINE3
002214110531     A*%%***********************************************************************
002215110531     A*%%RI 00000
002216110531     A*%%***********************************************************************
002217110531     A                                    59
002218110531     A                                      '***   FINE  STAMPA   ***'
002219110531     A                                      SPACEB(002)
002220110531     A*%%***********************************************************************
002221110531     A*%%SS
002222110531     A*%%CL 002
002223110531     A*%%CP+999CRTPRTF
002224110531     A*%%CP+    FILE(GAITRAFIL/TRMK89P)
002225110531     A*%%CP+    DEVTYPE(*SCS)
002226110531     A*%%CP+    PAGESIZE(69 198)
002227110531     A*%%CP+    CPI(15)
002228110531     A*%%CP+    OVRFLW(62)
002229110531     A*%%CP     USRDTA('St.Comle')
002230110531     A*%%CS+999CRTPRTF
002231110531     A*%%CS+    FILE(QTEMP/QPRDRPT   )
002232110531     A*%%CS+    DEVTYPE(*SCS)
002233110531     A*%%CS     PAGESIZE(*N       198      *N     )
002234110531     A*%%***********************************************************************
002235110531      *---------------------
002236110531     A*//       R MK86COUNTR
002237110531     A*//                                   SPACEB(000)
002238110531     A*//         PCURLINE       3  0    196EDTCDE(Z)
