000100040108      *--------------------------------------------------------------*
000200090708      * PARAMETRI X GESTIONE AGENDA COMMERCIALI                      *
000300040108      *--------------------------------------------------------------*
000400091111      *
000500091111     A          R MK82REC                   TEXT('DS PER GESTIONE AGE-
000600090708     A                                      NDA COMMERCIALI')
000700040108      *
000800091111      * C A M P I   I N   I N P U T
000900100215     A            IMK82RICH      1A         TEXT('1=PGM RICHIAMATO NO F10; -
001000100112     A                                            A=PGM RICHIAMATO NO F10')
001100091111     A            IMK82DATA      8S 0       TEXT('DATA')
001200091111     A            IMK82CAGE      7S 0       TEXT('COMMERCIALE')
001300091111     A            IMK82NOATT    10A         TEXT('10 ATTIVITÀ DA ESCLUDERE')
001400091111     A            IMK82TIME      1A         TEXT('TIME DI VISUALIZZAZIONE 1=1 -
001500091026     A                                      ORA 2=2 ORE 3=MEZZ''ORA')
001600091111      *
001700091111      * C A M P I   I N   O U T P U T
