000100951113     A*---------------------------------------------------------------*
000200080627     A* DS PER PGM DELLE INFO COMMERCIALI
000300951113     A*---------------------------------------------------------------*
000400080627     A                                      REF(TICPI00F)
000500080627     A          R D50MKREC                  TEXT('DS PER GESTIONE INFO COMM+
000600080627     A                                      ERCIALI')
000700951113     A*
000800940919     A* C A M P I   I N   I N P U T:
000900080627     A            I50TLA         1A         TEXT('TIPO LANCIO PROGRAMMA')
001000080627     A* DATI POTENZIALE
001100080627     A            I50CPO    R               REFFLD(CPICPO)
001200080627     A            I50RAG        48A         TEXT('RAGIONE SOCIALE POTENZIALE')
001300080627     A            I50ATB    R               REFFLD(CPIATB)
001400080627     A                                      TEXT('POTENZIALE ANNULLATO')
001500081003     A            I50IFOTOT      1A         TEXT('S= GIÀ INSERITE TUTTE LE INFO-
001600081003                                            COMMERCIALI')
001700080627     A**
001800080627     A            I50MOD         1A         TEXT('I=INTERROGAZIONE G=GESTIONE')
001900080627     A            I50OBL         1A         TEXT('S=OBBLIGATORIO L''INSERIMENTO-
002000080627                                             DELLE INFO')
002100080627     A            I50PGM        10A         TEXT('NOME PGM RICHIAMANTE')
002200960223     A*
002300960530     A* C A M P I   I N   O U T P U T:
002400960530     A*
002500080627     A            O50F03         1A         TEXT('S=PREMUTO F3')
002600080627     A            O50F06         1A         TEXT('S=PREMUTO F6')
002700080627     A            O50F12         1A         TEXT('S=PREMUTO F12')
002800081015     A            O50IFOTOT      1A         TEXT('S= INSERITE TUTTE LE INFO-
002900081015                                            COMMERCIALI')
