000100170406     A*%%TS  SD  20170406  111837  EDPMB       REL-V7R2M0  5770-WDS
000200170406     A*%%EC
000300170406     A                                      DSPSIZ(27 132 *DS4)
000400170406     A                                      CHGINPDFT(HI UL)
000500170406     A                                      INDARA
000600170406     A                                      PRINT
000700170405     A**-------------------------------------------------------------**
000800170406     A          R MKP0T01
000900170406     A*%%TS  SD  20170406  111837  EDPMB       REL-V7R2M0  5770-WDS
001000170406     A            RSUT      R        O  1  2REFFLD(RSUT DDATIUTE)
001100170406     A                                  1 47'**  Manutenzione Tariffe E-Commerc-
001200170406     A                                      e  **'
001300170406     A                                      DSPATR(RI)
001400170406     A                                      DSPATR(UL)
001500170406     A            V01PGM    R        O  1105REFFLD($PGM CNDIZION)
001600170406     A                                  1123DATE(*JOB *YY)
001700170406     A                                      EDTCDE(Y)
001800170406     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
001900170406     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
002000170406     A                                  2125TIME
002100170405     A**-------------------------------------------------------------**
002200170406     A          R MKP0D02
002300170406     A*%%TS  SD  20170406  092148  EDPMB       REL-V7R2M0  5770-WDS
002400170406     A                                      CF03
002500170406     A                                      OVERLAY
002600170406     A  28        V02MSG        78   M
002700170406     A                                  7 31'Filiale ...........?:'
002800170406     A            V02FIL         3A  B  7 54
002900170406     A  50                                  DSPATR(PC)
003000170406     A                                      CHECK(RB)
003100170406     A            V02FILD       20A  O  7 63COLOR(BLU)
003200170406     A                                  9 31'Comm.le Unificante ?:'
003300170406     A            V02CMM         7A  B  9 54
003400170406     A  51                                  DSPATR(PC)
003500170406     A                                      CHECK(RB)
003600170406     A            V02CMMD       25A  O  9 63COLOR(BLU)
003700170406     A                                 11 31'Cliente ...........?:'
003800170406     A            V02KSC         7A  B 11 54
003900170406     A  52                                  DSPATR(PC)
004000170406     A                                      CHECK(RB)
004100170406     A            V02KSCD       48A  O 11 63COLOR(BLU)
004200170406     A                                 12 35'oppure'
004300170406     A                                 13 31'Cliente Unificante ?:'
004400170406     A            V02KSU         7A  B 13 54
004500170406     A  53                                  DSPATR(PC)
004600170406     A                                      CHECK(RB)
004700170406     A            V02KSUD       48A  O 13 63COLOR(BLU)
004800170406     A                                 15 31'Cod.Importanza Cli ?:'
004900170406     A            V02CLV1        1A  B 15 54
005000170406     A  54                                  DSPATR(PC)
005100170406     A            V02CLV2        1A  B 15 57
005200170406     A  55                                  DSPATR(PC)
005300170406     A            V02CLV3        1A  B 15 60
005400170406     A  56                                  DSPATR(PC)
005500170406     A            V02CLV4        1A  B 15 63
005600170406     A  57                                  DSPATR(PC)
005700170406     A            V02CLV5        1A  B 15 66
005800170406     A  58                                  DSPATR(PC)
005900170406     A                                 17 31'% Sped. E-Commerce .:'
006000170406     A            V02ECOM        1A  B 17 54VALUES(' ' 'S' 'N')
006100170406     A                                 17 57'(S/N/_=Tutti)'
006200170406     A                                      COLOR(BLU)
006300170406     A                                 17 73'% > di'
006400170406     A            V02PERC        3Y 0B 17 81CHECK(RZ)
006500170406     A                                      RANGE(0 100)
006600170406     A                                      EDTCDE(Z)
006700170411     A  61                                  DSPATR(PC)
006800170406     A                                 19 31'Escludi "P" inserite:'
006900170406     A            V02ESCLUDI     1A  B 19 54VALUES(' ' 'S')
007000170406     A                                 19 63'(S/_=Tutti)'
007100170406     A                                      COLOR(BLU)
007200170406     A                                 24 43'PASSWORD:'
007300170406     A                                      DSPATR(HI)
007400170406     A                                      DSPATR(UL)
007500170406     A            V02PWD        10A  B 24 53TEXT('Password')
007600170406     A                                      DSPATR(ND)
007700170406     A  59                                  DSPATR(PC)
007800170406     A                                 27  4'F3=Fine'
007900170406     A                                      COLOR(BLU)
008000170405     A**-------------------------------------------------------------**
008100170406     A          R MKP0S03                   SFL
008200170406     A*%%TS  SD  20170406  111630  EDPMB       REL-V7R2M0  5770-WDS
008300170406     A  32                                  SFLNXTCHG
008400170406     A            VS3OPZ         1A  B  8  2
008500170406     A  60                                  DSPATR(PC)
008600170406     A  60                                  COLOR(RED)
008700170406     A            VH3KSCD       48A  H
008800170406     A            VS3CMM         7S 0H
008900170406     A            VS3CLV         1A  O  8  4
009000170406     A            VS3KSC         7S 0O  8  6
009100170406     A            VS3BLC         1A  O  8 14
009200170406     A            VS3KSCD       27A  O  8 16
009300170406     A            VS3CMMD       25A  O  8 44
009400170406     A            VS3CTR         3S 0O  8 70
009500170406     A            VS3PRG         3Y 0O  8 74EDTCDE(Z)
009600170406     A            VS3DDT         8Y 0O  8 78EDTCDE(Y)
009700170406     A            VS3DST         8Y 0O  8 89EDTCDE(Y)
009800170406     A            VS3DES        15A  O  8100
009900170406     A            VS3BAP         1A  O  8117
010000170406     A            VS3ECM         5Y 0O  8120EDTCDE(Z)
010100170406     A            VS3GVA         1A  O  8129
010200170406     A                                  9 43'Cliente Unificante'
010300170406     A                                      COLOR(BLU)
010400170406     A            VS3KSU         7S 0O  9 62
010500170406     A            VS3KSUD       27A  O  9 70
010600170405     A**-------------------------------------------------------------**
010700170406     A          R MKP0C03                   SFLCTL(MKP0S03)
010800170406     A*%%TS  SD  20170406  105415  EDPMB       REL-V7R2M0  5770-WDS
010900170406     A                                      SFLSIZ(9999)
011000170406     A                                      SFLPAG(0008)
011100170406     A                                      CF03
011200170406     A                                      CF06
011300170406     A                                      CF12
011400170406     A                                      OVERLAY
011500170406     A N30                                  SFLDSP
011600170406     A N31                                  SFLDSPCTL
011700170406     A  30 31                               SFLCLR
011800170406     A  33                                  SFLEND(*MORE)
011900170406     A                                      SFLDROP(CF09)
012000170406     A            V03RCD         4S 0H      SFLRCDNBR(CURSOR)
012100170406     A            V03CSR         5S 0H
012200170406     A  28        V03MSG        78   M
012300170406     A                                  4  2'Opzioni:'
012400170406     A                                      DSPATR(HI)
012500170406     A                                      DSPATR(UL)
012600170406     A                                  4 11'P=Imposta "P" Particolarità Varie;-
012700170406     A                                       T=Int.Tariffa; I=Int.Clienti; S=St-
012800170406     A                                      atistica'
012900170406     A                                      COLOR(BLU)
013000170406     A                                  6  2'O|I|CLIENTE                       -
013100170406     A                                             |                         | -
013200170406     A                                            |                     |      -
013300170406     A                                               |P/A|  %   |Part.'
013400170406     A                                      DSPATR(HI)
013500170406     A                                  7  2'P|C|        B=Bloccato            -
013600170406     A                                             |COMMERCIALE              |T-
013700170406     A                                      ar Prg|Decorrenza Scadenza  |Descri-
013800170406     A                                      zione    | B |E-Com.|Varie'
013900170406     A                                      DSPATR(HI)
014000170406     A                                      DSPATR(UL)
014100170405     A**-------------------------------------------------------------**
014200170405     A          R MKP0P03
014300170405     A*%%TS  SD  20170405  112321  EDPMB       REL-V7R2M0  5770-WDS
014400170405     A                                      OVERLAY
014500170405     A                                 25  2'                                  -
014600170405     A                                                                         -
014700170405     A                                                                         -
014800170405     A                                                                 '
014900170405     A                                      DSPATR(UL)
015000170405     A                                      DSPATR(HI)
015100170405     A                                 27  3'F3=Fine'
015200170405     A                                      COLOR(BLU)
015300170405     A                                 27 32'F6=Aggiorna Tariffa'
015400170405     A                                      COLOR(BLU)
015500170405     A                                 27 73'F9=Altri Dati'
015600170405     A                                      COLOR(BLU)
015700170405     A                                 27121'F12=Ritorno'
015800170405     A                                      COLOR(BLU)
015900170406     A**-------------------------------------------------------------**
016000170406     A          R MKP0D04
016100170406     A*%%TS  SD  20170406  105415  EDPMB       REL-V7R2M0  5770-WDS
016200170406     A                                      CF03
016300170406     A                                      CF12
016400170406     A                                      OVERLAY
016500170406     A                                  4  2'Opzioni:'
016600170406     A                                      DSPATR(HI)
016700170406     A                                      DSPATR(UL)
016800170406     A                                  4 11'P=Imposta "P" Particolarità Varie;-
016900170406     A                                       T=Int.Tariffa; I=Int.Clienti; S=St-
017000170406     A                                      atistica'
017100170406     A                                      COLOR(BLU)
017200170406     A                                  6  2'O|I|CLIENTE                       -
017300170406     A                                             |                         | -
017400170406     A                                            |                     |      -
017500170406     A                                               |P/A|  %   |Part.'
017600170406     A                                      DSPATR(HI)
017700170406     A                                  7  2'P|C|        B=Bloccato            -
017800170406     A                                             |COMMERCIALE              |T-
017900170406     A                                      ar Prg|Decorrenza Scadenza  |Descri-
018000170406     A                                      zione    | B |E-Com.|Varie'
018100170406     A                                      DSPATR(HI)
018200170406     A                                      DSPATR(UL)
018300170406     A                                 16 48'Nr. MAX righe visualizzabili super-
018400170406     A                                      ato.'
018500170406     A                                      COLOR(RED)
018600170406     A                                 25  2'                                  -
018700170406     A                                                                         -
018800170406     A                                                                         -
018900170406     A                                                                 '
019000170406     A                                      DSPATR(UL)
019100170406     A                                      DSPATR(HI)
019200170406     A                                 27  3'F3=Fine'
019300170406     A                                      COLOR(BLU)
019400170406     A                                 27121'F12=Ritorno'
019500170406     A                                      COLOR(BLU)
