000001140930     A*%%***********************************************************************
000002140930     A*%%TS  RD  20140930  095310  EDPMB       REL-V7R1M0  5770-WDS
000003140930     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004140930     A*%%FI       0000000000000000000000000000000000000000000000000
000005140930     A*%%***********************************************************************
000006140930      *======================================================================*
000007140930      *  STAMPA ANAGRAFICA POTENZIALI                                        *
000008140930      *======================================================================*
000009140930     A                                      INDARA
000010140930      *---------------------
000011140930     A          R MK13PAGINA
000012140930     A*%%***********************************************************************
000013140930     A*%%RI 00000
000014140930     A*%%***********************************************************************
000015140930     A                                      SKIPB(001)
000016140930     A                                     1
000017140930     A                                      ' '
000018140930     A*%%***********************************************************************
000019140930     A*%%SS
000020140930     A*%%***********************************************************************
000021140930      *---------------------
000022140930     A          R MK13SEPARA
000023140930     A*%%***********************************************************************
000024140930     A*%%RI 00000
000025140930     A*%%***********************************************************************
000026140930     A                                      SPACEB(001)
000027140930     A            WRKRIGA      198A        1
000028140930     A*%%***********************************************************************
000029140930     A*%%SS
000030140930     A*%%***********************************************************************
000031140930      *---------------------
000032140930     A          R MK13PAR
000033140930     A*%%***********************************************************************
000034140930     A*%%RI 00000
000035140930     A*%%***********************************************************************
000036140930     A                                      SPACEB(001)
000037140930     A            RSUT          20A        1
000038140930     A                                    50
000039140930     A                                      'S T A M P A   A N A G R A F I C A -
000040140930     A                                        C L I E N T I   P O T E N Z I A L-
000041140930     A                                       I'
000042140930     A                                      HIGHLIGHT
000043140930     A                                      UNDERLINE
000044140930     A            NOMEPGM       10A  O   154
000045140930     A            DATAELA        8S 0    172
000046140930     A                                      EDTWRD('  /  /    ')
000047140930     A                                   187
000048140930     A                                      'PAG.'
000049140930     A                                   192
000050140930     A                                      PAGNBR
000051140930     A                                      EDTCDE(Z)
000052140930     A            KNSIF     R              1
000053140930     A                                      REFFLD(KNSIF KPJBA)
000054140930     A                                      SPACEB(001)
000055140930     A            KNMUS     R             12
000056140930     A                                      REFFLD(KNMUS KPJBA)
000057140930     A                                    70
000058140930     A                                      'PARZIALIZZAZIONI:'
000059140930     A                                      SPACEB(002)
000060140930     A                                    72
000061140930     A                                      'Commerciale Unificante'
000062140930     A                                      SPACEB(002)
000063140930     A            D13CMMU        7S 0O    +4
000064140930     A                                      EDTCDE(Z)
000065140930     A            DESCMMU       25A  O    +1
000066140930     A                                    72
000067140930     A                                      'Provincia'
000068140930     A                                      SPACEB(001)
000069140930     A            D13PRV         2A  O   +17
000070140930     A                                    72
000071140930     A                                      'C.A.P.'
000072140930     A                                      SPACEB(001)
000073140930     A            D13CAP         9A  O   +20
000074140930     A                                    72
000075140930     A                                      'Nazione'
000076140930     A                                      SPACEB(001)
000077140930     A            D13NAZ         3A  O   +19
000078140930     A                                    72
000079140930     A                                      'Località'
000080140930     A                                      SPACEB(001)
000081140930     A            D13LOC        35A  O   +18
000082140930     A                                    72
000083140930     A                                      'Area'
000084140930     A                                      SPACEB(001)
000085140930     A            D13CAR         3S 0O   +22
000086140930     A                                      EDTCDE(Z)
000087140930     A            DESCAR        25A  O    +1
000088140930     A                                    72
000089140930     A                                      'Filiale di Appartenenza'
000090140930     A                                      SPACEB(001)
000091140930     A            D13FIL         3S 0O    +3
000092140930     A                                      EDTCDE(Z)
000093140930     A            DESFIL        20A  O    +1
000094140930     A                                    72
000095140930     A                                      'Categoria Merceologica'
000096140930     A                                      SPACEB(001)
000097140930     A            D13SCT         5S 0O    +4
000098140930     A                                      EDTCDE(Z)
000099140930     A            DESSCT        40A  O    +1
000100140930     A                                    72
000101140930     A                                      'Codice Importanza'
000102140930     A                                      SPACEB(001)
000103140930     A            D13CIC1        1A  O    +9
000104140930     A            D13CIC2        1A  O    +1
000105140930     A            D13CIC3        1A  O    +1
000106140930     A            D13CIC4        1A  O    +1
000107140930     A            D13CIC5        1A  O    +1
000108140930     A                                    72
000109140930     A                                      'Categoria'
000110140930     A                                      SPACEB(001)
000111140930     A            D13FLS1        1A  O   +17
000112140930     A            D13FLS2        1A  O    +1
000113140930     A            D13FLS3        1A  O    +1
000114140930     A            D13FLS4        1A  O    +1
000115140930     A            D13FLS5        1A  O    +1
000116140930     A                                    72
000117140930     A                                      '% Fatturato Export'
000118140930     A                                      SPACEB(001)
000119140930     A  10                                +8
000120140930     A                                      'da'
000121140930     A            D13PEXPDA      3S 0O    +1
000122140930     A                                      EDTCDE(Z)
000123140930     A  10                                +2
000124140930     A                                      'a'
000125140930     A            D13PEXPA       3S 0O    +1
000126140930     A                                      EDTCDE(Z)
000127140930     A                                    72
000128140930     A                                      'Anno Inizio Attività'
000129140930     A                                      SPACEB(001)
000130140930     A  10                                +6
000131140930     A                                      'da'
000132140930     A            D13ANNODA      4S 0O    +1
000133140930     A                                      EDTCDE(Z)
000134140930     A  10                                +1
000135140930     A                                      'a'
000136140930     A            D13ANNOA       4S 0O    +1
000137140930     A                                      EDTCDE(Z)
000138140930     A                                    72
000139140930     A                                      'Contattati'
000140140930     A                                      SPACEB(001)
000141140930     A            D13PST         1A  O   +16
000142140930     A            DESPST        15A  O    +1
000143140930     A                                    72
000144140930     A                                      'Sede/Filiale'
000145140930     A                                      SPACEB(001)
000146140930     A            D13FSF         1A  O   +14
000147140930     A            DESFSF        15A  O    +1
000148140930     A                                    72
000149140930     A                                      'Con Trattativa in corso'
000150140930     A                                      SPACEB(001)
000151140930     A            D13TTR         1A  O    +3
000152140930     A            DESTTR        15A  O    +1
000153140930     A                                    72
000154140930     A                                      'Prossima Attività'
000155140930     A                                      SPACEB(001)
000156140930     A                                      UNDERLINE
000157140930     A                                    74
000158140930     A                                      'Commerciale Unificante'
000159140930     A                                      SPACEB(001)
000160140930     A            D13CMM         7S 0O    +2
000161140930     A                                      EDTCDE(Z)
000162140930     A            DESCMM        25A  O    +1
000163140930     A                                    74
000164140930     A                                      'Causale Attività'
000165140930     A                                      SPACEB(001)
000166140930     A            D13CCO1        2A  O    +8
000167140930     A            D13CCO2        2A  O    +1
000168140930     A            D13CCO3        2A  O    +1
000169140930     A            D13CCO4        2A  O    +1
000170140930     A            D13CCO5        2A  O    +1
000171140930     A                                    74
000172140930     A                                      'Da Effettuare'
000173140930     A                                      SPACEB(001)
000174140930     A                                   +11
000175140930     A                                      'dal'
000176140930     A            STPDADDA       8S 0O    +1
000177140930     A                                      EDTWRD('  /  /    ')
000178140930     A                                    +2
000179140930     A                                      'al'
000180140930     A            STPDADA        8S 0O    +1
000181140930     A                                      EDTWRD('  /  /    ')
000182140930     A  10                                67
000183140930     A                                      'INFO COMMERCIALI'
000184140930     A                                      SPACEB(002)
000185140930     A  10                                72
000186140930     A                                      'Spesa Trasporti'
000187140930     A                                      SPACEB(001)
000188140930     A  10                               +11
000189140930     A                                      'da'
000190140930     A  10        D13SPTDA      11S 0O    +1
000191140930     A                                      EDTCDE(Z)
000192140930     A  10                                +2
000193140930     A                                      'a'
000194140930     A  10        D13SPTA       11S 0O    +1
000195140930     A                                      EDTCDE(Z)
000196140930     A  10                               130
000197140930     A                                      'Includi potenziali con solo spesa -
000198140930     A                                      presunta'
000199140930     A  10        DESSPTP        2A  O    +1
000200140930     A  10                                72
000201140930     A                                      'Ripartizione spesa'
000202140930     A                                      SPACEB(001)
000203140930     A  10        DESRIPG        6A  O    +8
000204140930     A  10        D13RIP1        3A  O    +7
000205140930     A  10        D13RIP2        3A  O    +1
000206140930     A  10        D13RIP3        3A  O    +1
000207140930     A  10                                +5
000208140930     A                                      'da'
000209140930     A  10        D13RIPDA       3S 0O    +1
000210140930     A                                      EDTCDE(Z)
000211140930     A  10                                +2
000212140930     A                                      'a'
000213140930     A  10        D13RIPA        3S 0O    +1
000214140930     A                                      EDTCDE(Z)
000215140930     A  10                                +1
000216140930     A                                      '%'
000217140930     A  10                                70
000218140930     A                                      'Non affidato a BRT'
000219140930     A                                      SPACEB(001)
000220140930     A  10                                72
000221140930     A                                      'Italia - Parcel'
000222140930     A                                      SPACEB(001)
000223140930     A  10                                98
000224140930     A                                      'da'
000225140930     A  10        D13NRFDA      11S 0O   101
000226140930     A                                      EDTCDE(Z)
000227140930     A  10                               114
000228140930     A                                      'a'
000229140930     A  10        D13NRFA       11S 0O   116
000230140930     A                                      EDTCDE(Z)
000231140930     A                                    +2
000232140930     A                                      'EUR'
000233140930     A  10                                72
000234140930     A                                      'Italia - Messaggeria'
000235140930     A                                      SPACEB(001)
000236140930     A  10                                98
000237140930     A                                      'da'
000238140930     A  10        D13NRODA      11S 0O   101
000239140930     A                                      EDTCDE(Z)
000240140930     A  10                               114
000241140930     A                                      'a'
000242140930     A  10        D13NROA       11S 0O   116
000243140930     A                                      EDTCDE(Z)
000244140930     A                                    +2
000245140930     A                                      'EUR'
000246140930     A  10                                72
000247140930     A                                      'Estero - Via Aerea'
000248140930     A                                      SPACEB(001)
000249140930     A  10                                98
000250140930     A                                      'da'
000251140930     A  10        D13NERDA      11S 0O   101
000252140930     A                                      EDTCDE(Z)
000253140930     A  10                               114
000254140930     A                                      'a'
000255140930     A  10        D13NERA       11S 0O   116
000256140930     A                                      EDTCDE(Z)
000257140930     A                                    +2
000258140930     A                                      'EUR'
000259140930     A  10                                72
000260140930     A                                      'Estero - Serv.Camion'
000261140930     A                                      SPACEB(001)
000262140930     A  10                                98
000263140930     A                                      'da'
000264140930     A  10        D13NAEDA      11S 0O   101
000265140930     A                                      EDTCDE(Z)
000266140930     A  10                               114
000267140930     A                                      'a'
000268140930     A  10        D13NAEA       11S 0O   116
000269140930     A                                      EDTCDE(Z)
000270140930     A                                    +2
000271140930     A                                      'EUR'
000272140930     A  10                                72
000273140930     A                                      'Altro (es.Completi-ADR)'
000274140930     A                                      SPACEB(001)
000275140930     A  10                                98
000276140930     A                                      'da'
000277140930     A  10        D13NTRDA      11S 0O   101
000278140930     A                                      EDTCDE(Z)
000279140930     A  10                               114
000280140930     A                                      'a'
000281140930     A  10        D13NTRA       11S 0O   116
000282140930     A                                      EDTCDE(Z)
000283140930     A                                    +2
000284140930     A                                      'EUR'
000285140930     A  10                                72
000286140930     A                                      'Paesi Esteri'
000287140930     A                                      SPACEB(001)
000288140930     A  10        SPPAESI1      25A  O   +14
000289140930     A  10        SPPAESI2      25A  O   125
000290140930     A  10        SPPAESI3      25A  O   152
000291140930     A  10        SPPAESI4      25A  O    98
000292140930     A                                      SPACEB(001)
000293140930     A  10        SPPAESI5      25A  O   125
000294140930     A  10                                72
000295140930     A                                      'Privati'
000296140930     A                                      SPACEB(001)
000297140930     A  10        D13PRI         1A  O   +19
000298140930     A  10                                +2
000299140930     A                                      '(S=Si)'
000300140930     A  10                                72
000301140930     A                                      'G.D.O.'
000302140930     A                                      SPACEB(001)
000303140930     A  10        D13GDO         1A  O   +20
000304140930     A  10                                +2
000305140930     A                                      '(S=Si)'
000306140930     A  10                                72
000307140930     A                                      'E-Commerce'
000308140930     A                                      SPACEB(001)
000309140930     A  10        D13ECM         1A  O   +16
000310140930     A  10                                +2
000311140930     A                                      '(S=Si)'
000312140930     A  10                                72
000313140930     A                                      'H 10:30 / Priority'
000314140930     A                                      SPACEB(001)
000315140930     A  10        D13HPR         1A  O    +8
000316140930     A  10                                +2
000317140930     A                                      '(S=Si)'
000318140930     A  10                                72
000319140930     A                                      'Secure Box'
000320140930     A                                      SPACEB(001)
000321140930     A  10        D13SBX         1A  O   +16
000322140930     A  10                                +2
000323140930     A                                      '(S=Si)'
000324140930     A  10                                72
000325140930     A                                      'Peso medio'
000326140930     A                                      SPACEB(001)
000327140930     A  10                               +16
000328140930     A                                      'da'
000329140930     A  10        D13PESDA       5S 0O    +1
000330140930     A                                      EDTCDE(Z)
000331140930     A  10        D13PESA        5S 0O    +4
000332140930     A                                      EDTCDE(Z)
000333140930     A  10                                +1
000334140930     A                                      'Kg.'
000335140930     A  10                                72
000336140930     A                                      'Affidato a BRT'
000337140930     A                                      SPACEB(001)
000338140930     A  10                               +12
000339140930     A                                      'da'
000340140930     A  10        D13BARDA       3S 0O    +1
000341140930     A                                      EDTCDE(Z)
000342140930     A  10                                +4
000343140930     A                                      'a'
000344140930     A  10        D13BARA        3S 0O    +1
000345140930     A                                      EDTCDE(Z)
000346140930     A  10                                +1
000347140930     A                                      '%'
000348140930     A  10                                72
000349140930     A                                      'Concorrenti'
000350140930     A                                      SPACEB(001)
000351140930     A  10        D13CONC1       4A  O   +15
000352140930     A  10        D13CONC2       4A  O    +1
000353140930     A  10        D13CONC3       4A  O    +1
000354140930     A  10        D13CONC4       4A  O    +1
000355140930     A  10        D13CONC5       4A  O    +1
000356140930     A  10                                +3
000357140930     A                                      'da'
000358140930     A  10        D13CONDA       3S 0O    +1
000359140930     A                                      EDTCDE(Z)
000360140930     A  10                                +2
000361140930     A                                      'a'
000362140930     A  10        D13CONA        3S 0O    +1
000363140930     A                                      EDTCDE(Z)
000364140930     A  10                                +1
000365140930     A                                      '%'
000366140930     A  10                                72
000367140930     A                                      'Motivo non affidamento'
000368140930     A                                      SPACEB(001)
000369140930     A  10        D13MOI1        4A  O    +4
000370140930     A  10        DESMOI1       20A  O    +1
000371140930     A  10        D13MOI2        4A  O    +2
000372140930     A  10        DESMOI2       20A  O    +1
000373140930     A  10                                72
000374140930     A                                      'Logistica: interressante per noi'
000375140930     A                                      SPACEB(001)
000376140930     A  10        D13LOFI        1A  O    +2
000377140930     A  10                                +1
000378140930     A                                      '(S=Si)'
000379140930     A  10                                +2
000380140930     A                                      'in outsourcing'
000381140930     A  10        D13LOGO        1A  O    +1
000382140930     A  10                                +1
000383140930     A                                      '(S=Si)'
000384140930     A  10                                +2
000385140930     A                                      'operatore'
000386140930     A  10        D11LOGP        4A  O    +2
000387140930     A  10                                83
000388140930     A                                      'Mq.'
000389140930     A                                      SPACEB(001)
000390140930     A  10                                87
000391140930     A                                      'da'
000392140930     A  10        D13MQLDA       5S 0O    90
000393140930     A                                      EDTCDE(Z)
000394140930     A  10                                96
000395140930     A                                      'a'
000396140930     A  10        D13MQL         5S 0O    98
000397140930     A                                      EDTCDE(Z)
000398140930     A  10                                83
000399140930     A                                      'Posti Pallet'
000400140930     A                                      SPACEB(001)
000401140930     A  10                                96
000402140930     A                                      'da'
000403140930     A  10        D13PPLDA       5S 0O    99
000404140930     A                                      EDTCDE(Z)
000405140930     A  10                               105
000406140930     A                                      'a'
000407140930     A  10        D13PPLA        5S 0O   107
000408140930     A                                      EDTCDE(Z)
000409140930     A  10                                72
000410140930     A                                      'Non presenti'
000411140930     A                                      SPACEB(001)
000412140930     A  10        D13NIFO        1A  O    86
000413140930     A  10                                88
000414140930     A                                      '(S=Si)'
000415140930     A  10                                72
000416140930     A                                      'Aggiornate al'
000417140930     A                                      SPACEB(001)
000418140930     A  10        STPIFOAL       8S 0O    +1
000419140930     A                                      EDTWRD('  /  /    ')
000420140930     A                                    67
000421140930     A                                      'STAMPA ORDINATA PER:'
000422140930     A                                      SPACEB(002)
000423140930     A                                   +23
000424140930     A                                      '(O=Ordinamento; P=Ordinamento e sa-
000425140930     A                                      lto pagina a cambio codice)'
000426140930     A                                    72
000427140930     A                                      'Spesa Trasporti ..................-
000428140930     A                                      ..:'
000429140930     A                                      SPACEB(001)
000430140930     A            D13OSPT        1A  O    +2
000431140930     A                                    72
000432140930     A                                      'Ragione Sociale ..................-
000433140930     A                                      ..:'
000434140930     A                                      SPACEB(001)
000435140930     A            D13ORAG        1A  O    +2
000436140930     A                                    72
000437140930     A                                      'Comm.le Unificante del Potenziale -
000438140930     A                                      ..:'
000439140930     A                                      SPACEB(001)
000440140930     A            D13OCMMU       1A  O    +2
000441140930     A                                    72
000442140930     A                                      'Comm.le Unificante Prossima Attivi-
000443140930     A                                      tà:'
000444140930     A                                      SPACEB(001)
000445140930     A            D13OCMM        1A  O    +2
000446140930     A                                    72
000447140930     A                                      'Area/Filiale Appartenenza ........-
000448140930     A                                      ..:'
000449140930     A                                      SPACEB(001)
000450140930     A            D13OCAR        1A  O    +2
000451140930     A                                    72
000452140930     A                                      'Categoria Merceologica ...........-
000453140930     A                                      ..:'
000454140930     A                                      SPACEB(001)
000455140930     A            D13OSCT        1A  O    +2
000456140930     A  10                                67
000457140930     A                                      'STAMPA INFORMAZIONI COMMERCIALI'
000458140930     A                                      SPACEB(002)
000459140930     A  10                                72
000460140930     A                                      'Stampa in dettaglio ..............-
000461140930     A                                      ..:'
000462140930     A                                      SPACEB(001)
000463140930     A  10        D13SIFO        1A  O    +2
000464140930     A  10                                +2
000465140930     A                                      '(S/N)'
000466140930     A*%%***********************************************************************
000467140930     A*%%SS
000468140930     A*%%CL 001
000469140930     A*%%CL 002
000470140930     A*%%CL 002
000471140930     A*%%CL 001
000472140930     A*%%CL 001
000473140930     A*%%CL 001
000474140930     A*%%CL 001
000475140930     A*%%CL 001
000476140930     A*%%CL 001
000477140930     A*%%CL 001
000478140930     A*%%CL 001
000479140930     A*%%CL 001
000480140930     A*%%CL 001
000481140930     A*%%CL 001
000482140930     A*%%CL 001
000483140930     A*%%CL 001
000484140930     A*%%CL 001
000485140930     A*%%CL 001
000486140930     A*%%CL 001
000487140930     A*%%CL 001
000488140930     A*%%CL 001
000489140930     A*%%CL 002
000490140930     A*%%CL 001
000491140930     A*%%CL 001
000492140930     A*%%CL 001
000493140930     A*%%CL 001
000494140930     A*%%CL 001
000495140930     A*%%CL 001
000496140930     A*%%CL 001
000497140930     A*%%CL 001
000498140930     A*%%CL 001
000499140930     A*%%CL 001
000500140930     A*%%CL 001
000501140930     A*%%CL 001
000502140930     A*%%CL 001
000503140930     A*%%CL 001
000504140930     A*%%CL 001
000505140930     A*%%CL 001
000506140930     A*%%CL 001
000507140930     A*%%CL 001
000508140930     A*%%CL 001
000509140930     A*%%CL 001
000510140930     A*%%CL 001
000511140930     A*%%CL 001
000512140930     A*%%CL 001
000513140930     A*%%CL 001
000514140930     A*%%CL 002
000515140930     A*%%CL 001
000516140930     A*%%CL 001
000517140930     A*%%CL 001
000518140930     A*%%CL 001
000519140930     A*%%CL 001
000520140930     A*%%CL 001
000521140930     A*%%CL 002
000522140930     A*%%CL 001
000523140930     A*%%***********************************************************************
000524140930      *---------------------
000525140930     A          R MK13TESTA
000526140930     A*%%***********************************************************************
000527140930     A*%%RI 00000
000528140930     A*%%***********************************************************************
000529140930     A                                      SPACEB(001)
000530140930     A            RSUT          20A        1
000531140930     A                                    50
000532140930     A                                      'S T A M P A   A N A G R A F I C A -
000533140930     A                                        C L I E N T I   P O T E N Z I A L-
000534140930     A                                       I'
000535140930     A                                      HIGHLIGHT
000536140930     A                                      UNDERLINE
000537140930     A            NOMEPGM       10A  O   154
000538140930     A            DATAELA        8S 0    172
000539140930     A                                      EDTWRD('  /  /    ')
000540140930     A                                   187
000541140930     A                                      'PAG.'
000542140930     A                                   192
000543140930     A                                      PAGNBR
000544140930     A                                      EDTCDE(Z)
000545140930     A            KNSIF     R              1
000546140930     A                                      REFFLD(KNSIF KPJBA)
000547140930     A                                      SPACEB(001)
000548140930     A            KNMUS     R             12
000549140930     A                                      REFFLD(KNMUS KPJBA)
000550140930     A            ORAELA         6S 0O   174
000551140930     A                                      EDTWRD('  :  :  ')
000552140930     A*%%***********************************************************************
000553140930     A*%%SS
000554140930     A*%%CL 001
000555140930     A*%%***********************************************************************
000556140930      *---------------------
000557140930     A          R MK13INTCOL
000558140930     A*%%***********************************************************************
000559140930     A*%%RI 00000
000560140930     A*%%***********************************************************************
000561140930     A                                      SPACEB(001)
000562140930     A                                     1
000563140930     A                                      'CODICE'
000564140930     A                                    +6
000565140930     A                                      'Sede'
000566140930     A                                    +1
000567140930     A                                      'RAGIONE SOCIALE'
000568140930     A                                   +10
000569140930     A                                      'LOCALITA'''
000570140930     A                                   +10
000571140930     A                                      'CAP'
000572140930     A                                    +7
000573140930     A                                      'PR'
000574140930     A                                    +1
000575140930     A                                      'NAZ'
000576140930     A                                    +1
000577140930     A                                      'COD'
000578140930     A                                    +1
000579140930     A                                      'CAT'
000580140930     A                                    +1
000581140930     A                                      'TR'
000582140930     A                                    +1
000583140930     A                                      '----------------- PROSSIMA ATTIVIT-
000584140930     A                                      A'' ------------------'
000585140930     A                                   146
000586140930     A                                      'CATEGORIA MERCEOLOGICA'
000587140930     A  10                               172
000588140930     A                                      'INFORMAZIONI COMMERCIALI'
000589140930     A                                    13
000590140930     A                                      'Fil'
000591140930     A                                      SPACEB(001)
000592140930     A                                    72
000593140930     A                                      'OV'
000594140930     A                                    79
000595140930     A                                      'IMP'
000596140930     A                                    83
000597140930     A                                      'POT'
000598140930     A                                    +1
000599140930     A                                      'CO'
000600140930     A                                    90
000601140930     A                                      'Data'
000602140930     A                                   101
000603140930     A                                      'Causale'
000604140930     A                                   125
000605140930     A                                      'Commerciale'
000606140930     A  10                               172
000607140930     A                                      'Ult Aggior'
000608140930     A  10                                +3
000609140930     A                                      'Spesa trasp.'
000610140930     A*%%***********************************************************************
000611140930     A*%%SS
000612140930     A*%%CL 001
000613140930     A*%%***********************************************************************
000614140930      *---------------------
000615140930     A          R MK13SALTA
000616140930     A*%%***********************************************************************
000617140930     A*%%RI 00000
000618140930     A*%%***********************************************************************
000619140930     A                                      SPACEB(001)
000620140930     A  11                                27
000621140930     A                                      'COMMERCIALE UNIFICANTE'
000622140930     A  11        DESCMMU       25A       +1
000623140930     A  12                                27
000624140930     A                                      'COMMERCIALE UNIFICANTE PROSSIMA AT-
000625140930     A                                      TIVITA'''
000626140930     A  12        DESCMM        25A       +1
000627140930     A  13                                27
000628140930     A                                      'AREA'
000629140930     A  13        DESCAR        25A       +1
000630140930     A  13                                +1
000631140930     A                                      'FILIALE'
000632140930     A  13        DESFLT        20A       +1
000633140930     A  14                                27
000634140930     A                                      'CATEGORIA MERCEOLOGICA'
000635140930     A  14        DESSCT        40A       +1
000636140930     A*%%***********************************************************************
000637140930     A*%%SS
000638140930     A*%%***********************************************************************
000639140930      *---------------------
000640140930     A          R MK13RIGA
000641140930     A*%%***********************************************************************
000642140930     A*%%RI 00000
000643140930     A*%%***********************************************************************
000644140930     A                                      SPACEB(001)
000645140930     A            CPOCPO        11S 0O     1
000646140930     A                                      EDTCDE(Z)
000647140930     A            STPFSF         2A  O    +1
000648140930     A            STPRAG        25A  O    +2
000649140930     A                                      HIGHLIGHT
000650140930     A            STPCIT        18A  O    +1
000651140930     A            CPOCAP         9A  O    +1
000652140930     A            CPOPRV         2A  O    +1
000653140930     A            CPONAZ         3A  O    +1
000654140930     A            CPOFTR         1A  O    +2
000655140930     A            CPOFLS         1A  O    +3
000656140930     A            STPTTR         1A  O    +2
000657140930     A            STPDAD         8S 0O    +2
000658140930     A                                      EDTWRD('  /  /    ')
000659140930     A            STPCAD         2A  O    +1
000660140930     A            STPDCAD       20A  O    +1
000661140930     A            STPDCMM       20A  O    +1
000662140930     A            STPDSCT       25A  O    +1
000663140930     A  10        STPDIM         8S 0O    +1
000664140930     A                                      EDTWRD('  /  /    ')
000665140930     A  10        STPSPTP       11S 0O    +1
000666140930     A                                      EDTCDE(2)
000667140930     A  10        FLGSPTP        1A  O    +1
000668140930     A*%%***********************************************************************
000669140930     A*%%SS
000670140930     A*%%***********************************************************************
000671140930      *---------------------
000672140930     A          R MK13INFO
000673140930     A*%%***********************************************************************
000674140930     A*%%RI 00000
000675140930     A*%%***********************************************************************
000676140930     A                                      SPACEB(001)
000677140930     A            INFOCOM      164A  O    35
000678140930     A*%%***********************************************************************
000679140930     A*%%SS
000680140930     A*%%***********************************************************************
000681140930      *---------------------
000682140930     A          R MK13TOT
000683140930     A*%%***********************************************************************
000684140930     A*%%RI 00000
000685140930     A*%%***********************************************************************
000686140930     A                                      SPACEB(001)
000687140930     A                                     1
000688140930     A                                      'TOTALE CLIENTI STAMPATI'
000689140930     A                                      HIGHLIGHT
000690140930     A            TOTCLI        10S 0O    25
000691140930     A                                      EDTCDE(2)
000692140930     A*%%***********************************************************************
000693140930     A*%%SS
000694140930     A*%%***********************************************************************
000695140930      *---------------------
000696140930     A          R MK13FINE
000697140930     A*%%***********************************************************************
000698140930     A*%%RI 00000
000699140930     A*%%***********************************************************************
000700140930     A                                      SPACEB(001)
000701140930     A                                    52
000702140930     A                                      '***   FINE  STAMPA   ***'
000703140930     A                                      SPACEB(004)
000704140930     A*%%***********************************************************************
000705140930     A*%%SS
000706140930     A*%%CL 004
000707140930     A*%%CP+999CRTPRTF
000708140930     A*%%CP+    FILE(GAITRAFIL/TRMK13P)
000709140930     A*%%CP+    DEVTYPE(*SCS)
000710140930     A*%%CP+    PAGESIZE(*N 198)
000711140930     A*%%CP+    CPI(15)
000712140930     A*%%CP     OVRFLW(63)
000713140930     A*%%CS+999CRTPRTF
000714140930     A*%%CS+    FILE(QTEMP/QPRDRPT   )
000715140930     A*%%CS+    DEVTYPE(*SCS)
000716140930     A*%%CS     PAGESIZE(*N       198      *N     )
000717140930     A*%%***********************************************************************
