000100170908/*PARMS DFTACTGRP(*NO) ACTGRP(*CALLER)                                        */
000200990907/*PARMS                                                                       */
000300990907/*PARMS                                                                       */
000400990907/*PARMS                                                                       */
000500990907/*PARMS                                                                       */
000600170914             PGM
000700991111
000800170908             DCL        VAR(&JOBCCSID)   TYPE(*DEC)  LEN(5 0)
000900170905
001000170908
001100170908 /* REPERISCO CCSID JOB CORRENTE */
001200170908             RTVJOBA    CCSID(&JOBCCSID)
001300170908
001400170908
001500170908 /* FORZO CCSID PER ESECUZIONE CORRENTE A 1144 */
001600170908             CHGJOB     CCSID(1144)
001700170908
001800170905
001900170908 /* CHIAMATA A *PGM ESECUTORE */
002000170914             CALL       PGM(TITV3A6R)
002100170905             MONMSG     MSGID(CPF0000)
002200170908
002300140804
002400170908 /* RIACQUISIZIONE RISORSE */
002500140804             RCLACTGRP  ACTGRP(*ELIGIBLE)
002600140804             RCLRSC
002700170908
002800170908
002900170908 /* RIPRISTINO CCSID JOB CORRENTE */
003000170908             CHGJOB     CCSID(&JOBCCSID)
003100170908
003200991111
003300990907             ENDPGM
