000100021028     A*------------------------------------------------------------------------*
000200120515     A* DS FILE HEADER PRIVALIA "F"                                            *
000300021028     A*------------------------------------------------------------------------*
000400021028     A                                      REF(CNDIZION)
000500120515     A          R D劫V2L3DF                 TEXT('DS lettura FILE HEADER')
000600120515     A            F刪EGTYPE      1          TEXT('REGISTER TYPE')
000700120515     A            F佝ILETYPE    15          TEXT('FILE TYPE')
000800120515     A            F低ARRCD      15          TEXT('CARRIER CODE')
000900120515     A            F低RTDT        8          TEXT('FILE CREATION DATE')
001000120515     A            F低RTTM        6          TEXT('FILE CREATIOON TIME')
001100120515     A            F低OLLECT      4          TEXT('DELIVERY/COLLECTION')
