000100991027      *PARMS MBR(*NONE) MAXMBRS(*NOMAX)
000200910516     A                                      REF(CNDIZION)
000300030113     A          R TNVASHSE                  TEXT('C/ASSEGNI AL CLIENTE HSE')
000400030113     A            HSENLDV       10A         TEXT('NUMERO LETTERA DI VETTURA')
000500030113     A            HSEFILLER1     3A         TEXT('FILLER 1')
000600030113     A            HSEDSP         8A         TEXT('DATA SPEDIZIONE')
000700030113     A            HSERSD        40A         TEXT('RAGIONE SOCIALE DESTINATARIO')
000800030113     A            HSERMA        15A         TEXT('RIFERIMENTO MITTENTE ALFA')
000900030113     A            HSEFILLER2     1A         TEXT('FILLER 2')
001000030113     A            HSETTERD       3A         TEXT('TERMINAL DI DESTINO')
001100030113     A            HSECASLIRE    12A         TEXT('IMPORTO CONTRASSEGNO IN LIRE')
001200030113     A            HSEFILLER3     2A         TEXT('FILLER 3')
001300030113     A            HSEDVA         8A         TEXT('DATA VALUTA')
001400030113     A            HSEVCA         3A         TEXT('DIVISA CONTRASSEGNO')
001500030113     A            HSEFILLER4     2A         TEXT('FILLER 4')
001600030113     A            HSECAS        19A         TEXT('IMPORTO CONTRASSEGNO IN LIRE')
