000010160718     A*%%TS  SD  20160718  135949  EDPMM       REL-V7R1M0  5770-WDS
000020990510     A****************************************************************
000030160718     A*%%EC
000040160718     A                                      DSPSIZ(24 80 *DS3)
000050160718     A                                      CHGINPDFT(HI UL)
000060160718     A                                      PRINT
000070160718     A                                      CA03
000080160718     A          R TNTB151
000090160718     A*%%TS  SD  20160718  135949  EDPMM       REL-V7R1M0  5770-WDS
000100160718     A  28        V1CMSG        78   M
000110160718     A            RSUT          20A  O  1  2
000120160718     A                                  1 27'* Bonus accordi sindacali *'
000130160718     A                                      DSPATR(RI)
000140160718     A                                  1 62'TNTB12R'
000150160718     A                                  1 72DATE
000160160718     A                                      EDTCDE(Y)
000170160718     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000180160718     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000190160718     A                                  2 72TIME
000200160718     A                                  7  3'Punto Operativo ? :'
000210160718     A                                 24  2'F3=Fine'
000220160718     A            V1CFIL         3A  B  7 24CHECK(RZ)
000230160718     A            V1DFIL        20A  O  7 29
000240160718     A          R TNTB152
000250160718     A*%%TS  SD  20160718  135949  EDPMM       REL-V7R1M0  5770-WDS
000260160718     A                                      CF12(12)
000270160718     A                                      CF06(06)
000280160718     A  28        V1CMSG        78   M
000290160718     A            RSUT          20A  O  1  2
000300160718     A                                  1 72DATE
000310160718     A                                      EDTCDE(Y)
000320160718     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000330160718     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000340160718     A                                  2 72TIME
000350160718     A                                  1 28'* Bonus accordi sindacali *'
000360160718     A                                      DSPATR(RI)
000370160718     A                                  1 62'TNTB15R'
000380160718     A                                 24  2'F3=Fine'
000390160718     A            V2CFIL         3A  O  4 20DSPATR(HI)
000400160718     A            V2DFIL        20A  O  4 25
000410160718     A  28        V2CMSG        78   M
000420160718     A            V2CCAU         3A  B  8 32
000430160718     A  40                                  DSPATR(PC)
000440160718     A                                  4  3'Punto Operativo'
000450160718     A                                 24 30'F6=Aggiornamento'
000460160718     A                                 24 69'F12=Ritorno'
000470160718     A                                  8  4'Causale nota addebito..?'
000480160718     A                                 10  4'Importo nota addebito'
000490160718     A                                 12  4'Fil/CDC a cui girocontare'
000500160718     A                                 14  4'Data inizio scrittura'
000510160718     A            V2CIMP         9Y 2B 10 32EDTCDE(2)
000520160718     A  43                                  DSPATR(PC)
000530160718     A            V2CCDC         3Y 0B 12 32EDTCDE(Z)
000540160718     A  41                                  DSPATR(PC)
000550160718     A            V2CDAT         8Y 0B 14 32EDTCDE(8)
000560160718     A  42                                  DSPATR(PC)
000570160718     A            V2CCAUD       45A  O  8 36
000580160718     A            V2CCDCD       20A  O 12 36
