000100090520      *PARMS MBR(*NONE)
000200090520      *---------------------------------------------------------------*
000300100504      * Tab. "TTA": Parametri relativi alla selezione                 *
000400090520      *---------------------------------------------------------------*
000500100504     A                                      REF(DTTA)
000600090520      *
000700100504     A          R TNTBTTAS                  TEXT('Ricerca/Selezione Ta-
000800100504     A                                      b. "TTA"')
000900090520      *
001000090520      *?Campi di INPUT:?
001100090520      *
001200100504     A            ITTATLA        1          TEXT('Tipo Lancio: +
001300090520     A                                            _=Elab. + *inRT +
001400090520     A                                            L=Elab. + *inLR +
001500090520     A                                            C=Chiude')
001600100504     A            ITTALEG        1          TEXT('S=Legata a cliente -
001700100504     A                                            N=NON legata a cliente')
001800090520      *
001900090520      *?Campi di OUTPUT:?
002000090520      *
002100100504     A            OTTAKE1   R               REFFLD(TBEKE1    TNTBE00F)
002200090520     A                                      TEXT('Chiave 1 Tabella: +
002300090520     A                                            Codice Causale +
002400090520     A                                            Attività')
002500100504     A            OTTAUNI   R               REFFLD(TBEUNI    TNTBE00F)
002600091217     A                                      TEXT('Campo unico tabella')
002700100504     A            OTTAFXX        1
002800090520     A                                      TEXT('Tasto funzionale pre-
002900090520     A                                      muto: 1=F03, 2=F12')
003000100504     A            OTTAERR        1
003100090520     A                                      TEXT('Flag di ritorno: *on-
003200090520     A                                      =Errore')
003300100504     A            OTTAMSG       78
003400090520     A                                      TEXT('Messaggio di errore')
