000100140930      *-------------------------------------------------------------
000200141003      * DS PER PGM DI GESTIONE TABELLA "ITO"
000300140930      *-------------------------------------------------------------
000400141003     A          R TBITOREC                  TEXT('Tabella "ITO"')
000500141003     A            BITOFUN        1          TEXT('Funzione chiamata -
000600140930     A                                      - 1=Ric./Scelta BLANKS=Manut.')
000700141003     A            BITOKE1        3          TEXT('Codice causale')
000800141003     A            BITODES       35          TEXT('Descrizione')
000900141003     A            BITOCOMAND     1          TEXT('Comando')
001000141003     A            BITOOPZIO      2          TEXT('Opzione')
001100141003     A            BITORICEZ      1          TEXT('Ricezione')
001200141003     A            BITOESITO      1          TEXT('Esito')
