000010111102     A*%%TS  SD  20111102  111200  EDPMB       REL-V6R1M0  5761-WDS
000020970224     A*---------------------------------------------------------------*
000030111102     A*%%EC
000040111102     A                                      DSPSIZ(24 80 *DS3)
000050111102     A                                      CHGINPDFT(HI UL)
000060111102     A                                      PRINT
000070111102     A                                      CA03
000080970903     A*---------------------------------------------------------------*
000090020227     A          R TN25D01
000100020227     A*%%TS  SD  20020227  161048  EDPAB       REL-V4R4M0  5769-PW1
000110020227     A  28        V1CMSG        78   M
000120020227     A            RSUT          20A  O  1  2
000130020227     A                                  1 27'* Tabella Riferimenti Fedex *'
000140020227     A                                      DSPATR(RI)
000150020227     A                                      DSPATR(UL)
000160020227     A            VTCPGM        10A  O  1 61
000170020227     A                                  1 72DATE
000180020227     A                                      EDTCDE(Y)
000190020227     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000200020227     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000210020227     A                                  2 72TIME
000220020227     A                                  4  2'Codice RIFERIMENTO...........:'
000230020227     A            V1CFED        15A  B  4 33DSPATR(PR)
000240020227     A                                  4 38'(?)'
000250020227     A                                 23  2'                                  -
000260020227     A                                                                         -
000270020227     A                                               '
000280020227     A                                      DSPATR(UL)
000290020227     A                                 24  2'F3=Fine'
000300020227     A*------------
000310020227     A          R TN25D02
000320020227     A*%%TS  SD  20020227  164319  EDPAB       REL-V4R4M0  5769-PW1
000330020227     A  01                                  CF05
000340020227     A N01                                  CF06
000350020227     A N01N02                               CF16
000360020227     A                                      CF12
000370020227     A  28        V2CMSG        78   M
000380020227     A            RSUT          20A  O  1  2
000390020227     A                                  1 27'* Tabella Riferimenti Fedex *'
000400020227     A                                      DSPATR(RI)
000410020227     A                                      DSPATR(UL)
000420020227     A            VTCPGM        10A  O  1 61
000430020227     A                                  1 72DATE
000440020227     A                                      EDTCDE(Y)
000450020227     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000460020227     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000470020227     A  01                              2 35'*ANNULLATA*'
000480020227     A                                      DSPATR(RI)
000490020227     A                                  2 72TIME
000500020227     A                                  4  2'Codice RIFERIMENTO...........:'
000510020227     A            V2CFED        15A  O  4 33
000520020227     A                                  6  2'Nome del Responsabile'
000530020227     A                                  7  2'di Filiale x Fedex'
000540020227     A            V2CDES        35A  B  7 21
000550020227     A  40                                  DSPATR(PC)
000560020227     A                                      CHECK(LC)
000570020227     A                                  9  2'Numero Telefono   '
000580020227     A            V2CTEL        15A  B  9 21
000590020227     A  41                                  DSPATR(PC)
000600020227     A            V2CFTT         1A  B 21 74CHECK(RB)
000610020227     A                                      VALUES(' ' 'S')
000620020227     A                                      DSPATR(ND)
000630020227     A                                      DSPATR(PR)
000640020227     A            V2CFLT         3Y 0B 22 75CHECK(RZ)
000650020227     A                                      DSPATR(ND)
000660020227     A                                      DSPATR(PR)
000670020227     A                                 23  2'                                  -
000680020227     A                                                                         -
000690020227     A                                               '
000700020227     A                                      DSPATR(UL)
000710020227     A                                      DSPATR(HI)
000720020227     A                                 24  2'F3=Fine'
000730020227     A  01                             24 12'F5=Ripristino'
000740020227     A N01                             24 28'F6=CONFERMA'
000750020227     A N01                             24 42'F16=Annullamento'
000760020227     A                                      DSPATR(ND)
000770020227     A                                 24 69'F12=Ritorno'
000780020227     A*------------
000790020418     A          R TN25D03
000800020418     A*%%TS  SD  20020418  175003  EDPAB       REL-V4R4M0  5769-PW1
000810020418     A  01                                  CF05
000820020418     A N01                                  CF06
000830020418     A N01N02                               CF16
000840020418     A                                      CF12
000850020418     A  28        V3CMSG        78   M
000860020418     A            RSUT          20A  O  1  2
000870020418     A                                  1 27'* Tabella Riferimenti Fedex *'
000880020418     A                                      DSPATR(RI)
000890020418     A                                      DSPATR(UL)
000900020418     A            VTCPGM        10A  O  1 61
000910020418     A                                  1 72DATE
000920020418     A                                      EDTCDE(Y)
000930020418     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000940020418     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000950020418     A  01                              2 35'*ANNULLATA*'
000960020418     A                                      DSPATR(RI)
000970020418     A                                  2 72TIME
000980020418     A                                  4  2'Codice RIFERIMENTO...........:'
000990020418     A            V3CFED        15A  O  4 33
001000110512     A                                  6  2'Cod. identificativo di BRT'
001010020418     A                                  7  2'per Fedex         '
001020020418     A            V3CCOD         9A  B  7 21
001030020418     A  42                                  DSPATR(PC)
001040020418     A                                  9  2'Cod. identificativo di spedizioni'
001050020418     A                                 10  2'Intra Europa codificate su tab naz-
001060020418     A                                      ioni'
001070020418     A            V3CINE         9A  B 11 21
001080020418     A  42                                  DSPATR(PC)
001090020418     A            V3CFTT         1A  B 21 74CHECK(RB)
001100020418     A                                      VALUES(' ' 'S')
001110020418     A                                      DSPATR(ND)
001120020418     A                                      DSPATR(PR)
001130020418     A            V3CFLT         3Y 0B 22 75CHECK(RZ)
001140020418     A                                      DSPATR(ND)
001150020418     A                                      DSPATR(PR)
001160020418     A                                 23  2'                                  -
001170020418     A                                                                         -
001180020418     A                                               '
001190020418     A                                      DSPATR(UL)
001200020418     A                                      DSPATR(HI)
001210020418     A                                 24  2'F3=Fine'
001220020418     A  01                             24 12'F5=Ripristino'
001230020418     A N01                             24 28'F6=CONFERMA'
001240020418     A N01                             24 42'F16=Annullamento'
001250020418     A                                      DSPATR(ND)
001260020418     A                                 24 69'F12=Ritorno'
001270021028     A*         R TN25D02
001280111102     A          R TN25D04
001290111102     A*%%TS  SD  20111102  111200  EDPMB       REL-V6R1M0  5761-WDS
001300111102     A  01                                  CF05
001310111102     A N01                                  CF06
001320111102     A N01N02                               CF16
001330111102     A                                      CF12
001340111102     A  28        V4CMSG        78   M
001350111102     A            RSUT          20A  O  1  2
001360111102     A                                  1 27'* Tabella Riferimenti Fedex *'
001370111102     A                                      DSPATR(RI)
001380111102     A                                      DSPATR(UL)
001390111102     A            VTCPGM        10A  O  1 61
001400111102     A                                  1 72DATE
001410111102     A                                      EDTCDE(Y)
001420111102     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
001430111102     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
001440111102     A  01                              2 35'*ANNULLATA*'
001450111102     A                                      DSPATR(RI)
001460111102     A                                  2 72TIME
001470111102     A                                  4  2'Codice RIFERIMENTO...........:'
001480111102     A            V4CFED        15A  O  4 33
001490111102     A                                  6  2'Luoghi in cui Fedex prende in cari-
001500111102     A                                      co la merce BRT'
001510111102     A            V4CDE1        25A  B  7 21
001520111102     A  40                                  DSPATR(PC)
001530111102     A                                      CHECK(LC)
001540111102     A            V4CDE2        25A  B  8 21
001550111102     A  40                                  DSPATR(PC)
001560111102     A                                      CHECK(LC)
001570111102     A            V4CDE3        25A  B  9 21
001580111102     A  40                                  DSPATR(PC)
001590111102     A                                      CHECK(LC)
001600111102     A            V4CDE4        25A  B 10 21
001610111102     A  40                                  DSPATR(PC)
001620111102     A                                      CHECK(LC)
001630111102     A            V4CDE5        25A  B 11 21
001640111102     A  40                                  DSPATR(PC)
001650111102     A                                      CHECK(LC)
001660111102     A            V4CFTT         1A  B 21 74CHECK(RB)
001670111102     A                                      VALUES(' ' 'S')
001680111102     A                                      DSPATR(ND)
001690111102     A                                      DSPATR(PR)
001700111102     A            V4CFLT         3Y 0B 22 75CHECK(RZ)
001710111102     A                                      DSPATR(ND)
001720111102     A                                      DSPATR(PR)
001730111102     A                                 23  2'                                  -
001740111102     A                                                                         -
001750111102     A                                               '
001760111102     A                                      DSPATR(UL)
001770111102     A                                      DSPATR(HI)
001780111102     A                                 24  2'F3=Fine'
001790111102     A  01                             24 12'F5=Ripristino'
001800111102     A N01                             24 28'F6=CONFERMA'
001810111102     A N01                             24 42'F16=Annullamento'
001820111102     A                                      DSPATR(ND)
001830111102     A                                 24 69'F12=Ritorno'
