000100021028     A*%%TS  SD  20021028  163324  EDPAB       REL-V4R4M0  5769-PW1
000200970224     A*---------------------------------------------------------------*
000300021028     A*%%EC
000400021028     A                                      DSPSIZ(24 80 *DS3)
000500021028     A                                      CHGINPDFT(HI UL)
000600021028     A                                      PRINT
000700021028     A                                      CA03
000800970903     A*---------------------------------------------------------------*
000900020227     A          R TN25D01
001000020227     A*%%TS  SD  20020227  161048  EDPAB       REL-V4R4M0  5769-PW1
001100020227     A  28        V1CMSG        78   M
001200020227     A            RSUT          20A  O  1  2
001300020227     A                                  1 27'* Tabella Riferimenti Fedex *'
001400020227     A                                      DSPATR(RI)
001500020227     A                                      DSPATR(UL)
001600020227     A            VTCPGM        10A  O  1 61
001700020227     A                                  1 72DATE
001800020227     A                                      EDTCDE(Y)
001900020227     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
002000020227     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
002100020227     A                                  2 72TIME
002200020227     A                                  4  2'Codice RIFERIMENTO...........:'
002300020227     A            V1CFED        15A  B  4 33DSPATR(PR)
002400020227     A                                  4 38'(?)'
002500020227     A                                 23  2'                                  -
002600020227     A                                                                         -
002700020227     A                                               '
002800020227     A                                      DSPATR(UL)
002900020227     A                                 24  2'F3=Fine'
003000020227     A*------------
003100020227     A          R TN25D02
003200020227     A*%%TS  SD  20020227  164319  EDPAB       REL-V4R4M0  5769-PW1
003300020227     A  01                                  CF05
003400020227     A N01                                  CF06
003500020227     A N01N02                               CF16
003600020227     A                                      CF12
003700020227     A  28        V2CMSG        78   M
003800020227     A            RSUT          20A  O  1  2
003900020227     A                                  1 27'* Tabella Riferimenti Fedex *'
004000020227     A                                      DSPATR(RI)
004100020227     A                                      DSPATR(UL)
004200020227     A            VTCPGM        10A  O  1 61
004300020227     A                                  1 72DATE
004400020227     A                                      EDTCDE(Y)
004500020227     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004600020227     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004700020227     A  01                              2 35'*ANNULLATA*'
004800020227     A                                      DSPATR(RI)
004900020227     A                                  2 72TIME
005000020227     A                                  4  2'Codice RIFERIMENTO...........:'
005100020227     A            V2CFED        15A  O  4 33
005200020227     A                                  6  2'Nome del Responsabile'
005300020227     A                                  7  2'di Filiale x Fedex'
005400020227     A            V2CDES        35A  B  7 21
005500020227     A  40                                  DSPATR(PC)
005600020227     A                                      CHECK(LC)
005700020227     A                                  9  2'Numero Telefono   '
005800020227     A            V2CTEL        15A  B  9 21
005900020227     A  41                                  DSPATR(PC)
006000020227     A            V2CFTT         1A  B 21 74CHECK(RB)
006100020227     A                                      VALUES(' ' 'S')
006200020227     A                                      DSPATR(ND)
006300020227     A                                      DSPATR(PR)
006400020227     A            V2CFLT         3Y 0B 22 75CHECK(RZ)
006500020227     A                                      DSPATR(ND)
006600020227     A                                      DSPATR(PR)
006700020227     A                                 23  2'                                  -
006800020227     A                                                                         -
006900020227     A                                               '
007000020227     A                                      DSPATR(UL)
007100020227     A                                      DSPATR(HI)
007200020227     A                                 24  2'F3=Fine'
007300020227     A  01                             24 12'F5=Ripristino'
007400020227     A N01                             24 28'F6=CONFERMA'
007500020227     A N01                             24 42'F16=Annullamento'
007600020227     A                                      DSPATR(ND)
007700020227     A                                 24 69'F12=Ritorno'
007800020227     A*------------
007900020418     A          R TN25D03
008000020418     A*%%TS  SD  20020418  175003  EDPAB       REL-V4R4M0  5769-PW1
008100020418     A  01                                  CF05
008200020418     A N01                                  CF06
008300020418     A N01N02                               CF16
008400020418     A                                      CF12
008500020418     A  28        V3CMSG        78   M
008600020418     A            RSUT          20A  O  1  2
008700020418     A                                  1 27'* Tabella Riferimenti Fedex *'
008800020418     A                                      DSPATR(RI)
008900020418     A                                      DSPATR(UL)
009000020418     A            VTCPGM        10A  O  1 61
009100020418     A                                  1 72DATE
009200020418     A                                      EDTCDE(Y)
009300020418     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
009400020418     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
009500020418     A  01                              2 35'*ANNULLATA*'
009600020418     A                                      DSPATR(RI)
009700020418     A                                  2 72TIME
009800020418     A                                  4  2'Codice RIFERIMENTO...........:'
009900020418     A            V3CFED        15A  O  4 33
010000110512     A                                  6  2'Cod. identificativo di BRT'
010100020418     A                                  7  2'per Fedex         '
010200020418     A            V3CCOD         9A  B  7 21
010300020418     A  42                                  DSPATR(PC)
010400020418     A                                  9  2'Cod. identificativo di spedizioni'
010500020418     A                                 10  2'Intra Europa codificate su tab naz-
010600020418     A                                      ioni'
010700020418     A            V3CINE         9A  B 11 21
010800020418     A  42                                  DSPATR(PC)
010900020418     A            V3CFTT         1A  B 21 74CHECK(RB)
011000020418     A                                      VALUES(' ' 'S')
011100020418     A                                      DSPATR(ND)
011200020418     A                                      DSPATR(PR)
011300020418     A            V3CFLT         3Y 0B 22 75CHECK(RZ)
011400020418     A                                      DSPATR(ND)
011500020418     A                                      DSPATR(PR)
011600020418     A                                 23  2'                                  -
011700020418     A                                                                         -
011800020418     A                                               '
011900020418     A                                      DSPATR(UL)
012000020418     A                                      DSPATR(HI)
012100020418     A                                 24  2'F3=Fine'
012200020418     A  01                             24 12'F5=Ripristino'
012300020418     A N01                             24 28'F6=CONFERMA'
012400020418     A N01                             24 42'F16=Annullamento'
012500020418     A                                      DSPATR(ND)
012600020418     A                                 24 69'F12=Ritorno'
012700021028     A*         R TN25D02
012800021028     A          R TN25D04
012900021028     A*%%TS  SD  20021028  163324  EDPAB       REL-V4R4M0  5769-PW1
013000021028     A  01                                  CF05
013100021028     A N01                                  CF06
013200021028     A N01N02                               CF16
013300021028     A                                      CF12
013400021028     A  28        V4CMSG        78   M
013500021028     A            RSUT          20A  O  1  2
013600021028     A                                  1 27'* Tabella Riferimenti Fedex *'
013700021028     A                                      DSPATR(RI)
013800021028     A                                      DSPATR(UL)
013900021028     A            VTCPGM        10A  O  1 61
014000021028     A                                  1 72DATE
014100021028     A                                      EDTCDE(Y)
014200021028     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
014300021028     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
014400021028     A  01                              2 35'*ANNULLATA*'
014500021028     A                                      DSPATR(RI)
014600021028     A                                  2 72TIME
014700021028     A                                  4  2'Codice RIFERIMENTO...........:'
014800021028     A            V4CFED        15A  O  4 33
014900021028     A                                  6  2'Luoghi in cui Fedex prende in cari-
015000021028     A                                      co la  merce Bartolini'
015100021028     A            V4CDE1        25A  B  7 21
015200021028     A  40                                  DSPATR(PC)
015300021028     A                                      CHECK(LC)
015400021028     A            V4CDE2        25A  B  8 21
015500021028     A  40                                  DSPATR(PC)
015600021028     A                                      CHECK(LC)
015700021028     A            V4CDE3        25A  B  9 21
015800021028     A  40                                  DSPATR(PC)
015900021028     A                                      CHECK(LC)
016000021028     A            V4CDE4        25A  B 10 21
016100021028     A  40                                  DSPATR(PC)
016200021028     A                                      CHECK(LC)
016300021028     A            V4CDE5        25A  B 11 21
016400021028     A  40                                  DSPATR(PC)
016500021028     A                                      CHECK(LC)
016600021028     A            V4CFTT         1A  B 21 74CHECK(RB)
016700021028     A                                      VALUES(' ' 'S')
016800021028     A                                      DSPATR(ND)
016900021028     A                                      DSPATR(PR)
017000021028     A            V4CFLT         3Y 0B 22 75CHECK(RZ)
017100021028     A                                      DSPATR(ND)
017200021028     A                                      DSPATR(PR)
017300021028     A                                 23  2'                                  -
017400021028     A                                                                         -
017500021028     A                                               '
017600021028     A                                      DSPATR(UL)
017700021028     A                                      DSPATR(HI)
017800021028     A                                 24  2'F3=Fine'
017900021028     A  01                             24 12'F5=Ripristino'
018000021028     A N01                             24 28'F6=CONFERMA'
018100021028     A N01                             24 42'F16=Annullamento'
018200021028     A                                      DSPATR(ND)
018300021028     A                                 24 69'F12=Ritorno'
