000100110926     A*%%TS  SD  20110926  140922  EDPAB       REL-V6R1M0  5761-WDS
000200110926     A*%%EC
000300110926     A                                      DSPSIZ(24 80 *DS3)
000400110926     A                                      CHGINPDFT(HI CS)
000500110926     A                                      PRINT
000600110926     A                                      ERRSFL
000700110926     A                                      CA03
000800110926     A                                      HELP
000900030122     A*-------------------------------------*
001000110926     A          R D1
001100110926     A*%%TS  SD  20110926  140922  EDPAB       REL-V6R1M0  5761-WDS
001200110926     A                                      CA12
001300110926     A N03                                  CF06
001400110926     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
001500110926     A                                      CSRLOC(H1RIGA     H1COLO)
001600110926     A                                      OVERLAY
001700110926     A            H1NMRC        10A  H      TEXT('Nome Record')
001800110926     A            H1NMFL        10A  H      TEXT('Nome Campo')
001900110926     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
002000110926     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
002100110926     A                                      ore')
002200110926     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
002300110926     A                                      ursore')
002400110926     A            D1FUN         10A  O  3 33
002500110926     A            D1MSG          1A  O  4  2TEXT('serve per emettere msg relati-
002600110926     A                                      vi a tutta la videata')
002700110926     A            D1ANN         15A  O  4 64
002800110926     A  08                                  DSPATR(RI)
002900110926     A  08                                  DSPATR(HI)
003000110926     A                                  5  2'Settimane per la Filiale....:'
003100110926     A            D1COD          3A  B  5 33
003200110926     A N02                                  DSPATR(PC)
003300110926     A  02                                  DSPATR(PR)
003400110926     A N02                                  DSPATR(HI)
003500110926     A N02                                  DSPATR(CS)
003600110926     A  50                                  ERRMSG('Manca Codice' 50)
003700110926     A  53                                  ERRMSG('Codice già presente' 53)
003800110926     A                                  7  2'Settimane'
003900110926     A            D1001          2A  B  7 12CHECK(LC)
004000110926     A  03                                  DSPATR(PR)
004100110926     A                                      DSPATR(PC)
004200110926     A            D1002          2A  B  7 16CHECK(LC)
004300110926     A  03                                  DSPATR(PR)
004400110926     A                                      DSPATR(PC)
004500110926     A            D1003          2A  B  7 20CHECK(LC)
004600110926     A  03                                  DSPATR(PR)
004700110926     A                                      DSPATR(PC)
004800110926     A            D1004          2A  B  7 24CHECK(LC)
004900110926     A  03                                  DSPATR(PR)
005000110926     A                                      DSPATR(PC)
005100110926     A            D1005          2A  B  7 28CHECK(LC)
005200110926     A  03                                  DSPATR(PR)
005300110926     A                                      DSPATR(PC)
005400110926     A            D1006          2A  B  7 32CHECK(LC)
005500110926     A  03                                  DSPATR(PR)
005600110926     A                                      DSPATR(PC)
005700110926     A            D1007          2A  B  7 36CHECK(LC)
005800110926     A  03                                  DSPATR(PR)
005900110926     A                                      DSPATR(PC)
006000110926     A            D1008          2A  B  7 40CHECK(LC)
006100110926     A  03                                  DSPATR(PR)
006200110926     A                                      DSPATR(PC)
006300110926     A            D1009          2A  B  7 44CHECK(LC)
006400110926     A  03                                  DSPATR(PR)
006500110926     A                                      DSPATR(PC)
006600110926     A            D1010          2A  B  8 12CHECK(LC)
006700110926     A  03                                  DSPATR(PR)
006800110926     A                                      DSPATR(PC)
006900110926     A            D1011          2A  B  8 16CHECK(LC)
007000110926     A  03                                  DSPATR(PR)
007100110926     A                                      DSPATR(PC)
007200110926     A            D1012          2A  B  8 20CHECK(LC)
007300110926     A  03                                  DSPATR(PR)
007400110926     A                                      DSPATR(PC)
007500110926     A            D1013          2A  B  8 24CHECK(LC)
007600110926     A  03                                  DSPATR(PR)
007700110926     A                                      DSPATR(PC)
007800110926     A            D1014          2A  B  8 28CHECK(LC)
007900110926     A  03                                  DSPATR(PR)
008000110926     A                                      DSPATR(PC)
008100110926     A            D1015          2A  B  8 32CHECK(LC)
008200110926     A  03                                  DSPATR(PR)
008300110926     A                                      DSPATR(PC)
008400110926     A            D1016          2A  B  8 36CHECK(LC)
008500110926     A  03                                  DSPATR(PR)
008600110926     A                                      DSPATR(PC)
008700110926     A            D1017          2A  B  8 40CHECK(LC)
008800110926     A  03                                  DSPATR(PR)
008900110926     A                                      DSPATR(PC)
009000110926     A            D1018          2A  B  8 44CHECK(LC)
009100110926     A  03                                  DSPATR(PR)
009200110926     A                                      DSPATR(PC)
009300110926     A            D1019          2A  B  9 12CHECK(LC)
009400110926     A  03                                  DSPATR(PR)
009500110926     A                                      DSPATR(PC)
009600110926     A            D1020          2A  B  9 16CHECK(LC)
009700110926     A  03                                  DSPATR(PR)
009800110926     A                                      DSPATR(PC)
009900110926     A            D1021          2A  B  9 20CHECK(LC)
010000110926     A  03                                  DSPATR(PR)
010100110926     A                                      DSPATR(PC)
010200110926     A            D1022          2A  B  9 24CHECK(LC)
010300110926     A  03                                  DSPATR(PR)
010400110926     A                                      DSPATR(PC)
010500110926     A            D1023          2A  B  9 28CHECK(LC)
010600110926     A  03                                  DSPATR(PR)
010700110926     A                                      DSPATR(PC)
010800110926     A            D1024          2A  B  9 32CHECK(LC)
010900110926     A  03                                  DSPATR(PR)
011000110926     A                                      DSPATR(PC)
011100110926     A            D1025          2A  B  9 36CHECK(LC)
011200110926     A  03                                  DSPATR(PR)
011300110926     A                                      DSPATR(PC)
011400110926     A            D1026          2A  B  9 40CHECK(LC)
011500110926     A  03                                  DSPATR(PR)
011600110926     A                                      DSPATR(PC)
011700110926     A            D1027          2A  B  9 44CHECK(LC)
011800110926     A  03                                  DSPATR(PR)
011900110926     A                                      DSPATR(PC)
012000110926     A            D1028          2A  B 10 12CHECK(LC)
012100110926     A  03                                  DSPATR(PR)
012200110926     A                                      DSPATR(PC)
012300110926     A            D1029          2A  B 10 16CHECK(LC)
012400110926     A  03                                  DSPATR(PR)
012500110926     A                                      DSPATR(PC)
012600110926     A            D1030          2A  B 10 20CHECK(LC)
012700110926     A  03                                  DSPATR(PR)
012800110926     A                                      DSPATR(PC)
012900110926     A            D1031          2A  B 10 24CHECK(LC)
013000110926     A  03                                  DSPATR(PR)
013100110926     A                                      DSPATR(PC)
013200110926     A            D1032          2A  B 10 28CHECK(LC)
013300110926     A  03                                  DSPATR(PR)
013400110926     A                                      DSPATR(PC)
013500110926     A            D1033          2A  B 10 32CHECK(LC)
013600110926     A  03                                  DSPATR(PR)
013700110926     A                                      DSPATR(PC)
013800110926     A            D1034          2A  B 10 36CHECK(LC)
013900110926     A  03                                  DSPATR(PR)
014000110926     A                                      DSPATR(PC)
014100110926     A            D1035          2A  B 10 40CHECK(LC)
014200110926     A  03                                  DSPATR(PR)
014300110926     A                                      DSPATR(PC)
014400110926     A            D1036          2A  B 10 44CHECK(LC)
014500110926     A  03                                  DSPATR(PR)
014600110926     A                                      DSPATR(PC)
014700110926     A            D1037          2A  B 11 12CHECK(LC)
014800110926     A  03                                  DSPATR(PR)
014900110926     A                                      DSPATR(PC)
015000110926     A            D1038          2A  B 11 16CHECK(LC)
015100110926     A  03                                  DSPATR(PR)
015200110926     A                                      DSPATR(PC)
015300110926     A            D1039          2A  B 11 20CHECK(LC)
015400110926     A  03                                  DSPATR(PR)
015500110926     A                                      DSPATR(PC)
015600110926     A            D1040          2A  B 11 24CHECK(LC)
015700110926     A  03                                  DSPATR(PR)
015800110926     A                                      DSPATR(PC)
015900110926     A            D1041          2A  B 11 28CHECK(LC)
016000110926     A  03                                  DSPATR(PR)
016100110926     A                                      DSPATR(PC)
016200110926     A            D1042          2A  B 11 32CHECK(LC)
016300110926     A  03                                  DSPATR(PR)
016400110926     A                                      DSPATR(PC)
016500110926     A            D1043          2A  B 11 36CHECK(LC)
016600110926     A  03                                  DSPATR(PR)
016700110926     A                                      DSPATR(PC)
016800110926     A            D1044          2A  B 11 40CHECK(LC)
016900110926     A  03                                  DSPATR(PR)
017000110926     A                                      DSPATR(PC)
017100110926     A            D1045          2A  B 11 44CHECK(LC)
017200110926     A  03                                  DSPATR(PR)
017300110926     A                                      DSPATR(PC)
017400110926     A                                 22  4'F3=Fine'
017500110926     A N03                             22 30'F6=Conferma'
017600110926     A                                 22 68'F12=Ritorno'
017700040930     A*------------------------------------------------------------------
017800110901     A          R T1
017900110901     A*%%TS  SD  20110901  164644  EDPAB       REL-V6R1M0  5761-WDS
018000110901     A                                  1  3SYSNAME
018100110901     A            NOMSIF        10A  O  1 12
018200110901     A                                  1 25' Classi Merceologiche Articoli '
018300110901     A                                      DSPATR(UL)
018400110901     A                                      DSPATR(RI)
018500110901     A            NOMPGM        10A  O  1 59
018600110901     A                                  1 70DATE
018700110901     A                                      EDTCDE(Y)
018800110901     A            NOMDIT        20A  O  2  3TEXT('DESCRIZIONE DITTA')
018900110901     A            T1OPE         30A  O  2 26
019000110901     A                                  2 59USER
019100110901     A                                  2 70TIME
019200040930     A*------------------------------------------------------------------
019300030220     A          R W1TRAS
019400030220     A*%%TS  SD  20030220  151104  EDPAB       REL-V4R4M0  5769-PW1
019500030220     A                                      WINDOW(5 15 10 40)
019600030220     A                                      OVERLAY
019700030220     A                                      WDWBORDER((*COLOR RED) (*DSPATR RI)-
019800030220     A                                       (*CHAR '        '))
019900030220     A                                  3  4'A chi Trasmettere la Tabella'
020000030220     A                                      DSPATR(UL)
020100030220     A                                  4  4'Scelta'
020200030220     A            T1TRS          1A  B  4 13VALUES(' ' '1' '2')
020300030220     A                                  4 19'1=Trs.a Tutti'
020400030220     A                                  5 19'2=Trs.a Filiale'
020500030220     A                                  6 18'  =Non trasmettere'
020600030220     A                                  7  4'Filiale'
020700030220     A            T1FIL          3Y 0B  7 13EDTCDE(Z)
020800030220     A  77                                  ERRMSG('Filiale errata' 77)
020900030220     A                                  9  4'Enter=Conferma'
