000100060428     A*--------------------------------------------------------------*
000200060428     A*  DS PER PGM DI GESTIONE TABELLA CCH
000300060428     A*--------------------------------------------------------------*
000400060428     A          R TB49REC                   TEXT('Manutenzione TNTBE00F -
000500060428     A                                      - Tabella CCH')
000600120329     A            B92FUN         1          TEXT('Funzione chiamata -
000700060428     A                                      - 1=Ric./Scelta BLANKS=Manut.')
000800120329     A            B92KE1         3          TEXT('Codice FILIALE')
000900120329     A            B92KE2         5          TEXT('Codice causale')
001000120329     A            B92DES        50          TEXT('Descrizione')
001100120329     A            B92COMAND      1          TEXT('Comando')
001200120329     A            B92OPZIO       2          TEXT('Opzione')
001300120329     A            B92RICEZ       1          TEXT('Ricezione')
001400120329     A            B92ESITO       1          TEXT('Esito')
