000100121127     A*%%TS  SD  20121127  110951  EDPLC       REL-V6R1M0  5761-WDS
000200970526     A*-------------------------------------------------------------------------
000300121127     A*%%EC
000400121127     A                                      DSPSIZ(24 80 *DS3)
000500121127     A                                      CHGINPDFT(HI CS)
000600121127     A                                      PRINT
000700121127     A                                      CF01
000800121127     A                                      CF02
000900121127     A                                      CF03
001000121127     A                                      CF04
001100121127     A                                      CF05
001200121127     A                                      CF06
001300121127     A                                      CF07
001400121127     A                                      CF08
001500121127     A                                      CF09
001600121127     A                                      CF10
001700121127     A                                      CF11
001800121127     A                                      CF12
001900121127     A                                      CF13
002000121127     A                                      CF14
002100121127     A                                      CF15
002200121127     A                                      CF16
002300121127     A                                      CF17
002400121127     A                                      CF18
002500121127     A                                      CF19
002600121127     A                                      CF20
002700121127     A                                      CF21
002800121127     A                                      CF22
002900121127     A                                      CF23
003000121127     A                                      CF24
003100121127     A                                      HELP
003200970526     A*-------------------------------------------------------------------------
003300121127     A          R TB51D01
003400121127     A*%%TS  SD  20121127  110951  EDPLC       REL-V6R1M0  5761-WDS
003500121127     A                                      TEXT('Testata')
003600121127     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
003700121127     A                                  1 24'*  Test TNTB51R (tab.3TR) in Ctrl -
003800121127     A                                      *'
003900121127     A                                      DSPATR(RI)
004000121127     A                                      DSPATR(UL)
004100121127     A                                  1 60'TNTB51R1'
004200121127     A                                  1 71DATE
004300121127     A                                      EDTCDE(Y)
004400121127     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004500121127     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004600121127     A                                  2 71TIME
004700970526     A*-------------------------------------------------------------------------
004800121127     A          R TB51D02
004900970526     A                                      OVERLAY
005000970526     A            FUN001        19A  O 22  2
005100970526     A            FUN002        19A  O 22 22
005200970526     A            FUN003        19A  O 22 42
005300970526     A            FUN004        19A  O 22 62
005400970526     A            FUN005        19A  O 23  2
005500970526     A            FUN006        19A  O 23 22
005600970526     A            FUN007        19A  O 23 42
005700970526     A            FUN008        19A  O 23 62
005800970526     A*-------------------------------------------------------------------------
005900121127     A          R TB51D03
006000121127     A*%%TS  SD  20121127  110951  EDPLC       REL-V6R1M0  5761-WDS
006100121127     A                                      OVERLAY
006200121127     A                                  4  2'INPUT                   '
006300121127     A                                  5  2'Tabella ...............:'
006400121127     A                                  5 27'3TR'
006500121127     A                                  6  2'Lingua ................:'
006600121127     A            VIDLIN         1   B  6 27
006700121127     A                                  7  2'Sistema informativo ...:'
006800121127     A            VIDSIF        10   B  7 27
006900121127     A                                  8  2'Filiale (KE1) .........:'
007000121127     A            VIDKE1         3Y 0B  8 27EDTCDE(4)
007100121127     A                                      CHECK(RZ)
007200121127     A                                  9  2'Cod. cliente (KE2) ....:'
007300121127     A            VIDKE2         7Y 0B  9 27CHECK(RZ)
007400121127     A                                      EDTCDE(4)
007500121127     A                                 11  2'Filiale arrivo ........:'
007600121127     A            VIDPOA         3  0B 11 27
007700121127     A                                      EDTCDE(4)
007800121127     A                                      CHECK(RZ)
007900121127     A                                 13  2'OUTPUT'
008000121127     A                                 14  2'Errore ................:'
008100121127     A            VIDERR         1   O 14 27
008200121127     A            VIDMSG        78   O 15  2
008300970526     A*-------------------------------------------------------------------------
008400121127     A          R TB51DMS                   SFL
008500970526     A                                      SFLMSGRCD(24)
008600970526     A            MSGKEY                    SFLMSGKEY
008700970526     A            MSGQUE                    SFLPGMQ
008800970526     A*-------------------------------------------------------------------------
008900121127     A          R TB51DMC                   SFLCTL(TB51DMS)
009000970526     A                                      OVERLAY
009100970526     A                                      SFLDSP
009200970526     A  40                                  SFLCLR
009300970526     A                                      SFLSIZ(0002)
009400970526     A                                      SFLPAG(0001)
