000100150327      *PARMS MBR(*NONE) SIZE(1 0 0)
000200150327      */*PRM mbr(*none) size(1 0 0)
000300150327      */*END
000400150327      *---------------------------------------------------------------*
000500150327      *?Parametri per SELEZIONE del SINGOLO CLIENTE dalla tab. "VMA"  ?*
000600150327      *---------------------------------------------------------------*
000700150327     A                                      REF(CNDIZION)
000800150327      *
000900150327     A          R TNTBVMAS                  TEXT('Parm x SELEZIONE SIN-
001000150327     A                                      GOLO CLIENTE da tab."VMA"')
001100150327      *
001200150327      * -?Parametri di INPUT (parzializzazioni)?
001300150327      *
001400150327      * -?Parametri di OUTPUT (selezione)?
001500150327     A            OVMACLI   R     S         REFFLD($KSC)
001600150327     A            OVMAFXX        2          TEXT('Tasto Funzionale di -
001700150327     A                                      uscita: 06=F6, 12=F12.')
001800150327     A            OVMAERR   R               REFFLD($FLA)
001900150327     A                                      TEXT('*on = Errore')
002000150327     A            OVMAMSG       78A
002100150327     A                                      TEXT('Messaggio di errore')
