000100100125     A                                      REF(TNTBE00F)
000200100125     A          R TNTB___I                  TEXT('Manutenzione TNTBE00F in -
000300100125     A                                      lingua: parametri I.')
000400100125     A            TBECOD    R               REFFLD(TBECOD)
000500100215     A            TBESIF    R               REFFLD(TBESIF)
000600100125     A            DESPOS         3S 0       TEXT('Descrizione: posizione -
000700100125     A                                      iniziale.')
000800100125     A            DESLEN         3S 0       TEXT('Descrizione: lunghezza.')
