000100951113     A*---------------------------------------------------------------*
000200080627     A* DS PER PGM DELLE INFO COMMERCIALI
000300951113     A*---------------------------------------------------------------*
000400080627     A                                      REF(TICPI00F)
000500081007     A          R D70TBREC                  TEXT('DS RICERCA SOTTOTIPO INFO+
000600081007     A                                      COMM.')
000700951113     A*
000800940919     A* C A M P I   I N   I N P U T:
000900081007     A            ITB70TLA       1A         TEXT('TIPO LANCIO PROGRAMMA')
001000080627     A* DATI POTENZIALE
001100081007     A            ITB70CPO  R               REFFLD(CPICPO)
001200081007     A            ITB70RAG      48A         TEXT('RAGIONE SOCIALE POTENZIALE')
001300081007     A            ITB70TPF       3A         TEXT('INFO COMMERCIALE')
001400081007     A            ITB70DTPF      3A         TEXT('DESCRIZIONE INFO COMMERCIALE')
001500081007     A            ITB70PGM      10A         TEXT('NOME PGM RICHIAMANTE')
001600960223     A*
001700960530     A* C A M P I   I N   O U T P U T:
001800960530     A*
001900081007     A            OTB70SPF       4A         TEXT('SOTTOTIPO INFO COMMERCIALE')
002000081007     A            OTB70DSPF     25A         TEXT('DESCRIZIONE SOTTOTIPO INFO')
