000100140930      *-------------------------------------------------------------
000200141002      * DS PER PGM DI GESTIONE TABELLA "IFS"
000300140930      *-------------------------------------------------------------
000400141002     A          R TBIFSREC                  TEXT('Tabella "IFS"')
000500141002     A            BIFSFUN        1          TEXT('Funzione chiamata -
000600140930     A                                      - 1=Ric./Scelta BLANKS=Manut.')
000700141002     A            BIFSKE1        3          TEXT('Codice causale')
000800141002     A            BIFSDES       35          TEXT('Descrizione')
000900141002     A            BIFSCOMAND     1          TEXT('Comando')
001000141002     A            BIFSOPZIO      2          TEXT('Opzione')
001100141002     A            BIFSRICEZ      1          TEXT('Ricezione')
001200141002     A            BIFSESITO      1          TEXT('Esito')
