000100110505      */*PRM rstdsp(*yes) dfrwrt(*yes) decfmt(*job)
000200110505      */*END
000300110505      **=============================================================**
000400110505      **?Ricerca e Selezione tab. "CPO": categoria potenziali.      ?**
000500110505      **=============================================================**
000600110505     A                                      DSPSIZ(24  80 *DS3 +
000700110505     A                                             27 132 *DS4)
000800110505     A                                      REF(*LIBL/DCPO D§CPO)
000900110505     A                                      CHGINPDFT(HI UL)
001000110505     A                                      INDARA
001100110505     A                                      PRINT
001200110505      *---------------------------------------------------------------*
001300110505     A*//       R TB87T01                   TEXT('Testata')
001400110505     A*//                                   OVERLAY
001500110505     A*//                                   WINDOW(TB87P01)
001600110505      *
001700110505     A*//         RSUT      R           1  1REFFLD(RSUT       DDATIUTE)
001800110505     A*//                               1 24'* Categoria Potenziali *'
001900110505     A*//                                   DSPATR(RI)
002000110505     A*//         V1TPGM    R           1 50REFFLD($PGM       CNDIZION)
002100110505     A*//                                + 1DATE(*JOB *YY)
002200110505     A*//                                   EDTCDE(Y)
002300110505     A*//         KNSIF     R           2  1REFFLD(KNSIF      KPJBA)
002400110505     A*//                                + 1USER
002500110505     A*//                               2 50'Tab."CPO" '
002600110505     A*//                                   DSPATR(HI)
002700110505     A*//                                + 1TIME
002800110505      *---------------------------------------------------------------*
002900110505     A          R TB87S01                   TEXT('Subfile')
003000110505      *
003100110505     A                                      SFL
003200110505     A  32                                  SFLNXTCHG
003300110505      * Campi di Input/Output
003400110505     A            S1COPZ    R        B  5  2REFFLD($FLA       CNDIZION)
003500110505     A                                      TEXT('Opzione')
003600110505     A  50                                  DSPATR(PC)
003700110505      * Campi di Output
003800110505     A            S1CCOD    R            + 3REFFLD(CPOFLS     TNCPO00F)
003900110505     A                                      DSPATR(HI)
004000110505     A            S1DDES    R            + 3REFFLD(§CPODES)
004100110505      *---------------------------------------------------------------*
004200110505     A          R TB87C01                   TEXT('SubFile Control')
004300110505      *
004400110505     A                                      SFLCTL(TB87S01)
004500110505     A                                      SFLSIZ(0009)
004600110505     A                                      SFLPAG(0008)
004700110505     A N30                                  SFLDSP
004800110505     A    N31                               SFLDSPCTL
004900110505     A  30 31                               SFLCLR
005000110505     A        33                            SFLEND(*MORE)
005100110505      *
005200110505     A                                      WINDOW(TB87P01)
005300110505     A                                      OVERLAY
005400110505      *
005500110505     A                                      CA12
005600110505     A       N33                            ROLLUP
005700110505      *
005800110505     A                                      SFLCSRRRN(&C1CSRRRN)
005900110505     A            C1RCDNBR       4S 0H      SFLRCDNBR(CURSOR)
006000110505     A            C1CSRRRN       5S 0H      TEXT('Numero relativo reco-
006100110505     A                                      rd cursore.')
006200110505      *
006300110505     A  28        V1DMSG        78   M
006400110505      *
006500110505     A            V1TPGM    R           1  1REFFLD($PGM       CNDIZION)
006600110505     A                                  2  1'Tab. "CPO" = Categoria +
006700110505     A                                                    Potenziali'
006800110505     A                                      DSPATR(HI)
006900110505      *
007000110505     A                                  3  1'OPZIONI:'
007100110505     A                                      COLOR(BLU)
007200110505     A                                      DSPATR(UL)
007300110505     A                                   + 1'1=Selezione.'
007400110505     A                                      COLOR(BLU)
007500110505      *
007600110505     A                                  4  1'Opz Cod. Descrizione     -
007700110505     A                                               '
007800110505     A                                      DSPATR(HI)
007900110505     A                                      DSPATR(UL)
008000110505      *---------------------------------------------------------------*
008100110505     A          R TB87S00                   TEXT('SubFile vuoto')
008200110505      *
008300110505     A                                      OVERLAY
008400110505     A                                      PUTOVR
008500110505     A                                      OVRDTA
008600110505     A                                      OVRATR
008700110505     A                                      WINDOW(TB87P01)
008800110505      *
008900110505     A                                  8  1'NON VI SONO DATI DA VISUA-
009000110505     A                                      LIZZARE'
009100110505     A                                      DSPATR(HI)
009200110505      *---------------------------------------------------------------*
009300110505     A          R TB87P01                   TEXT('Piede SubFile')
009400110505      *
009500110505     A                                      WINDOW(2 3 13 34 +
009600110505     A                                             *NOMSGLIN +
009700110505     A                                             *NORSTCSR)
009800110505     A*//                                   WDWTITLE((*TEXT 'Tab. "CPO" -
009900110505     A*//                                   = Categoria Potenziali') +
010000110505     A*//                                   (*COLOR RED))
010100110505     A                                      OVERLAY
010200110505      *
010300110505     A                                 13  1'F3=Fine'
010400110505     A                                      COLOR(BLU)
010500110505      *---------------------------------------------------------------*
010600110505     A          R ASSUME                    TEXT('Serve x preservare i-
010700110505     A                                      l video precedente')
010800110505      *
010900110505     A                                      ASSUME
011000110505     A                                  1  2' '
