000010051215     A*%%TS  SD  20051215  131558  EDPES       REL-V5R3M0  5722-WDS
000020911213     A*-------------------------------------------------------*
000030020206     A*  TNTB23D AUTORIZZAZIONE CONFERMA BOLLE IN ALTRO PO
000040911213     A*-------------------------------------------------------*
000050051215     A*%%EC
000060051215     A                                      DSPSIZ(24 80 *DS3)
000070051215     A                                      REF(*LIBL/CNDIZION)
000080051215     A                                      CHGINPDFT(UL)
000090051215     A                                      PRINT
000100051215     A                                      CF06
000110051215     A                                      CF12
000120891030     A*-------------------------------------------------------*
000130051215     A          R TB51V1
000140051215     A*%%TS  SD  20051215  131558  EDPES       REL-V5R3M0  5722-WDS
000150051215     A                                      CA03
000160051215     A  28        V1CMSG        78   M
000170051215     A            V1CRAG        20A  O  1  2TEXT('RAG.SOC.UTENTE')
000180051215     A                                  1 26'* ABILITAZIONE TRAFERIMENTO *'
000190051215     A                                      DSPATR(RI)
000200051215     A                                  1 61'TNTB51R'
000210051215     A                                  1 73DATE
000220051215     A                                      EDTCDE(Y)
000230051215     A            V1CSIF        10A  O  2  2
000240051215     A            V1CUTE        10A  O  2 15
000250051215     A                                  2 26'***          DATI         ***'
000260051215     A                                      DSPATR(RI)
000270051215     A                                      DSPATR(UL)
000280051215     A                                  2 73TIME
000290051215     A            V1COPZ        15A  O  4 33DSPATR(RI)
000300051215     A                                  6  1'Codice cliente  delle bolle da tra-
000310051215     A                                      sferire...:'
000320051215     A            V1CCOD         7Y 0B  6 48CHECK(RB)
000330051215     A  38                                  DSPATR(PR)
000340051215     A  39
000350051215     AO 41
000360051215     AO 43                                  DSPATR(RI)
000370051215     A N39                                  DSPATR(HI)
000380051215     A            V1DCOD        25A  B  6 56
000390051215     A  38                                  DSPATR(PR)
000400051215     A                                  8 16'oppure'
000410051215     A                                 10  1'Punto Operativo cliente'
000420051215     A                                 11 17'delle bolle da trasferire...:'
000430051215     A            V1CPOU         3Y 0B 11 48CHECK(RZ)
000440051215     A                                      DSPATR(HI)
000450051215     A  38                                  DSPATR(PR)
000460051215     A  37                                  DSPATR(PC)
000470051215     A            V1DPOU        20A  O 11 56
000480051215     A                                 13  1'-----------------------------------
000490051215     A                                      ------------------------------------
000500051215     A                                      -----------'
000510051215     A                                 15  1'P.Operativo per Reso / ORM .......-
000520051215     A                                      ..........:'
000530051215     A            V1CRES         3Y 0B 15 48CHECK(RZ)
000540051215     A  36                                  DSPATR(PC)
000550051215     A            V1DRES        20A  O 15 56
000560051215     A                                 18  1'Punti Operativi abilitati alla Ric-
000570051215     A                                      ezione ...:'
000580051215     A            V1CP01         3Y 0B 18 48
000590051215     A  44                                  DSPATR(RI)
000600051215     A  44                                  DSPATR(PC)
000610051215     A                                      EDTCDE(Z)
000620051215     A                                      CHECK(RB)
000630051215     A  61                                  DSPATR(PR)
000640051215     A            V1CP02         3Y 0B 18 53
000650051215     A  52                                  DSPATR(RI)
000660051215     A  52                                  DSPATR(PC)
000670051215     A                                      EDTCDE(Z)
000680051215     A                                      CHECK(RB)
000690051215     A  61                                  DSPATR(PR)
000700051215     A            V1CP03         3Y 0B 18 58
000710051215     A  53                                  DSPATR(RI)
000720051215     A  53                                  DSPATR(PC)
000730051215     A                                      EDTCDE(Z)
000740051215     A                                      CHECK(RB)
000750051215     A  61                                  DSPATR(PR)
000760051215     A            V1CP04         3Y 0B 18 63
000770051215     A  54                                  DSPATR(RI)
000780051215     A  54                                  DSPATR(PC)
000790051215     A                                      EDTCDE(Z)
000800051215     A                                      CHECK(RB)
000810051215     A  61                                  DSPATR(PR)
000820051215     A            V1CP05         3Y 0B 18 68
000830051215     A  55                                  DSPATR(RI)
000840051215     A  55                                  DSPATR(PC)
000850051215     A                                      EDTCDE(Z)
000860051215     A                                      CHECK(RB)
000870051215     A  61                                  DSPATR(PR)
000880051215     A            V1CP06         3Y 0B 19 48
000890051215     A  56                                  DSPATR(RI)
000900051215     A  56                                  DSPATR(PC)
000910051215     A                                      EDTCDE(Z)
000920051215     A                                      CHECK(RB)
000930051215     A  61                                  DSPATR(PR)
000940051215     A            V1CP07         3Y 0B 19 53
000950051215     A  57                                  DSPATR(RI)
000960051215     A  57                                  DSPATR(PC)
000970051215     A                                      EDTCDE(Z)
000980051215     A                                      CHECK(RB)
000990051215     A  61                                  DSPATR(PR)
001000051215     A            V1CP08         3Y 0B 19 58
001010051215     A  58                                  DSPATR(RI)
001020051215     A  58                                  DSPATR(PC)
001030051215     A                                      EDTCDE(Z)
001040051215     A                                      CHECK(RB)
001050051215     A  61                                  DSPATR(PR)
001060051215     A            V1CP09         3Y 0B 19 63
001070051215     A  59                                  DSPATR(RI)
001080051215     A  59                                  DSPATR(PC)
001090051215     A                                      EDTCDE(Z)
001100051215     A                                      CHECK(RB)
001110051215     A  61                                  DSPATR(PR)
001120051215     A            V1CP10         3Y 0B 19 68
001130051215     A  60                                  DSPATR(RI)
001140051215     A  60                                  DSPATR(PC)
001150051215     A                                      EDTCDE(Z)
001160051215     A                                      CHECK(RB)
001170051215     A  61                                  DSPATR(PR)
001180051215     A                                 22 48'999 = Nessuno'
001190051215     A                                 23  2'F3-Fine  F6-Conferma  F12-Ritorno'
