000010160718     A*%%TS  SD  20160718  161234  EDPMM       REL-V7R1M0  5770-WDS
000020990510     A****************************************************************
000030160718     A*%%EC
000040160718     A                                      DSPSIZ(24 80 *DS3)
000050160718     A                                      CHGINPDFT(HI UL)
000060160718     A                                      PRINT
000070160718     A                                      CA03
000080160718     A          R TNTB011
000090160718     A*%%TS  SD  20160718  161234  EDPMM       REL-V7R1M0  5770-WDS
000100160718     A  28        V1CMSG        78   M
000110160718     A            RSUT          20A  O  1  2
000120160718     A                                  1 26'* Modelli Automobili/Veicoli *'
000130160718     A                                      DSPATR(RI)
000140160718     A                                  1 61'TNTBA02R'
000150160718     A                                  1 72DATE
000160160718     A                                      EDTCDE(Y)
000170160718     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000180160718     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000190160718     A                                  2 72TIME
000200160718     A                                  7  3'Modello.........? :'
000210160718     A                                 24  2'F3=Fine'
000220160718     A            V1CMAU         3A  B  7 24CHECK(RZ)
000230160718     A            V1CMAUD       30A  O  7 29
000240160718     A          R TNTB012
000250160718     A*%%TS  SD  20160718  161234  EDPMM       REL-V7R1M0  5770-WDS
000260160718     A                                      CF12(12)
000270160718     A                                      CF06(06)
000280160718     A  28        V1CMSG        78   M
000290160718     A            RSUT          20A  O  1  2
000300160718     A                                  1 72DATE
000310160718     A                                      EDTCDE(Y)
000320160718     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000330160718     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000340160718     A                                  2 72TIME
000350160718     A                                  1 26'* Modelli Automobili/Veicoli *'
000360160718     A                                      DSPATR(RI)
000370160718     A                                  1 61'TNTBA02R'
000380160718     A                                 24  2'F3=Fine'
000390160718     A            V2CMAU         3A  O  4 20DSPATR(HI)
000400160718     A  28        V2CMSG        78   M
000410160718     A                                  4  3'Modello'
000420160718     A                                 24 30'F6=Aggiornamento'
000430160718     A                                 24 69'F12=Ritorno'
000440160718     A                                  8  4'Descrizione Modello....?'
000450160718     A            V2CMAUD       30A  B  8 31
000460160718     A            V2CSEFI        1A  B 12 31VALUES(' ' 'S' 'F')
000470160718     A                                 12  4'Utilizzo sede filiale'
000480160718     A                                 12 34'(S=Sede F=Filiale " "=ENTRAMBI)'
