000010110913     A*%%TS  SD  20110913  150958  EDPMB       REL-V6R1M0  5761-WDS
000020110913     A*%%EC
000030110913     A                                      DSPSIZ(24 80 *DS3)
000040110913     A                                      CHGINPDFT(HI UL)
000050110913     A                                      PRINT
000060110913     A                                      CA12
000070041221     A****************************************************************
000080041221     A*
000090041221     A*
000100041221     A*
000110041221     A*
000120041221     A*
000130110913     A          R TB13D01
000140110913     A*%%TS  SD  20110913  150958  EDPMB       REL-V6R1M0  5761-WDS
000150041221     A*
000160110913     A            RSUT          20A  O  1  2
000170110913     A                                  1 28' Codice Serie per Disk C '
000180110913     A                                      DSPATR(RI)
000190110913     A                                  1 61'TNTB131R'
000200110913     A                                  1 72DATE
000210110913     A                                      EDTCDE(Y)
000220041221     A*
000230110913     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000240110913     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000250110913     A                                  2 32' con prefisso CC '
000260110913     A                                      DSPATR(RI)
000270110913     A                                  2 72TIME
000280041221     A*
000290110913     A                                 12  7'Serie..:'
000300110913     A            V1CSER         4A  O 12 16DSPATR(HI)
000310110913     A                                 10  7'Cliente:'
000320110913     A            V1CKSC         7Y 0O 10 16DSPATR(HI)
000330110913     A            V1DKSC        45   O 10 24COLOR(BLU)
000340110913     A                                 24 69'F12=Ritorno'
000350110913     A                                      COLOR(BLU)
