000010170109     A*%%TS  SD  20170109  153104  EDPMM       REL-V7R1M0  5770-WDS
000020990510     A****************************************************************
000030170109     A*%%EC
000040170109     A                                      DSPSIZ(24 80 *DS3)
000050170109     A                                      CHGINPDFT(HI UL)
000060170109     A                                      PRINT
000070170109     A                                      CA03
000080161011     A          R TNTB161
000090161011     A*%%TS  SD  20161011  133756  EDPMM       REL-V7R1M0  5770-WDS
000100161011     A  28        V1CMSG        78   M
000110161011     A            RSUT          20A  O  1  2
000120161011     A                                  1 27'* Minimo garantito accordi *'
000130161011     A                                      DSPATR(RI)
000140161011     A                                  1 62'TNTB16R'
000150161011     A                                  1 72DATE
000160161011     A                                      EDTCDE(Y)
000170161011     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000180161011     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000190161011     A                                  2 72TIME
000200161011     A                                  7  3'Filiale.........? :'
000210161011     A                                 24  2'F3=Fine'
000220161011     A            V1CFIL         3A  B  7 24CHECK(RZ)
000230161011     A            V1DFIL        20A  O  7 29
000240170109     A          R TNTB162
000250170109     A*%%TS  SD  20170109  153104  EDPMM       REL-V7R1M0  5770-WDS
000260170109     A                                      CF12(12)
000270170109     A                                      CF06(06)
000280170109     A                                      CF10
000290170109     A  28        V1CMSG        78   M
000300170109     A            RSUT          20A  O  1  2
000310170109     A                                  1 72DATE
000320170109     A                                      EDTCDE(Y)
000330170109     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000340170109     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000350170109     A                                  2 72TIME
000360170109     A                                  1 28'* Minimo garantito accordi *'
000370170109     A                                      DSPATR(RI)
000380170109     A                                  1 62'TNTB16R'
000390170109     A                                 24  2'F3=Fine'
000400170109     A            V2CFIL         3A  O  4 20DSPATR(HI)
000410170109     A            V2DFIL        20A  O  4 25
000420170109     A  28        V2CMSG        78   M
000430170109     A            V2CCAU         3A  B  8 32
000440170109     A  40                                  DSPATR(PC)
000450170109     A  98                                  DSPATR(PR)
000460170109     A                                  4  3'Filiale........'
000470170109     A                                 24 25'F6=Aggiornamento'
000480170109     A                                 24 69'F12=Ritorno'
000490170109     A                                  8  4'Causale nota addebito..?'
000500170109     A                                 10  4'Importo massimo'
000510170109     A                                 12  4'Fil/CDC a cui girocontare'
000520170109     A                                 14  4'Data inizio scrittura'
000530170109     A            V2CIMP         9Y 2B 10 32EDTCDE(2)
000540170109     A  43                                  DSPATR(PC)
000550170109     A  98                                  DSPATR(PR)
000560170109     A            V2CCDC         3Y 0B 12 32EDTCDE(Z)
000570170109     A  41                                  DSPATR(PC)
000580170109     A  98                                  DSPATR(PR)
000590170109     A            V2CDAT         8Y 0B 14 32EDTCDE(8)
000600170109     A  42                                  DSPATR(PC)
000610170109     A  98                                  DSPATR(PR)
000620170109     A            V2CCAUD       45A  O  8 36
000630170109     A            V2CCDCD       20A  O 12 36
000640170109     A                                 16  4'Data fine   scrittura'
000650170109     A            V2CDATF        8Y 0B 16 32EDTCDE(8)
000660170109     A  44                                  DSPATR(PC)
000670170109     A  99                                  DSPATR(PR)
000680170109     A                                 24 43'F10=Inserimento'
