000010070524     A*%%TS  SD  20070524  125627  EDPES       REL-V5R3M0  5722-WDS
000020911213     A*-------------------------------------------------------*
000030020206     A*  TNTB23D AUTORIZZAZIONE CONFERMA BOLLE IN ALTRO PO
000040911213     A*-------------------------------------------------------*
000050070524     A*%%EC
000060070524     A                                      DSPSIZ(24 80 *DS3)
000070070524     A                                      REF(*LIBL/CNDIZION)
000080070524     A                                      CHGINPDFT(UL)
000090070524     A                                      PRINT
000100070524     A                                      CF06
000110070502     A          R TB59V1
000120070502     A*%%TS  SD  20070502  092551  EDPES       REL-V5R3M0  5722-WDS
000130070502     A                                      CA03
000140070502     A  28        V1CMSG        78   M
000150070502     A            V1CRAG        20A  O  1  2TEXT('RAG.SOC.UTENTE')
000160070502     A                                  1 29'* PERSONALIZZAZIONE AMBITI *'
000170070502     A                                      DSPATR(RI)
000180070502     A                                  1 62'TNTB59R'
000190070502     A                                  1 73DATE
000200070502     A                                      EDTCDE(Y)
000210070502     A            V1CSIF        10A  O  2  2
000220070502     A            V1CUTE        10A  O  2 14
000230070502     A                                  2 29'*  DI CONSEGNA SPEDIZIONE  *'
000240070502     A                                      DSPATR(RI)
000250070502     A                                      DSPATR(UL)
000260070502     A                                  2 73TIME
000270070502     A                                  9  8'Filiale in Gestione :'
000280070502     A            V1CFIL         3Y 0B  9 31DSPATR(HI)
000290070502     A                                      CHECK(RB)
000300070502     A  40                                  DSPATR(PC)
000310070502     A                                 23 73'F3=Fine'
000320891030     A*-------------------------------------------------------*
000330070524     A          R TB59V2
000340070524     A*%%TS  SD  20070524  125627  EDPES       REL-V5R3M0  5722-WDS
000350070524     A                                      CA03
000360070524     A                                      CF16
000370070524     A                                      CF12
000380070524     A  28        V1CMSG        78   M
000390070524     A            V1CRAG        20A  O  1  2TEXT('RAG.SOC.UTENTE')
000400070524     A                                  1 29'* PERSONALIZZAZIONE AMBITI *'
000410070524     A                                      DSPATR(RI)
000420070524     A                                  1 62'TNTB59R'
000430070524     A                                  1 73DATE
000440070524     A                                      EDTCDE(Y)
000450070524     A            V1CSIF        10A  O  2  2
000460070524     A            V1CUTE        10A  O  2 14
000470070524     A                                  2 29'*  DI CONSEGNA SPEDIZIONE  *'
000480070524     A                                      DSPATR(RI)
000490070524     A                                      DSPATR(UL)
000500070524     A                                  2 73TIME
000510070524     A            V1CMOD        11A  O  3 38DSPATR(RI)
000520070524     A                                  6  9'Filiale in Gestione :'
000530070524     A            V1CFIL         3S 0O  6 31DSPATR(HI)
000540070524     A                                  6 35'-'
000550070524     A            V1DFIL        25A  O  6 37DSPATR(HI)
000560070524     A                                 10 36'Limite PESO (kg)'
000570070524     A                                      DSPATR(UL)
000580070524     A                                 10 58'Limite VOLUME (mc)'
000590070524     A                                      DSPATR(UL)
000600070524     A                                 12  5'Personalizza limite SOTTO:'
000610070524     A            V1CLKS         7Y 1B 12 40CHECK(RB)
000620070524     A                                      DSPATR(HI)
000630070524     A  41                                  DSPATR(PC)
000640070524     A                                      EDTCDE(2)
000650070524     A            V1CLMS         5Y 3B 12 65CHECK(RB)
000660070524     A                                      DSPATR(HI)
000670070524     A  42                                  DSPATR(PC)
000680070524     A                                      EDTCDE(2)
000690070524     A                                 14  5'Personalizza limite OLTRE:'
000700070524     A            V1CLKG         7Y 1B 14 40CHECK(RB)
000710070524     A                                      DSPATR(HI)
000720070524     A  43                                  DSPATR(PC)
000730070524     A                                      EDTCDE(2)
000740070524     A            V1CLMC         5Y 3B 14 65CHECK(RB)
000750070524     A                                      DSPATR(HI)
000760070524     A  44                                  DSPATR(PC)
000770070524     A                                      EDTCDE(2)
000780070524     A                                 18  5'Gestire ambito Supermercato :'
000790070524     A            V1CAIS         2A  B 18 36DSPATR(HI)
000800070524     A  45                                  DSPATR(PC)
000810070524     A                                      VALUES('SI' 'NO' '  ')
000820070524     A                                 18 42'(SI/NO)'
000830070524     A                                 24  3'F6=Conferma'
000840070524     A                                 24 22'F16=Annullamento'
000850070524     A                                 24 52'F12=Ritorno'
000860070524     A                                 24 73'F3=Fine'
