000010060502     A*%%TS  SD  20060502  124416  EDPRM       REL-V5R3M0  5722-WDS
000020990510     A****************************************************************
000030060502     A*%%EC
000040060502     A                                      DSPSIZ(24 80 *DS3)
000050060502     A                                      CHGINPDFT(HI UL)
000060060502     A                                      PRINT
000070060502     A                                      CA03
000080060502     A          R TNTB121
000090060502     A*%%TS  SD  20060502  124416  EDPRM       REL-V5R3M0  5722-WDS
000100060502     A  28        V1CMSG        78   M
000110060502     A            RSUT          20A  O  1  2
000120060502     A                                  1 25'*** Anagrafico per ORM estero ***'
000130060502     A                                      DSPATR(RI)
000140060502     A                                  1 62'TNTB12R'
000150060502     A                                  1 72DATE
000160060502     A                                      EDTCDE(Y)
000170060502     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000180060502     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000190060502     A                                  2 72TIME
000200060502     A                                  7  3'Punto Operativo ? :'
000210060502     A                                 24  2'F3=Fine'
000220060502     A            V1CFIL         4A  B  7 24CHECK(RZ)
000230060502     A            V1DFIL        20A  O  7 29
000240060502     A          R TNTB122
000250060502     A*%%TS  SD  20060502  124416  EDPRM       REL-V5R3M0  5722-WDS
000260060502     A                                      CF12(12)
000270060502     A                                      CF06(06)
000280060502     A            RSUT          20A  O  1  2
000290060502     A                                  1 72DATE
000300060502     A                                      EDTCDE(Y)
000310060502     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000320060502     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000330060502     A                                  2 72TIME
000340060502     A                                  1 25'*** Anagrafico per ORM estero ***'
000350060502     A                                      DSPATR(RI)
000360060502     A                                  1 62'TNTB12R'
000370060502     A                                 24  2'F3=Fine'
000380060502     A            V2CFIL         4A  O  4 55
000390060502     A            V2DFIL        20A  O  4 60
000400060502     A  28        V2CMSG        78   M
000410060502     A                                  8  8'I dati inseriti vengono stampati n-
000420060502     A                                      el fax ORM per i partner esteri'
000430060502     A                                      DSPATR(HI)
000440060502     A                                 11  4'Descrizione .............:'
000450060502     A                                 13  4'Numero Fax ..............:'
000460060502     A            V2CDES        35A  B 11 32
000470060502     A            V2CFAX        16A  B 13 32
000480060502     A                                 15  4'Persona da contattare ...:'
000490060502     A            V2CNOM        35A  B 15 32
000500060502     A                                  4 38'Punto Operativo'
000510060502     A                                 24 30'F6=Aggiornamento'
000520060502     A                                 24 69'F12=Ritorno'
