000010031127     A*%%TS  SD  20031127  110209  EDPBA       REL-V4R4M0  5769-PW1
000020020212     A*PARMS RSTDSP(*YES) DFRWRT(*YES) DECFMT(*JOB)
000030020212     A****************************************************************
000040031127     A*%%EC
000050031127     A                                      DSPSIZ(24 80 *DS3)
000060031127     A                                      PRINT
000070020212     A*------------------------------------*
000080031117     A          R TB42T1
000090031117     A*%%TS  SD  20031117  092734  EDPBA       REL-V4R4M0  5769-PW1
000100031117     A            RSUT          20   O  1  2
000110031117     A                                  1 24'** Causali autofattura fornitori *-
000120031117     A                                      *'
000130031117     A                                      DSPATR(RI)
000140031117     A                                  1 61'TNTB42R'
000150031117     A                                  1 71DATE(*JOB *YY)
000160031117     A                                      EDTCDE(Y)
000170031117     A            KNSIF         10   O  2  2
000180031117     A            KNMUS         10   O  2 13
000190031117     A            T1OPZ         15A  O  2 33DSPATR(HI)
000200031117     A                                  2 71TIME
000210020212     A*------------------------------------*
000220031117     A          R TB42V1
000230031117     A*%%TS  SD  20031117  092734  EDPBA       REL-V4R4M0  5769-PW1
000240031117     A                                      CA03
000250031117     A                                      OVERLAY
000260031117     A                                  9 16'Causale ? :'
000270031117     A            V1CAU          4A  B  9 29
000280031117     A  51                                  DSPATR(PC)
000290031117     A            V1DES         30A  O  9 35
000300031117     A  99        V1MSG         78A  O 23  2DSPATR(HI)
000310031117     A                                 24  2'F3=Fine'
000320020212     A*------------------------------------*
000330031127     A          R TB42V2
000340031127     A*%%TS  SD  20031127  110209  EDPBA       REL-V4R4M0  5769-PW1
000350031127     A                                      TEXT('Record dettaglio')
000360031127     A                                      CA03
000370031127     A N02                                  CF06
000380031127     A                                      CA12
000390031127     A N01N02                               CA16
000400031127     A                                      OVERLAY
000410031127     A                                  4  2'Causale............:'
000420031127     A                                      DSPATR(HI)
000430031127     A            V2CAU          4A  O  4 24
000440031127     A            V2DES         30A  B  4 31
000450031127     A  52                                  DSPATR(PC)
000460031127     A                                  5  2'Tipo anagrafico....:'
000470031127     A                                      DSPATR(HI)
000480031127     A            V2TIP          1A  B  5 24VALUES('A' 'C' 'D')
000490031127     A  53                                  DSPATR(PC)
000500031127     A                                  5 31'("A"=Autotrasp.- "C"=Coop.- "D"=Af-
000510031127     A                                      f/Def.)'
000520031127     A                                  6  2'Richiedere quantità:'
000530031127     A                                      DSPATR(HI)
000540031127     A            V2QTA          1A  B  6 24VALUES('S' 'N')
000550031127     A  54                                  DSPATR(PC)
000560031127     A                                  6 31'(S/N)'
000570031127     A                                  7  2'Codice tabella Y4Z.:'
000580031127     A                                      DSPATR(HI)
000590031127     A            V2TAB          1A  B  7 24
000600031127     A  55                                  DSPATR(PC)
000610031127     A            V2DESTAB      30A  O  7 31
000620031127     A                                  8  2'Testo fattura......:'
000630031127     A                                      DSPATR(HI)
000640031127     A            V2CSOC         3A  B  8 24
000650031127     A  58                                  DSPATR(PC)
000660031127     A            V2CTES         2A  B  8 28
000670031127     A  59                                  DSPATR(PC)
000680031127     A            V2DTES        50A  O  8 31
000690031127     A                                  9  2'Mese di fatturazione'
000700031127     A                                      DSPATR(HI)
000710031127     A                                      DSPATR(UL)
000720031127     A                                  9 33'Importo'
000730031127     A                                      DSPATR(HI)
000740031127     A                                 10  2'Gennaio............:'
000750031127     A                                      DSPATR(HI)
000760031127     A            V2MES1         1A  B 10 24VALUES(' ' 'X')
000770031127     A  56                                  DSPATR(PC)
000780031127     A            V2IMP1        10Y 3B 10 31EDTCDE(2)
000790031127     A  57                                  DSPATR(PC)
000800031127     A                                 11  2'Febbraio...........:'
000810031127     A                                      DSPATR(HI)
000820031127     A            V2MES2         1A  B 11 24VALUES(' ' 'X')
000830031127     A            V2IMP2        10Y 3B 11 31EDTCDE(2)
000840031127     A                                 12  2'Marzo..............:'
000850031127     A                                      DSPATR(HI)
000860031127     A            V2MES3         1A  B 12 24VALUES(' ' 'X')
000870031127     A            V2IMP3        10Y 3B 12 31EDTCDE(2)
000880031127     A                                 13  2'Aprile.............:'
000890031127     A                                      DSPATR(HI)
000900031127     A            V2MES4         1A  B 13 24VALUES(' ' 'X')
000910031127     A            V2IMP4        10Y 3B 13 31EDTCDE(2)
000920031127     A                                 14  2'Maggio.............:'
000930031127     A                                      DSPATR(HI)
000940031127     A            V2MES5         1A  B 14 24VALUES(' ' 'X')
000950031127     A            V2IMP5        10Y 3B 14 31EDTCDE(2)
000960031127     A                                 15  2'Giugno.............:'
000970031127     A                                      DSPATR(HI)
000980031127     A            V2MES6         1A  B 15 24VALUES(' ' 'X')
000990031127     A            V2IMP6        10Y 3B 15 31EDTCDE(2)
001000031127     A                                 16  2'Luglio.............:'
001010031127     A                                      DSPATR(HI)
001020031127     A            V2MES7         1A  B 16 24VALUES(' ' 'X')
001030031127     A            V2IMP7        10Y 3B 16 31EDTCDE(2)
001040031127     A                                 17  2'Agosto.............:'
001050031127     A                                      DSPATR(HI)
001060031127     A            V2MES8         1A  B 17 24VALUES(' ' 'X')
001070031127     A            V2IMP8        10Y 3B 17 31EDTCDE(2)
001080031127     A                                 18  2'Settembre..........:'
001090031127     A                                      DSPATR(HI)
001100031127     A            V2MES9         1A  B 18 24VALUES(' ' 'X')
001110031127     A            V2IMP9        10Y 3B 18 31EDTCDE(2)
001120031127     A                                 19  2'Ottobre............:'
001130031127     A                                      DSPATR(HI)
001140031127     A            V2MES10        1A  B 19 24VALUES(' ' 'X')
001150031127     A            V2IMP10       10Y 3B 19 31EDTCDE(2)
001160031127     A                                 20  2'Novembre...........:'
001170031127     A                                      DSPATR(HI)
001180031127     A            V2MES11        1A  B 20 24VALUES(' ' 'X')
001190031127     A            V2IMP11       10Y 3B 20 31EDTCDE(2)
001200031127     A                                 21  2'Dicembre...........:'
001210031127     A                                      DSPATR(HI)
001220031127     A            V2MES12        1A  B 21 24VALUES(' ' 'X')
001230031127     A            V2IMP12       10Y 3B 21 31EDTCDE(2)
001240031127     A  99        V2MSG         78A  O 23  1DSPATR(HI)
001250031127     A                                 24  1'F3=Fine'
001260031127     A N02                             24 27'F6=Conferma'
001270031127     A                                 24 41'F12=Ritorno'
001280031127     A N01N02                          24 55'F16=Annullamento'
001290020222     A*------------------------------------*
001300020912     A          R TB42W1
001310020222     A                                      TEXT('Window Modif. dati Trasmiss.')
001320020225     A                                      WINDOW(5 10 8 60 *NOMSGLIN)
001330020222     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
001340020222     A                                          '))
001350020222     A                                      USRRSTDSP
001360020301     A                                      CF06
001370020222     A                                      CA12
001380020222     A                                      BLINK
001390020222     A                                      OVERLAY
001400020225     A                                  1 18'Gestione dati trasmissione'
001410020225     A                                      DSPATR(HI)
001420020225     A                                      DSPATR(UL)
001430020222     A*
001440020225     A                                  3  1'Tipo trasmissione:'
001450020225     A            W1FTT     R        B  3 21REFFLD(TBEFTT TNTBE00F)
001460020225     A                                      VALUES(' ' 'S')
001470020226     A                                  3 25'S=SI'
001480020225     A                                  4  1'P.O. trasmissione:'
001490020225     A            W1FLT     R        O  4 21REFFLD(TBEFLT TNTBE00F)
001500020225     A                                      EDTWRD('0   ')
001510020225     A                                  5  1'Flag trasmissione:'
001520020225     A            W1FTR     R        O  5 21REFFLD(TBEFTR TNTBE00F)
001530020226     A                                  5 25'" "=Da trasm. "R"=Ricev. "T"=Trasm-
001540020226     A                                      .'
001550020225     A                                  6  1'Data trasmissione:'
001560020225     A            W1DTR          8  0O  6 21
001570020225     A                                      EDTCDE(Y)
001580020301     A*
001590020301     A  99        W1MSG         60A  O  7  1
001600020222     A*
001610020301     A                                  8  1'F6=Conferma'
001620020301     A                                   + 3'F12=Ritorno'
001630020212     A*------------------------------------*
001640020212     A          R PROTECT
001650020212     A                                      TEXT('Serve x inibire tutto il vide-
001660020212     A                                      o')
001670020212     A                                      CA03
001680020212     A                                      CA12
001690020212     A                                      OVERLAY
001700020212     A                                      PROTECT
001710020212     A                                      CLRL(*NO)
001720020226     A*------------------------------------*
001730020226     A          R ASSUME
001740020226     A                                      TEXT('Serve x preservare il video p-
001750020226     A                                      recedente')
001760020226     A                                      ASSUME
001770020226     A                                  1  2' '
