000100890907     A                                      REF(CNDIZION)
000200900327     A*
000300020904     A          R EDIVAT00                  TEXT('BOLLE PARTENZA DA CLIENTE +
000400980218     A                                      *ESTENSIONE DETT. COLLI*')
000500980218     A            VATATB    R               REFFLD($ATB)
000600020904     A            VATFGS    R     S         REFFLD($FGS)
000700020904     A            VATCCM    R     S         REFFLD($CCM)
000800980218     A            VATLNP    R     S         REFFLD($LNP)
000900980218     A            VATAAS    R     S         REFFLD($AAS)
001000980218     A            VATNRS    R     S         REFFLD($NRS)
001100980218     A            VATNSP    R     S         REFFLD($NSP)
001200980218     A            VATTRC    R               REFFLD($TRC)
001300980218     A            VATNOT    R               REFFLD($NOT)
001400980218     A                                      TEXT('DESCRIZIONE')
001500980218     A                                      COLHDG('DESCRIZ')
001600031121     A            VATCMR        35          TEXT('NUMERO CMR')
001700031121     A                                      COLHDG('NUM.' 'CMR')
001800031121     A            VATCNT         5S 0       TEXT('CONTATORE')
001900170817     A                                      COLHDG('CONTATORE')
002000170817     A            VATSUN         9A         TEXT('STRATEGI USER NUMBER')
002100170817     A                                      COLHDG('STRATEGI' 'USER NUMBER')
