000100061030      *--------------------------------------------------------------*
000200171219      *  CONSEGNE INVIO A PDA DETTAGLIO COLLI X DISTINTE DEMO
000300061030      *--------------------------------------------------------------*
000400061219     A                                      REF(CNDIZION)
000500171219     A          R FDIDD000                  TEXT('CONSEGNE:INVIO VAR.DETTA-
000600171219     A                                      GLIO COLLI A PDA DEMO')
000700171219     A            UDDFGS    R               REFFLD($FGS)
000800080212     A                                      TEXT('FILIALE DISTINTA')
000900080212     A                                      COLHDG('FIL' 'DIST')
001000171219     A            UDDNDC    R               REFFLD($NFV)
001100061221     A                                      TEXT('NR. DISTINTA')
001200080212     A                                      COLHDG('NR.DIST')
001300171219     A            UDDAAS    R               REFFLD($AAS)
001400171219     A            UDDLNP    R               REFFLD($LNP)
001500171219     A            UDDNRS    R               REFFLD($NRS)
001600171219     A            UDDNSP    R               REFFLD($NSP)
001700171219     A            UDDATB    R               REFFLD($ATB)
001800171219     A            UDDFLS    R               REFFLD($FLS)
001900171219     A            UDDLNA    R               REFFLD($LNA)
002000171219     A            UDDNRSER  R               REFFLD($NRS)
002100171219     A            UDDNSC    R               REFFLD($NSC)
002200171219     A            UDDCAN    R               REFFLD($CAN)
002300171219     A            UDDSPUMAG R               REFFLD($FLA)
002400080212     A                                      TEXT('S=COLLO SPUNTATO IN USCITA IN-
002500080212     A                                       MAGAZZINO')
002600171219     A            UDDCODAUT R               REFFLD($PDR)
002700070115     A                                      TEXT('WRK-CODICE AUTOTRASPORTATORE')
002800171219     A            UDDDATORA R               REFFLD($ALFA17)
002900070112     A                                      TEXT('WRK-DATA/ORA PREP.DATI AAAAMM-
003000070112     A                                      GGHHMMSS')
003100070112     A                                      COLHDG('DATA/ORA')
