000100000000     A*--------------------------------------------------------------*
000200080925     A*         TARIFFE AUTISTI AFF/DEF TESTATA                      *
000300000000     A*--------------------------------------------------------------*
000400890913     A                                      REF(CNDIZION)
000500090624     A          R FIADTS00                  TEXT('STORICO TARIFFE - AFF/DEF')
000600080925     A            ADTATB    R               REFFLD($ATB)
000700080925     A            ADTPDR    R               REFFLD($PDR)
000800080925     A            ADTTSR    R               REFFLD($TSR)
000900080925     A            ADTPRG    R               REFFLD($PRG)
001000930809     A*
001100080925     A            ADTDDT    R               REFFLD($DDT)
001200080925     A            ADTDST    R               REFFLD($DST)
001300080925     A            ADTDCN    R               REFFLD($DCN)
001400090324     A                                      TEXT('DATA STAMPA IN SEDE')
001500080925     A            ADTDTS    R               REFFLD($DTS)
001600090324     A                                      TEXT('DATA CONVALIDA FILIALE')
001700081223     A            ADTDUV    R               REFFLD($DUV)
001800090114     A            ADTPCAR   R               REFFLD($PCAR)
001900090107     A            ADTPKL    R               REFFLD($PKL)
002000090107     A            ADTVLU    R               REFFLD($VLU)
002100930909     A*
002200090324     A            ADTDRC         8P 0       TEXT('DATA RITORNO COPIA FIRMATA')
002300090324     A            ADTNRC         7P 0       TEXT('NUMERO CONTRATTO')
002400090324     A            ADTTMPC        4  0       TEXT('TEMPI CARICO')
002500090324     A            ADTTMPS        4  0       TEXT('TEMPI SCARICO')
002600090427     A            ADTCDF    R               REFFLD($CDF)
002700090327     A                                      TEXT('CODICE FORNITORE')
002800090327     A            ADTCSF    R               REFFLD($CSF)
002900090327     A                                      TEXT('COD.SISTEMA INFORMATIVO -
003000090327     A                                      FORNITORE')
003100090402     A            ADTFIL         3P 0       TEXT('FIL. GESTIONE CONTRATTO')
003200090402     A                                      COLHDG('FILIALE' 'GESTIONE')
003300111130     A            ADTUNODC  R               REFFLD($UNODC)
003400111130     A            ADTDFA    R               REFFLD($DFA)
003500111130     A            ADTFLR        30          TEXT('FILLER')
003600090624     A*
003700090624     A          K ADTPDR
003800090624     A          K ADTDST
