000100890907     A*---------------------------------------------------------------*
000200070219     A*  ANAGRAFICA AUT. ESTENSIONE DATI X GESTIONE DISTINTE
000300890907     A*---------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500900327     A*
000600070219     A          R FIAPD200                  TEXT('ANAGRAF. AUT. ESTENSIONE+
000601070219     A                                      DATI X GEST.DISTINTA')
000700060922     A            APD2ATB   R               REFFLD($ATB)
000701070119     A            APD2TIPA  R               TEXT('TIPO ANAGRAFICA A=AUT.')
000702070119     A                                      REFFLD($TIPA)
000703070119     A                                      COLHDG('TIP' 'ANAG')
000800060922     A            APD2PDR   R               REFFLD($PDR)
000801061213     A            APD2DDE   R               REFFLD($DDE)
000802070119     A            APD2DSCAD R               REFFLD($DSCAD)
000803061213     A            APD2FPP   R               REFFLD($FPP)
000804070119     A                                      TEXT('MATTINO/POMERIGGIO')
000805070712     A            APD2PDA   R               REFFLD($FLA)
000806070712     A                                      TEXT('LIBERO')
000809061213     A            APD2PKL   R               REFFLD($PKL)
000810070712     A                                      TEXT('C-PESO MAX ASSEGNABILE')
000811061213     A            APD2VLU   R               REFFLD($VLU)
000812070712     A                                      TEXT('C-VOLUME MAX ASSEGNABILE')
004400070119     A            APD2NFTL  R               REFFLD($NFTL)
004500070712     A                                      TEXT('C-NR.MAX FERMATE ASSEGNABILI')
004600070712     A                                      COLHDG('C-MAX' 'FERM.')
004601070219     A            APD2NBL   R               REFFLD($NBL)
004602070712     A                                      TEXT('C-NR.MAX BOLLE ASSEGNABILI')
004603070712     A                                      COLHDG('C-MAX' 'BOLLE')
004604070221     A            APD2TOL   R               REFFLD($PER)
004605070712     A                                      TEXT('C-% TOLLERANZA PESO/VOLUME')
004607070712     A                                      COLHDG('C-% TOLL.' 'PESO/VOL.')
004700061213     A            APD2FTC   R               REFFLD($FLA)
004701070716     A                                      TEXT('C-INCL/ESCL. CONSEGNE+
004702070219     A                                      PARTICOLARI')
004703070219     A                                      COLHDG('I/E' 'C/P')
004704061213     A            APD2TC1   R               REFFLD($TC1)
004800070716     A                                      TEXT('C-CONS.PARTICOLARE 1 ')
004801061213     A                                      COLHDG('CONS.' 'PART. 1')
004900060922     A            APD2TC2   R               REFFLD($TC1)
004901070716     A                                      TEXT('C-CONS.PARTICOLARE 2 ')
005001061213     A                                      COLHDG('CONS.' 'PART. 2')
005100060922     A            APD2TC3   R               REFFLD($TC1)
005101070716     A                                      TEXT('C-CONS.PARTICOLARE 3 ')
005201061213     A                                      COLHDG('CONS.' 'PART. 3')
005300060922     A            APD2TC4   R               REFFLD($TC1)
005301070716     A                                      TEXT('C-CONS.PARTICOLARE 4 ')
005401061213     A                                      COLHDG('CONS.' 'PART. 4')
005500060922     A            APD2TC5   R               REFFLD($TC1)
005501070716     A                                      TEXT('C-CONS.PARTICOLARE 5 ')
005601061213     A                                      COLHDG('CONS.' 'PART. 5')
005700061213     A            APD2INC   R               REFFLD($FLA)
005701070712     A                                      TEXT('C-INCASSI S=SI/N=NO')
005800070712     A                                      COLHDG('C-INC.' 'SI/NO')
005801061213     A            APD2FTS   R               REFFLD($FLA)
005802070712     A                                      TEXT('C-INC/ESCL. TIPI SERVIZI')
005803070712     A                                      COLHDG('C-I/E' 'T/S')
005900060922     A            APD2TS1   R               REFFLD($TSP)
006000070712     A                                      TEXT('C-TIPO SERVIZIO 1 ')
006001070712     A                                      COLHDG('C-TIPO' 'SERV. 1')
006100060922     A            APD2TS2   R               REFFLD($TSP)
006200070712     A                                      TEXT('C-TIPO SERVIZIO 2 ')
006201070712     A                                      COLHDG('C-TIPO' 'SERV. 2')
007100070119     A            APD2NRAS  R               REFFLD($NRAS)
007200070712     A                                      TEXT('NR.ASSOLUTO PER FIAPD30F/50F')
007300061213     A                                      COLHDG('NR.ASS.')
007301070710     A            APD2RPKL  R               REFFLD($PKL)
007302070712     A                                      TEXT('R-PESO MAX ASSEGNABILE ORM')
007303070710     A            APD2RVLU  R               REFFLD($VLU)
007304070712     A                                      TEXT('R-VOLUME MAX ASSEGNABILE ORM')
007305070710     A            APD2RNFTL R               REFFLD($NFTL)
007306070712     A                                      TEXT('R-NR.MAX FERMATE ASSEGN.ORM')
007307070710     A                                      COLHDG('MAX' 'FERM.ORM')
007308070710     A            APD2RNBL  R               REFFLD($NBL)
007309070712     A                                      TEXT('R-NR.MAX ORM ASSEGNABILI')
007310070710     A                                      COLHDG('MAX' 'ORM')
007311070710     A            APD2RTOL  R               REFFLD($PER)
007312070712     A                                      TEXT('R-% TOLLERAN.PESO/VOLUME ORM')
007314070712     A                                      COLHDG('R-% TOLL.' 'PESO/VOL.')
007315070710     A            APD2RINC  R               REFFLD($FLA)
007316070712     A                                      TEXT('R-INCASSI ORM S=SI/N=NO')
007317070710     A                                      COLHDG('INC.ORM' 'SI/NO')
007318070711     A            APD2RSPI  R               REFFLD($FLA)
007319070712     A                                      TEXT('R-SPONDA IDRAULICA:S=SI/N=NO')
007320070712     A                                      COLHDG('R-SPONDA' 'IDR.')
007321070711     A            APD2RTPA  R               REFFLD($FLA)
007322070712     A                                      TEXT('R-TIPO AUTOM:A=AUTOTRENO-
007323070712     A                                      /B=BILICO/M=MOTRICE/BLANK=NO')
007324070712     A                                      COLHDG('R-TIPO' 'AUT.')
007325070716     A            APD2PSF   R               REFFLD($PER)
007326070716     A                                      TEXT('LIBERO')
007400070219     A            APD2FLR       30A         TEXT('FILLER')
