000100941214     A*---------------------------------------------------------------*
000200941214     A*  VARIAZIONE BOLLE                       ERRORI
000300990907     A*  -- TASSAZIONE
000400941214     A*---------------------------------------------------------------*
000500990907     A                                      REF(FIARBT0F)
000600990907     A          R FIARBT00                  TEXT('VARIAZ.BOLLE :+
000700990907     A                                       TASSAZIONE')
000800990907     A            ARBATB    R               REFFLD(ARBATB)
000900990907     A            ARBAAS    R               REFFLD(ARBAAS)
001000990907     A            ARBLNP    R               REFFLD(ARBLNP)
001100990907     A            ARBNRS    R               REFFLD(ARBNRS)
001200990907     A            ARBNSP    R               REFFLD(ARBNSP)
001300990907     A            ARBTRC    R               REFFLD(ARBTRC)
001400990907     A            ARBCBO    R               REFFLD(ARBCBO)
001500990907     A*
001600990907     A            ARBDTV    R               REFFLD(ARBDTV)
001700990907     A            ARBORV    R               REFFLD(ARBORV)
001800990907     A            ARBCVB    R               REFFLD(ARBCVB)
001900990907     A            ARBPRU    R               REFFLD(ARBPRU)
002000990907     A*
002100990907     A            ARBKSC    R               REFFLD(ARBKSC)
002200990907     A            ARBCTR    R               REFFLD(ARBCTR)
002300990907     A* QUANTITA' DA FATTURARE
002400990907     A            ARBQFT    R               REFFLD(ARBQFT)
002500990907     A* VALORE MERCE DICHIARATO
002600990907     A            ARBVMD    R               REFFLD(ARBVMD)
002700990907     A            ARBVAD    R               REFFLD(ARBVAD)
002800990907     A* IMPORTO DA ASSICURARE
002900990907     A            ARBIAS    R               REFFLD(ARBIAS)
003000990907     A            ARBVAS    R               REFFLD(ARBVAS)
003100990907     A            ARBIAP    R               REFFLD(ARBIAS)
003200990907     A                                      TEXT('IMP.DA ASSIC.PRECED.')
003300990907     A                                      COLHDG('IMP.ASS.' 'PRECED.')
003400990907     A            ARBVAP    R               REFFLD(ARBVAS)
003500990907     A                                      TEXT('VAL.IMP.ASS.PRECED.')
003600990907     A                                      COLHDG('VAL.IMP.' 'ASS.' 'PRECED.')
003700990907     A            ARBFCP    R               REFFLD(TASFCM TITAS00F)
003800990907     A                                      TEXT('F=ARBIAP IMMESSO DALLA FATTUR-
003900990907     A                                      AZIONE')
004000990907     A                                      COLHDG('IAS PRECED.' 'DA FATTURAZ')
004100990907     A* TASSAZIONE
004200990907     A            ARBDIV    R               REFFLD(ARBDIV)
004300990907     A            ARBPOR    R               REFFLD(ARBPOR)
004400990907     A            ARBSV1    R               REFFLD(ARBSV1)
004500990907     A            ARBVA1    R               REFFLD(ARBVA1)
004600990907     A            ARBSV2    R               REFFLD(ARBSV2)
004700990907     A            ARBVA2    R               REFFLD(ARBVA2)
004800990907     A            ARBSV3    R               REFFLD(ARBSV3)
004900990907     A            ARBVA3    R               REFFLD(ARBVA3)
005000990907     A            ARBIMV    R               REFFLD(ARBIMV)
005100991013     A            ARBFIM    R               REFFLD(ARBFIM)
005200990907     A            ARBALI    R               REFFLD(ARBALI)
005300990907     A            ARBCEI    R               REFFLD(ARBCEI)
005400990907     A            ARBIFT    R               REFFLD(ARBIFT)
005500990907     A            ARBDFT    R               REFFLD(ARBDFT)
005600990907     A            ARBNFT    R               REFFLD(ARBNFT)
005700990907     A            ARBFIV    R               REFFLD(ARBFIV)
005800990907     A            ARBLNA    R               REFFLD($LNA CNDIZION)
005900990907     A            ARBFEV    R               REFFLD($FEV CNDIZION)
006000990907     A            ARBDAT    R               REFFLD($DA8 CNDIZION)
006100990907     A                                      TEXT('DATA STAMPA ERRORE')
006200990907     A            ARBDER        35A         TEXT('DESCRIZIONE ERRORE')
006300990907     A            ARBVAR         1A         TEXT('R=VARIA R')
