000100890907     A*---------------------------------------------------------------*
000200060207     A*  ARCHIVIO TRASMISSIONE ESTENSIONE DESCRIZIONI BOLLE
000300900526     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500890907     A                                      REF(CNDIZION)
000600900327     A*
000700060207     A          R FIAR4000                  FORMAT(FIAR400F)
