000100890907     A*---------------------------------------------------------------*
000200010103     A*  ARCHIVIO RICEZIONE    BOLLE ARRIVO CONSEGNATE  X SEDE       -*
000300911108     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500890907     A                                      REF(CNDIZION)
000600900327     A*
000700010103     A          R FIARBR00                  TEXT('ARCHIVIO RICEZIONE BOLLE +
000800010103     A                                      ARRIVO CONSEGNATE')
000900010103     A            ARBLNP    R               REFFLD($LNP)
001000010103     A            ARBAAS    R               REFFLD($AAS)
001100010103     A            ARBNRS    R               REFFLD($NRS)
001200010103     A            ARBNSP    R               REFFLD($NSP)
001300010103     A*
001400010103     A            ARBDTI    R               REFFLD($DTI)
001500010103     A            ARBHTI    R               REFFLD($HTI)
001600010103     A            ARBDCE    R               REFFLD($DCE)
001700010103     A            ARBNPI    R               REFFLD($NPI)
001800010103     A            ARBNCI    R               REFFLD($NCI)
001900010103     A            ARBNRC    R               REFFLD($NRC)
002000010103     A            ARBDPC    R               REFFLD($DPC)
002100010103     A            ARBDUC    R               REFFLD($DUC)
002200010103     A            ARBFLP    R               REFFLD($FLP)
002300010103     A            ARBDET    R               REFFLD($DET)
002400010103     A            ARBDUT    R               REFFLD($DUT)
002500010103     A            ARBDAM    R               REFFLD($DAM)
002600010103     A            ARBNDC    R               REFFLD($NDC)
002700010103     A                                      TEXT('NR.DISTINTA CONSEGNA')
002800010103     A                                      COLHDG('NUM' 'DIST.CONS')
002900010103     A            ARBDDC    R               REFFLD($DDC)
003000010103     A                                      TEXT('DATA DISTINTA CONSEGNA')
003100010103     A                                      COLHDG('DATA' 'DIST.CONS')
003200010103     A            ARBDCP    R               REFFLD($DCP)
003300010103     A            ARBFDS    R               REFFLD($FLA)
003400010103     A                                      TEXT('S= SI DETTAGLIO SEGNACOLLI')
003500010103     A            ARBDCM    R               REFFLD($DCM)
003600010103     A            ARBHMC    R               REFFLD($HMC)
003700010103     A            ARBCCA    R               REFFLD($CCA)
003800010103     A            ARBTMC    R               REFFLD($TMC)
003900010103     A            ARBFAG    R               REFFLD($FLA)
004000010103     A                                      TEXT('FL.AGGIOR.:" "=NORM.,D=B.DIRO+
004100010103     A                                      T.,O=B.ORIGINALE')
004200010103     A            ARBPDC    R               REFFLD($PDR)
004300010103     A                                      TEXT('PADRON.DIST.CONSEGNA')
004400010103     A                                      COLHDG('PAD' 'DIST.CONS')
