000100890907     A*---------------------------------------------------------------*
000200060207     A*  BOLLE: ESTENSIONE DESCRIZIONI .ERRORI SEDE
000300890907     A*---------------------------------------------------------------*
000400910924     A                                      REF(CNDIZION)
000500910924     A*
000600060207     A          R FIAR4000                  FORMAT(FIAR400T)
