000100890907     A*---------------------------------------------------------------*
000200990906     A*  ARCHIVIO TRASMISSIONE ESTENSIONE TASSAZ. BOLLA BOLLE ARRIVI
000300900526     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500890907     A                                      REF(CNDIZION)
000600900327     A*
000700990906     A          R FIAR7000                  FORMAT(FIAR700F)
