000100890907     A*---------------------------------------------------------------*
000200940720     A*  VARIAZIONE BOLLE
000300990830     A*  -- ESTENSIONE TASSAZIONE BOLLA
000400890907     A*---------------------------------------------------------------*
000500890907     A                                      REF(CNDIZION)
000600900327     A*
000700990830     A          R FIARBU00                  TEXT('VARIAZ.BOLLE :+
000800990830     A                                       ESTENS.TASSAZIONE')
000900910417     A            ARBAAS    R               REFFLD($AAS)
001000940630     A            ARBLNP    R               REFFLD($LNP)
001100910417     A            ARBNRS    R               REFFLD($NRS)
001200910417     A            ARBNSP    R               REFFLD($NSP)
001300990830     A            ARBTRC    R               REFFLD($TRC)
001400990830                                            TEXT('TIPO RECORD BOLLA: 1-1 BOLLA -
001500990830                                            2-2 BOLLA')
001600940701     A            ARBDTV    R               REFFLD($DTV)
001700940701     A            ARBORV    R               REFFLD($ORV)
001800911113     A*
001900940701     A            ARBSVN    R               REFFLD($SVN)
002000940701     A            ARBVAN    R               REFFLD($VAN)
