000100940712     A*------------------------------------------------------------------------*
000200990915     A*  ARCHIVIO BOLLE FILILE   "INCASSI"                                     *
000300940712     A*------------------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500900327     A*
000600990917     A          R FIARI000                  TEXT('ARCHIVIO BOLLE FILIALE "INCAS-
000700990915     A                                      SI"')
000800990915     A            ARIATB    R               REFFLD($ATB)
000900990915     A            ARIAAS    R               REFFLD($AAS)
001000990915     A                                      EDTCDE(Z)
001100990915     A            ARILNP    R               REFFLD($LNP)
001200990915     A                                      EDTCDE(Z)
001300990915     A            ARINRS    R               REFFLD($NRS)
001400990915     A                                      EDTCDE(Z)
001500990915     A            ARINSP    R               REFFLD($NSP)
001600990915     A                                      EDTCDE(Z)
001700990915     A            ARITIP         1A         TEXT('TIPO INC. A=ASSEGNATO C=C/ASS+
001800990915     A                                      EGNO')
001900940615     A*
002000990915     A            ARIDIV    R               REFFLD($DIV)
002100990915     A                                      TEXT('DIVISA INCASSO')
002200990915     A            ARIIMP    R               REFFLD($IPP)
002300990915     A                                      TEXT('IMP.INC.:C/ASS.SE DIV +
002400990915     A                                      <>, ASS. PARZ. O DIV. <>')
002500990915     A                                      COLHDG('IMP.INCASS.')
002600990915     A                                      EDTCDE(K)
002700990915     A            ARIIPP    R               REFFLD($IPP)
002800990915     A                                      TEXT('IMP.PROGR.INCASSATO PER AS+
002900990915     A                                      SEGNATO')
003000990915     A                                      COLHDG('IMP.PRG.INC.')
003100990915     A                                      EDTCDE(K)
