000100890907     A*---------------------------------------------------------------*
000200060207     A*  ARCHIVIO TRASMISSIONE ESTENSIONE DESCRIZIONI BOLLE
000300060207     A*    A SEDE
000400900526     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000500890907     A*---------------------------------------------------------------*
000600890907     A                                      REF(CNDIZION)
000700900327     A*
000800060207     A          R FIAR4000                  FORMAT(FIAR400F)
