000100040513      *--------------------------------------------------------------*
000200060807      *  L.F. ESTENSIONE TESTATA GEO-REFERENZIAZIONE E GIRI CONS.    *
000300040513      *  =========================================================   *
000800040513      *--------------------------------------------------------------*
001000060807     A          R FIARG000                  PFILE(FIARG00F)
001100070208     A          K ARGFGS
001200070208     A          K ARGNDC
001300070208     A          K ARGDDC
