000100021125      *---------------------------------------------------------------*
000200021203      *  BOLLE: ESTENSIONE TESTATA     --ARCHIVIO ERRORI--
000300021125      *---------------------------------------------------------------*
000400021203     A                                      REF(CNDIZION)
000500021203     A*
000600021203     A          R FIAR5000                  FORMAT(FIAR500F)
