000100890907     A*---------------------------------------------------------------*
000200910924     A*  ARCHIVIO RICEZIONE A SEDE BOLLE PARTENZA
000300941231     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500910924     A                                      REF(CNDIZION)
000600910924     A*
000700990914     A          R FIBLPA00                  FORMAT(FIBLPA0T)
