000100131121      *---------------------------------------------------------------*
000101151210      *  V.L. PER FILIALE/CLIENTE
000800131121      *---------------------------------------------------------------*
001000131121      *
001001150511     A                                      UNIQUE
001100151210     A          R FIBSP100                  PFILE(FIBSP10F)
001200131121      *
001400151210     A          K BS1FIL
001500151210     A          K BS1KSC
