000200060330     A          R FIDPI000
000300060330     A                                      PFILE(FIDPI00F)
000400060330     A          K DPIKNRAZ
000401060330     A          K DPIAAS
000402060330     A          K DPILNP
000403060330     A          K DPINRS
000404060330     A          K DPINSP
