000100991115      *---------------------------------------------------------------*
000200991129      *  BOLLE DPD: DATI RICEVUTI DA DPD - ERRORI
000300991115      *---------------------------------------------------------------*
000400991115      *
000500991129     A          R FIDPD000                  TEXT('BOLLE DPD: RICEVUTE DA DPD - -
000600991129                                            ERRORI')
000700991115      *
000800991129     A            DPDUNI       200          TEXT('CAMPO UNICO')
000900991129                                            COLHDG('CAMPO UNICO')
001000991129     A            DPDERR        50          TEXT('DESCRIZIONE ERRORE')
001100991129                                            COLHDG('DESCRIZIONE ERRORE')
