000100991115      *---------------------------------------------------------------*
000200991129      *  BOLLE DPD: DATI RICEVUTI DA DPD
000300991115      *---------------------------------------------------------------*
000400991115      *
000500991129     A          R FIDPD000                  TEXT('BOLLE DPD: RICEVUTE DA DPD')
000600991115      *
000700991129     A            DPDUNI       200          TEXT('CAMPO UNICO')
000800991129                                            COLHDG('CAMPO UNICO')
