000100991115      *---------------------------------------------------------------*
000200021209      *  FILE D'APPOGGIO PER TRASMISSIONE DATE A PAR/ARR/SEDE
000300021209      *    -- FILE PER TRASMISSIONE --
000400021209      *     MBR=*NONE  -  MAXMBRS=*NOMAX
000500991115      *---------------------------------------------------------------*
000600000131     A                                      REF(CNDIZION)
000700021209     A          R FIDTA000                  FORMAT(FIDTA00F)
