000100000000     A*--------------------------------------------------------------*
000200020517     A*  L.F. SU DETTAGLIO VOCI C/E COSTI                            *
000300000000     A*--------------------------------------------------------------*
000400020326     A          R FIFCE000                  PFILE(FIFCE00F)
000500020129      *
000600020626     A          K FCEDDC
000700940920     A**
000800940920     A**  INDICI PER:
000900020626     A**  - DATA DOCUMENTO
