000100021030     A          R FIFEI00W
000200020219     A
000300021030     A            WRKDAT       250A         TEXT('CMP UNICO X IMPORTARE STATI')
000400020621     A*
000500021030     A* RICEVUTI DA FEDEX INFORMAZIONI DI FATTURAZIONE BOLLE EXPORT
