000100021016     A          R FIFES00W
000200020219     A
000300021016     A            WRKDAT       500A         TEXT('CMP UNICO X IMPORTARE STATI')
000400020621     A*
000500020621     A* RICEVUTI DA FEDEX INFORMAZIONI DI CONSEGNA NOSTRE BOLLE EXPORT
