000100000000     A*--------------------------------------------------------------*
000200020306     A*  ARCHIVIO RETTIFICHE AI CONTEGGI PADRONCINI
000300000000     A*--------------------------------------------------------------*
000400020315     A*
000500020315     A          R FIFRE000                  PFILE(FIFRE00F)
000600020315     A*
000700020315     A          K FREDDC
000800020315     A          K FRECRE
000900020315     A          K FREPNO
