000100000000     A*--------------------------------------------------------------*
000200931005     A*  ARCHIVIO DETTAGLIO TASSAZIONE PADRONCINI (FORNITORI)
000300000000     A*--------------------------------------------------------------*
000400931005     A                                      REF(CNDIZION)
000500020328     A          R FIFTDW00
000600020328     A*
000700020328     A            FTWFGS    R               REFFLD($FGS)
000800020328     A            FTWPDR    R               REFFLD($PDR)
000900020328     A            FTWTSR    R               REFFLD($TSR)
001000020328     A            FTWNDC    R               REFFLD($NDC)
001100020328     A            FTWDDC    R               REFFLD($DDC)
001200011025     A                                      TEXT('DATA DOCUMENTO')
001300011025     A                                      COLHDG('DATA' 'DOCUM')
001400020328     A            FTWSTP    R               REFFLD($STP)
001500020328     A                                      TEXT('NUMERO STOP')
001600020328     A            FTWAAS    R               REFFLD($AAS)
001700020328     A            FTWLNP    R               REFFLD($LNP)
001800020328     A            FTWNRS    R               REFFLD($NRS)
001900020328     A            FTWNSP    R               REFFLD($NSP)
002000020328     A            FTWPKL    R               REFFLD($PKL)
002100931126     A                                      TEXT('PESO RELATIVO AI COLLI +
002200931126     A                                      CONSEGNABILI/RITIRATI')
002300931126     A                                      COLHDG('PESO' 'DEI COLLI' 'CONS/RI')
002400020328     A            FTWVLU    R               REFFLD($VLU)
002500931126     A                                      TEXT('VOLUME RELATIVO AI COLLI +
002600931126     A                                      CONSEGNABILI/RITIRATI')
002700931126     A                                      COLHDG('VOL' 'DEI COLLI' 'CONS/RIT')
