000100040513      *--------------------------------------------------------------*
000200070124      *  - L.F. X CODICE GIRO
000300040513      *--------------------------------------------------------------*
000500070111     A          R FIGRG000                  PFILE(FIGRG00F)
000601070123     A          K GRGFGS
000700070124     A          K GRGCGI
000800070123     A          K GRGDDE
