000100070111     A*---------------------------------------------------------------*
000200070111     A*  GEO-REFERENZIAZIONE: ANAGRAFICA GIRI                         *
000300070111     A*---------------------------------------------------------------*
000400070111     A                                      REF(CNDIZION)
000500070111     A*
000600070111     A          R FIGRG000                  TEXT('GEO-REFERENZIAZIONE: ANAGRAFI-
000700070111     A                                      CA GIRI CONSEGNA')
000800070111     A*
000900070111     A            GRGATB    R               REFFLD($ATB)
001000070124     A            GRGDDE    R     S         REFFLD($DDE)
001100070112     A                                      TEXT('DATA DECORRENZA')
001200070112     A                                      COLHDG('DECORRENZA')
001300070124     A            GRGDSCAD  R     S         REFFLD($DSCAD)
001400070112     A                                      TEXT('DATA SCADENZA')
001500070112     A                                      COLHDG('SCADENZA')
001600070112     A            GRGFGS    R     S         REFFLD($LNA)
001700070112     A                                      TEXT('P.O. GESTIONE')
001800070112     A                                      COLHDG('P.O. GESTIONE')
001900070124     A            GRGCGI    R               REFFLD($CGI)
002000070124     A                                      TEXT('CODICE GIRO')
002100070124     A                                      COLHDG('CODICE GIRO')
002200070111     A            GRGAIN         1A         TEXT('AMBITO INSTRADAMENTO')
002300070111     A                                      COLHDG('AMBITO INSTRADAMENTO')
002400070119     A            GRGDES        30A
002500070111     A                                      TEXT('DESCRIZIONE GIRO')
002600070111     A                                      COLHDG('DESCRIZIONE GIRO')
002700070111     A            GRGACT         1A
002800070111     A                                      TEXT('FLAG GIRO ATTIVO')
002900070111     A                                      COLHDG('FLAG GIRO ATTIVO')
003000070111     A            GRGDUV    R               REFFLD($DUV)
003100070112     A                                      TEXT('DATA INSERIMENTO/MODIFICA')
003200070112     A                                      COLHDG('DATA INS/MOD')
003300070112     A            GRGUTE    R               REFFLD($PRU)
003400070112     A                                      TEXT('UTENTE INSERIMENTO/MODIFICA')
003500070112     A                                      COLHDG('UTENTE INS/MOD')
003600070112     A            GRGFTT         1A
003700070112     A                                      TEXT('FLAG TRASMISSIONE A TELLUS')
003800070112     A                                      COLHDG('FLAG TRASM. A TELLUS')
003900070111     A            GRGFLO    R               REFFLD($FLO)
004000070111     A                                      TEXT('USI FUTURI')
004100070111     A                                      COLHDG('USI FUTURI')
