000100060131     A          R FIINC000
000200060127     A                                      PFILE(FIINC00F)
000300060323     A          K INCSESSION
