000100060210     A          R FIINC000
000200060210     A                                      PFILE(FIINC00F)
000300060210     A          K INCFIV
000400060210     A          K INCDFT
000500060210     A          K INCNFT
