000100170522      *---------------------------------------------------------------*
000200170522      *?MERCE INCOMPATIBILE - POSTAZIONI.                            ?*
000300170522      *---------------------------------------------------------------*
000400170522     A                                      REF(CNDIZION)
000500170522      *
000600170522     A          R FIMIP000                  TEXT('MERCE INCOMPATIBILE:-
000700170522     A                                       POSTAZIONI')
000800170522      *
000900170524     A            MIPFIL    R               REFFLD($FIL)
001000170524     A            MIPNPG    R               REFFLD($NPG)
001100170524     A            MIPTIP    R               REFFLD($FLA)
001200170524     A                                      TEXT('TIPO POSTAZIONE: -
001300170524     A                                      P=PISTOLA, F=FISSA/WIFI')
001400170524     A                                      COLHDG('TIPO POST' +
001500170524     A                                             'PIST,FISS')
001600170522     A            MIPPEP    R               REFFLD(§MSLPEP    DMSL)
001700170522     A                                      COLHDG('POSTAZIONE')
001800170524     A            MIPDTI    R               REFFLD($DA8)
001900170524     A                                      TEXT('DATA INIZIO VALIDITÀ-
002000170524     A                                      ')
002100170524     A                                      COLHDG('DATA INI' +
002200170524     A                                             'VALIDITÀ')
002300170524     A                                      EDTWRD('    -  -  ')
002400170524     A            MIPDTF    R               REFFLD($DA8)
002500170524     A                                      TEXT('DATA FINE VALIDITÀ')
002600170524     A                                      COLHDG('DATA FIN' +
002700170524     A                                             'VALIDITÀ')
002800170524     A                                      EDTWRD('    -  -  ')
002900170523     A            MIPHMI    R               REFFLD($HM)
003000170524     A                                      TEXT('ORE/MINUTI INIZIO LE-
003100170524     A                                      TTURE')
003200170524     A                                      COLHDG('HM INIZ' +
003300170524     A                                             'LETTURE')
003400170523     A                                      EDTWRD('  :  ')
003500170523     A            MIPHMF    R               REFFLD($HM)
003600170524     A                                      TEXT('ORE/MINUTI FINE LETT-
003700170524     A                                      URE')
003800170524     A                                      COLHDG('HM FINE' +
003900170524     A                                             'LETTURE')
004000170523     A                                      EDTWRD('  :  ')
