000100061227      *--------------------------------------------------------------*
000200080227      *  PDA - CODICE FISCALE E PARTITA IVA DA PDA
000300061227      *--------------------------------------------------------------*
000400080227     A          R FIPCI000                  PFILE(FIPCI00F)
000500080227     A          K PCIPOE
000600080227     A          K PCINSR
000700080227     A          K PCINOR
000800080227     A          K PCINRV
