000100061030      *--------------------------------------------------------------*
000200080305      *  PDA - RITORNO ESITI DETTAGLIO COLLI
000300061030      *--------------------------------------------------------------*
000400061219     A                                      REF(CNDIZION)
000500080305     A          R FIPCD000                  TEXT('PDA-RITORNO ESITI DETT.COLLI')
000501080305     A            PCDATB    R               REFFLD($ATB)
000502080227     A            PCDFGS    R               REFFLD($FGS)
000503080227     A            PCDNDC         6  0       TEXT('NUMERO DISTINTA')
000600080227     A            PCDAAS    R               REFFLD($AAS)
000700080227     A            PCDLNP    R               REFFLD($LNP)
000800080227     A            PCDNRS    R               REFFLD($NRS)
000900080227     A            PCDNSP    R               REFFLD($NSP)
000901080227     A            PCDFLS    R               REFFLD($FLS)
000902080227     A            PCDLNA    R               REFFLD($LNA)
000903080227     A            PCDNRSER  R               REFFLD($NRS)
000904080227     A            PCDNSC    R               REFFLD($NSC)
001100080227     A            PCDTRD    R               REFFLD($TRD)
001101080305     A                                      TEXT('TIPO RECORD-ESITO')
001401080305     A            PCDDTORIN     14  0       TEXT('ULT. DATA/ORA INS./VAR. -
001402080305     A                                      SU PDA/AS400')
001403080305     A            PCDPDAAS4 R               REFFLD($FLA)
001404080305     A                                      TEXT('INSERITO P=PDA, A=AS400')
001500080305     A            PCDDATI       20          TEXT('DATI RICEVUTI')
