000100061030      *--------------------------------------------------------------*
000200061228      *  PDA - RICEZIONE ESITI ORM
000300061030      *--------------------------------------------------------------*
000400070111     A          R FIPRC000                  TEXT('PDA - RICEZIONE ESITI ORM')
000500070111     A            PRCTIPORCD     3A         TEXT('TIPO RECORD')
000600070111     A            PRCPRFC       10A         TEXT('PROFILO CONNESSIONE')
000700070111     A            PRCIDDISP     35A         TEXT('ID DISPOSITIVO')
000800070111     A            PRCDATI      250A         TEXT('DATI RICEVUTI DA PDA')
000900070111     A            PRCDATORA     14A         TEXT('DATA/ORA RICEZIONE DATI AAAAM-
001000061030                                            MGGHHMMSS')
