000100950522     A*---------------------------------------------------------------*
000200040928     A*    QUADRATURE AUT - BOLLETTATO  TESTATA                       *
000300950522     A*---------------------------------------------------------------*
000400950522     A                                      REF(CNDIZION)
000500041005     A          R FIQBT000                  TEXT('QUADRATURE AUT - BOLLETTATO')
000600040928     A            QBTATB    R               REFFLD($ATB)
000700040928     A            QBTFGS    R               REFFLD($FGS)
000800040928     A            QBTDDC    R               REFFLD($DDC)
000900040928     A                                      TEXT('DATA DISTINTA')
001000040928     A                                      COLHDG('DATA' 'DISTINTA')
001100040928     A            QBTPDR    R               REFFLD($PDR)
001200040928     A*
001300040928     A            QBTNCLBO  R               REFFLD($NCL)
001400040928     A                                      TEXT('NUMERO COLLI BOLLETTATI ')
001401050207     A                                      COLHDG('NR.COLLI' 'BOLLETT.')
001500040928     A            QBTNSPBO  R               REFFLD($NBL)
001600040928     A                                      TEXT('NUMERO SPEDIZ. BOLLETTATE ')
001601050207     A                                      COLHDG('NR.SPED.' 'BOLLETT.')
001700041005     A            QBTPKFBO  R+   2          REFFLD($PKF)
001800040928     A                                      TEXT('PESO DEI COLLI BOLLETTATI')
001801050207     A                                      COLHDG('PESO COLLI' 'BOLLETT.')
001900041005     A            QBTVLFBO  R+   2          REFFLD($VLF)
002000040928     A                                      TEXT('VOLUME COLLI BOLLETTATI')
002001050207     A                                      COLHDG('VOL. COLLI' 'BOLLETT.')
002100041025     A            QBTDAEBO  R               REFFLD($DA8)
002200040928     A                                      TEXT('DATA ELAB.BOLLETTATO')
002201050207     A                                      COLHDG('DATA ELAB.' 'BOLLETT.')
002300040928     A            QBTORABO  R               REFFLD($HM)
002400040928     A                                      TEXT('ORA/MIN ELAB. BOLLETTATO')
002401050207     A                                      COLHDG('ORA/MIN.' 'EL.BOLLETT.')
002500041005     A*
002600041005     A            QBTFLO    R               REFFLD($FLO)
002700050207     A                                      TEXT('FILLER')
002800050207     A                                      COLHDG('FILLER')
