000100950522     A*---------------------------------------------------------------*
000200040928     A*    QUADRATURE AUT - DISTINTE CONSEGNA - DETTAGLIO             *
000300950522     A*---------------------------------------------------------------*
000400950522     A                                      REF(CNDIZION)
000500041005     A          R FIQDC000                  TEXT('QUADRATURE AUT -DISTINTE -
000600040928     A                                      CONSEGNA/ORM')
000700040928     A            QDCATB    R               REFFLD($ATB)
000800040928     A            QDCFGS    R               REFFLD($FGS)
000900040928     A            QDCNFV    R               REFFLD($NFV)
001000950522     A                                      TEXT('NUMERO DISTINTA')
001100950522     A                                      COLHDG('NUM' 'DISTINTA')
001200040928     A            QDCDDC    R               REFFLD($DDC)
001300040928     A                                      TEXT('DATA DISTINTA')
001400040928     A                                      COLHDG('DATA' 'DISTINTA')
001500040928     A            QDCPDR    R               REFFLD($PDR)
001600040928     A*
001700040928     A            QDCAAS    R               REFFLD($AAS)
001800040928     A            QDCLNP    R               REFFLD($LNP)
001900040928     A            QDCNRS    R               REFFLD($NRS)
002000040928     A            QDCNSP    R               REFFLD($NSP)
002100040928     A            QDCNCL    R               REFFLD($NCL)
002200040928     A                                      TEXT('NUMERO COLLI SPED.')
002300040928     A            QDCFLS    R               REFFLD($FLS)
002400040928     A            QDCNSC    R               REFFLD($NSC)
002500040928     A            QDCLNA    R               REFFLD($LNA)
002600040928     A            QDCCEV    R               REFFLD($CEV)
002700040928     A            QDCNSPRI  R               REFFLD($FLA)
002800040928     A                                      TEXT('NO SPUNTA RIENTRO CAT "8"')
002900041005     A*
003000041005     A            QDCFLO    R               REFFLD($FLO)
003100041112     A            QDCTSP    R               REFFLD($TSP)
