000100890907     A*---------------------------------------------------------------*
000200961003     A*  Archivio di Work x EDI memorizzazione dati quadratura entrata*
000300890907     A*---------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500900327     A*
000600100621     A          R FIQEM000
000700100618     A*
000800100618     A            QEMFLG         1A         TEXT('FLAG ANNULLAMENTO')
000900100618     A*
001000100618     A            QEMCCM    R               REFFLD($CCM)
001100100618     A*
001200100618     A            QEMAAS    R               REFFLD($AAS)
001300100618     A            QEMLNP    R               REFFLD($LNP)
001400100618     A            QEMNRS    R               REFFLD($NRS)
001500100618     A            QEMNSP    R               REFFLD($NSP)
001600100618      *
001700100618     A            QEMLNA    R               REFFLD($LNA)
001800100618     A            QEMFLS    R               REFFLD($FLS)
001900100618     A            QEMZNC    R               REFFLD($ZSC)
002000100618     A            QEMNSC    R               REFFLD($NSC)
002100100618      *
002200100618     A            QEMNPS    R               REFFLD($NPS)
002300100618     A            QEMDCS    R               REFFLD($DCS)
002400000209     A                                      TEXT('DATA IMM./VARIAZ. SPUNTA')
002500100618     A            QEMHCS    R               REFFLD($HCS)
002600000209     A                                      TEXT('ORA  IMM./VARIAZ. SPUNTA')
002700100618     A            QEMDFE    R               REFFLD($DA8)
002800100715     A            QEMNFE    R               REFFLD($NFV)
002900100715      *
003000100715     A            QEMSTS         3A         TEXT('CODICE ERRORE')
003100100715     A            QEMCAN    R               REFFLD($CAN)
003200100618      *
003300100618     A            QEMRMA    R               REFFLD($RMA)
003400100618     A            QEMRMN    R               REFFLD($RMN)
003500100714     A            QEMCHI    R               REFFLD($CHI)
003600100618      *
003700100618     A            QEMCMR        35A         TEXT('CMR DI RIFERIMENTO')
003800100618      *
