000100000000     A*--------------------------------------------------------------*
000200000128     A*  L.F. ARCHIVIO COLLI DISK 'C'                                *
000300000000     A*--------------------------------------------------------------*
000400000208     A          R FISGN000                  PFILE(FISGN00F)
000500900524      *
000600000209     A          K SGNFLS
000700000209     A          K SGNLNA
000800000209     A          K SGNNRS
000900000209     A          K SGNNCD
