000100000000     A*--------------------------------------------------------------*
000200000128     A*  L.F. ARCHIVIO COLLI DISK 'C'                                *
000300000000     A*--------------------------------------------------------------*
000400000208     A          R FISGN000                  PFILE(FISGN00F)
000500900524      *
000600001228     A          K SGNTNP
000700080623     A          K SGNDATORA
000800001228     A          K SGNWHO
