000100000000     A*------------------------------------------------------------------------*
000200000000     A*  ARCHIVIO PER STATISTICHE SUL PARTITO
000300000000     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500090911     A          R FISPA000                  TEXT('STATISTICHE SUL PARTITO')
000600000000     A            SPAFLE    R               REFFLD($FLE)
000700000000     A            SPALNP    R               REFFLD($LNP)
000800970128     A            SPADRE    R               REFFLD($DA8)
000900000000     A            SPATRE    R               REFFLD($TIPO)
001000000000     A                                      TEXT('TIPO RECORD: C=C/SERV. T=TRAN-
001100970204     A                                      SITO '' ''=NORMALE F=FESTIVO')
001200000000     A                                      COLHDG('TIPO' 'RECORD')
001300000000      * ---- COLLI ----
001400970129     A            SPACPE         7P 0       TEXT('NR.COLLI PART.(ESPRESSO)')
001500970128     A                                      COLHDG('COLLI' 'PARTITI' 'ESPR.')
001600970129     A            SPACPC         7P 0       TEXT('NR.COLLI PART.(CORRIERE)')
001700970128     A                                      COLHDG('COLLI' 'PARTITI' 'CORR.')
001800970129     A            SPACPD         7P 0       TEXT('NR.COLLI PART.(DISTRIB.)')
001900970128     A                                      COLHDG('COLLI' 'PARTITI' 'DISTR.')
002000090911     A            SPACPH         7P 0       TEXT('NR.COLLI PART.(H 1030 )')
002100090911     A                                      COLHDG('COLLI' 'PARTITI' 'H1030')
002200090911     A            SPACPX         7P 0       TEXT('NR.COLLI PART.(USI FUTURI)')
002300090911     A                                      COLHDG('COLLI' 'PARTITI' 'FUTURO')
002400000000      * ---- SPUNTE ----
002500970129     A            SPA88B         7P 0       TEXT('COLLI NON SPUNTATI IN PARTENZ-
002600970128     A                                      A DISK B (PIST. 88)')
002700970128     A                                      COLHDG('COLLI' 'NON SPUN.PART.' 'DI-
002800970128     A                                      SKB')
002900970129     A            SPA88A         7P 0       TEXT('ALTRI COLLI NON SPUNTATI IN P-
003000970128     A                                      ARTENZA  (PIST. 88)')
003100970128     A                                      COLHDG('ALTRI' 'COLLI' 'NON SPUN.PA-
003200970128     A                                      RT.')
003300970129     A            SPA87B         7P 0       TEXT('COLLI RISPUNTATI IN PART. DIS-
003400970129     A                                      KB (PIST.87)')
003500970129     A                                      COLHDG('COLLI' 'PIST.87' 'DISKB')
003600970129     A            SPA87A         7P 0       TEXT('ALTRI COLLI RISPUNTATI IN PAR-
003700970129     A                                      T. (PIST.87)')
003800970129     A                                      COLHDG('ALTRI' 'COLLI' 'PIST.87')
003900000000      * ---- PESI ----
004000000000     A            SPAPFE         9P 1       TEXT('TOTALE PESO FINO A 35 QUINTAL-
004100970128     A                                      I (ESPRESSO)')
004200000000     A                                      COLHDG('PESO' 'FINO 35Q' 'ESPR.')
004300970129     A            SPAPFC         9P 1       TEXT('TOTALE PESO FINO A 35 QUINTAL-
004400970128     A                                      I (CORRIERE)')
004500970128     A                                      COLHDG('PESO' 'FINO 35Q' 'CORR.')
004600970129     A            SPAPFD         9P 1       TEXT('TOTALE PESO FINO A 35 QUINTAL-
004700970128     A                                      I (DISTRIB.)')
004800970128     A                                      COLHDG('PESO' 'FINO 35Q' 'DISTR.')
004900090911     A            SPAPFH         9P 1       TEXT('TOTALE PESO FINO A 35 QUINTAL-
005000090911     A                                      I (H1030)')
005100090911     A                                      COLHDG('PESO' 'FINO 35Q' 'H1030')
005200090911     A            SPAPFX         9P 1       TEXT('TOTALE PESO FINO A 35 QUINTAL-
005300090911     A                                      I (USI FUTURI)')
005400090911     A                                      COLHDG('PESO' 'FINO 35Q' 'FUTURO')
005500090911     C
005600970129     A            SPAPOE         9P 1       TEXT('TOTALE PESO OLTRE 35 QUINTALI-
005700970129     A                                       (ESPRESSO)')
005800970129     A                                      COLHDG('PESO' 'OLTRE 35Q' 'ESPR.')
005900970129     A            SPAPOC         9P 1       TEXT('TOTALE PESO OLTRE 35 QUINTALI-
006000970129     A                                       (CORRIERE)')
006100970129     A                                      COLHDG('PESO' 'OLTRE 35Q' 'CORR.')
006200970129     A            SPAPOD         9P 1       TEXT('TOTALE PESO OLTRE 35 QUINTALI-
006300970129     A                                       (DISTRIB.)')
006400970129     A                                      COLHDG('PESO' 'OLTRE 35Q' 'DISTR.')
006500090911     A            SPAPOH         9P 1       TEXT('TOTALE PESO OLTRE 35 QUINTALI-
006600090911     A                                       (H1030)')
006700090911     A                                      COLHDG('PESO' 'OLTRE 35Q' 'H1030')
006800090911     A            SPAPOX         9P 1       TEXT('TOTALE PESO OLTRE 35 QUINTALI-
006900090911     A                                       (USI FUTURI')
007000090911     A                                      COLHDG('PESO' 'OLTRE 35Q' 'FUTURO')
007100090911     A
007200000000     A            SPAPTA         9P 1       TEXT('TOTALE PESO TASSABILE')
007300000000     A                                      COLHDG('PESO' 'TASSABILE')
007400000000      * ---- VOLUMI ----
007500970129     A            SPAVPE         9P 4       TEXT('TOTALE VOLUME PARTITO (ESPRES-
007600970128     A                                      SO)')
007700970128     A                                      COLHDG('VOLUME' 'PART.' 'ESPR.')
007800970129     A            SPAVPC         9P 4       TEXT('TOTALE VOLUME PARTITO (CORRIE-
007900970128     A                                      RE)')
008000970128     A                                      COLHDG('VOLUME' 'PART.' 'CORR.')
008100970129     A            SPAVPD         9P 4       TEXT('TOTALE VOLUME PARTITO (DISTRI-
008200970129     A                                      B.)')
008300970128     A                                      COLHDG('VOLUME' 'PART.' 'DISTR.')
008400090911     A            SPAVPH         9P 4       TEXT('TOTALE VOLUME PARTITO (H1030)-
008500090911     A                                      ')
008600090911     A                                      COLHDG('VOLUME' 'PART.' 'H1030')
008700090911     A            SPAVPX         9P 4       TEXT('TOTALE VOLUME PARTITO (USI FU-
008800090911     A                                      TURI)')
008900090911     A                                      COLHDG('VOLUME' 'PART.' 'FUTURO')
009000970128      * ---- SPEDIZIONI ----
009100970129     A            SPASPE         7P 0       TEXT('NR.SPEDIZIONI PARTITE (ESPRES-
009200970128     A                                      SO)')
009300970128     A                                      COLHDG('SPEDIZ.' 'PART.' 'ESPR.)')
009400970129     A            SPASPC         7P 0       TEXT('NR.SPEDIZIONI PARTITE (CORRIE-
009500970128     A                                      RE)')
009600970128     A                                      COLHDG('SPEDIZ.' 'PART.' 'CORR.')
009700970129     A            SPASPD         7P 0       TEXT('NR.SPEDIZIONI PARTITE (DISTRI-
009800970128     A                                      B.)')
009900970128     A                                      COLHDG('SPEDIZ.' 'PART.' 'DISTR.')
010000090911     A            SPASPH         7P 0       TEXT('NR.SPEDIZIONI PARTITE (H1030-
010100090911     A                                      )')
010200090911     A                                      COLHDG('SPEDIZ.' 'PART.' 'H1030')
010300090911     A            SPASPX         7P 0       TEXT('NR.SPEDIZIONI PARTITE (USI FU-
010400090911     A                                      TURI)')
010500090911     A                                      COLHDG('SPEDIZ.' 'PART.' 'FUTURO')
010600090911     A
010700970128     A            SPASDE         7P 0       TEXT('NR.SPEDIZIONI DA PARTIRE (ESP-
010800970128     A                                      RESSO)')
010900970128     A                                      COLHDG('SPEDIZ.' 'DA PART.' 'ESPR.')
011000970128     A            SPASDC         7P 0       TEXT('NR.SPEDIZIONI DA PARTIRE (COR-
011100970128     A                                      RIERE)')
011200970128     A                                      COLHDG('SPEDIZ.' 'DA PART.' 'CORR.')
011300970128     A            SPASDD         7P 0       TEXT('NR.SPEDIZIONI DA PARTIRE (DIS-
011400970128     A                                      TRIB.)')
011500970129     A                                      COLHDG('SPEDIZ.' 'DA PART.' 'DISTR.-
011600970129     A                                      ')
011700090911     A            SPASDH         7P 0       TEXT('NR.SPEDIZIONI DA PARTIRE (H10-
011800090911     A                                      30)')
011900090911     A                                      COLHDG('SPEDIZ.' 'DA PART.' 'H1030-
012000090911     A                                      ')
012100090911     A            SPASDX         7P 0       TEXT('NR.SPEDIZIONI DA PARTIRE (USI-
012200090911     A                                       FUTURI)')
012300090911     A                                      COLHDG('SPEDIZ.' 'DA PART.' 'FUTURO-
012400090911     A                                      ')
012500090911
012600970206     A            SPASFE         7P 0       TEXT('NR.SPEDIZIONI PARTITE FUORI A-
012700970206     A                                      FFIDABILITA (ESPRESSO)')
012800970206     A                                      COLHDG('SPED.PART.' 'FUORI AFFID.' -
012900970206     A                                      'ESPR.')
013000970206     A            SPASFC         7P 0       TEXT('NR.SPEDIZIONI PARTITE FUORI A-
013100970206     A                                      FFIDABILITA (CORRIERE)')
013200970206     A                                      COLHDG('SPED.PART.' 'FUORI AFFID.' -
013300970206     A                                      'CORR.')
013400970206     A            SPASFD         7P 0       TEXT('NR.SPEDIZIONI PARTITE FUORI A-
013500970206     A                                      FFIDABILITA (DISTRIB.)')
013600970206     A                                      COLHDG('SPED.PART.' 'FUORI AFFID.' -
013700970206     A                                      'DISTR.')
013800090911     A            SPASFH         7P 0       TEXT('NR.SPEDIZIONI PARTITE FUORI A-
013900090911     A                                      FFIDABILITA (H1030)')
014000090911     A                                      COLHDG('SPED.PART.' 'FUORI AFFID.' -
014100090911     A                                      'H1030.')
014200090911     A            SPASFX         7P 0       TEXT('NR.SPEDIZIONI PARTITE FUORI A-
014300090911     A                                      FFIDABILITA (USI FUTURI)')
014400090911     A                                      COLHDG('SPED.PART.' 'FUORI AFFID.' -
014500090911     A                                      'FUTURO')
014600090911
014700970206     A            SPATFE         7P 0       TEXT('NR.SPEDIZIONI A TERRA FUORI A-
014800970206     A                                      FFIDABILITA (ESPRESSO)')
014900970206     A                                      COLHDG('SPED.TERRA' 'FUORI AFFID.' -
015000970206     A                                      'ESPR.')
015100970206     A            SPATFC         7P 0       TEXT('NR.SPEDIZIONI A TERRA FUORI A-
015200970206     A                                      FFIDABILITA (CORRIERE)')
015300970206     A                                      COLHDG('SPED.TERRA' 'FUORI AFFID.' -
015400970206     A                                      'CORR.')
015500970206     A            SPATFD         7P 0       TEXT('NR.SPEDIZIONI A TERRA FUORI A-
015600970206     A                                      FFIDABILITA (DISTRIB.)')
015700970206     A                                      COLHDG('SPED.TERRA' 'FUORI AFFID.' -
015800970206     A                                      'DISTR.')
015900090911     A            SPATFH         7P 0       TEXT('NR.SPEDIZIONI A TERRA FUORI A-
016000090911     A                                      FFIDABILITA (H1030)')
016100090911     A                                      COLHDG('SPED.TERRA' 'FUORI AFFID.' -
016200090911     A                                      'H1030')
016300090911     A            SPATFX         7P 0       TEXT('NR.SPEDIZIONI A TERRA FUORI A-
016400090911     A                                      FFIDABILITA (USI FUTURI)')
016500090911     A                                      COLHDG('SPED.TERRA' 'FUORI AFFID.' -
016600090911     A                                      'FUTURO')
016700000000      *
016800970130     A            SPAFTR    R               REFFLD($FTR)
016900000000     A                                      TEXT('FLAG TRASMISS.:" "=DA TRASM.+
017000000000     A                                      "T"=TRASMESSO')
017100000000     A            SPADTR    R               REFFLD($DTR)
