000100000000     A*--------------------------------------------------------------*
000200081219     A*  L.F. SU SUPERTESTATA TARIFFE AUT.
000300000000     A*--------------------------------------------------------------*
000400940920     A                                      UNIQUE
000500081219     A          R FITGT000                  PFILE(FITGT00F)
000600081219     A          K TGTPDR
000700081219     A          K TGTSML
001000081219     A          K TGTPRG
