000100000000     A*--------------------------------------------------------------*
000200081219     A*         TARIFFE PADRONCINI  -  SUPERTESTATA
000300000000     A*--------------------------------------------------------------*
000400890913     A                                      REF(CNDIZION)
000500081219     A          R FITGT000                  TEXT('TARIFFE AUT. SUPERTESTATA')
000600081219     A            TGTATB    R               REFFLD($ATB)
000700081219     A            TGTPDR    R               REFFLD($PDR)
000800081219     A            TGTSML    R               REFFLD($SML)
001100081219     A            TGTPRG    R               REFFLD($PRG)
001101081219     A            TGTDIV    R               REFFLD($DIV)
001102011024     A                                      TEXT('DIVISA DELLA TARIFFA')
001103011024     A                                      COLHDG('DIVISA' 'TARIFFA')
001300081219     A            TGTDDT    R               REFFLD($DDT)
001400081219     A            TGTDST    R               REFFLD($DST)
001500081219     A            TGTDUV    R               REFFLD($DUV)
001501081219     A            TGTDCV    R               REFFLD($DES15)
001502081219     A                                      TEXT('DESCRIZ.VARIAB COD.TAR')
004700081219     A            TGTPRU    R               REFFLD($PRU)
004701090323     A            TGTDTS    R               REFFLD($DTS)
004702090421     A                                      COLHDG('CONVALIDA FILIALE')
004703090421     A                                      TEXT('DATA CONVALIDA FILIALE')
004903081219     A            TGTDCN    R               REFFLD($DCN)
004904090421     A                                      COLHDG('STAMPA SEDE')
004905090320     A                                      TEXT('DATA STAMPA IN SEDE')
004907090320     A            TGTDRC         8P 0       TEXT('DATA RITORNO COPIA FIRMATA')
004908090320     A                                      COLHDG('DATA' 'RIENTRO' 'C.FIRMATA')
004909090402     A            TGTFIL         3P 0       TEXT('FIL. GESTIONE CONTRATTO')
004910090320     A                                      COLHDG('FILIALE' 'GESTIONE')
004911090402     A            TGTNRC         7P 0       TEXT('NUMERO CONTRATTO')
004912090402     A                                      COLHDG('NUMERO' 'CONTRATTO' )
004913090330     A            TGTSOC    R               REFFLD($SOC)
004914090330     A            TGTCDF    R               REFFLD($CDF)
004915090320     A            TGTTMPC        4  0       TEXT('TEMPI CARICO')
004916090320     A            TGTTMPS        4  0       TEXT('TEMPI SCARICO')
005000090320     A            TGTKM          5  0       TEXT('KM MEDI PERCORSI')
005001090320     A                                      COLHDG('KM')
005100081219     A            TGTPKL    R               REFFLD($PKL)
005200090402     A                                      TEXT('MASSA COMPLESSIVA')
005300090109     A                                      COLHDG('PESO')
005400081219     A            TGTVLU    R               REFFLD($VLU)
005500090109     A                                      TEXT('VOLUME')
005600090320     A                                      COLHDG('VOLUME')
005700090109     A            TGTPCAR   R               REFFLD($PCAR)
005701090109     A            TGTCCKM   R               REFFLD($CCKM)
006000081219     A            TGTFLR        30          TEXT('FILLER')
