000100000000     A*--------------------------------------------------------------*
000200980326     A*  ARCHIVIO SPUNTE DA VANDERLANDE                              *
000300000000     A*--------------------------------------------------------------*
000400890913     A                                      REF(CNDIZION)
000500080617     A          R FITR4                     TEXT('ARCHIVIO SPUNTE DA         +
000600980326     A                                      VANDERLANDE             ')
000700080620     A            TR4FIL         3A         TEXT('FILIALE')
000800080620     A            TR4PC          1A         TEXT('CODICE P.C.')
000900080620     A            TR4DA1       256A         TEXT('DATI')
001000080620     A            TR4DATORA     14A         TEXT('DATA/ORA RICEZIONE AAAAMMGGHH-
001100080620     A                                      MMSS')
