000100890907     A*---------------------------------------------------------------*
000200960104     A*  ARCHIVIO DI WORK BOLLE DA MAGAZZINO SEDE PER  BOLOGNA
000300890907     A*---------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500900327     A*
000600021029     A          R FIVAB000                  FORMAT(FIVAB00F)
