000100000000     A*--------------------------------------------------------------*
000200930803     A*  ARCHIVIO TOTALI STATISTICA CONTROLLO UFF. GIACENZA          *
000300000000     A*--------------------------------------------------------------*
000400890913     A                                      REF(CNDIZION)
000500010921     A          R FLFG76                    FORMAT(FLFG765F)
000600930709     A*
