000100930804     A*--------------------------------------------------------------*
000200930804     A*  L.F. TOTALI X STATISTICA CONTROLLO UFF. GIACENZE            *
000300930804     A*--------------------------------------------------------------*
000400010921     A          R FLFG76                    PFILE(FLFG765F)
000401050301     A          K FG7FIL
000500930804     A          K FG7AAS
000600930804     A          K FG7PER
