000100000921      *--------------------------------------------------------------*
000200000921      *  L.F. ANAGRAFICA CLIENTI RITIRO
000300000921      *--------------------------------------------------------------*
000400000921     A          R FNACR000                  PFILE(FNACR00F)
000500001011     A          K ACRRSR
000600001011     A          K ACRCRO
000700000921      **  INDICI PER:
000800000927      **  - RAGIONE SOCIALE
000900001011      **  - CODICE CLIENTE RITIRO
