000100890907     A*---------------------------------------------------------------*
000200940720     A*  VARIAZIONE BOLLE
000300130926     A*  -- NOTE E VARI
000400890907     A*---------------------------------------------------------------*
000500890907     A                                      REF(CNDIZION)
000600900327     A*
000700130926     A          R FNARBN00                  TEXT('VARIAZ.BOLLE: +
000800130926     A                                      NOTE E VARI')
000900910417     A            ARBATB    R               REFFLD($ATB)
001000910417     A            ARBAAS    R               REFFLD($AAS)
001100940630     A            ARBLNP    R               REFFLD($LNP)
001200910417     A            ARBNRS    R               REFFLD($NRS)
001300910417     A            ARBNSP    R               REFFLD($NSP)
001400941214     A            ARBCBO    R               REFFLD($CBO)
001500911113     A*
001600940630     A            ARBDTV    R               REFFLD($DTV)
001700940630     A            ARBORV    R               REFFLD($ORV)
001800940720     A            ARBCVB    R               REFFLD($CVB)
001900940630     A            ARBPRU    R               REFFLD($PRU)
002000940630     A                                      TEXT('PROFILO UTENTE CHE HA ESEGUIT-
002100940630     A                                      O LA VARIAZIONE')
002200940720     A*
002300130927     A* CAMPO GENERICO DATI
002400130927     A            ARBTRD    R               REFFLD($TRD)
002500130927     A            ARBUNI70  R               REFFLD($UNI70)
002600940720     A*
002700941014     F* FLAG DI STAMPA
002800941014     A            ARBFST    R               REFFLD($FST)
002900941014     A                                      TEXT('S=STAMPATA VARIAZIONE')
003000941014     A                                      COLHDG('STAMPA' 'VARIAZ')
