000100890907     A*---------------------------------------------------------------*
000200940722     A*  TRASMISSIONE VARIAZIONI BOLLE
000300940722     A*  -- DESTINATARIO/P.IVA/ PESO/ VOLUME/FLAG INOLTRO/F.DEPOSITO
000500890907     A*---------------------------------------------------------------*
000600890907     A                                      REF(CNDIZION)
000700900327     A*
000800940722     A          R FNARBD00                  FORMAT(FNARBD0F)
