000100000000     A*--------------------------------------------------------------*
000200920304     A*  L.F. VARIAZIONI CONTRASSEGNI
000300000000     A*--------------------------------------------------------------*
000400941128     A          R FNARBK00                   PFILE(FNARBK0F)
000500920304     A          K ARBDTV
000600941128     A          O ARBFST                    CMP(EQ 'S')
