000100890907     A*---------------------------------------------------------------*
000200980219     A*  DETTAGLIO SEGNACOLLI: ESTENZIONE DESCRIZIONI
000300890907     A*---------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500900327     A*
000600980219     A          R FNARS000                  TEXT('DETTAGLIO SEGNACOLLI ARRIVO+
000700980219     A                                      : ESTENSIONE')
000800980219     A            ARSATB    R               REFFLD($ATB)
000900980219     A            ARSFLS    R               REFFLD($FLS)
001000980219     A            ARSLNA    R               REFFLD($LNA)
001100980219     A            ARSNRS    R               REFFLD($NRS)
001200980219     A            ARSNSC    R               REFFLD($NSC)
001300980219     A            ARSTRC    R               REFFLD($TRC)
001400980219     A            ARSNOT    R               REFFLD($NOT)
001500980219     A                                      TEXT('DESCRIZIONE')
001600980219     A                                      COLHDG('DESCRIZ')
001700980219     A            ARSDAT    R               REFFLD($DA8)
001800980318     A            ARSCAN    R               REFFLD($CAN)
001900980318     A            ARSFL1         3A         TEXT('USI FUTURI')
002000980318     A                                      COLHDG('USI' 'FUTURI')
002100980318     A            ARSFL2         3A         TEXT('USI FUTURI')
002200980318     A                                      COLHDG('USI' 'FUTURI')
002300980219     A            ARSFTR    R               REFFLD($FTR)
002400980219     A            ARSDTR    R               REFFLD($DTR)
