000100000000     A*--------------------------------------------------------------*
000200900517     A*  L.F. BOLLE SPEDIZIONE PARTENZA E PARTITE
000300000000     A*--------------------------------------------------------------*
000400941228     A          R FNBLP000                  PFILE(FNBLP00F)
000500921023     A          K BLPKSC
000600980406     A          K BLPDT3
