000100990913      *---------------------------------------------------------------*
000200990913      *  ARCHIVIO TRASMISSIONE A SEDE BOLLE PARTENZA
000300990913      *---------------------------------------------------------------*
000400990913     A                                      REF(FNBLP00F)
000500990913      *
000600990913     A          R FIBLP000
000700950109     A            BLPAAS    R               REFFLD(BLPAAS)
000800950109     A            BLPLNP    R               REFFLD(BLPLNP)
000900950109     A            BLPNRS    R               REFFLD(BLPNRS)
001000950109     A            BLPNSP    R               REFFLD(BLPNSP)
