000100000000     A*--------------------------------------------------------------*
000200000630     A*  L.F. ARCHIVIO BOLLE APPOGGIO PER SEDE
000300000000     A*--------------------------------------------------------------*
000400070510     A                                      FIFO
000500070423     A          R FNBLP000                  PFILE(FNBLP46F)
000600000000     A*
000700070423     A          K BLPTFP
000800000000     A**  INDICI PER:
000900070423     A**  - TERMINAL DI PARTENZA
