000100890907     A*---------------------------------------------------------------*
000200941231     A*  ARCHIVIO RICEZIONE  BOLLE PARTENZA ARRIVO
000300900526     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500910924     A                                      REF(CNDIZION)
000600910924     A*
000700941231     A          R FNBLPE00                  FORMAT(FNBLPE0T)
