000100890907     A*---------------------------------------------------------------*
000200910124     A*  ARCHIVIO BOLLE PARTENZA "TESTATA"                            *
000300940729     A*---------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500900327     A*
000600000922     A          R FNBLP18R                  TEXT('ARCHIVIO BOLLE PARTENZA')
000700900417     A            BLPAAS    R               REFFLD($AAS)
000800940520     A            BLPLNP    R               REFFLD($LNP)
000900940520     A            BLPNRS    R               REFFLD($NRS)
001000940520     A            BLPNSP    R               REFFLD($NSP)
