000100000000     A*--------------------------------------------------------------*
000200940615     A*  SPUNTE IN PARTENZA E IN ARRIVO
000300000000     A*--------------------------------------------------------------*
000400890913     A                                      REF(CNDIZION)
000500070110     A          R FNBRV000                  TEXT('SPUNTE IN PARTENZA E IN ARRIV-
000600940615     A                                      O')
000700070110     A            BRVNVR    R               REFFLD($NVL)
000800070110     A                                      TEXT('*=SPUNTA NON VALIDA PER CALCO-
000900070110     A                                      LO RESPONSABILITA''')
001000070110     A                                      COLHDG('*=NO' 'RESPO C.A.')
001100940616     A            BRVFGS    R               REFFLD($FGS)
001200940616     A            BRVNPG    R               REFFLD($NPG)
001300940615     A            BRVNFV    R               REFFLD($NFV)
001400991222     A            BRVPES    R               REFFLD($PES)
001500910318     A            BRVLNP    R               REFFLD($LNP)
001600910318     A            BRVLNA    R               REFFLD($LNA)
001700910318     A            BRVNRS    R               REFFLD($NRS)
001800940615     A            BRVNSC    R               REFFLD($NSC)
001900910318     A            BRVZNC    R               REFFLD($ZSC)
002000910318     A            BRVNPS    R               REFFLD($NPS)
002100940615     A            BRVCAN    R               REFFLD($CAN)
002200940623     A            BRVVUC    R               REFFLD($VUC)
002300940707     A            BRVPUC    R               REFFLD($PUC)
002400940616     A            BRVDCS    R               REFFLD($DCS)
002500070110     A            BRVHCS    R               REFFLD($HCS6)
002600991223     A            BRVDFS    R               REFFLD($DFS)
002700991223     A                                      TEXT('DATA IMMISS./VARIAZ.SPUNTA')
002800991223     A                                      COLHDG('DATA' 'IMMISS/VARIAZ' 'SPUN-
002900991223     A                                      TA')
003000070110     A            BRVHMS    R               REFFLD($HMS6)
003100991223     A                                      TEXT('ORA IMMISS./VARIAZ.SPUNTA')
003200991223     A                                      COLHDG('ORA' 'IMMISS/VARIAZ' 'SPUNT-
003300991223     A                                      A')
003400940707     A            BRVATR    R               REFFLD($ATR)
003500070109     A            BRVTSU    R               REFFLD($TSU)
003600940616     A            BRVFTR    R               REFFLD($FTR)
003700940616     A            BRVDTR    R               REFFLD($DTR)
003800991222     A            BRVHTR    R               REFFLD($HTR)
003900941229     A            BRVFLE    R               REFFLD($FLE)
004000070110     A                                      TEXT('TERMINAL PARTENZA SPUNTA')
004100070109     A            BRVPRU    R               REFFLD($PRU)
004200070109     A            BRVMIS    R               REFFLD($MIS)
004300070109     A            BRVTAP    R               REFFLD($TAP)
