000100000000     A*--------------------------------------------------------------*
000200000000     A*  L.F. DETTAGLIO SEGNACOLLI BOLLE TRANSITO
000300000000     A*--------------------------------------------------------------*
000400000000     A          R FNBTT000                  PFILE(FNBTT00F)
000500000000     A          K BTTDET
000600000000     A**
000700000000     A**  INDICI PER:
000800000000     A**  - DATA ENTRATA DAL TRANSITO
