000100890907     A*---------------------------------------------------------------*
000200940912     A*  ARCHIVIO TRASMISSIONE A FIL. PARTENZA INCASSO CONTRASSEGNI
000300900526     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500900327     A*
000600910516     A                                      REF(CNDIZION)
000700940912     A          R FNCAF000                  TEXT('TRASMISS.C/ASSEGNI INCASSATI')
000800940912     A            CAFLNP    R               REFFLD($LNP)
000900940912     A            CAFAAS    R               REFFLD($AAS)
001000940912     A            CAFNRS    R               REFFLD($NRS)
001100940912     A            CAFNSP    R               REFFLD($NSP)
001200940912     A            CAFCAS    R               REFFLD($CAS)
001300940912     A            CAFVCA    R               REFFLD($VCA)
001400940912     A            CAFTPA    R               REFFLD($TPA)
001500940912     A            CAFTPI    R               REFFLD($TPI)
001600940912     A            CAFDMI    R               REFFLD($DMI)
