000100931008     A*--------------------------------------------------------------*
000200931008     A*  L.F. DATI CONTRASSEGNI X FILIALI
000300000000     A*--------------------------------------------------------------*
000400941102     A          R FNCSB000                  PFILE(FNCSB00F)
000500960917     A          K CSBSTA
000600931008     A          K CSBCDI
000700931008     A**  INDICI PER:
000800960917     A**  - STATO CONTRASSEGNO
000900931008     A**  - CODICE CLIENTE
