000100980909      *---------------------------------------------------------------*
000200980909      *  L.F. ARCHIVIO DANNI: ANAGRAFICA DENUNCIE
000300980909      *---------------------------------------------------------------*
000400971021     A                                      UNIQUE
000500980909     A          R FNDAD000                  PFILE(FNDAD00F)
000600980721      *
000700980909     A          K DADFIL
000800980721      **  INDICI PER:
000900980909      **  - P.O. PRESENTAZIONE DENUNCIA
