000100890907     A*---------------------------------------------------------------*
000200970821     A*  ARCHIVIO DANNI: EVENTI DETTAGLIO
000300890907     A*---------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500900327     A*
000600970821     A          R FNDED000                  TEXT('DANNI: DETTAGLIO EVENTI')
000700970821     A            DEDATB    R               REFFLD($ATB)
000800970821     A            DEDAAE    R               REFFLD($AAS)
000900970821     A                                      TEXT('ANNO EVENTO')
001000970821     A                                      COLHDG('ANNO EVENTO')
001100970821     A            DEDNEV    R               REFFLD($NEV)
001200970821     A            DEDFIE    R               REFFLD($FIL)
001300970821     A                                      TEXT('P.O. INTERESSATA ALL''EVENTO')
001400970821     A                                      COLHDG('P.O.INTERES.' 'EVENTO')
