000100050714      *---------------------------------------------------------------*
000200051025      *  FNDRA00F - Archivio DANNI: RECUPERI DA A.I.G.                *
000300050714      *---------------------------------------------------------------*
000400050714     A                                      REF(CNDIZION)
000500050714      *
000600051025     A          R FNDRA000                  TEXT('DANNI: RECUPERI DA A-
000700051025     A                                      .I.G.')
000800050714      *
000900050715     A            DRAATB    R               REFFLD($ATB)
001000050715     A            DRAAAC    R               REFFLD($AAA)
001100050714     A                                      TEXT('ANNO C.A.')
001200050714     A                                      COLHDG(' '  -
001300050714     A                                             'ANNO' -
001400050714     A                                             'C.A.')
001500050715     A            DRAFIL    R               REFFLD($FIL)
001600050714     A                                      TEXT('P.O. APERTURA C.A.')
001700050714     A                                      COLHDG('P.O.' -
001800050714     A                                             'APERT' -
001900050714     A                                             'C.A.')
002000050715     A            DRANCA    R               REFFLD($NCA)
002100050714      *
002200050715     A            DRADRR    R               REFFLD($DA8)
002300050714     A                                      EDTWRD('    /  /  ')
002400051025     A                                      TEXT('DATA RICHIESTA RECUP-
002500051025     A                                      ERO AD A.I.G.')
002600050714     A                                      COLHDG('     DATA' -
002700050714     A                                             'RICHIESTA' -
002800051025     A                                             ' RECUPERO')
002900050715     A            DRADVR    R               REFFLD($DA8)
003000050714     A                                      EDTWRD('    /  /  ')
003100051025     A                                      TEXT('DATA VALUTA RECUPERO-
003200051025     A                                       DA A.I.G.')
003300050714     A                                      COLHDG('     DATA' -
003400050714     A                                             '   VALUTA' -
003500051025     A                                             ' RECUPERO')
003600050715     A            DRADIR    R               REFFLD($VAS)
003700051025     A                                      TEXT('DIVISA IMPORTO RECUP-
003800051025     A                                      ERATO')
003900050714     A                                      COLHDG('DIV' -
004000050714     A                                             'IMP' -
004100051025     A                                             'REC')
004200050715     A            DRAIRI    R               REFFLD($IPV)
004300051025     A                                      TEXT('IMPORTO RECUPERATO')
004400050714     A                                      COLHDG('          ' -
004500050714     A                                             '   IMPORTO' -
004600051025     A                                             'RECUPERATO')
004700050715     A            DRAESC    R               REFFLD($FLA)
004800050714     A                                      TEXT('FLAG ESCLUSIONE DAL -
004900051025     A                                      RECUPERO ("E")')
005000050714     A                                      COLHDG('E' -
005100050714     A                                             'S' -
005200050714     A                                             'C')
005300050928      *
005400050928     A            DRADRD    R               REFFLD($DA8)
005500050928     A                                      EDTWRD('    /  /  ')
005600050928     A                                      TEXT('DATA RICEZIONE DISPO-
005700050928     A                                      SIZIONI A.I.G.')
005800050928     A                                      COLHDG('     DATA' -
005900050928     A                                             'RICEZIONE' -
006000050928     A                                             'DISPOSIZ.')
