000100981016      *---------------------------------------------------------------*
000200990430      *  DANNI: RAGGRUPPAMENTI TIPI RESPONSABILITA'
000300981016      *---------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500981016      *
000600990430     A          R FNDRR000                  TEXT('DANNI: RAGGRUPPAMENTI TIPI -
000700990430                                            RESPONSABILITA')
000800990407      *
000900990504     A            DRRATB    R               REFFLD($ATB)
001000990430     A            DRRRFL         2A         TEXT('CODICE RAGGRUPPAMENTO FILTRI')
001100990430     A            DRRCFL         2A         TEXT('CODICE FILTRO')
001200990430     A            DRRTRE         4A         TEXT('TIPO RESPONSABILITA')
001300990430     A            DRRRTA         1A         TEXT('RAGGRUPPAMENTO TIPI ANOMALIA')
001400990430     A            DRRFTR    R               REFFLD($FTR)
001500990407                                            TEXT(' FLAG TRASMISS.')
001600990430     A            DRRDTR    R               REFFLD($DTR)
001700990407                                            TEXT(' DATA TRASMISS.')
