000100890907     A*---------------------------------------------------------------*
000200981112     A*  ARCHIVIO DANNI: BENEFICIARI
000300890907     A*---------------------------------------------------------------*
000400900327     A*
000500981112     A          R FNDTD000                  TEXT('DANNI: BENEFICIARI')
000600981111     A            DTDATB         1A         TEXT('FLG ANNULLAMENTO A=ANNULLATO')
000700981111     A                                      COLHDG('FLAG ANNULLAMENTO')
000800981111     A            DTDANP         4S 0       TEXT('ANNO SINISTRO')
000900981111     A                                      COLHDG('ANNO SINISTRO')
001000981111     A            DTDPRN         7S 0       TEXT('CODICE SINISTRO')
001100981111     A                                      COLHDG('CODICE SINISTRO')
001200981112     A            DTDINT        20A         TEXT('INTESTATARIO')
001300981112     A                                      COLHDG('INTESTATARIO')
001400981111     A            DTDIPV        15S 3       TEXT('IMPORTO PREVENTIVO')
001500981111     A                                      COLHDG('IMP.PREVENTIVO')
001600981112     A            DTDVPV         3A         TEXT('DIVISA IMP.PREVENTIVO')
001700981112     A                                      COLHDG('DIV.IMP.PREV.')
001800981111     A            DTDIPC        15S 3       TEXT('IMPORTO MANDATO X CONTO')
001900981111     A                                      COLHDG('IMP.MAND. X CONTO')
002000981112     A            DTDVPC         3A         TEXT('DIVISA IMP.MANDATO X CONTO')
002100981112     A                                      COLHDG('DIV.IMP.MAND.CONTO')
002200981111     A            DTDIRC        15S 3       TEXT('IMPORTO R C V')
002300981111     A                                      COLHDG('IMP. R C V')
002400981112     A            DTDVRC         3A         TEXT('DIVISA IMPORTO R C V')
002500981112     A                                      COLHDG('DIV.IMP.R C V')
002600981112     A            DTDCPA         4A         TEXT('"  "=INSERIM;"PROG"=PROG.LIQU-
002700981112     A                                      IDAZ;"LIQU"=PAGAMENTO')
002800981111     A                                      COLHDG('INSE/PROG/LIQU')
002900981111     A            DTDNCA        14S 0       TEXT('NUMERO C.A.')
003000981111     A                                      COLHDG('NUMERO C.A.')
003100981111     A            DTDDAP         8S 0       TEXT('DATA ACCETTAZIONE PROGETTO -
003200981112     A                                      LIQUIDAZIONE AMG')
003300981111     A                                      COLHDG('DTA ACCET.PROG.LIQ.')
003400981112     A            DTDDLI         8S 0       TEXT('DTA INVIO PROGETTO "PROG";-
003500981112     A                                      DTA LIQUIDAZIONE "LIQU" AMG')
003600981111     A                                      COLHDG('DTA INVIO PROG'  'DTA -
003700981112     A                                      LIQUIDAZ.' 'AMG')
003800981111     A            DTDNDO         2S 0       TEXT('N. DOX')
003900981111     A                                      COLHDG('N.DOX')
004000990312     A            DTDCLI         4S 0       TEXT('COD.CLIENTE CONSULINDUSTRIA')
004100990312     A                                      COLHDG('COD.CLI.CONSUL')
