000100890907     A*---------------------------------------------------------------*
000200990204     A*  ARCHIVIO DANNI: PRATICA ASSICURATIVA   STORICO
000300890907     A*---------------------------------------------------------------*
000400900327     A*
000500990204     A          R FNDTT000                  FORMAT(FNDTT00T)
