000100890907     A*---------------------------------------------------------------*
000200930420     A*  ARCHIVIO TRASMISSIONE EVENTI BOLLE                          -*
000300911108     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500890907     A                                      REF(CNDIZION)
000600900327     A*
000700990802     A          R FNEVB000                  FORMAT(FNEVB00F)
