000100000000     A*--------------------------------------------------------------*
000200130121     A* FOGLI VIAGGIO PARTENZA - RICHIESTA BIS
000300000000     A*--------------------------------------------------------------*
000400130121     A          R FNFGB000                  PFILE(FNFGB00F)
000500130121     A          K FGBDTN
000600130130     A          K FGBTFA
000700900330     A**  INDICI PER:
000800130121     A**  - DATA TRAINO
000900130130     A**  - TERMINAL DI ARRIVO
