000100000000     A*--------------------------------------------------------------*
000200000414     A*  L.F. FOGLI DI VIAGGIO  - ESTENSIONE                         *
000300000000     A*--------------------------------------------------------------*
000400000427     A          R FNFGW000                  PFILE(FNFGW00F)
000500020926     A          K FGWFGS
000600020926     A          K FGWNFV
000700900330     A**  INDICI PER:
000800020926     A**  - P.O. GESTIONE FOGLIO
000900020926     A**  - NUMERO FOGLIO VIAGGIO
