000100000000     A*--------------------------------------------------------------*
000200000000     A* RICEZIONE DETTAGLIO TOTALI FOGLI VIAGGIO PARTENZA            *
000300000000     A* MBR=*NONE  -  MAXMBRS=*NOMAX                                 *
000400000000     A*--------------------------------------------------------------*
000500000000     A          R FNFVD000                  FORMAT(FNFVD00T)
