000100060920      *---------------------------------------------------------------*
000200101118      *?IMPIANO RPVP -  SALDI
000300060920      *---------------------------------------------------------------*
000400060920     A                                      REF(CNDIZION)
000500060920      *
000600101118     A          R FNMSP000                  TEXT('IMP.RPVP-SALDI GI-
000700060920     A                                      ORNO')
000800060920      *
000900101118     A            MSPAPL    R               REFFLD($FLA)
001000060920     A                                      TEXT('TIPO APPLICAZIONE')
001100060920     A                                      COLHDG('TIPO APPLICAZIONE')
001200101118     A            MSPFIL    R     S         REFFLD($FIL)
001300060920     A                                      TEXT('PUNTO OPERATIVO')
001400060920     A                                      COLHDG('P.O.')
001500101118     A            MSPDFV    R     S         REFFLD($DFV)
001600101118     A            MSPNPG    R     S         REFFLD($NPG)
001700101210     A            MSPTLM         7S 0       TEXT('MINUTI LAVORATI TOTA-
001800101119     A                                      LI')
001900101119     A                                      COLHDG('MM TOT')
002000101119     A            MSPNCCA        7S 0       TEXT(' COLLI CARICATI')
002100101119     A                                      COLHDG('COLLI CARIC')
002200101119     A            MSPCNBO        7S 0       TEXT('COLLI BOLLETTATI > DI')
002300101119     A                                      COLHDG('COLLI BOLL' '>DI')
002400101119     A            MSPPKCA        9S 1       TEXT('TOT PESO CARICATO')
002500101119     A                                      COLHDG('PESO' 'CAR')
002600101119     A            MSPVLCA        9S 3       TEXT('TOT VOL CARICATO')
002700101119     A                                      COLHDG('VOL' 'CAR')
