000100000921      *--------------------------------------------------------------*
000200001013      *  L.F. ORDINI RITIRO MERCE
000300000921      *--------------------------------------------------------------*
000400001013     A          R FNORM000                  PFILE(FNORM00F)
000500001016     A          K ORMRSR
000600000921      **  INDICI PER:
000700001016      **  - RAGIONE SOCIALE RITIRO
