000100000000     A*--------------------------------------------------------------*
000300140716     A*  QUADRATURA ENTRATA: PARAMETRI DI LANCIO ELABORAZ. DEFINITIVA EDI
000400000000     A*--------------------------------------------------------------*
000500890913     A                                      REF(CNDIZION)
000600140716     A          R FNQUE000                  TEXT('QUADRATURA ENTR.PARAM.LANCIO')
000700140716     A            QUENFV    R               REFFLD($NFV)
000800140716     A            QUEFGS    R               REFFLD($FGS)
000900140716     A            QUENPG    R               REFFLD($NPG)
001000140716     A            QUELNP    R               REFFLD($LNP)
001300140716     A            QUEPDR    R               REFFLD($PDR)
001500140717     A            QUENRS    R     A         REFFLD($NRS)
001501140716     A            QUECCM    R               REFFLD($CCM)
001600140716     A            QUEDRT    R               REFFLD($DRT)
001700140717     A            QUENRT    R     A         REFFLD($NRT)
001800140716     A            QUEFPP    R               REFFLD($FPP)
002000140716     A            QUEDEL         8S 0       TEXT('DATA ELABORAZIONE')
002100140716     A            QUEUSR    R               REFFLD($PRU)
