000100000000     A*------------------------------------------------------------------------*
000200000000     A*  ARCHIVIO PER STATISTICHE PARTENZE: CONTROLLO ENTRATE
000300000000     A*------------------------------------------------------------------------*
000400000000     A* ATTENZIONE!!  Se si modifica questo file occorre modificare e/o ricom-
000500000000     A*               pilare anche FLSCE00T e FLSCE00R.
000600000000     A*------------------------------------------------------------------------*
000700000000     A                                      REF(CNDIZION)
000800000000     A          R FNSCE000                  TEXT('STATISTICHE PARTENZE: CONTROL-
000900000000     A                                      LO ENTRATE')
001000000000     A            SCEFLE    R               REFFLD($FLE)
001100000000     A            SCELNP    R               REFFLD($LNP)
001200000000     A            SCEPDR    R               REFFLD($PDR)
001300000000     A            SCEDRE    R               REFFLD($DA8)
001400000000      * Bollettato: numero spedizioni
001500000000     A            SCEBSA         7P 0       TEXT('BOLLETTATO:  NR.SPEDIZIONI   -
001600000000     A                                      (DISK A)')
001700000000     A                                      COLHDG('BOLLETT' 'SPEDIZ' 'DISK A')
001800000000     A            SCEBSB         7P 0       TEXT('BOLLETTATO:  NR.SPEDIZIONI   -
001900000000     A                                      (DISK B)')
002000000000     A                                      COLHDG('BOLLETT' 'SPEDIZ' 'DISK B')
002100010420     A            SCEBSE         7P 0       TEXT('BOLLETTATO:  NR.SPEDIZIONI   -
002200010420     A                                      (DISK A+C BAR.)')
002300010420     A                                      COLHDG('BOLLETT' 'SPEDIZ' 'DISK A+C-
002400010420     A                                      BAR')
002500010420     A            SCEBSC         7P 0       TEXT('BOLLETTATO:  NR.SPEDIZIONI   -
002600010420     A                                      (DISK C BAR.)')
002700010420     A                                      COLHDG('BOLLETT' 'SPEDIZ' 'DISK C B-
002800010420     A                                      AR')
002900010417     A            SCEBSK         7P 0       TEXT('BOLLETTATO:  NR.SPEDIZIONI   -
003000010417     A                                      (DISK C CLI.)')
003100010417     A                                      COLHDG('BOLLETT' 'SPEDIZ' 'DISK C C-
003200010417     A                                      LI')
003300000000     A            SCEBSN         7P 0       TEXT('BOLLETTATO:  NR.SPEDIZIONI   -
003400000000     A                                      (NO DISK)')
003500000000     A                                      COLHDG('BOLLETT' 'SPEDIZ' 'NO DISK')
003600000000      * Bollettato: numero colli
003700000000     A            SCEBCA         7P 0       TEXT('BOLLETTATO:  NR.COLLI        -
003800000000     A                                      (DISK A)')
003900000000     A                                      COLHDG('BOLLETT' 'COLLI' 'DISK A')
004000000000     A            SCEBCB         7P 0       TEXT('BOLLETTATO:  NR.COLLI        -
004100000000     A                                      (DISK B)')
004200000000     A                                      COLHDG('BOLLETT' 'COLLI' 'DISK B')
004300010420     A            SCEBCE         7P 0       TEXT('BOLLETTATO:  NR.COLLI        -
004400010420     A                                      (DISK A+C BAR)')
004500010420     A                                      COLHDG('BOLLETT' 'COLLI' 'DISK A+C -
004600010420     A                                      BAR')
004700010417     A            SCEBCC         7P 0       TEXT('BOLLETTATO:  NR.COLLI        -
004800010417     A                                      (DISK C BAR)')
004900010417     A                                      COLHDG('BOLLETT' 'COLLI' 'DISK C BA-
005000010417     A                                      R')
005100010417     A            SCEBCK         7P 0       TEXT('BOLLETTATO:  NR.COLLI        -
005200010417     A                                      (DISK C CLI')
005300010417     A                                      COLHDG('BOLLETT' 'COLLI' 'DISK C CL-
005400010417     A                                      I')
005500000000     A            SCEBCN         7P 0       TEXT('BOLLETTATO:  NR.COLLI        -
005600000000     A                                      (NO DISK)')
005700000000     A                                      COLHDG('BOLLETT' 'COLLI' 'NO DISK')
005800000000      * Bollettato: numero clienti
005900000000     A            SCEBLA         7P 0       TEXT('BOLLETTATO:  NR.CLIENTI      -
006000000000     A                                      (DISK A)')
006100000000     A                                      COLHDG('BOLLETT' 'CLIENTI' 'DISK A')
006200000000     A            SCEBLB         7P 0       TEXT('BOLLETTATO:  NR.CLIENTI      -
006300000000     A                                      (DISK B)')
006400000000     A                                      COLHDG('BOLLETT' 'CLIENTI' 'DISK B')
006500010420     A            SCEBLE         7P 0       TEXT('BOLLETTATO:  NR.CLIENTI      -
006600010420     A                                      (DISK A+C BAR)')
006700010420     A                                      COLHDG('BOLLETT' 'CLIENTI' 'DISK A+-
006800010420     A                                      C BAR')
006900010420     A            SCEBLC         7P 0       TEXT('BOLLETTATO:  NR.CLIENTI      -
007000010420     A                                      (DISK C BAR)')
007100010420     A                                      COLHDG('BOLLETT' 'CLIENTI' 'DISK C -
007200010420     A                                      BAR')
007300010417     A            SCEBLK         7P 0       TEXT('BOLLETTATO:  NR.CLIENTI      -
007400010417     A                                      (DISK C CLI)')
007500010417     A                                      COLHDG('BOLLETT' 'CLIENTI' 'DISK C -
007600010417     A                                      CLI')
007700000000     A            SCEBLN         7P 0       TEXT('BOLLETTATO:  NR.CLIENTI      -
007800000000     A                                      (NO DISK)')
007900000000     A                                      COLHDG('BOLLETT' 'CLIENTI' 'NO DISK-
008000000000     A                                      ')
008100000000      * Controllato: numero spedizioni
008200000000     A            SCECSA         7P 0       TEXT('CONTROLLATO: NR.SPEDIZIONI   -
008300000000     A                                      (DISK A)')
008400000000     A                                      COLHDG('CONTROL' 'SPEDIZ' 'DISK A')
008500000000     A            SCECSB         7P 0       TEXT('CONTROLLATO: NR.SPEDIZIONI   -
008600000000     A                                      (DISK B)')
008700000000     A                                      COLHDG('CONTROL' 'SPEDIZ' 'DISK B')
008800010420     A            SCECSE         7P 0       TEXT('CONTROLLATO: NR.SPEDIZIONI   -
008900010420     A                                      (DISK A+C BAR)')
009000010420     A                                      COLHDG('CONTROL' 'SPEDIZ' 'DISK A+C-
009100010420     A                                       BAR')
009200010420     A            SCECSC         7P 0       TEXT('CONTROLLATO: NR.SPEDIZIONI   -
009300010420     A                                      (DISK C BAR)')
009400010420     A                                      COLHDG('CONTROL' 'SPEDIZ' 'DISK C B-
009500010420     A                                      AR')
009600010417     A            SCECSK         7P 0       TEXT('CONTROLLATO: NR.SPEDIZIONI   -
009700010417     A                                      (DISK C CLI)')
009800010417     A                                      COLHDG('CONTROL' 'SPEDIZ' 'DISK C C-
009900010417     A                                      LI')
010000000000     A            SCECSN         7P 0       TEXT('CONTROLLATO: NR.SPEDIZIONI   -
010100000000     A                                      (NO DISK)')
010200000000     A                                      COLHDG('CONTROL' 'SPEDIZ' 'NO DISK')
010300000000      * Controllato: numero colli
010400000000     A            SCECCA         7P 0       TEXT('CONTROLLATO: NR.COLLI        -
010500000000     A                                      (DISK A)')
010600000000     A                                      COLHDG('CONTROL' 'COLLI' 'DISK A')
010700000000     A            SCECCB         7P 0       TEXT('CONTROLLATO: NR.COLLI        -
010800000000     A                                      (DISK B)')
010900000000     A                                      COLHDG('CONTROL' 'COLLI' 'DISK B')
011000010420     A            SCECCE         7P 0       TEXT('CONTROLLATO: NR.COLLI        -
011100010420     A                                      (DISK A+C BAR)')
011200010420     A                                      COLHDG('CONTROL' 'COLLI' 'DISK A+C -
011300010420     A                                      BAR')
011400010420     A            SCECCC         7P 0       TEXT('CONTROLLATO: NR.COLLI        -
011500010420     A                                      (DISK C BAR)')
011600010420     A                                      COLHDG('CONTROL' 'COLLI' 'DISK C BA-
011700010420     A                                      R')
011800010417     A            SCECCK         7P 0       TEXT('CONTROLLATO: NR.COLLI        -
011900010417     A                                      (DISK C CLI)')
012000010417     A                                      COLHDG('CONTROL' 'COLLI' 'DISK C CL-
012100010417                                            I')
012200000000     A            SCECCN         7P 0       TEXT('CONTROLLATO: NR.COLLI        -
012300000000     A                                      (NO DISK)')
012400000000     A                                      COLHDG('CONTROL' 'COLLI' 'NO DISK')
012500000000      * Controllato: numero clienti
012600000000     A            SCECLA         7P 0       TEXT('CONTROLLATO: NR.CLIENTI      -
012700000000     A                                      (DISK A)')
012800000000     A                                      COLHDG('CONTROL' 'CLIENTI' 'DISK A')
012900000000     A            SCECLB         7P 0       TEXT('CONTROLLATO: NR.CLIENTI      -
013000000000     A                                      (DISK B)')
013100000000     A                                      COLHDG('CONTROL' 'CLIENTI' 'DISK B')
013200010420     A            SCECLE         7P 0       TEXT('CONTROLLATO: NR.CLIENTI      -
013300010420     A                                      (DISK A+C BAR)')
013400010420     A                                      COLHDG('CONTROL' 'CLIENTI' 'DISK A+-
013500010420     A                                      C BAR')
013600010420     A            SCECLC         7P 0       TEXT('CONTROLLATO: NR.CLIENTI      -
013700010420     A                                      (DISK C BAR)')
013800010420     A                                      COLHDG('CONTROL' 'CLIENTI' 'DISK C -
013900010420     A                                      BAR')
014000010417     A            SCECLK         7P 0       TEXT('CONTROLLATO: NR.CLIENTI      -
014100010417     A                                      (DISK C CLI)')
014200010417     A                                      COLHDG('CONTROL' 'CLIENTI' 'DISK C -
014300010417     A                                      CLI')
014400000000     A            SCECLN         7P 0       TEXT('CONTROLLATO: NR.CLIENTI      -
014500000000     A                                      (NO DISK)')
014600000000     A                                      COLHDG('CONTROL' 'CLIENTI' 'NO DISK-
014700000000     A                                      ')
014800000000      *
014900000000     A            SCEFTR    R               REFFLD($FTR)
015000000000     A                                      TEXT('FLAG TRASMISS.:" "=DA TRASM.+
015100000000     A                                      "T"=TRASMESSO')
015200000000     A            SCEDTR    R               REFFLD($DTR)
