000100040413     A**---------* F N S P 2 0 0 F *-------------FISICO--***
000200891011     A**         FILE ANAGRAFICO SPEDIZIONIERI/LUOGHI     **
000300040413     A**         ---- ESTENSIONE LUOGHI ----              **
000400891011     A***------------------------------------------------***
000500891011     A**
000600900522     A                                      REF(CNDIZION)
000700040413     A          R FNSP2000                  TEXT('LUOGHI / SPEDIZIONIERI   ')
000800040413     A            SP2FLG    R               REFFLD($FLAG)
000801970911     A                                      TEXT('FLAG ANNULLAMENTO      -b/A-')
000803040413     A            SP2CLI    R               REFFLD($KSC)
000900040413     A                                      TEXT('COD.CLIENTE')
001101040413     A            SP2COD         3A         TEXT('CODICE LUOGO')
001102040413     A            SP2TPE         2A         TEXT('TIPO ESTENSIONE:EM=E-MAIL')
002202040413     A            SP2EST        60A         TEXT('CAMPO ESTENSIONE')
