000100000000     A*--------------------------------------------------------------*
000200970929     A*  STOP PADRONCINI: FILE DI APPOGGIO PER CALCOLO NUMERO SPEDIZ.
000300970929     A*                   PER STOP DI RITIRO CON PDR DIPENDENTE      *
000400000000     A*--------------------------------------------------------------*
000500931005     A                                      REF(CNDIZION)
000600970929     A          R FNSTPR00                  TEXT('STOP PADRONCINI: DI APPOGGIO -
000700970929     A                                      PER RITIRI')
000800970929     A            STRAAS    R               REFFLD($AAS)
000900970929     A            STRLNP    R               REFFLD($LNP)
001000970929     A            STRNRS    R               REFFLD($NRS)
001100970929     A            STRNSP    R               REFFLD($NSP)
001200970929     A            STRPDR    R               REFFLD($PDR)
001300970930     A            STRDDC    R               REFFLD($DDC)
001400970930     A            STRNDC    R               REFFLD($NDC)
001500001020     A            STRSTP    R    5  0       REFFLD($STP)
001600970929     A                                      TEXT('NUMERO STOP')
001700970929     A            STRKSC    R               REFFLD($KSC)
001800970929     A                                      TEXT('CODICE CLIENTE SPEDIZIONE PE-
001900970929     A                                      R RITIRI')
002000970929     A            STRRSC    R               REFFLD($RSC)
002100970929     A                                      TEXT('RAGIONE SOCIALE MITT.')
002200970929     A                                      COLHDG('RAG.SOC.' 'MITT.')
002300970930     A            STRINV         1          TEXT('"S"=SEDE;"F"=FIL.;"E"=ENTRAMB-
002400970930     A                                      I')
