000100890907     A*---------------------------------------------------------------*
000200941217     A*  ARCHIVIO RICEZIONE BOLLE DA DISCHETTO CLIENTE   -COLLI-
000300941217     A*  TRAMITE LINEA REMOTA
000400941217     A*  MBR=*NONE  -  MAXMBRS=*NOMAX
000500941217     A*  IL NOME DEI MEMBRI E' M+CODICE CLIENTE MITTENTE
000600890907     A*---------------------------------------------------------------*
000700890907     A                                      REF(CNDIZION)
000800900327     A*
000900941217     A          R FNVAD000                  FORMAT(FNVAD00F)
