000100980218      *--------------------------------------------------------------*
000200980218      *  L.F.
000300000417      *  STORICO DISPOSIZIONI GIACENZE RICEVUTE DAI CLIENTI
000400980218      *--------------------------------------------------------------*
000500000417     A          R FNVARS00                  PFILE(FNVAR00S)
000600000417     A          K VARDRD
000700000417     A          K VARCCM
