000100991027      *PARMS MBR(*NONE) MAXMBRS(*NOMAX)
000200910516     A                                      REF(CNDIZION)
000300030331     A          R FNVABX00                  TEXT('TESTATA BOLLE AI CLIENTI +
000400991027     A                                      VIA INTERNET')
000500030331     A            VABXDTA     1024A         TEXT('CAMPO DATI FLAT')
