000100890907     A*---------------------------------------------------------------*
000200031230     A*  INPUT X RICERCA BOLLE FORMATE PT                             *
000300890907     A*---------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500900327     A*
000600031230     A          R FNVACPTBF0                TEXT('INPUT RICERCA BOLLE FIRMATE')
000700031230     A            VACPTBFS      12          TEXT('NUMERO SEGNACOLLO')
000800031230     A            VACPTBFL      16          TEXT('NUMERO LETTERA DI VETTURA')
000900031230     A            VACPTBFD    1024          TEXT('CAMPO DATI INPUT PT')
