000100000000     A*--------------------------------------------------------------*
000200940909     A*  L.F. ARCHIVIO BOLLE PARTENZA DA CLIENTE
000300000000     A*--------------------------------------------------------------*
000400940909     A          R FNVAB000                  PFILE(FNVAB00F)
000500940909     A          K VABCCM
000600940909     A          K VABRMN
000700900330     A**  INDICI PER:
000800900807     A**  - CODICE CLIENTE
000900900807     A**  - RIFERIMENTI MITTENTE NUMERICO
