000100000000      *---------------------------------------------------------------*
000200000000      *  ARCHIVIO BOLLE DI APPOGGIO PER ELABORAZIONI                  *
000300000000      *---------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500000000      *
000600950105     A          R FNWRK000                  TEXT('ARCHIVIO BOLLE DI APPOGGIO')
000700000000     A            WRKFLG         1A         TEXT('FLAG ELABORAZIONE (DI COMODO)-
000800000000     A                                      ')
000900000000     A                                      COLHDG('FLAG' 'ELABOR.')
001000000000     A            WRKAAS    R               REFFLD($AAS)
001100950105     A            WRKLNP    R               REFFLD($LNP)
001200000000     A            WRKMGS    R               REFFLD($MMG)
001300000000     A                                      TEXT('MESE/GIORNO SPEDIZIONE')
001400000000     A            WRKNRS    R               REFFLD($NRS)
001500000000     A            WRKNSP    R               REFFLD($NSP)
001600000000     A            WRKLNA    R               REFFLD($LNA)
001700000000     A            WRKTSP    R               REFFLD($TSP)
001800000000     A            WRKNCL    R               REFFLD($NCL)
001900050112     A* *** CAMPO WRKXCO NON PIU' USATO ***
002000000000     A            WRKXCO    R               REFFLD($XCO)
002100000000     A            WRKNC1    R               REFFLD($NCL)
002200000000     A                                      TEXT('NUMERO COLLI ESAMINATI')
002300000000     A                                      COLHDG('NR.COLLI' 'ESAMINATI')
002400000000     A            WRKTFA    R               REFFLD($TFA)
002500000000     A            WRKCSE         1A         TEXT('C=C/SERVIZIO')
002600000000     A                                      COLHDG('C=CONTO' 'SERVIZIO')
002700970207     A            WRKDBR    R               REFFLD($DBR)
002800970303     A            WRKDPC    R               REFFLD($DPC)
002900970303     A            WRKDUC    R               REFFLD($DUC)
003000970303     A            WRKNPI    R               REFFLD($NPI)
003100000000      *
003200000000     A          K WRKFLG
003300000000     A          K WRKLNP
003400000000     A          K WRKAAS
003500000000     A          K WRKNRS
003600000000     A          K WRKNSP
003700000000     A          K WRKCSE
003800000000      *   INDICI PER:
003900000000      *   - FLAG NORMALE O TRANSITO
004000000000      *   - ANNO SPED.
004100000000      *   - FILIALE PARTENZA
004200000000      *   - SERIE  SPEDIZIONE
004300000000      *   - NUMERO SPEDIZIONE
004400000000      *   - FLAG DI C/SERVIZIO
