000100871021     A*--------------------------------------------------------------*
000200120629     A* WORK ANAGRAFICO CLIENTI POTENZIALI
000300840614     A*--------------------------------------------------------------*
000400920414     A                                      REF(CNDIZION)
000500120629     A          R WFAGP000                  TEXT('CLIENTI POTENZIALI')
000600920414     A*
000700920414     A            CPOCPO    R               REFFLD($CPO)
000800920414     A            CPORAG    R               REFFLD(ACORAG)
000900110131     A            CPOFLS         1A         TEXT('CATEGORIA POTENZIALE')
001000110705     A                                      COLHDG('CAT' 'POT')
001100120629     A            CPSFST         2A         TEXT('STATO CLI.POT (TABELLA 1Q)')
001200120629                                            COLHDG('STATO' 'CLIENTE')
001300120629     A            CPSCNC         2A         TEXT('CAUSALE NON CONTATTO')
