000100871021     A*--------------------------------------------------------------*
000200120629     A* WORK ANAGRAFICO CLIENTI POTENZIALI
000300840614     A*--------------------------------------------------------------*
000400920414     A                                      REF(CNDIZION)
000500120629     A          R WFAGP000                  TEXT('CLIENTI POTENZIALI')
000600920414     A*
000700920414     A            CPOCPO    R               REFFLD($CPO)
000800920414     A            CPORAG    R               REFFLD(ACORAG)
000900120703     A            TRATT_APER     7  0       TEXT('TRATT.APERTE')
001000120926     A            TRATT_CHIU     7  0       TEXT('TRATT.CHIUSE')
001100120703     A            TRATT_MAGG     7  0       TEXT('TRATT.CH > DTA PULIZIA')
001200120703     A            TRATT_MINO     7  0       TEXT('TRATT.CH < DTA PULIZIA')
001300120926     A            ATTIV_MAGG     7  0       TEXT('ATTIV.CH > DTA PULIZIA')
001400120703     A            ATTIV_MINO     7  0       TEXT('ATTIV.CH < DTA PULIZIA')
001500120926     A            ATTIV_APER     7  0       TEXT('ATTIV.APERTE')
001600121012     A            PULIZIA_DI    40          TEXT('COSA PULISCO')
