000100030826      *---------------------------------------------------------------*
000200110913      * L.F.
000300110913     A*  WORKFILE     ANOMALIE  COLLI MANCANTI/ECCEDENTI DA INVIARE AL CLIENTI
000400030826      *---------------------------------------------------------------*
000500110913     A          R WFANC000                  PFILE(WFANC00F)
000600030826      *
000700110913     A          K ANCEPO
