000100040212      *---------------------------------------------------------------*
000200040212      * WRKFILE DETTAGLIO ELENCO C.A.                                 *
000300040212      *---------------------------------------------------------------*
000400040212     A          R WFDDN000                  PFILE(WFDDN00F)
000500040212      *
000600040212     A          K DDNEUT
000700040212     A          K DDNEPO
000800040212     A          K DDNEDT
