000100030826      *---------------------------------------------------------------*
000200110613      * L.F. WORKFILE PER RESTITUZIONE DDT AI MITTENTI                *
000300030826      *---------------------------------------------------------------*
000400110613     A          R WFDDT000                  PFILE(WFDDT00F)
000500030826      *
000600110613     A          K DDTEPO
000700110613     A          K DDTCCM
000800110616     A          K DDTEDT
