000100970711     A*------------------------------------------------------------------------*
000200040331     A* WRK-FILE FILE DISTINTE PER PC
000300970711     A*------------------------------------------------------------------------*
000400040331     A          R WFDSC000                  PFILE(WFDSC00F)
000500040331     A          K DSCFGS
000600040331     A          K DSCNDC
