000100890907     A*---------------------------------------------------------------*
000200040624     A*  ARCHIVIO BOLLE GIACENZA X GENERAZIONE VAG ESTEMPORANEO
000300890907     A*---------------------------------------------------------------*
000400900327     A*
000500050406     A          R TIGCP000                  FORMAT(TIGCP00F)
