000100140509     A          R FIPLGORA                  PFILE(WFIPLGORAF)
000200030826      *
000300140509     A          K ORATIPORCD
000400140509     A          K ORACODAUT
000500140509     A          K ORAFGS
000600140509     A          K ORANDC
000700140509     A          K ORADATA
000800140509     A          K ORAORA
000900140509     A          K ORAIDDOC
