000100970711     A*------------------------------------------------------------------------*
000200031007     A* WRK-FILE LISTA ANOMALIE
000300970711     A*------------------------------------------------------------------------*
000400031007     A          R WFLAN000                  PFILE(WFLAN00F)
000500031007     A          K WLANFLS
000600031007     A          K WLANNRS
