000100070119      *---------------------------------------------------------------*
000200070119      * WorkFile WFNBL00F - Conteggio n° LdV A4/A5                    *
000300070119      *---------------------------------------------------------------*
000400070119     A                                      REF(CNDIZION)
000500070119      *
000600070119     A          R WFNBL000                  TEXT('WrkF conteggio n° Ld-
000700070119     A                                      V A4/A5')
000800070119      *
000900080212      * Estrazione: Utente e Data
001000070119     A            WNBEUT    R               REFFLD($PRU)
001100070119     A                                      TEXT('ESTRAZIONE: utente')
001200070119     A                                      COLHDG(' ' 'Utente' +
001300070119     A                                             'estrazione')
001400070119     A            WNBEDT    R               REFFLD($DA8)
001500070119     A                                      TEXT('ESTRAZIONE: data')
001600070119     A                                      COLHDG(' ' 'Data' +
001700070119     A                                             'estrazione')
001800070119      *
001900070119      * Parametri di lancio
002000070119     A            WNBDTI    R               REFFLD($DA8)
002100070119     A                                      TEXT('PARAMETRI: Data Iniz-
002200070119     A                                      io Periodo')
002300070119     A                                      COLHDG(' Data ' +
002400070119     A                                             'inizio' +
002500070119     A                                             'periodo')
002600070119     A            WNBDTF    R               REFFLD($DA8)
002700070119     A                                      TEXT('PARAMETRI: Data  Fin-
002800070119     A                                      e  Periodo')
002900070119     A                                      COLHDG(' Data ' +
003000070119     A                                             ' fine ' +
003100070119     A                                             'periodo')
003200070119      * Dati: Giorno
003300070124     A            WNBDSP    R               REFFLD($DA8)
003400070119     A                                      TEXT('Data Spedizione')
003500070119     A                                      COLHDG(' ' 'Data' +
003600070119     A                                             'spedizione')
003700080212      * Dati: Linea di partenza
003800070119     A            WNBLNP    R               REFFLD($LNP)
003900080212     A                                      TEXT('Fil. Partenza')
004000080212     A                                      COLHDG(' ' 'Fil.' +
004100070124     A                                                 'part')
004200080212      * Dati: Linea di arrivo
004300070119     A            WNBLNA    R               REFFLD($LNA)
004400080212     A                                      TEXT('Fil. Arrivo')
004500080212     A                                      COLHDG(' ' 'Fil.' +
004600070124     A                                                 'arr.')
004700070119      * Dati: Nr. LdV A4
004800070119     A            WNBNA4         9  0
004900070124     A
005000070119     A                                      TEXT('Numero LdV "A4"')
005100070119     A                                      COLHDG(' ' 'Num.LdV' +
005200070124     A                                                 '    A4 ')
005300070119      * Dati: Nr. LdV A5
005400070119     A            WNBNA5         9  0
005500070119     A                                      TEXT('Numero LdV "A5"')
005600070119     A                                      COLHDG(' ' 'Num.LdV' +
005700070124     A                                                 '    A5 ')
