000100890907     A*---------------------------------------------------------------*
000200041122     A          R WFNRP000
000300041001     A*
000400041122     A            WNPFIL         3S 0       TEXT('LINEA P.O.')
000500041001     A                                      COLHDG('LINEA P.O.')
000600040929     A*
000700041122     A            WNPKSC         7S 0       TEXT('CLIENTE')
000800040929     A                                      COLHDG('CLIENTE')
000900011003     A*
001000041122     A            WNPRAG        40A         TEXT('RAG.SOC.')
001100040929     A                                      COLHDG('RAG.SOC.')
001200040929     A*
001300041122     A            WNPTOT         7S 0       TEXT('TOT.NR.INVIO ')
001400041122     A                                      COLHDG('TOT.NR.INVIO')
001500040929     A*
001600041122     A            WNPNRL         5S 0       TEXT('TOT.LETTERE')
001700041122     A                                      COLHDG('TOT.LETTERE')
001800041001     A*
001900041122     A            WNPNRF         5S 0       TEXT('TOT.FAX')
002000041122     A                                      COLHDG('TOT.FAX')
002100041001     A*
002200041122     A            WNPNRP         5S 0       TEXT('TOT.POSTEL')
002300041122     A                                      COLHDG('TOT.POSTEL')
002400041122     A*
002500041122     A            WNPNRM         5S 0       TEXT('TOT.MAIL')
002600041122     A                                      COLHDG('TOT.MAIL')
002700041001     A*
002800041123     A            WNPNOT        20          TEXT('NOTE    ')
002900041123     A                                      COLHDG('NOTE    ')
003000041123     A*
003100041122     A            WNPDDA         8S 0       TEXT('DA DATA')
003200041001     A                                      COLHDG('DA DATA')
003300041001     A*
003400041122     A            WNPADA         8S 0       TEXT('A DATA')
003500041001     A                                      COLHDG('A DATA')
003600040929     A*
003700041122     A* CHIAVE
003800041122     A          K WNPFIL
003900041122     A          K WNPKSC
