000100000000     A*--------------------------------------------------------------*
000200130305     A*  WORKFILE     CONTEGGIO COLLI IN PARTENZA DA ALRA FILIALI
000300000000     A*--------------------------------------------------------------*
000400890913     A                                      REF(CNDIZION)
000500130305     A          R WFPCL000                  TEXT('WF  CONTEGIO COLLI IN PA-
000600130305     A                                      RT ALTRE TFP-XCO')
000700130305      * Estrazione: Data, utente e p.o.
000800130305     A            PCLFIL         3S 0       TEXT('Fil.BRT RICHIEDENTE ')
000900130305     A            PCLIDUTE      10          TEXT('Uso interno BRT')
001000110913     A*
001100130305     A            PCLTFP    R     S         REFFLD($TFP)
001200130305     A                                      TEXT('TERMINAL PARTENZA BOLLE')
001300130305     A            PCLFLS    R               REFFLD($FLS)
001400130305     A            PCLNRS    R               REFFLD($NRS)
001500130305     A            PCLDSD    R               REFFLD($DA8)
001600130305     A                                      TEXT('DATA SPEDIZIONE DAL')
001700130305     A            PCLDSA    R               REFFLD($DA8)
001800130305     A                                      TEXT('DATA SPEDIZIONE  AL')
001900130305     A            PCLFGS         3S 0       TEXT('FILIALE SPUNTA')
002000130307     A            PCLTBOL        7S 0       TEXT('TOTALE BOLLE')
002100130307     A            PCLTNCL        9S 0       TEXT('TOTALE COLLI')
002200130305     A            PCLTPKG       13S 3       TEXT('TOTALE PESO')
002300130305     A            PCLTPKGB      13S 3       TEXT('TOTALE PESO-MDIA DA-
002400130305     A                                       BOLLA')
002500130305     A            PCLTVLM       13S 6       TEXT('TOTALE VOLUME')
002600130305     A            PCLTVLMB      13S 6       TEXT('TOTALE VOLUME-MEDIA DA -
002700130305     A                                       BOLLA')
002800130305     A
