000100941206     A*------------------------------------------------------------------------*
000200991018     A* FILE DI LAVORO PER STAMPA STATISTICA PESI AUTOMATICI/VDL               *
000300941206     A*------------------------------------------------------------------------*
000400890911     A                                      REF(CNDIZION)
000500090707     A          R WFPESF                    TEXT('WF STAT.PESI DI FILIALE')
000600991018     A            WFPANN    R               REFFLD($AAA)
000700991018     A            WFPMES    R               REFFLD($MMM)
000800991018     A            WFPDIV         1          TEXT('DIVISIONE')
000900930615     A                                      COLHDG('DIV.')
001000991018     A            WFPARE         3  0       TEXT('AREA')
001100930615     A                                      COLHDG('AREA')
001200991018     A            WFPFIL    R               REFFLD($FIL)
001300930625     A                                      TEXT('FILIALE')
001400930625     A                                      COLHDG('FIL.')
001500090706     A            WFPCUN    R               REFFLD($AGE)
001501090706     A                                      TEXT('COMM.LE UNIF.')
001502090706     C                                      COLHDG('COMM.LE' 'UNIF.')
001503090706     A            WFPKSC    R               REFFLD($CSC)
001600991018     A            WFPCTR    R               REFFLD($CTR)
001700040220     A            WFPRAG        40          TEXT('RAGIONE SOCIALE')
001800040220     A                                      COLHDG('RAG. SOC.')
001900991025     A            WFPPSC         9  1       TEXT('PESO VDL')
002000991025     A                                      COLHDG('PESO VDL')
002100991025     A            WFPNCV         7  0       TEXT('N.COLLI VDL')
002200991025     A                                      COLHDG('N.COLLI VDL')
002300991025     A            WFPPSB         9  1       TEXT('PESO BOLL. "DI VDL"')
002400991105     A                                      COLHDG('PESO BOLL.')
002500991025     A            WFPNCL         7  0       TEXT('NUMERO COLLI BOLL. "DI VDL"')
002600991025     A                                      COLHDG('N.COLLI BOLL.')
002700991025     A            WFPNSP         7  0       TEXT('NUM.SPEDIZIONI "DI VDL"')
002800930625     A                                      COLHDG('N.SPED.')
002900991105     A            WFPTCL         7  0       TEXT('TOT. COLL. BOLL.')
003000991025     A                                      COLHDG('TOT.COLLI BOLL.')
003100991025     A            WFPTPB         9  1       TEXT('TOT. PESO  BOLL.     ')
003200991025     A                                      COLHDG('TOT.PESO BOLL.')
003300991025     A            WFPTNS         7  0       TEXT('TOT. NUM. SPED.')
003400991025     A                                      COLHDG('TOT.NUM. SPED.')
