000100030826      *---------------------------------------------------------------*
000200110613      * L.F. WORKFILE PER RESTITUZIONE DDT AI MITTENTI                *
000300030826      *---------------------------------------------------------------*
000400130114     A          R WFPKC000                  PFILE(WFPKC00F)
000500030826      *
000600130114     A          K PKCEPO
000700130114     A          K PKCEDT
