000100950911      *---------------------------------------------------------------*
000200060928      *  WORKFILE PER ELENCO CLIENTI PER SOTTOCONTO INTESTAZIONE FATT.*
000300950911      *---------------------------------------------------------------*
000400950911     A                                      REF(CNDIZION)
000500950911      *
000600060928     A          R WFTA9100                  TEXT('WORKFILE PER ELENCO CLI. X SO-
000700060928     A                                      TTOC.INT.FATTURA')
000800060928     A            WTA91SCF  R               REFFLD($SCF)
000900060928     A            WTA91AGE  R               REFFLD($AGE)
