000100161109     /*END
000200161109      *===============================================================*
000300161109      *?WrkF - Tempi Distinte AUT ("CRI"/"CUS"/"CDC")                ?*
000400161109      *===============================================================*
000500161109     A                                      REF(CNDIZION)
000600161109      *
000700161109     A          R WFTDA000                  TEXT('TEMPI DISTINTE AUT (-
000800161109     A                                      "CRI"/"CUS"/"CDC")')
000900161109      *?Dati estratti?
001000161109     A            WTDANFV   R     S         REFFLD($NFV)
001100161109     A            WTDADFV   R     S         REFFLD($DFV)
001200161109     A            WTDAPDR   R     S         REFFLD($PDR)
001300161109     A            WTDACUS   R     S         REFFLD($HMD)
001400161109     A                                      TEXT('ORA INSERIMENTO FASE-
001500161109     A                                       "CUS"')
001600161109     A                                      COLHDG('Ora Ins.' +
001700161109     A                                             'Fase CUS')
001800161109     A                                      EDTWRD('  :  :  ')
001900161109     A            WTDACRI   R     S         REFFLD($HMD)
002000161109     A                                      TEXT('ORA INSERIMENTO FASE-
002100161109     A                                       "CRI"')
002200161109     A                                      COLHDG('Ora Ins.' +
002300161109     A                                             'Fase CRI')
002400161109     A                                      EDTWRD('  :  :  ')
002500161109     A            WTDACDC   R     S         REFFLD($HMD)
002600161109     A                                      TEXT('ORA INSERIMENTO FASE-
002700161109     A                                       "CDC"')
002800161109     A                                      COLHDG('Ora Ins.' +
002900161109     A                                             'Fase CDC')
003000161109     A                                      EDTWRD('  :  :  ')
