000100100413      *--------------------------------------------------------------*
000200100413      *   VISITE DA TRASCODIFICARE
000300100413      *--------------------------------------------------------------*
000400890913     A                                      REF(CNDIZION)
000500100413     A          R WFVIS000                  TEXT('VISITE DA TRASCODIFICARE')
000600100413     A            WISCMM    R               REFFLD($CMM)
000700100413     A            WISCPO    R               REFFLD($CPO)
000800100413     A            WISKSC    R               REFFLD($KSC)
000900100413     A            WISNRV    R               REFFLD($NRV)
001000100413     A            WISDVI    R               REFFLD($DVI)
001100100414     A            WISHMV    R               REFFLD($HMV)
001200100413     A            WISTPV    R               REFFLD($TPV)
001300100413     A            WISFFZ    R               REFFLD($FFZ)
001400100514     A            WISDPO    R               REFFLD($DPO)
001500100514     A            WISDOE    R               REFFLD($DPO)
001600100514     A                                      TEXT('DATA OFFERTA ESTERA')
001700100514     A                                      COLHDG('DATA' 'OFF' 'ESTERA')
001800100517     A            WISRAG    R               REFFLD(ACORAG)
001900100517     A            WISCNW    R               REFFLD($CNW)
002000100416     A            WISFIL    R               REFFLD($FLT)
002100100416     A                                      TEXT('FILIALE POTENZIALE')
002200100416     A                                      COLHDG('FIL' 'CPO')
002300100416     A            WISCMMP   R               REFFLD($CMM)
002400100416     A                                      TEXT('COMMERCIALE POTENZIALE')
002500100416     A                                      COLHDG('CMM' 'CPO')
002600100416     A            WISOFF    R               REFFLD($FLA)
002700100416     A                                      TEXT('S=OFFERTE')
002800100416     A                                      COLHDG('S' 'OFF')
002900100416     A            WISCOD    R               REFFLD($FLA)
003000100416     A                                      TEXT('S=MAI CODIFICATO')
003100100416     A                                      COLHDG('S' 'NO' 'COD')
003200100510     A            WISNEWF   R               REFFLD($FLA)
003300100513     A                                      TEXT('N=NO NEL NUOVO TIVIS')
003400100513     A                                      COLHDG('N' 'TIVIS')
003500100510     A            WISNFFZ   R               REFFLD($FFZ)
003600100510     A                                      TEXT('NUOVO FLAG FITTIZIO')
003700100510     A                                      COLHDG('NEW' 'FITTIZIO')
003800100510     A            WISNTPV   R               REFFLD($TPV)
003900100510     A                                      TEXT('NUOVO TIPO TRATTATIVA')
004000100510     A                                      COLHDG('NEW' 'TP' 'TRAT')
