000100991014     A*------------------------------------------------------------------------*
000200991014     A*  ARCHIVIO BOLLE FILILE   "INCASSI"                                     *
000300991014     A*------------------------------------------------------------------------*
000400991014     A                                      REF(CNDIZION)
000500991014     A*
000600060127     A          R YFMDI000                  TEXT('ARCHIVIO BOLLE FILIALE "INCAS-
000700991014     A                                      SI"')
000800060127     A            MDIFLE    R               REFFLD($FLE)
000900991014     A                                      EDTCDE(Z)
001000060329     A                                      TEXT('FILIALE DI INCASSO')
001100991014     A                                      COLHDG('FIL.INCASS.')
001200060127     A            MDICUC    R               REFFLD($CDU)
001300991014     A                                      EDTCDE(Z)
001400991014     A                                      TEXT('CODICE OPERATORE')
001500991014     A                                      COLHDG('COD.OPER.')
001600060127     A            MDITMI    R               REFFLD($FLA)
001700060127     A                                      TEXT('TIPO MANDATO D''INTROITO')
001800060127     A                                      COLHDG('TP.M.INTROITO')
001900060127     A            MDINMI    R               REFFLD($NMI)
002000060127     A                                      EDTCDE(Z)
002100060127     A                                      TEXT('NUMERO MANDATO D''INTROITO')
002200060127     A                                      COLHDG('NR.M.INTROITO')
002300060127     A            MDIDMI    R               REFFLD($DMI)
002400991014     A                                      TEXT('DATA MANDATO D''INTROITO')
002500991014     A                                      COLHDG('DT.M.INTROITO')
002600991014     A                                      EDTCDE(8)
002700060130     A            MDIORA    R               REFFLD($OCD)
002800060130     A                                      TEXT('ORA MANDATO D''INTROITO')
002900060130     A                                      COLHDG('ORA.M.INTROITO')
003000060127     A            MDIICON   R               REFFLD($IDC)
003100060127     A                                      TEXT('IMPORTO INCASSATO CONTANTI')
003200060127     A                                      COLHDG('IMP.INC.CON')
003300060127     A            MDIIASS   R               REFFLD($IDC)
003400060127     A                                      TEXT('IMPORTO INCASSATO ASSEGNI')
003500060127     A                                      COLHDG('IMP.INC.ASS')
003600060127     A            MDIIPOS   R               REFFLD($IDC)
003700060127     A                                      TEXT('IMPORTO INCASSATO POS')
003800060127     A                                      COLHDG('IMP.INC.POS')
003900060127     A            MDIFPC         1A         TEXT('FLAG MANDATO PRESO IN CARICO=-
004000991014     A                                      S')
004100991124     A                                      COLHDG('S=PRESO' 'IN' 'CARICO')
004200060127     A            MDIVIE         1A         TEXT('FLAG VERSATO IMPORTO IN EURO=-
004300991103     A                                      S')
004400991124     A                                      COLHDG('S=VERS.' 'IMP' 'EUR')
004500060310     A            MDIKSC    R               REFFLD($KSC)
004600060329     A                                      COLHDG('CLIENTE')
