000100001115      *--------------------------------------------------------------*
000200021119      *  L.F. FILE INC.ATTRIBUIRE DEL GG DOPO X QUADRATURA GIORNAL.
000300001115      *--------------------------------------------------------------*
000400060131     A          R YFQIG000                  PFILE(YFQIG00F)
000500021120     A          K QIGANN
000501021120     A          K QIGFLE
000700021119     A          K QIGDTA
