000100160321     D FIOR000_RQSOPCODE_IMMISSIONE_TEL...
000200140619     D                 C                   1
000300140619     D FIOR000_RQSOPCODE_CONFERMA_INTERNET...
000400140619     D                 C                   2
000500141010     D FIOR000_RQSOPCODE_MANUTENZIONE...
000600141010     D                 C                   3
000700160321     D FIOR000_RQSOPCODE_IMMISSIONE_MAIL...
000800160321     D                 C                   4
000900170530     D FIOR000_RQSOPCODE_CONFERMA_FISSI...
001000170530     D                 C                   5
001100140414     D FIOR000_RPYOPCODE_DONE...
001200140210     D                 C                   0
001300140414     D FIOR000_RPYOPCODE_ERROR...
001400131008     D                 C                   -1
001500140414     D FIOR000_ESITO_OK...
001600131007     D                 C                   0
001700140414     D FIOR000_ESITO_ERRORE...
001800090313     D                 C                   -1
001900140414     D FIOR000_ESITO_RQSOPCODE_SCONOSCIUTO...
002000090313     D                 C                   -2
002100140414     D FIOR000_ESITO_NOME_FORMATO_SCONOSCIUTO...
002200131007     D                 C                   -3
002300140414     D FIOR000_ESITO_VERSIONE_FORMATO_SCONOSCIUTO...
002400131008     D                 C                   -4
002500140414     D FIOR000_ESITO_SIZE_DATA_ERRATO...
002600140210     D                 C                   -5
002700160616     D FIOR000_VIDEO_PRINCIPALE...
002800160616     D                 C                   '01'
002900160616     D FIOR000_VIDEO_ALTRIDATI...
003000160616     D                 C                   '02'
003100160616     D FIOR000_VIDEO_ALERTCOMM...
003200160616     D                 C                   '03'
003300160616     D FIOR000_VIDEO_ALERTCONF...
003400160616     D                 C                   '04'
003500141022     D FIOR000_VIDEO_WHOISORD...
003600160616     D                 C                   '05'
003700140617     D FIOR000_TASTO_F01...
003800140617     D                 C                   CONST(x'31')
003900140617     D FIOR000_TASTO_F02...
004000140617     D                 C                   CONST(x'32')
004100140617     D FIOR000_TASTO_F03...
004200140617     D                 C                   CONST(x'33')
004300140617     D FIOR000_TASTO_F04...
004400140617     D                 C                   CONST(x'34')
004500140617     D FIOR000_TASTO_F05...
004600140617     D                 C                   CONST(x'35')
004700140617     D FIOR000_TASTO_F06...
004800140617     D                 C                   CONST(x'36')
004900140617     D FIOR000_TASTO_F07...
005000140617     D                 C                   CONST(x'37')
005100140617     D FIOR000_TASTO_F08...
005200140617     D                 C                   CONST(x'38')
005300140617     D FIOR000_TASTO_F09...
005400140617     D                 C                   CONST(x'39')
005500140617     D FIOR000_TASTO_F10...
005600140617     D                 C                   CONST(x'3A')
005700140617     D FIOR000_TASTO_F11...
005800140617     D                 C                   CONST(x'3B')
005900140617     D FIOR000_TASTO_F12...
006000140617     D                 C                   CONST(x'3C')
006100140617     D FIOR000_TASTO_F13...
006200140617     D                 C                   CONST(x'B1')
006300140617     D FIOR000_TASTO_F14...
006400140617     D                 C                   CONST(x'B2')
006500140617     D FIOR000_TASTO_F15...
006600140617     D                 C                   CONST(x'B3')
006700140617     D FIOR000_TASTO_F16...
006800140617     D                 C                   CONST(x'B4')
006900140617     D FIOR000_TASTO_F17...
007000140617     D                 C                   CONST(x'B5')
007100140617     D FIOR000_TASTO_F18...
007200140617     D                 C                   CONST(x'B6')
007300140617     D FIOR000_TASTO_F19...
007400140617     D                 C                   CONST(x'B7')
007500140617     D FIOR000_TASTO_F20...
007600140617     D                 C                   CONST(x'B8')
007700140617     D FIOR000_TASTO_F21...
007800140617     D                 C                   CONST(x'B9')
007900140617     D FIOR000_TASTO_F22...
008000140617     D                 C                   CONST(x'BA')
008100140617     D FIOR000_TASTO_F23...
008200140617     D                 C                   CONST(x'BB')
008300140617     D FIOR000_TASTO_F24...
008400140617     D                 C                   CONST(x'BC')
008500140617     D FIOR000_TASTO_ENTER...
008600140617     D                 C                   CONST(x'F1')
008700140617     D FIOR000_TASTO_ROLL_DOWN...
008800140617     D                 C                   CONST(x'F4')
008900140617     D FIOR000_TASTO_ROLL_UP...
009000140617     D                 C                   CONST(x'F5')
009100141010     D FIOR000_ATTR_HI...
009200141010     D                 C                   CONST(X'22')
009300140612     D FIOR000_ATTR_HIUL...
009400140612     D                 C                   CONST(X'26')
009500141010     D FIOR000_ATTR_ND...
009600141010     D                 C                   CONST(X'27')
009700141010     D FIOR000_ATTR_PR...
009800141010     D                 C                   CONST(X'A0')
009900141010     D FIOR000_IMPOSTA_PC...
010000141010     D                 C                   'POSCURSORE'
