000100170217     D FNLGW00_RQSOPCODE_GET_POSSIBILI_DISPO...
000200131009     D                 C                   1
000300170201     D FNLGW00_RPYOPCODE_DONE...
000400140210     D                 C                   0
000500170201     D FNLGW00_RPYOPCODE_ERROR...
000600131008     D                 C                   -1
000700170201     D FNLGW00_ESITO_OK...
000800131007     D                 C                   0
000900170201     D FNLGW00_ESITO_RQSOPCODE_SCONOSCIUTO...
001000090313     D                 C                   -2
001100170201     D FNLGW00_ESITO_NOME_FORMATO_SCONOSCIUTO...
001200131007     D                 C                   -3
001300170201     D FNLGW00_ESITO_SIZE_DATA_ERRATO...
001400140210     D                 C                   -5
001500170201     D FNLGW00_ESITO_ID_RICHIAMO_ERRATO...
001600140520     D                 C                   -6
001700170201     D FNLGW00_ESITO_TIPOELA_ERRATO...
001800140618     D                 C                   -12
001900170201     D FNLGW00_MSG_ERRORE...
002000140527     D                 C                   'E'
