000005180108     D PROJ_CAUSALE_NON_IVA...
000006180108     D                 C                   '0'
000007161024     D PROJ_CAUSALE_IVA...
000008161024     D                 C                   '1'
000015150331     D PROJ_CHAIN...
000016150331     D                 C                   '1'
000017150331     D PROJ_CONTABILITA_CIVILISTICA...
000018150331     D                 C                   'CG'
000019160712     D PROJ_DOCUMENTO_IVA_CLIENTE...
000020160712     D                 C                   'C'
000021180108     D PROJ_DOCUMENTO_IVA_FORNITORE...
000022180108     D                 C                   'F'
000023180108     D PROJ_DOCUMENTO_IVA_FATTURA_NAZIONALE...
000024180108     D                 C                   '0'
000025180108     D PROJ_DOCUMENTO_IVA_NOTA_ACCREDITO_NAZIONALE...
000026180108     D                 C                   '1'
000027180108     D PROJ_DOCUMENTO_IVA_FATTURA_RITENUTA_ACCONTO...
000028180108     D                 C                   '5'
000029150331     D PROJ_ESITO_ERRORE...
000030150331     D                 C                   '1'
000031150331     D PROJ_ESITO_OK...
000032150331     D                 C                   '0'
000033150331     D PROJ_ENTER...
000034150331     D                 C                   *BLANK
000035150331     D PROJ_F3...
000036150331     D                 C                   '1'
000037150331     D PROJ_F6...
000038150331     D                 C                   '0'
000039150331     D PROJ_F12...
000040150331     D                 C                   '2'
000041150331     D PROJ_IVA_ACQUISTI...
000042150331     D                 C                   '1'
000043150331     D PROJ_IVA_VENDITE...
000044150331     D                 C                   '2'
000045170831     D PROJ_IVA_CORRISPETTIVI...
000046170831     D                 C                   '3'
000047180108     D PROJ_IVA_LIQUIDAZIONE_MENSILE...
000048180108     D                 C                   '1'
000049180108     D PROJ_IVA_LIQUIDAZIONE_TRIMESTRALE...
000050180108     D                 C                   '3'
000051150331     D PROJ_NATURA_ATTIVITA...
000052150331     D                 C                   '1'
000053150331     D PROJ_NATURA_COSTO...
000054150331     D                 C                   '3'
000055150331     D PROJ_NATURA_PASSIVITA...
000056150331     D                 C                   '2'
000057150331     D PROJ_NATURA_RICAVO...
000058150331     D                 C                   '4'
000059160712     D PROJ_NOTA_ACCREDITO_ESTERA...
000060160712     D                 C                   '4'
000061160712     D PROJ_NOTA_ACCREDITO_NAZIONALE...
000062160712     D                 C                   '1'
000063170320     D PROJ_NUMERATORE_ALLOCATO...
000064170320     D                 C                   '2'
000104150331     D PROJ_OPZIONE_RICERCA...
000105150331     D                 C                   '01'
000106180108     D PROJ_REGIME_IVA_NORMALE...
000107180108     D                 C                   '0'
000108180108     D PROJ_REGIME_IVA_TRASPORTATORE...
000109180108     D                 C                   '1'
000110180108     D PROJ_REGIME_IVA_TRASPORTATORE_MISTO...
000111180108     D                 C                   '2'
000112150331     D PROJ_REGISTRAZIONE_DEFINITIVA...
000113150327     D                 C                   'D'
000114150327     D PROJ_REGISTRAZIONE_PROVVISORIA...
000115150327     D                 C                   'P'
000116150327     D PROJ_REGISTRAZIONE_GESTIONALE...
000117150327     D                 C                   'G'
000118150331     D PROJ_SOC001...
000119150331     D                 C                   'SOC001'
000120150331     D PROJ_SOC002...
000121150331     D                 C                   'SOC002'
000122171211     D PROJ_SOTTONATURA_CASSA...
000123171211     D                 C                   '1'
000124150331     D PROJ_SOTTONATURA_CLIENTE...
000125150331     D                 C                   'C'
000126150331     D PROJ_SOTTONATURA_FORNITORE...
000127150331     D                 C                   'F'
000128150331     D PROJ_STRUTTURA_DVACLI...
000129150331     D                 C                   'DVACLI'
000130150331     D PROJ_STRUTTURA_DVAFOR...
000131150331     D                 C                   'DVAFOR'
000132150331     D PROJ_STRUTTURA_DVASOG...
000133150331     D                 C                   'DVASOG'
000134180108     D PROJ_STRUTTURA_ANOPE...
000135180108     D                 C                   'ANOPE'
000136180108     D PROJ_STRUTTURA_ND001DS...
000137180108     D                 C                   'ND001DS'
000138151202     D PROJ_CONTO_TRATTAMENTO_ANALITICA_NO...
000139151202     D                 C                   '0'
000140151202     D PROJ_CONTO_TRATTAMENTO_PARTITA_NO...
000141151202     D                 C                   '0'
000142151202     D PROJ_LETTURA_ULTIMO_NUMERO...
000143151202     D                 C                   '1'
000144151202     D PROJ_PRELIEVO_NUMERO_SENZA_DATA...
000145151202     D                 C                   '2'
000146151202     D PROJ_SEGNO_AVERE...
000147151202     D                 C                   'A'
000148151202     D PROJ_SEGNO_DARE...
000149151202     D                 C                   'D'
000150151202     D PROJ_MOVIMENTAZIONE_NON_PERMESSA...
000151151202     D                 C                   ' '
000152151202     D PROJ_MOVIMENTAZIONE_DARE_E_AVERE...
000153151202     D                 C                   '0'
000154151202     D PROJ_MOVIMENTAZIONE_SOLO_DARE...
000155151202     D                 C                   '1'
000156151202     D PROJ_MOVIMENTAZIONE_SOLO_AVERE...
000157151202     D                 C                   '2'
