000100120220     D TIBSSOF_TIPO_SOCIETA_OPERATIVA...
000200120216     D                 C                   'O'
000300120220     D TIBSSOF_NOME_FORMATO_AZORG00F...
000400120220     D                 C                   1
000500120220     D TIBSSOF_VERSIONE_FORMATO_A...
000600120217     D                 C                   'A'
000700120220     D TIBSSOF_RQSOPCODE_INIT...
000800120220     D                 C                   1
000900120220     D TIBSSOF_RQSOPCODE_FINALIZE...
001000120220     D                 C                   2
001100120220     D TIBSSOF_RQSOPCODE_GET_IDSOCIETA_BY_IDFILIALE...
001200120220     D                 C                   3
001300120220     D TIBSSOF_RQSOPCODE_GET_IDFILIALI_BY_IDSOCIETA...
001400120220     D                 C                   4
001500120220     D TIBSSOF_RPYOPCODE_DONE...
001600120220     D                 C                   1
001700120220     D TIBSSOF_RPYOPCODE_ERROR...
001800120220     D                 C                   -1
001900120220     D TIBSSOF_ESITO_OK...
002000120216     D                 C                   0
002100120220     D TIBSSOF_ESITO_ERRORE...
002200120216     D                 C                   -1
002300120220     D TIBSSOF_ESITO_MODULO_NON_INIZIALIZZATO...
002400120216     D                 C                   -2
002500120220     D TIBSSOF_ESITO_MODULO_GIA_INIZIALIZZATO...
002600120216     D                 C                   3
002700120220     D TIBSSOF_ESITO_ID_FILIALE_OBBLIGATORIO...
002800120217     D                 C                   -4
002900120220     D TIBSSOF_ESITO_ID_SOCIETA_OBBLIGATORIO...
003000120217     D                 C                   -5
003100120220     D TIBSSOF_ESITO_NOME_FORMATO_SCONOSCIUTO...
003200120217     D                 C                   -6
003300120220     D TIBSSOF_ESITO_VERSIONE_FORMATO_SCONOSCIUTO...
003400120217     D                 C                   -7
003500120220     D TIBSSOF_ESITO_RQSOPCODE_SCONOSCIUTO...
003600120217     D                 C                   -8
003700120220     D TIBSSOF_ROW_NOT_FOUND...
003800120217     D                 C                   100
