000700160311     D TRTC0TT_RPYOPCODE_DONE...
000800140210     D                 C                   0
000900160311     D TRTC0TT_RPYOPCODE_ERROR...
001000131008     D                 C                   -1
001100160311     D TRTC0TT_ESITO_OK...
001200131007     D                 C                   0
001500160311     D TRTC0TT_ESITO_RQSOPCODE_SCONOSCIUTO...
001600090313     D                 C                   -2
001700160311     D TRTC0TT_ESITO_NOME_FORMATO_SCONOSCIUTO...
001800131007     D                 C                   -3
002100160311     D TRTC0TT_ESITO_SIZE_DATA_ERRATO...
002200140210     D                 C                   -5
002201160311     D TRTC0TT_ESITO_ID_RICHIAMO_ERRATO...
002202140520     D                 C                   -6
002203160315     D TRTC0TT_ESITO_ID_BOLLA_ERRATO...
002204160315     D                 C                   -11
002205160311     D TRTC0TT_ESITO_TIPOELA_ERRATO...
002206140618     D                 C                   -12
002207160311     D TRTC0TT_ESITO_LINEA_PARTNER_NON_GESTITA...
002208160311     D                 C                   -13
003300160311     D TRTC0TT_MSG_ERRORE...
003400140527     D                 C                   'E'
