000100161011     D DIR_ESITO_ROW_NOT_FOUND...
000200110623     D                 C                   100
000300161011     D DIR_ESITO_OK...
000400110623     D                 C                   0
000500161011     D DIR_ESITO_ERRORE_RTVDIRINF...
000600110623     D                 C                   -1
000700161011     D DIR_ESITO_LIBRERIA_NON_VALIDA...
000800110623     D                 C                   -2
000900161011     D DIR_ESITO_RICHIAMO_NON_ESEGUITO...
001000110623     D                 C                   -3
001100161011     D DIR_ESITO_PARAMETRO_OBBLIGATORIO...
001200110624     D                 C                   -4
001300161011     D DIR_ESITO_RICHIAMO_GIA_PREPARATO...
001400110624     D                 C                   -5
001500161011     D DIR_ESITO_RICHIAMO_NON_PREPARATO...
001600110624     D                 C                   -6
001700161011     D DIR_INFLIB_QTEMP...
001800110623     D                 C                   'QTEMP'
001900161011     D DIR_SUBTREE_NONE...
002000110623     D                 C                   '*NONE'
