000100130114     D YCO087_ESITO_OK...
000200130114     D                 C                   0
000300130114     D YCO087_ESITO_ERRORE_GENERICO...
000400130114     D                 C                   -1
000500130114     D YCO087_ESITO_FORMATO_SCONOSCIUTO...
000600130114     D                 C                   -2
000700130114     D YCO087_ESITO_ERRORE_REGISTRAZIONE_INSERT...
000800130114     D                 C                   -3
000900130114     D YCO087_ESITO_FATTURA_NON_TROVATA...
001000130114     D                 C                   -4
001100130115     D YCO087_ESITO_FATTURA_GIA_ELABORATA...
001200130212     D                 C                   5
001300130117     D YCO087_ESITO_FALLITA_CANCELLAZIONE_REGISTRAZIONE...
001400130117     D                 C                   6
001500130117     D YCO087_ESITO_SALDO_PARTITA_NON_AVERE...
001600130117     D                 C                   7
001700130117     D YCO087_ESITO_PARTITA_IN_PAGAMENTO...
001800130117     D                 C                   8
001900130122     D YCO087_ESITO_MANCA_TABELLA_SFA...
002000130122     D                 C                   -9
002100130117     D YCO087_TIPO_ELABORAZIONE_LISTA...
002200130117     D                 C                   '2'
002300130117     D YCO087_TIPO_ELABORAZIONE_CONTROLLO...
002400130117     D                 C                   '4'
002500130117     D YCO087_TIPO_ELABORAZIONE_ESECUZIONE...
002600130117     D                 C                   '6'
