000100100202     D INTRASTAT_SERVIZI_COMMIT...
000200100202     D                 C                   *ON
000300100202     D INTRASTAT_SERVIZI_ESITO_ERROR...
000400100202     D                 C                   -1
000500100129     D INTRASTAT_SERVIZI_ESITO_OK...
000600100129     D                 C                   0
000700100204     D INTRASTAT_SERVIZI_ESITO_WARNING_PARAMETRI...
000800100204     D                 C                   1
000900100204     D INTRASTAT_SERVIZI_ESITO_WARNING_PARAMETRO_ANNO...
001000100204     D                 C                   2
001100100204     D INTRASTAT_SERVIZI_ESITO_WARNING_PARAMETRO_MESE...
001200100204     D                 C                   3
001300100204     D INTRASTAT_SERVIZI_ESITO_WARNING_PARAMETRO_REGISTRO...
001400100204     D                 C                   4
001500100204     D INTRASTAT_SERVIZI_ESITO_WARNING_PARAMETRO_SEZIONE...
001600100204     D                 C                   5
001700100204     D INTRASTAT_SERVIZI_ESITO_WARNING_PARAMETRO_REPLACE...
001800100204     D                 C                   6
001900100204     D INTRASTAT_SERVIZI_ESITO_WARNING_SEQUENZA...
002000100204     D                 C                   7
002100100204     D INTRASTAT_SERVIZI_ESITO_WARNING_ID_DOCUMENTO...
002200100204     D                 C                   8
002300100204     D INTRASTAT_SERVIZI_ESITO_WARNING_NAZIONE_SOGGETTO...
002400100204     D                 C                   9
002500100204     D INTRASTAT_SERVIZI_ESITO_WARNING_CODICE_IVA_SOGGETTO...
002600100204     D                 C                   10
002700100204     D INTRASTAT_SERVIZI_ESITO_WARNING_IMPORTO_EURO...
002800100204     D                 C                   11
002900100204     D INTRASTAT_SERVIZI_ESITO_WARNING_CODICE_SERVIZIO...
003000100204     D                 C                   12
003100100204     D INTRASTAT_SERVIZI_ESITO_WARNING_SEGNO...
003200100204     D                 C                   13
003300100204     D INTRASTAT_SERVIZI_ESITO_WARNING_ID_FATTURA...
003400100204     D                 C                   14
003500100204     D INTRASTAT_SERVIZI_ESITO_WARNING_EROGAZIONE...
003600100204     D                 C                   15
003700100204     D INTRASTAT_SERVIZI_ESITO_WARNING_INCASSO...
003800100204     D                 C                   16
003900100204     D INTRASTAT_SERVIZI_ESITO_WARNING_PAESE_PAGAMENTO...
004000100204     D                 C                   17
004100100204     D INTRASTAT_SERVIZI_ESITO_WARNING_RETTIFICA_PERIODO...
004200100204     D                 C                   18
004300100204     D INTRASTAT_SERVIZI_ESITO_WARNING_PARAMETRO_NUMERO_ASSOLUTO...
004400100204     D                 C                   19
004500100204     D INTRASTAT_SERVIZI_ESITO_WARNING_REGISTRAZIONE_NON_TROVATA...
004600100204     D                 C                   20
004700100204     D INTRASTAT_SERVIZI_ESITO_WARNING_REGISTRAZIONE_NON_VALIDA...
004800100204     D                 C                   21
004900100204     D INTRASTAT_SERVIZI_ESITO_WARNING_REGISTRAZIONE_FATTURA_NON_TROVATA...
005000100204     D                 C                   22
005100100204     D INTRASTAT_SERVIZI_ESITO_WARNING_DOCUMENTO_NO_SERVIZIO...
005200100204     D                 C                   23
005300100129     D INTRASTAT_SERVIZI_ESITO_WARNING_NAZIONE_NO_UE...
005400100204     D                 C                   24
005500100201     D INTRASTAT_SERVIZI_ESITO_WARNING_FATTURA_VECCHIA...
005600100204     D                 C                   25
005700100204     D INTRASTAT_SERVIZI_ESITO_WARNING_SOGGETTO_NON_TROVATO...
005800100204     D                 C                   26
005900100204     D INTRASTAT_SERVIZI_ESITO_WARNING_CONDIZIONE_PAGAMENTO_NON_TROVATA...
006000100204     D                 C                   27
006100100205     D INTRASTAT_SERVIZI_ESITO_WARNING_CAUSALE_NON_TROVATA...
006200100205     D                 C                   28
006300100210     D INTRASTAT_SERVIZI_ESITO_WARNING_DOCUMENTO_GIA_INSERITO...
006400100210     D                 C                   29
006500100714     D INTRASTAT_SERVIZI_ESITO_WARNING_PROGRESSIVO_SEZIONE3_NONREPERITO...
006600100714     D                 C                   30
006700100129     D INTRASTAT_SERVIZI_EROGAZIONE_A_PIU_RIPRESE...
006800100129     D                 C                   'R'
006900100129     D INTRASTAT_SERVIZI_EROGAZIONE_ISTANTANEA...
007000100129     D                 C                   'I'
007100100129     D INTRASTAT_SERVIZI_INCASSO_ACCREDITO...
007200100129     D                 C                   'A'
007300100129     D INTRASTAT_SERVIZI_INCASSO_ALTRO...
007400100129     D                 C                   'X'
007500100129     D INTRASTAT_SERVIZI_INCASSO_BONIFICO...
007600100129     D                 C                   'B'
007700100129     D INTRASTAT_SERVIZI_REGISTRO_ESPORTAZIONI...
007800100129     D                 C                   'E'
007900100129     D INTRASTAT_SERVIZI_REGISTRO_IMPORTAZIONI...
008000100129     D                 C                   'I'
008100100202     D INTRASTAT_SERVIZI_ROLLBACK...
008200100202     D                 C                   *ON
008300100205     D INTRASTAT_SERVIZI_SEGNO_MENO...
008400100205     D                 C                   '-'
008500100205     D INTRASTAT_SERVIZI_SEGNO_PIU...
008600100205     D                 C                   '+'
008700100129     D INTRASTAT_SERVIZI_SEZIONE_RESI...
008800100129     D                 C                   '3'
008900100129     D INTRASTAT_SERVIZI_SEZIONE_RETTIFICHE...
009000100129     D                 C                   '4'
009100100202     D INTRASTAT_SERVIZI_START_COMMIT_CONTROL...
009200100202     D                 C                   *ON
009300100202     D INTRASTAT_SERVIZI_TUTTO...
009400100202     D                 C                   '*'
009500100202     D INTRASTAT_SERVIZI_DOCUMENTO_FATTURA...
009600100202     D                 C                   'F'
009700100202     D INTRASTAT_SERVIZI_DOCUMENTO_NOTA_ACCREDITO...
009800100202     D                 C                   'A'
