000100120509     D YCOCTZOUT_OPERAZIONE_INSERIRE...
000200120509     D                 C                   1
000300120509     D YCOCTZOUT_OPERAZIONE_AGGIORNARE...
000400120509     D                 C                   2
000500120509     D YCOCTZOUT_OPERAZIONE_ANNULLARE...
000600120509     D                 C                   3
000700120509     D YCOCTZOUT_OPERAZIONE_RIPRISTINARE...
000800120509     D                 C                   4
000900120509     D YCOCTZOUT_OPERAZIONE_CANCELLARE...
001000120509     D                 C                   5
001100120712     D YCOCTZOUT_OPERAZIONE_NUOVO_STATO...
001200120712     D                 C                   6
001300120712     D YCOCTZOUT_OPERAZIONE_CANCELLARE_STATO...
001400120712     D                 C                   7
