000100170207     D YDRERE_ERRORE...
000101170207     D                 C                   -1
000102170207     D YDRERE_OK...
000103170207     D                 C                   0
000104170207     D YDRERE_INSERIMENTO_AUTOMATICO...
000105170207     D                 C                   'A'
000106170210     D YDRERE_INSERIMENTO_MANUALE...
000107170207     D                 C                   'M'
000108170207     D YDRERE_OPERAZIONE_INSERT...
000109170207     D                 C                   'INSERT'
000110170207     D YDRERE_OPERAZIONE_UPDATE...
000111170207     D                 C                   'UPDATE'
000112170207     D YDRERE_OPERAZIONE_DELETE...
000113170207     D                 C                   'DELETE'
000114170207     D YDRERE_OPERAZIONE_ANNUL...
000115170207     D                 C                   'ANNUL'
000116170207     D YDRERE_OPERAZIONE_RESET...
000117170207     D                 C                   'RESET'
