000100090224     D CBIPE_BANCA_BENEFICIARIA...
000200090224     D                 C                   'BF'
000300090224     D CBIPE_CAUSALE_VALUTARIA_INFERIORE_LIMITE...
000400110728     D                 C                   '7010'
000500090109     D CBIPE_CLEAN_PAYMENT...
000600090109     D                 C                   '1'
000700081215     D CBIPE_CVS_EMISSIONE_E_REGOLAMENTO...
000800081215     D                 C                   'EMI'
000900081215     D CBIPE_CVS_INFERIORE_A_LIMITE...
001000081215     D                 C                   'INF'
001100090109     D CBIPE_CVS_SOLA_CAUSALE_VALUTARIA...
001200090109     D                 C                   'CVA'
001300090109     D CBIPE_CVS_CESSIONE_DIVISA_TRA_RESIDENTI...
001400090109     D                 C                   'CDV'
001500081215     D CBIPE_CVS_SOGGETTO_NON_RESIDENTE...
001600081215     D                 C                   'SNR'
001700081215     D CBIPE_DATA_CREAZIONE_DISPOSIZIONE...
001800081209     D                 C                   '137'
001900081215     D CBIPE_DATA_DISPONIBILITA...
002000081209     D                 C                   '227'
002100081215     D CBIPE_DATA_VALUTA_ACCREDITO...
002200081209     D                 C                   '140'
002300081215     D CBIPE_DATA_VALUTA_ADDEBITO...
002400081209     D                 C                   '228'
002500081215     D CBIPE_DATA_ESECUZIONE...
002600081209     D                 C                   '203'
002700081215     D CBIPE_DIVISA_BONIFICO_ACCREDITO_DIVERSE...
002800081209     D                 C                   '57'
002900081215     D CBIPE_DIVISA_BONIFICO_ACCREDITO_UGUALI...
003000081209     D                 C                   '9'
003100081215     D CBIPE_DOCUMENTO_CONTRATTO...
003200081205     D                 C                   '315'
003300081215     D CBIPE_DOCUMENTO_FATTURACOMMERCIALE...
003400081205     D                 C                   '380'
003500081215     D CBIPE_TRANSAZIONE_DOMESTICA...
003600081209     D                 C                   'DO'
003700081215     D CBIPE_TRANSAZIONE_INTERNAZIONALE...
003800081209     D                 C                   'IN'
003900081215     D CBIPE_ESITO_ERROR_BGM_1004_OBBLIGATORIO...
004000081215     D                 C                   -101
004100081215     D CBIPE_ESITO_ERROR_BUS_3279_NONVALIDO...
004200081215     D                 C                   -102
004300081215     D CBIPE_ESITO_ERROR_BUS_4487_NONVALIDO...
004400081215     D                 C                   -103
004500081215     D CBIPE_ESITO_ERROR_CAUSALEVALUTARIA_OBBLIGATORIO...
004600081215     D                 C                   -104
004700081215     D CBIPE_ESITO_ERROR_CVS_IMPORTO_LIMITE_NONTROVATO...
004800081215     D                 C                   -105
004900081215     D CBIPE_ESITO_ERROR_DTM_2_2005_NONVALIDO...
005000081215     D                 C                   -106
005100081215     D CBIPE_ESITO_ERROR_DTM_3_2005_NONVALIDO...
005200081215     D                 C                   -107
005300081215     D CBIPE_ESITO_ERROR_FTX_C108_OBBLIGATORIO...
005400081215     D                 C                   -108
005500081215     D CBIPE_ESITO_ERROR_FTX_4451_NONVALIDO...
005600081215     D                 C                   -109
005700081215     D CBIPE_ESITO_ERROR_IBANBENEFICIARIO_OBBLIGATORIO...
005800081215     D                 C                   -110
005900081215     D CBIPE_ESITO_ERROR_IBANORDINANTE_OBBLIGATORIO...
006000081215     D                 C                   -111
006100081215     D CBIPE_ESITO_ERROR_MITTENTE_OBBLIGATORIO...
006200081215     D                 C                   -112
006300081215     D CBIPE_ESITO_ERROR_MOA_5004_NONVALIDO...
006400081215     D                 C                   -113
006500081215     D CBIPE_ESITO_ERROR_MOA_5025_NONVALIDO...
006600081215     D                 C                   -114
006700081215     D CBIPE_ESITO_ERROR_MOA_6345_NONVALIDO...
006800081215     D                 C                   -115
006900081215     D CBIPE_ESITO_ERROR_NAD_3124_OBBLIGATORIO...
007000081215     D                 C                   -116
007100081215     D CBIPE_ESITO_ERROR_NOMESUPPORTO_GIAUSATO...
007200081215     D                 C                   -117
007300081215     D CBIPE_ESITO_ERROR_NOMESUPPORTO_OBBLIGATORIO...
007400081215     D                 C                   -118
007500081215     D CBIPE_ESITO_ERROR_PAESEBENEFICIARIO_NONVALIDO...
007600081215     D                 C                   -119
007700081215     D CBIPE_ESITO_ERROR_PAESEBENEFICIARIO_OBBLIGATORIO...
007800081215     D                 C                   -120
007900081215     D CBIPE_ESITO_ERROR_RICEVENTE_OBBLIGATORIO...
008000081215     D                 C                   -121
008100110728     D CBIPE_ESITO_ERROR_CAUSALEVALUTARIA_NONVALIDO...
008200110728     D                 C                   -122
008300081215     D CBIPE_ESITO_WARNING_FLUSSOSQUADRATO...
008400081215     D                 C                   101
