000100061017             PGM        PARM(&KPJBA)
000200061017
000300061017
000400061017             DCL        VAR(&KPJBA)  TYPE(*CHAR)  LEN(502)
000500061010
000600061010             ADDLIBLE EDPFGCAP
000700061010             MONMSG     MSGID(CPF0000)
000800061016
000900061017             CLRPFM     FILE(WFDCPL00F)
001000061016
001100061204             CALL       PGM(TISP20RE2) PARM(&KPJBA)
001200000000
001300061123             RMVLIBLE EDPFGCAP
001400061123             MONMSG     MSGID(CPF0000)
001500000000
001600000000             ENDPGM
