000010100521     A*%%TS  SD  20100521  111838  EDPMM       REL-V6R1M0  5761-WDS
000020100521     A*%%EC
000030100521     A                                      DSPSIZ(24 80 *DS3)
000040100521     A                                      PRINT
000050100521     A                                      INDARA
000060100521     A                                      ERRSFL
000070100521     A                                      CF03
000080100521     A          R F01
000090100521     A*%%TS  SD  20100521  111838  EDPMM       REL-V6R1M0  5761-WDS
000100100521     A                                      WINDOW(6 45 5 30)
000110100521     A                                      CF06
000120100521     A                                      OVERLAY
000130100521     A                                      WDWBORDER((*DSPATR RI) (*CHAR '\ / -
000140100521     A                                       / \'))
000150100521     A                                      RMVWDW
000160100521     A                                      USRRSTDSP
000170100521     A                                      WDWTITLE((*TEXT 'Totale cassaforte -
000180100521     A                                      con feritoia'))
000190100521     A            VTOTALE       11Y 2B  2  9EDTCDE(2)
000200100521     A                                      DSPATR(UL)
000210100521     A                                      DSPATR(HI)
000220100521     A                                      CHECK(RB)
000230100521     A                                  4 11'F6=Conferma'
000240100521     A                                  3  8'Importo errato'
000250100521     A                                      DSPATR(BL)
000260100521     A N66                                  DSPATR(ND)
000270100517     A          R ASSUME
000280060323     A*%%TS  SD  20060323  154842  EDPMM       REL-V5R3M0  5722-WDS
000290100517     A                                      TEXT('Serve x preservare il video p-
000300100517     A                                      recedente')
000310100517     A                                      KEEP
000320100517     A                                      ASSUME
000330100517     A                                  1  2' '
000340100517     A          R FRCDTA
000350100517     A*%%TS  DD  20060330  171931  CussiniD    REL-V5.0.1  WDSc
000360100517     A                                      FRCDTA
000370100517     A                                      CLRL(*NO)
