000010060502     A*%%TS  SD  20060502  103613  EDPBA       REL-V5R3M0  5722-WDS
000020911112     A*  91/11/12  10:08:25    EDPWB       REL-R03M00  5728-PW1
000030060502     A*%%EC
000040060502     A                                      DSPSIZ(24 80 *DS3)
000050060502     A                                      PRINT
000060060502     A          R CN0W102
000070060502     A*%%TS  SD  20060502  103613  EDPBA       REL-V5R3M0  5722-WDS
000080060502     A                                      WINDOW(10 10 10 63)
000090060502     A                                      CA03
000100060502     A N20                                  CF06
000110060502     A                                      OVERLAY
000120060502     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
000130060502     A                                          '))
000140060502     A            KNMUS         10A  O  1  1
000150060502     A                                  1 14'STORNO RICEVUTA MANDATO DI VERSAME-
000160060502     A                                      NTO'
000170060502     A                                      DSPATR(RI)
000180060502     A                                      DSPATR(UL)
000190060502     A                                  1 55'CNC0W11R'
000200060502     A                                  2 20'CASSAFORTE CON FERITOIA'
000210060502     A                                      DSPATR(RI)
000220060502     A                                      DSPATR(UL)
000230060502     A                                  4  7'Punto operativo'
000240060502     A            POV            3Y 0B  4 39EDTCDE(2)
000250060502     A  01                                  ERRMSG('Punto operativo errato' 01)
000260060502     A                                      DSPATR(HI)
000270060502     A            DESPO         20A  O  4 43
000280060502     A                                  5  7'Codice Operatore               '
000290060502     A            CUCV           3Y 0B  5 39EDTCDE(2)
000300060502     A  01                                  ERRMSG('Punto operativo errato' 01)
000310060502     A                                      DSPATR(HI)
000320060502     A            DESCUC        20A  O  5 43
000330060502     A                                  6  7'Data mandato da stornare    '
000340060502     A            DTAV           8Y 0B  6 39EDTWRD('  /  /    ')
000350060502     A                                      DSPATR(HI)
000360060502     A                                  7  7'Ora  mandato da stornare       '
000370060502     A            ORAV           6Y 0B  7 39EDTWRD('  :  :  ')
000380060502     A                                      EDTMSK('  &  &  ')
000390060502     A                                      DSPATR(HI)
000400060502     A                                  8  3'F3=Fine'
000410060502     A                                      COLOR(BLU)
000420060502     A                                  8 13'F6=Conferma'
000430060502     A                                      COLOR(BLU)
000440060502     A  20                                  DSPATR(ND)
000450060502     A            $MSG          63A  O  9  1COLOR(RED)
