000100930823     A*%%TS  SD  19930823  184313  EDPWB       REL-V2R1M0  5738-PW1
000200930823     A*%%EC
000300930823     A                                      DSPSIZ(24 80 *DS3)
000400930823     A                                      CHGINPDFT(HI CS)
000500930823     A                                      PRINT
000600930823     A                                      HLPDOC('INIZIO' 'CGE_1_03' 'ORIONH')
000700930823     A                                      HELP
000800930823     A          R C032D01
000900930823     A*%%TS  SD  19930823  184313  EDPWB       REL-V2R1M0  5738-PW1
001000930823     A                                      CA03
001100930823     A                                      CA14
001200930823     A            RSUT          20A  O  1  2
001300930823     A                                  1 24'* Manutenzione Causali Operative  -
001400930823     A                                       *'
001500930823     A                                      DSPATR(RI)
001600930823     A                                      DSPATR(UL)
001700930823     A            NOMPGM        11A  O  1 61
001800930823     A                                  1 73DATE
001900930823     A                                      EDTCDE(Y)
002000930823     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
002100930823     A                                  2 24'*       Primanota Generica        -
002200930823     A                                       *'
002300930823     A                                      DSPATR(RI)
002400930823     A                                      DSPATR(UL)
002500930823     A                                  2 61'* Gruppo Pro *'
002600930823     A                                  4 10'Causale'
002700930823     A            P34CD1         2A  O  4 19DSPATR(HI)
002800930823     A            P34COD         4A  O  4 23DSPATR(HI)
002900930823     A            P34DES        16A  B  4 29COMP(NE ' ')
003000930823     A                                  4 50'P-0,1.....'
003100930823     A            G00101         1A  O  4 61
003200930823     A            MESSAG        15A  O  4 65
003300930823     A            MESSA1        15A  O  5 65
003400930823     A                                  6  2'P-0,2   ''1'' creaz.portaf., ''2''-
003500930823     A                                       storno/rich.,''3'' insol. ...'
003600930823     A            G00202         1A  B  6 61VALUES(' ' '0' '1' '2' '3' '4' '5' -
003700930823     A                                      '6')
003800930823     A                                  6 65'( /1/2/3/4/5/6)'
003900930823     A                                  7 10'''4'' pag.insol.,''5'' pres./rit.,-
004000930823     A                                      ''6'' accr./addeb.    '
004100930823     A                                  7 65'( /no portaf.)'
004200930823     A                                  8  6'3'
004300930823     A                                  8 10'Con ''1'' permessa movimentazione -
004400930823     A                                      IVA ..............'
004500930823     A            G00303         1A  B  8 61VALUES(' ' '0' '1')
004600930823     A                                  8 65'( /1)'
004700930823     A                                  9  6'4'
004800930823     A                                  9 10'Con ''1'' Movimento escluso dal Gi-
004900930823     A                                      roconto a Erario..'
005000930823     A            G00404         1A  B  9 61
005100930823     A                                  9 65'( /1)'
005200930823     A                                 10  6'5'
005300930823     A                                 10 10'Con ''1'' permessa cancellazione m-
005400930823     A                                      ov. provvisori ...'
005500930823     A            G00505         1A  B 10 61VALUES(' ' '0' '1')
005600930823     A                                 10 65'( /1)'
005700930823     A                                 11  6'6'
005800930823     A                                 11 10'Gestione descrizione aggiuntiva ..-
005900930823     A                                      ................'
006000930823     A            G00606         1A  B 11 61VALUES(' ' '0' '2' '3' '4')
006100930823     A                                 11 65'( /2/3/4)'
006200930823     A                                 12  6'7'
006300930823     A                                 12 10'Con ''1'' sono obbligatori data/nr-
006400930823     A                                      . documento ......'
006500930823     A            G00707         1A  B 12 61VALUES(' ' '1')
006600930823     A                                 12 65'( /1)'
006700930823     A                                 13  6'8'
006800930823     A                                 13 10'..................................-
006900930823     A                                      ................'
007000930823     A            G00808         1A  B 13 61
007100930823     A                                 14  6'9'
007200930823     A                                 14 10'..................................-
007300930823     A                                      ................'
007400930823     A            G00909         1A  B 14 61
007500930823     A                                 15  5'10'
007600930823     A                                 15 10'..................................-
007700930823     A                                      ................'
007800930823     A            G01010         1A  B 15 61
007900930823     A                                 16  2'P-1,1'
008000930823     A                                 16 10'Controllo movimentazione su Client-
008100930823     A                                      i ..............'
008200930823     A            G10101         1A  B 16 61VALUES('D' 'A' 'E' ' ')
008300930823     A                                 16 65'(D/A/E/ )'
008400930823     A                                 17  2'P-2,1'
008500930823     A                                 17 10'Controllo movimentazione su Fornit-
008600930823     A                                      ori ............'
008700930823     A            G20101         1A  B 17 61VALUES(' ' 'D' 'A' 'E')
008800930823     A                                 17 65'(D/A/E/ )'
008900930823     A                                 18  2'P-3,1'
009000930823     A                                 18 10'Controllo movimentazione su Agenti-
009100930823     A                                       ...............'
009200930823     A            G30101         1A  B 18 61VALUES(' ' 'D' 'A' 'E')
009300930823     A                                 18 65'(D/A/E/ )'
009400930823     A                                 19  2'P-4,1'
009500930823     A                                 19 10'Controllo movimentazione su Cassa -
009600930823     A                                      ................'
009700930823     A            G40101         1A  B 19 61VALUES(' ' 'A' 'D' 'E')
009800930823     A                                 19 65'(D/A/E/ )'
009900930823     A                                 20  2'P-5,1'
010000930823     A                                 20 10'..................................-
010100930823     A                                      ................'
010200930823     A            G50101         1A  B 20 61
010300930823     A                                 21  2'P-6,1'
010400930823     A                                 21 10'Controllo movimentazione su Banche-
010500930823     A                                       c/c ...........'
010600930823     A            G60101         1A  B 21 61VALUES(' ' 'D' 'A' 'E')
010700930823     A                                 21 65'(D/A/E/ )'
010800930823     A                                 22  2'                                  -
010900930823     A                                                                         -
011000930823     A                                               '
011100930823     A                                      DSPATR(UL)
011200930823     A                                 23  2'F3=Fine'
011300930823     A                                 23 14'Invio=Altri dati'
011400930823     A                                 23 36'F14=Block Notes'
011500930823     A  77                                  DSPATR(ND)
011600930823     A  98N77                               DSPATR(BL)
011700930823     A                                  5 10'Trasmissione a filiali (N=No, blan-
011800930823     A                                      k=Si) ..........'
011900930823     A                                      DSPATR(HI)
012000930823     A            OPEFTT         1A  B  5 61TEXT('trasmissione a filiali N=no')
012100930823     A                                      VALUES(' ' 'N')
012200930823     A                                      DSPATR(HI)
012300930823     A                                      DSPATR(CS)
012400930823     A          R C032D02
012500930823     A*%%TS  SD  19930823  180635  EDPWB       REL-V2R1M0  5738-PW1
012600930823     A                                      CA03
012700930823     A N70                                  CF05
012800930823     A                                      CF06
012900930823     A                                      CF12
013000930823     A N70                                  CF16
013100930823     A            RSUT          20A  O  1  2
013200930823     A                                  1 24'* Manutenzione Causali Operative  -
013300930823     A                                       *'
013400930823     A                                      DSPATR(RI)
013500930823     A                                      DSPATR(UL)
013600930823     A            NOMPGM        11A  O  1 61
013700930823     A                                  1 73DATE
013800930823     A                                      EDTCDE(Y)
013900930823     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
014000930823     A                                  2 24'*       Primanota Generica        -
014100930823     A                                       *'
014200930823     A                                      DSPATR(RI)
014300930823     A                                      DSPATR(UL)
014400930823     A                                  2 61'* Gruppo Pro *'
014500930823     A                                  4 10'Causale'
014600930823     A            P34CD1         2A  O  4 19DSPATR(HI)
014700930823     A            P34COD         4A  O  4 23DSPATR(HI)
014800930823     A            P34DES        16A  B  4 29COMP(NE ' ')
014900930823     A            MESSAG        15A  O  4 65
015000930823     A            MESSA1        15A  O  5 65
015100930823     A                                  6  2'P-2,8'
015200930823     A                                  6 10'Con ''1'' Reg.Spese Fornitore per -
015300930823     A                                      Contab.Pubblica...'
015400930823     A            G20808         1A  B  6 61VALUES(' ' '1')
015500930823     A                                  6 65'( /1)'
015600930823     A                                  7  6'9'
015700930823     A                                  7 10'Con ''1'' caus. di reg. vendite pe-
015800930823     A                                      r corrispettivi...'
015900930823     A            G20909         1A  B  7 61VALUES(' ' '1')
016000930823     A                                  7 65'( /1)'
016100930823     A                                  8  2'P-8,1'
016200930823     A                                  8 10'Controllo movimentazione su altri -
016300930823     A                                      conti ..........'
016400930823     A            G80101         1A  B  8 61VALUES(' ' 'D' 'A' 'E')
016500930823     A                                  8 65'(D/A/E/ )'
016600930823     A                                  9  2'P-7,2'
016700930823     A                                  9 10'Con ''1'' esclusione dai bilanci e-
016800930823     A                                      stesi ............'
016900930823     A            G70202         1A  B  9 61VALUES(' ' '0' '1')
017000930823     A                                  9 65'( /1)'
017100930823     A                                 10  6'3'
017200930823     A                                 10 10'E/C: movimento insoluto (3), prome-
017300930823     A                                      sse (4) ........'
017400930823     A            G70303         1A  B 10 61VALUES(' ' '0' '3' '4')
017500930823     A                                 10 65'(3/4)'
017600930823     A                                 11  6'4'
017700930823     A                                 11 10'E/C: somma movimento in portafogli-
017800930823     A                                      o ..............'
017900930823     A            G70404         1A  B 11 61VALUES(' ' '0' '1')
018000930823     A                                 11 65'(1=si)'
018100930823     A                                 12  5'5/6'
018200930823     A                                 12 10'E/C: giorni di rischio ...........-
018300930823     A                                      ................'
018400930823     A            G70506         2A  B 12 61RANGE('00' '99')
018500930823     A                                      CHECK(AB)
018600930823     A                                 12 65'(00-99)'
018700930823     A                                 13  6'7'
018800930823     A                                 13 10'E/C: tipologia rimessa diretta sca-
018900930823     A                                      duta............'
019000930823     A            G70707         1A  B 13 61
019100930823     A                                 14  6'8'
019200930823     A                                 14 10'E/C: tipologia insoluto/protesto .-
019300930823     A                                      ................'
019400930823     A            G70808         1A  B 14 61VALUES(' ' 'I' 'P')
019500930823     A                                 14 65'(I/P)'
019600930823     A                                 15  6'9'
019700930823     A                                 15 10'Per incassi o pagamenti: modalità -
019800930823     A                                      (V. tabella 18).'
019900930823     A            G70909         1A  B 15 61
020000930823     A                                 16  5'10'
020100930823     A                                 16 10'Causale tecnica esclusa dagli Scad-
020200930823     A                                      enziari.........'
020300930823     A            G71010         1A  B 16 61VALUES(' ' '1')
020400930823     A                                 16 65'(1=esclusa)'
020500930823     A                                 17  2'P-6,2'
020600930823     A                                 17 10'Gestione finanziamenti: modulo CTF-
020700930823     A                                      ................'
020800930823     A            G60202         1A  B 17 61VALUES(' ' '1' '2' '3' '4' '5' '6')
020900930823     A                                 17 65'( /1/2/3/4/5/6)'
021000930823     A                                 18  2'P-8,2'
021100930823     A                                 18 10'..................................-
021200930823     A                                      ................'
021300930823     A            G80202         1A  B 18 61
021400930823     A                                 19  4'3/4'
021500930823     A                                 19 10'..................................-
021600930823     A                                      ................'
021700930823     A            G80303         1A  B 19 61
021800930823     A            G80404         1A  B 19 63
021900930823     A                                 20  6'5'
022000930823     A                                 20 10'..................................-
022100930823     A                                      ................'
022200930823     A            G80505         1A  B 20 61
022300930823     A                                 21  3'7/10'
022400930823     A                                 21 10'Causale operazione bancaria ......-
022500930823     A                                      ................'
022600930823     A            G80710         4A  B 21 61
022700930823     A                                 22  2'                                  -
022800930823     A                                                                         -
022900930823     A                                               '
023000930823     A                                      DSPATR(UL)
023100930823     A                                 23  2'F3=Fine'
023200930823     A                                 23 14'F5=Ripristino'
023300930823     A  77                                  DSPATR(ND)
023400930823     A                                 23 32'F6=Conferma'
023500930823     A  77                                  DSPATR(ND)
023600930823     A                                 23 48'F12=Ritorno'
023700930823     A                                 23 64'F16=Annullamento'
023800930823     A  77                                  DSPATR(ND)
023900930823     A          R C032D03
024000930823     A*%%TS  SD  19930823  180635  EDPWB       REL-V2R1M0  5738-PW1
024100930823     A                                      CA03
024200930823     A                                      BLINK
024300930823     A                                      OVERLAY
024400930823     A                                      PROTECT
024500930823     A          R C032D04
024600930823     A*%%TS  SD  19930823  180635  EDPWB       REL-V2R1M0  5738-PW1
024700930823     A                                      CA03
024800930823     A                                      CF12
024900930823     A                                      BLINK
025000930823     A                                      OVERLAY
025100930823     A                                      PROTECT
