000010030320     A*%%TS  SD  20030320  120421  EDPDC       REL-V4R4M0  5769-PW1
000020900601     A*  90/06/01  10:19:25    EDPWB       REL-R02M00  5728-PW1
000030000000     A*            11:33:07    INALPGM     REL-R08M00  5714-UT1
000040030320     A*%%EC
000050030320     A                                      DSPSIZ(24 80 *DS3)
000060030320     A                                      REF(*LIBL/CNABI00F)
000070890727     A*  89/07/27  15:35:55    MAZZALI     REL-R01M02  5728-PW1
000080000000     A*            11:28:10    INALPGM     REL-R08M00  5714-UT1
000090000320     A          R F1
000100000320     A*%%TS  SD  20000320  171916  EDPWB       REL-V4R2M0  5769-PW1
000110000320     A                                      CHGINPDFT
000120000320     A                                      CA03(03 'Fine lavoro')
000130000320     A                                  1 73DATE
000140000320     A                                      EDTCDE(Y)
000150000320     A                                  9  8'Codice A.B.I.   '
000160000320     A                                 11  8'Codice C.A.B.   '
000170000320     A            ABIV      R        B  9 30REFFLD(ABIABI)
000180000320     A                                      DSPATR(HI)
000190000320     A                                      DSPATR(CS)
000200000320     A                                      CHECK(RB)
000210000320     A                                      EDTCDE(4)
000220000320     A  91                                  DSPATR(RI)
000230000320     A            CABV      R        B 11 30REFFLD(ABICAB)
000240000320     A                                      DSPATR(HI)
000250000320     A                                      DSPATR(CS)
000260000320     A                                      CHECK(RB)
000270000320     A                                      EDTCDE(4)
000280000320     A  11                                  DSPATR(PC)
000290000320     A                                      CHECK(FE)
000300000320     A                                 23 62'CMD03-'
000310000320     A                                      DSPATR(HI)
000320000320     A                                 23 69'FINE LAVORO'
000330000320     A            ERRORE        60A  O 24  4DSPATR(HI)
000340000320     A N90                                  DSPATR(ND)
000350000320     A            DESV1         30A  O  9 38
000360000320     A            DESV2         30A  O 11 38
000370000320     A                                  9 25':'
000380000320     A                                 11 25':'
000390000320     A                                  1 61'* CNC591R *'
000400000320     A                                  2 61'* PROGET82 BOLOGNA *'
000410000320     A            RSUT          20A  O  1  2
000420000320     A            VKNMUS         9A  O  2  2
000430000320     A                                  2 26'* GESTIONE ABI e CAB BANCHE *'
000440000320     A                                      DSPATR(UL)
000450000320     A                                      DSPATR(RI)
000460000320     A                                  1 26'                             '
000470000320     A                                      DSPATR(UL)
000480000320     A                                 22  2'                                  -
000490000320     A                                                                         -
000500000320     A                                               '
000510000320     A                                      DSPATR(UL)
000520000320     A                                 14 29'(Blank per la Ricerca Alfabetica)'
000530890727     A*  89/07/27  13:01:21    MAZZALI     REL-R01M02  5728-PW1
000540000000     A*            10:39:02    INALPGM     REL-R08M00  5714-UT1
000550030320     A          R S1                        SFL
000560030320     A*%%TS  SD  20030320  120421  EDPDC       REL-V4R4M0  5769-PW1
000570030320     A            Y              4Y 0O  9  3DSPATR(HI)
000580030320     A                                      EDTCDE(Z)
000590030320     A            ABIABI         5S 0O  9 10DSPATR(HI)
000600030320     A            DESCR1        60A  O  9 19
000610890727     A*  89/07/27  14:36:17    MAZZALI     REL-R01M02  5728-PW1
000620000000     A*            11:33:07    INALPGM     REL-R08M00  5714-UT1
000630030320     A          R SC1                       SFLCTL(S1)
000640030320     A*%%TS  SD  20030320  114749  EDPDC       REL-V4R4M0  5769-PW1
000650030320     A                                      CHGINPDFT
000660030320     A                                      SFLSIZ(0015)
000670030320     A                                      SFLPAG(0014)
000680030320     A N10                                  ROLLUP(95 'ROLL UP')
000690030320     A                                      OVERLAY
000700030320     A N55                                  SFLDSP
000710030320     A N55                                  SFLDSPCTL
000720030320     A  55                                  SFLCLR
000730030320     A  10                                  SFLEND
000740030320     A            RCDNBR         4S 0H      SFLRCDNBR
000750030320     A                                  1 61'* CNC591R *'
000760030320     A                                  2 61'* PROGET82 BOLOGNA *'
000770030320     A            RSUT          20A  O  1  2
000780030320     A            VKNMUS         9A  O  2  2
000790030320     A                                  2 26'* RICERCA CODICE A.B.I. *'
000800030320     A                                      DSPATR(UL)
000810030320     A                                      DSPATR(RI)
000820030320     A                                  1 26'                         '
000830030320     A                                      DSPATR(UL)
000840030320     A            CHOIC1         4Y 0B  5  3DSPATR(RI)
000850030320     A                                      EDTCDE(4)
000860030320     A                                      DSPATR(CS)
000870030320     A                                  5  8'<=='
000880030320     A                                  5 12'Scegliere'
000890030320     A                                  5 22'il'
000900030320     A                                  5 25'Codice'
000910030320     A                                  5 32'ABI'
000920030320     A                                      DSPATR(HI)
000930030320     A                                  5 36'e'
000940030320     A                                  5 38'premere'
000950030320     A                                  5 46'ENTR.'
000960030320     A                                      DSPATR(HI)
000970030320     A                                  8  2'|Sel.| Cod. ABI |Descrizione Istit-
000980030320     A                                      uto                                -
000990030320     A                                              |'
001000030320     A                                      DSPATR(UL)
001010030320     A                                  7  2'                                  -
001020030320     A                                                                         -
001030030320     A                                               '
001040030320     A                                      DSPATR(UL)
001050030320     A                                  6  2'-----------------------------------
001060030320     A                                      ------------------------------------
001070030320     A                                      ---------'
001080890727     A*  89/07/27  14:28:39    MAZZALI     REL-R01M02  5728-PW1
001090000000     A*            10:39:02    INALPGM     REL-R08M00  5714-UT1
001100030320     A          R S2                        SFL
001110030320     A*%%TS  SD  20030320  120421  EDPDC       REL-V4R4M0  5769-PW1
001120030320     A            $              4Y 0O 10  3DSPATR(HI)
001130030320     A                                      EDTCDE(Z)
001140030320     A            ABICAB         5S 0O 10 11DSPATR(HI)
001150030320     A            DESCR2        60A  O 10 19
001160890727     A*  89/07/27  14:36:17    MAZZALI     REL-R01M02  5728-PW1
001170000000     A*            11:33:07    INALPGM     REL-R08M00  5714-UT1
001180030320     A          R SC2                       SFLCTL(S2)
001190030320     A*%%TS  SD  20030320  114749  EDPDC       REL-V4R4M0  5769-PW1
001200030320     A                                      CHGINPDFT
001210030320     A                                      SFLSIZ(0015)
001220030320     A                                      SFLPAG(0014)
001230030320     A N10                                  ROLLUP(95 'ROLL UP')
001240030320     A                                      OVERLAY
001250030320     A N66                                  SFLDSP
001260030320     A N66                                  SFLDSPCTL
001270030320     A  66                                  SFLCLR
001280030320     A  10                                  SFLEND
001290030320     A            RCDNB1         4S 0H      SFLRCDNBR
001300030320     A                                  1 61'* CNC591R *'
001310030320     A                                  2 61'* PROGET82 BOLOGNA *'
001320030320     A            RSUT          20A  O  1  2
001330030320     A            VKNMUS         9A  O  2  2
001340030320     A                                  2 26'* GESTIONE ABI e CAB BANCHE *'
001350030320     A                                      DSPATR(UL)
001360030320     A                                      DSPATR(RI)
001370030320     A                                  1 26'                             '
001380030320     A                                      DSPATR(UL)
001390030320     A            CHOIC2         4Y 0B  6  3DSPATR(RI)
001400030320     A                                      EDTCDE(4)
001410030320     A                                      DSPATR(CS)
001420030320     A                                  6  8'<=='
001430030320     A                                  6 12'Scegliere'
001440030320     A                                  6 22'il'
001450030320     A                                  6 25'Codice'
001460030320     A                                  6 32'CAB'
001470030320     A                                      DSPATR(HI)
001480030320     A                                  6 36'e'
001490030320     A                                  6 38'premere'
001500030320     A                                  6 46'ENTR.'
001510030320     A                                      DSPATR(HI)
001520030320     A                                  9  2'|Sel.| Cod. CAB |Descrizione Agenz-
001530030320     A                                      ia                                 -
001540030320     A                                              |'
001550030320     A                                      DSPATR(UL)
001560030320     A                                  8  2'                                  -
001570030320     A                                                                         -
001580030320     A                                               '
001590030320     A                                      DSPATR(UL)
001600030320     A            ABIV           5S 0O  4 17DSPATR(HI)
001610030320     A            DSSC2         43A  O  4 25
001620030320     A                                  4  2'Cod. A.B.I.:'
001630030320     A                                  7  2'-----------------------------------
001640030320     A                                      ------------------------------------
001650030320     A                                      ---------'
001660900601     A*  90/06/01  10:19:25    EDPWB       REL-R02M00  5728-PW1
001670000000     A*            11:28:10    INALPGM     REL-R08M00  5714-UT1
001680000320     A          R F2
001690000320     A*%%TS  SD  20000320  171916  EDPWB       REL-V4R2M0  5769-PW1
001700000320     A                                      CHGINPDFT
001710000320     A                                      CA12(12 'rit. primo formato')
001720000321     A                                      CF16(16 'CANCELLA RECORD')
001730000320     A                                      CF05(05 'riattiva')
001740000320     A                                  1 61'* CNC591R *'
001750000320     A                                  2 61'* PROGET82 BOLOGNA *'
001760000320     A            RSUT          20A  O  1  2
001770000320     A            VKNMUS         9A  O  2  2
001780000320     A                                  2 26'* GESTIONE ABI e CAB BANCHE *'
001790000320     A                                      DSPATR(UL)
001800000320     A                                      DSPATR(RI)
001810000320     A                                  1 26'                             '
001820000320     A                                      DSPATR(UL)
001830000320     A            ABIV      R        B  4 24REFFLD(ABIABI)
001840000320     A                                      DSPATR(HI)
001850000320     A                                      CHECK(RB)
001860000320     A                                      EDTCDE(4)
001870000320     A                                      DSPATR(PR)
001880000320     A                                      DSPATR(UL)
001890000320     A            CABV      R        B  4 32REFFLD(ABICAB)
001900000320     A                                      DSPATR(HI)
001910000320     A                                      CHECK(RB)
001920000320     A                                      EDTCDE(4)
001930000320     A                                      DSPATR(PR)
001940000320     A                                      DSPATR(UL)
001950000320     A                                 23  2'CMD12-'
001960000320     A                                      DSPATR(HI)
001970000320     A            ORRORE        60A  O 24  2DSPATR(HI)
001980000320     A N99                                  DSPATR(ND)
001990000320     A                                  4 30'/'
002000000320     A                                  3  1'Codice'
002010000320     A                                  6  1'Descrizione'
002020000320     A                                      DSPATR(HI)
002030000320     A                                  6 13'ISTITUTO:'
002040000320     A                                      DSPATR(HI)
002050000320     A            ABVIST        80A  B  7  1DSPATR(UL)
002060000320     A  88                                  DSPATR(PR)
002070000320     A N88                                  DSPATR(CS)
002080000320     A                                 11  1'Descrizione'
002090000320     A                                      DSPATR(HI)
002100000320     A                                 11 13'AGENZIA'
002110000320     A                                      DSPATR(HI)
002120000320     A                                 11 21':'
002130000320     A                                      DSPATR(HI)
002140000320     A            ABVAGE        40A  B 12  1DSPATR(UL)
002150000320     A                                      DSPATR(CS)
002160000320     A                                 14  1'Indirizzo'
002170000320     A                                      DSPATR(HI)
002180000320     A                                 14 11'AGENZIA'
002190000320     A                                      DSPATR(HI)
002200000320     A                                 14 21':'
002210000320     A                                      DSPATR(HI)
002220000320     A            ABVIND        80A  B 15  1DSPATR(UL)
002230000320     A                                      COLOR(BLU)
002240000320     A                                      DSPATR(CS)
002250000320     A                                 17  1'Località'
002260000320     A                                      DSPATR(HI)
002270000320     A                                 17 10'AGENZIA'
002280000320     A                                      DSPATR(HI)
002290000320     A                                 17 21':'
002300000320     A                                      DSPATR(HI)
002310000320     A            ABVLOC        40A  B 18  1DSPATR(UL)
002320000320     A                                      DSPATR(CS)
002330000320     A                                 20  1'Comune'
002340000320     A                                      DSPATR(HI)
002350000320     A                                 20  8'AGENZIA'
002360000320     A                                      DSPATR(HI)
002370000320     A                                 20 21':'
002380000320     A                                      DSPATR(HI)
002390000320     A            ABVCOM        36A  B 21  1DSPATR(UL)
002400000320     A                                      DSPATR(CS)
002410000320     A                                 20 45'C.a.P.'
002420000320     A                                      DSPATR(HI)
002430000320     A                                 20 52'Ag.:'
002440000320     A                                      DSPATR(HI)
002450000320     A            ABVCAP         5Y 0B 21 47DSPATR(CS)
002460000320     A                                      CHECK(RZ)
002470000320     A                                      EDTCDE(4)
002480000320     A                                      DSPATR(UL)
002490000320     A            ABVPRO         2A  B 21 63DSPATR(UL)
002500000320     A                                      DSPATR(CS)
002510000320     A                                 23  9'Formato Prec.'
002520000320     A                                 23 64'ENTER:'
002530000320     A                                      DSPATR(HI)
002540000320     A                                 23 71'Convalida'
002550000320     A                                 23 26'CMD05-'
002560000320     A                                      DSPATR(HI)
002570000320     A                                 23 33'Riattiva'
002580000320     A                                  1 73DATE
002590000320     A                                      EDTCDE(Y)
002600000320     A                                  4  1'A.B.I. / C.A.B. ....:'
002610000320     A                                      DSPATR(HI)
002620000320     A                                  9  1'-----------------------------------
002630000320     A                                      ------------------------------------
002640000320     A                                      -----------'
002650000320     A                                      DSPATR(HI)
002660000320     A                                 20 62'Prov.'
002670000320     A                                      DSPATR(HI)
002680000321     A                                 23 44'CMD16-'
002690000320     A                                      DSPATR(HI)
002700000320     A                                 23 51'Cancella'
002710000320     A  85                              3 32'* ANNULLATO *'
002720000320     A                                      DSPATR(HI)
002730000320     A                                      DSPATR(BL)
002740000320     A                                 20 71'Stato'
002750000320     A                                      DSPATR(HI)
002760000320     A            VSTATO         4A  B 21 72DSPATR(UL)
002770000320     A                                      DSPATR(CS)
002780000320     A        91                            DSPATR(PC RI)
002790890727     A          R V99
002800890727     A*  89/07/27  14:28:39    MAZZALI     REL-R01M02  5728-PW1
002810890727     A                                 23  2'ENTER-'
002820890727     A                                      DSPATR(HI)
002830890727     A                                 23  9'Ritorno'
