000010000320     A*%%TS  SD  20000320  171916  EDPWB       REL-V4R2M0  5769-PW1
000020900601     A*  90/06/01  10:19:25    EDPWB       REL-R02M00  5728-PW1
000030000000     A*            11:33:07    INALPGM     REL-R08M00  5714-UT1
000040000320     A*%%EC
000050000320     A                                      DSPSIZ(24 80 *DS3)
000060000320     A                                      REF(*LIBL/CNABI00F)
000070890727     A*  89/07/27  15:35:55    MAZZALI     REL-R01M02  5728-PW1
000080000000     A*            11:28:10    INALPGM     REL-R08M00  5714-UT1
000090000320     A          R F1
000100000320     A*%%TS  SD  20000320  171916  EDPWB       REL-V4R2M0  5769-PW1
000110000320     A                                      CHGINPDFT
000120000320     A                                      CA03(03 'Fine lavoro')
000130000320     A                                  1 73DATE
000140000320     A                                      EDTCDE(Y)
000150000320     A                                  9  8'Codice A.B.I.   '
000160000320     A                                 11  8'Codice C.A.B.   '
000170000320     A            ABIV      R        B  9 30REFFLD(ABIABI)
000180000320     A                                      DSPATR(HI)
000190000320     A                                      DSPATR(CS)
000200000320     A                                      CHECK(RB)
000210000320     A                                      EDTCDE(4)
000220000320     A  91                                  DSPATR(RI)
000230000320     A            CABV      R        B 11 30REFFLD(ABICAB)
000240000320     A                                      DSPATR(HI)
000250000320     A                                      DSPATR(CS)
000260000320     A                                      CHECK(RB)
000270000320     A                                      EDTCDE(4)
000280000320     A  11                                  DSPATR(PC)
000290000320     A                                      CHECK(FE)
000300000320     A                                 23 62'CMD03-'
000310000320     A                                      DSPATR(HI)
000320000320     A                                 23 69'FINE LAVORO'
000330000320     A            ERRORE        60A  O 24  4DSPATR(HI)
000340000320     A N90                                  DSPATR(ND)
000350000320     A            DESV1         30A  O  9 38
000360000320     A            DESV2         30A  O 11 38
000370000320     A                                  9 25':'
000380000320     A                                 11 25':'
000390000320     A                                  1 61'* CNC591R *'
000400000320     A                                  2 61'* PROGET82 BOLOGNA *'
000410000320     A            RSUT          20A  O  1  2
000420000320     A            VKNMUS         9A  O  2  2
000430000320     A                                  2 26'* GESTIONE ABI e CAB BANCHE *'
000440000320     A                                      DSPATR(UL)
000450000320     A                                      DSPATR(RI)
000460000320     A                                  1 26'                             '
000470000320     A                                      DSPATR(UL)
000480000320     A                                 22  2'                                  -
000490000320     A                                                                         -
000500000320     A                                               '
000510000320     A                                      DSPATR(UL)
000520000320     A                                 14 29'(Blank per la Ricerca Alfabetica)'
000530890727     A          R S1                        SFL
000540890727     A*  89/07/27  13:01:21    MAZZALI     REL-R01M02  5728-PW1
000550000000     A*            10:39:02    INALPGM     REL-R08M00  5714-UT1
000560890727     A            Y              3S 0O  9  3DSPATR(HI)
000570890727     A            ABIABI         5S 0O  9 10DSPATR(HI)
000580890727     A            DESCR1        60A  O  9 19
000590890727     A*  89/07/27  14:36:17    MAZZALI     REL-R01M02  5728-PW1
000600000000     A*            11:33:07    INALPGM     REL-R08M00  5714-UT1
000610000320     A          R SC1                       SFLCTL(S1)
000620000320     A*%%TS  SD  20000320  171916  EDPWB       REL-V4R2M0  5769-PW1
000630000320     A                                      CHGINPDFT
000640000320     A N10                                  ROLLUP(95 'ROLL UP')
000650000320     A                                      OVERLAY
000660000320     A N55                                  SFLDSP
000670000320     A N55                                  SFLDSPCTL
000680000320     A  55                                  SFLCLR
000690000320     A  10                                  SFLEND
000700000320     A                                      SFLSIZ(0015)
000710000320     A                                      SFLPAG(0014)
000720000320     A            RCDNBR         4S 0H      SFLRCDNBR
000730000320     A                                  1 61'* CNC591R *'
000740000320     A                                  2 61'* PROGET82 BOLOGNA *'
000750000320     A            RSUT          20A  O  1  2
000760000320     A            VKNMUS         9A  O  2  2
000770000320     A                                  2 26'* RICERCA CODICE A.B.I. *'
000780000320     A                                      DSPATR(UL)
000790000320     A                                      DSPATR(RI)
000800000320     A                                  1 26'                         '
000810000320     A                                      DSPATR(UL)
000820000320     A            CHOIC1         3Y 0B  5  3DSPATR(RI)
000830000320     A                                      EDTCDE(4)
000840000320     A                                      DSPATR(CS)
000850000320     A                                  5  8'<=='
000860000320     A                                  5 12'Scegliere'
000870000320     A                                  5 22'il'
000880000320     A                                  5 25'Codice'
000890000320     A                                  5 32'ABI'
000900000320     A                                      DSPATR(HI)
000910000320     A                                  5 36'e'
000920000320     A                                  5 38'premere'
000930000320     A                                  5 46'ENTR.'
000940000320     A                                      DSPATR(HI)
000950000320     A                                  8  2'|Sel.| Cod. ABI |Descrizione Istit-
000960000320     A                                      uto                                -
000970000320     A                                              |'
000980000320     A                                      DSPATR(UL)
000990000320     A                                  7  2'                                  -
001000000320     A                                                                         -
001010000320     A                                               '
001020000320     A                                      DSPATR(UL)
001030000320     A                                  6  2'-----------------------------------
001040000320     A                                      ------------------------------------
001050000320     A                                      ---------'
001060890727     A          R S2                        SFL
001070890727     A*  89/07/27  14:28:39    MAZZALI     REL-R01M02  5728-PW1
001080000000     A*            10:39:02    INALPGM     REL-R08M00  5714-UT1
001090890727     A            $              3S 0O 10  3DSPATR(HI)
001100890727     A            ABICAB         5S 0O 10 11DSPATR(HI)
001110890727     A            DESCR2        60A  O 10 19
001120890727     A*  89/07/27  14:36:17    MAZZALI     REL-R01M02  5728-PW1
001130000000     A*            11:33:07    INALPGM     REL-R08M00  5714-UT1
001140000320     A          R SC2                       SFLCTL(S2)
001150000320     A*%%TS  SD  20000320  171916  EDPWB       REL-V4R2M0  5769-PW1
001160000320     A                                      CHGINPDFT
001170000320     A N10                                  ROLLUP(95 'ROLL UP')
001180000320     A                                      OVERLAY
001190000320     A N66                                  SFLDSP
001200000320     A N66                                  SFLDSPCTL
001210000320     A  66                                  SFLCLR
001220000320     A  10                                  SFLEND
001230000320     A                                      SFLSIZ(0015)
001240000320     A                                      SFLPAG(0014)
001250000320     A            RCDNB1         4S 0H      SFLRCDNBR
001260000320     A                                  1 61'* CNC591R *'
001270000320     A                                  2 61'* PROGET82 BOLOGNA *'
001280000320     A            RSUT          20A  O  1  2
001290000320     A            VKNMUS         9A  O  2  2
001300000320     A                                  2 26'* GESTIONE ABI e CAB BANCHE *'
001310000320     A                                      DSPATR(UL)
001320000320     A                                      DSPATR(RI)
001330000320     A                                  1 26'                             '
001340000320     A                                      DSPATR(UL)
001350000320     A            CHOIC2         3Y 0B  6  3DSPATR(RI)
001360000320     A                                      EDTCDE(4)
001370000320     A                                      DSPATR(CS)
001380000320     A                                  6  7'<=='
001390000320     A                                  6 12'Scegliere'
001400000320     A                                  6 22'il'
001410000320     A                                  6 25'Codice'
001420000320     A                                  6 32'CAB'
001430000320     A                                      DSPATR(HI)
001440000320     A                                  6 36'e'
001450000320     A                                  6 38'premere'
001460000320     A                                  6 46'ENTR.'
001470000320     A                                      DSPATR(HI)
001480000320     A                                  9  2'|Sel.| Cod. CAB |Descrizione Agenz-
001490000320     A                                      ia                                 -
001500000320     A                                              |'
001510000320     A                                      DSPATR(UL)
001520000320     A                                  8  2'                                  -
001530000320     A                                                                         -
001540000320     A                                               '
001550000320     A                                      DSPATR(UL)
001560000320     A            ABIV           5S 0O  4 17DSPATR(HI)
001570000320     A            DSSC2         43A  O  4 25
001580000320     A                                  4  2'Cod. A.B.I.:'
001590000320     A                                  7  2'-----------------------------------
001600000320     A                                      ------------------------------------
001610000320     A                                      ---------'
001620900601     A*  90/06/01  10:19:25    EDPWB       REL-R02M00  5728-PW1
001630000000     A*            11:28:10    INALPGM     REL-R08M00  5714-UT1
001640000320     A          R F2
001650000320     A*%%TS  SD  20000320  171916  EDPWB       REL-V4R2M0  5769-PW1
001660000320     A                                      CHGINPDFT
001670000320     A                                      CA12(12 'rit. primo formato')
001680000321     A                                      CF16(16 'CANCELLA RECORD')
001690000320     A                                      CF05(05 'riattiva')
001700000320     A                                  1 61'* CNC591R *'
001710000320     A                                  2 61'* PROGET82 BOLOGNA *'
001720000320     A            RSUT          20A  O  1  2
001730000320     A            VKNMUS         9A  O  2  2
001740000320     A                                  2 26'* GESTIONE ABI e CAB BANCHE *'
001750000320     A                                      DSPATR(UL)
001760000320     A                                      DSPATR(RI)
001770000320     A                                  1 26'                             '
001780000320     A                                      DSPATR(UL)
001790000320     A            ABIV      R        B  4 24REFFLD(ABIABI)
001800000320     A                                      DSPATR(HI)
001810000320     A                                      CHECK(RB)
001820000320     A                                      EDTCDE(4)
001830000320     A                                      DSPATR(PR)
001840000320     A                                      DSPATR(UL)
001850000320     A            CABV      R        B  4 32REFFLD(ABICAB)
001860000320     A                                      DSPATR(HI)
001870000320     A                                      CHECK(RB)
001880000320     A                                      EDTCDE(4)
001890000320     A                                      DSPATR(PR)
001900000320     A                                      DSPATR(UL)
001910000320     A                                 23  2'CMD12-'
001920000320     A                                      DSPATR(HI)
001930000320     A            ORRORE        60A  O 24  2DSPATR(HI)
001940000320     A N99                                  DSPATR(ND)
001950000320     A                                  4 30'/'
001960000320     A                                  3  1'Codice'
001970000320     A                                  6  1'Descrizione'
001980000320     A                                      DSPATR(HI)
001990000320     A                                  6 13'ISTITUTO:'
002000000320     A                                      DSPATR(HI)
002010000320     A            ABVIST        80A  B  7  1DSPATR(UL)
002020000320     A  88                                  DSPATR(PR)
002030000320     A N88                                  DSPATR(CS)
002040000320     A                                 11  1'Descrizione'
002050000320     A                                      DSPATR(HI)
002060000320     A                                 11 13'AGENZIA'
002070000320     A                                      DSPATR(HI)
002080000320     A                                 11 21':'
002090000320     A                                      DSPATR(HI)
002100000320     A            ABVAGE        40A  B 12  1DSPATR(UL)
002110000320     A                                      DSPATR(CS)
002120000320     A                                 14  1'Indirizzo'
002130000320     A                                      DSPATR(HI)
002140000320     A                                 14 11'AGENZIA'
002150000320     A                                      DSPATR(HI)
002160000320     A                                 14 21':'
002170000320     A                                      DSPATR(HI)
002180000320     A            ABVIND        80A  B 15  1DSPATR(UL)
002190000320     A                                      COLOR(BLU)
002200000320     A                                      DSPATR(CS)
002210000320     A                                 17  1'Località'
002220000320     A                                      DSPATR(HI)
002230000320     A                                 17 10'AGENZIA'
002240000320     A                                      DSPATR(HI)
002250000320     A                                 17 21':'
002260000320     A                                      DSPATR(HI)
002270000320     A            ABVLOC        40A  B 18  1DSPATR(UL)
002280000320     A                                      DSPATR(CS)
002290000320     A                                 20  1'Comune'
002300000320     A                                      DSPATR(HI)
002310000320     A                                 20  8'AGENZIA'
002320000320     A                                      DSPATR(HI)
002330000320     A                                 20 21':'
002340000320     A                                      DSPATR(HI)
002350000320     A            ABVCOM        36A  B 21  1DSPATR(UL)
002360000320     A                                      DSPATR(CS)
002370000320     A                                 20 45'C.a.P.'
002380000320     A                                      DSPATR(HI)
002390000320     A                                 20 52'Ag.:'
002400000320     A                                      DSPATR(HI)
002410000320     A            ABVCAP         5Y 0B 21 47DSPATR(CS)
002420000320     A                                      CHECK(RZ)
002430000320     A                                      EDTCDE(4)
002440000320     A                                      DSPATR(UL)
002450000320     A            ABVPRO         2A  B 21 63DSPATR(UL)
002460000320     A                                      DSPATR(CS)
002470000320     A                                 23  9'Formato Prec.'
002480000320     A                                 23 64'ENTER:'
002490000320     A                                      DSPATR(HI)
002500000320     A                                 23 71'Convalida'
002510000320     A                                 23 26'CMD05-'
002520000320     A                                      DSPATR(HI)
002530000320     A                                 23 33'Riattiva'
002540000320     A                                  1 73DATE
002550000320     A                                      EDTCDE(Y)
002560000320     A                                  4  1'A.B.I. / C.A.B. ....:'
002570000320     A                                      DSPATR(HI)
002580000320     A                                  9  1'-----------------------------------
002590000320     A                                      ------------------------------------
002600000320     A                                      -----------'
002610000320     A                                      DSPATR(HI)
002620000320     A                                 20 62'Prov.'
002630000320     A                                      DSPATR(HI)
002640000321     A                                 23 44'CMD16-'
002650000320     A                                      DSPATR(HI)
002660000320     A                                 23 51'Cancella'
002670000320     A  85                              3 32'* ANNULLATO *'
002680000320     A                                      DSPATR(HI)
002690000320     A                                      DSPATR(BL)
002700000320     A                                 20 71'Stato'
002710000320     A                                      DSPATR(HI)
002720000320     A            VSTATO         4A  B 21 72DSPATR(UL)
002730000320     A                                      DSPATR(CS)
002731000320     A        91                            DSPATR(PC RI)
002740890727     A          R V99
002750890727     A*  89/07/27  14:28:39    MAZZALI     REL-R01M02  5728-PW1
002760890727     A                                 23  2'ENTER-'
002770890727     A                                      DSPATR(HI)
002780890727     A                                 23  9'Ritorno'
