000100920918     A*---------------------------------------------------------------**
000200930215     A*  DS ESTERNA PER EDITAZIONE CAMPI NUMERICI                      *
000300920918     A*---------------------------------------------------------------**
000400930215     A          R XANA06YYY
000500930215     A*
000600930215     A            XA6IMP        50          TEXT('IMPORTO          ')
000700930215     A            XA6LEN         2S 0       TEXT('LUNGHEZZA        ')
000800930215     A            XA6DEC         2S 0       TEXT('NR. DECIMALI     ')
000900930215     A            XA6ERR         1  0       TEXT('FLAG ERRORE      ')
