000010920601     A*%%TS  SD  19920601  122816  EDPES       REL-V2R1M0  5738-PW1
000020000000     A*            10:53:14    EDPMAST001  REL-R08M00  5714-UT1
000030000000     A***-FILE : ANU016D  -------------------------------------***
000040000000     A*              RICERCA CODIFICA PAGAMENTI                  *
000050000000     A***------------------------------------------------------***
000060000000     A*
000070920601     A*%%EC
000080920601     A                                      DSPSIZ(24 80 *DS3)
000090920601     A                                      CHGINPDFT
000100920601     A                                      PRINT
000110920601     A                                      CA12
000120000000     A*            12:36:31    SIAM38__01  REL-R08M00  5714-UT1
000130000000     A*-------------------------------------*
000140920601     A          R XCD0161
000150920601     A*%%TS  SD  19920601  122816  EDPES       REL-V2R1M0  5738-PW1
000160920601     A                                      TEXT('TESTATA')
000170920601     A                                      OVERLAY
000180920601     A                                  2 20'*---->  RICERCA CODIFICA PAGAMENTI-
000190920601     A                                        <----*'
000200920601     A                                      DSPATR(RI)
000210920601     A                                      DSPATR(UL)
000220920601     A                                  3 20'                                  -
000230920601     A                                              '
000240920601     A                                      DSPATR(UL)
000250920601     A                                  4 20'|x| |Cod| |Descrizione            -
000260920601     A                                             |'
000270920601     A                                      DSPATR(UL)
000280920601     A                                  1 20'                                  -
000290920601     A                                              '
000300920601     A                                      DSPATR(UL)
000310920601     A                                  1 63'*XCDPAGR*'
000320920601     A                                  1 73DATE
000330920601     A                                      EDTCDE(Y)
000340920601     A                                  2 63'*Proget82 Bologna*'
000350000000     A          R XCD16SF1                  SFL
000360000000     A*            10:53:14    EDPMAST001  REL-R08M00  5714-UT1
000370000000     A*-------------------------------------*
000380000000     A                                      TEXT('FMT.-3- SUBFILE')
000390000000     A            SCELTA         1A  I  6 21DSPATR(CS)
000400000000     A                                      DSPATR(HI)
000410000000     A  50                                  DSPATR(PR)
000420000000     A                                      VALUES('X' ' ')
000430000000     A                                      CHECK(ER)
000440000000     A            CODPAG         3A  O  6 25
000450000000     A            DESPAG        30A  O  6 31
000460000000     A            CODLIN         1A  O  6 29
000470000000     A*-------------------------------------*
000480920601     A          R XCD16SC1                  SFLCTL(XCD16SF1)
000490920601     A*%%TS  SD  19920601  122816  EDPES       REL-V2R1M0  5738-PW1
000500920601     A  90                                  ALARM
000510920601     A                                      OVERLAY
000520920601     A  71                                  SFLDSP
000530920601     A N70                                  SFLDSPCTL
000540920601     A  70                                  SFLCLR
000550920601     A  71                                  SFLEND
000560920601     A                                      SFLSIZ(0016)
000570920601     A                                      SFLPAG(0015)
000580920601     A N71                             24 29'NON TROVATE INFORMAZIONI'
000590920601     A                                      DSPATR(RI)
000600920601     A                                 24 58'CMD12-RITORNO'
