000100061024      *-----------------------------------------------------------------------**
000200061024      *  DS ESTERNA PER CONTROLLO CODICE FISCALE E/O PARTITA IVA EUROPEA       *
000300061024      *-----------------------------------------------------------------------**
000400061024     A          R RXCFIVA                   TEXT('CONTROLLO C.FISC E/O P.IVA')
000500061024
000600061024     A            XCFIVATLA      1A         TEXT('TIPO LANCIO PROGRAMMA')
000700061106     A            XCFIVAMOD      1A         TEXT('TIPO RICHIAMO: P=P.IVA -
000800061106     A                                      " "=C.F.')
000900061024     A            XCFIVAPAR     16A         TEXT('COD.FISCALE O PAR.IVA')
001000061024     A            XCFIVANAR      3A         TEXT('NAZIONE P.IVA')
001100061025     A            XCFIVAPRV      2A         TEXT('PROVINCIA')
001200151013     A            XCFIVACAP      9A         TEXT('CAP')
001300151013     A            XCFIVALOC     35A         TEXT('LOCALITA''')
001400151014     A* FLG='9' SINGIFICA CHE LA NAZ/CAP/LOC NON PREVEDE IL CODICE ( FISC. O P.IVA)
001500061025     A            XCFIVAFLG      1S 0       TEXT('FLAG VALIDITA')
001600061024     A            XCFIVAMSG     78A         TEXT('MESSAGGIO ERRORE')
001700180201     A
001800180201     A* = 'S' SERVE PER FORZARE PARTITA IVA DI NAZIONE <> DALLA NAZIONE DI RIFERIMENTO
001900180201     A*  OVVERO PASSATA IN XCFIVANAR
002000151013     A            XCFIVAFORI     1          TEXT('FORZATURA ITALIA')
002100151014     A
002200151014     A* IL CAMPO DELLA PARTITA IVA SERVE UNITAMENTE AL COD FISCALE PER "SM"
002300151013     A            XCFIVAPIVA    16A         TEXT('PARTITA IVA')
002400151014
002500151014     A* ESENTE - INDICA CHE NON È PREVISTO NÈ COD FISC NÈ P.IVA
002600151014     A            XCFIVAESE      1S 0       TEXT('9=NAZ/CAP/LOC NON PREVEDE -
002700151014     A                                      NÈ COD FISC. NÈ P.IVA')
002800151014     A
002900151104     A            XCFIVAP88      1A         TEXT('8=RICHIAMO PER CLI OCCASIONAL-
003000151104     A                                      I-PREPAGATI')
003100151104     A            XCFIVAFLO     14A         TEXT('LIBERO')
