000100050202             pgm
000200050202
000300050209    /* Ripulisco il file --------------------------------------------*/
000400051017             clrpfm     file(WFsca00F)
000600050202
000700050202    /* Richiamo il pgm. per impostare i dati nel wrkf ---------------*/
000800050209             call       pgm(FIDN13R)
000900050202
001000050202             endpgm
