000010170919     A*%%TS  SD  20170919  125406  EDPGA       REL-V7R2M0  5770-WDS
000020980715     A*---------------------------------------------------------------*
000030170919     A*%%EC
000040170919     A                                      DSPSIZ(24 80 *DS3)
000050170919     A                                      CHGINPDFT(HI UL)
000060170919     A                                      PRINT
000070970903     A*---------------------------------------------------------------*
000080990129     A          R FI03T01
000090990129     A            RSUT          20A  O  1  2
000100990129     A                                  1 28'** COMUNICAZIONE DI ANOMALIA **'
000110990129     A                                      DSPATR(RI)
000120990129     A                                      DSPATR(UL)
000130990129     A            VTCPGM        10A  O  1 61
000140990129     A                                  1 72DATE
000150990129     A                                      EDTCDE(Y)
000160990129     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000170990129     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000180990129     A            VTCMOD        14A  O  2 36DSPATR(HI)
000190990129     A                                  2 72TIME
000200990129     A N01                              3  2'C.A.      :'
000210990129     A                                      DSPATR(UL)
000220990129     A N01        VTCFIL         3S 0O  3 14
000230990129     A N01        VTCNCA         7Y 0O  3 18EDTCDE(Z)
000240990129     A N01                              3 31'del'
000250990129     A N01        VTCDC1         8Y 0O  3 35EDTCDE(8)
000260990129     A                                  3 46'ANOMALIA:'
000270990129     A                                      DSPATR(UL)
000280990129     A            VTCTAD         2A  O  3 56DSPATR(HI)
000290990129     A            VTDTAD        22A  O  3 59DSPATR(HI)
000300990129     A                                  4  2'SPEDIZIONE:'
000310990129     A                                      DSPATR(UL)
000320020827     A            VTCLNP         3S 0O  4 14
000330020827     A            VTCNRS         2Y 0O  4 18EDTCDE(Z)
000340020827     A                                  4 21'-'
000350020827     A            VTCNSP         7Y 0O  4 23EDTCDE(Z)
000360020827     A                                  4 31'del'
000370020827     A            VTCDSP         8Y 0O  4 35EDTCDE(8)
000380020827     A                                  4 46'LINEA ARRIVO :'
000390990129     A                                      DSPATR(UL)
000400020827     A            VTCLNA         3S 0O  4 61
000410020827     A            VTDLNA        16A  O  4 65
000420990129     A N01                              5  2'FASE C.A. :'
000430990129     A                                      DSPATR(UL)
000440990129     A N01        VTCFCA         3S 0O  5 14
000450990129     A N01        VTDFCA        25A  O  5 18
000460990129     A N01                              5 46'P.O. GESTIONE:'
000470990129     A                                      DSPATR(UL)
000480990129     A N01        VTCGFC         3S 0O  5 61
000490990129     A N01        VTDGFC        16A  O  5 65
000500990129     A                                  6  2'-----------------------------------
000510990129     A                                      ------------------------------------
000520990129     A                                      ----------'
000530990129     A                                  7  2'Mitt.'
000540020827     A            VTCKSM         7Y 0O  7  8EDTCDE(Z)
000550020827     A            VTCRSM        25A  O  7 16DSPATR(UL)
000560990129     A                                  7 42'Dest.'
000570020827     A            VTCKSD         7Y 0O  7 48EDTCDE(Z)
000580020827     A            VTCRSD        25A  O  7 56DSPATR(UL)
000590020827     A            VTCCAM         9A  O  8  6DSPATR(UL)
000600020827     A            VTCLOM        18A  O  8 16DSPATR(UL)
000610020827     A            VTCPRM         2A  O  8 35DSPATR(UL)
000620020827     A            VTCNAM         3A  O  8 38DSPATR(UL)
000630020827     A            VTCCAD         9A  O  8 46DSPATR(UL)
000640020827     A            VTCLOD        18A  O  8 56DSPATR(UL)
000650020827     A            VTCPRD         2A  O  8 75DSPATR(UL)
000660020827     A            VTCNAD         3A  O  8 78DSPATR(UL)
000670020827     A            VTDCBO         9A  O  9 29
000680020827     A            VTCDDT         6A  O  9 20
000690020827     A            VTCNAS        15A  O  9  2
000700020827     A                                  9 42'Colli'
000710020827     A            VTCNCL         5Y 0O  9 48EDTCDE(Z)
000720990129     A                                      DSPATR(UL)
000730020827     A                                  9 56'Kg'
000740020827     A            VTCPKF         7Y 1O  9 59EDTCDE(4)
000750990129     A                                      DSPATR(UL)
000760020827     A                                  9 70'Mc'
000770020827     A            VTCFVF         1A  O  9 73DSPATR(UL)
000780020827     A            VTCVLF         5Y 3O  9 75EDTCDE(4)
000790990129     A                                      DSPATR(UL)
000800990129     A                                 11  2'-----------------------------------
000810990129     A                                      ------------------------------------
000820990129     A                                      ----------'
000830990129     A                                 10  2'Imp.Ass.'
000840010904     A  10        VTCIAS        13Y 3O 10 11EDTCDE(3)
000850010904     A            VTCVAS         3A  O 10 26
000860010904     A                                 10 30'C/A'
000870010904     A  11        VTCCAS        13Y 3O 10 34EDTCDE(3)
000880010904     A            VTCVCA         3A  O 10 49
000890010904     A                                 10 53'Fatt.Imm.'
000900010904     A  12        VTCIFT        13Y 3O 10 63EDTCDE(3)
000910010910     A            VTCVIF         3A  O 10 78
000920020827     A*---------------------------------------------------------------*
000930170919     A          R FI03D01
000940170919     A*%%TS  SD  20170919  125406  EDPGA       REL-V7R2M0  5770-WDS
000950170919     A N16                                  CA03
000960170919     A N01                                  CF04
000970170919     A  25                                  CF05
000980170919     A  15                                  CF08
000990170919     A                                      CF09
001000170919     A N16                                  CF12
001010170919     A  19                                  CF16
001020170919     A                                      CF18
001030170919     A                                      OVERLAY
001040170919     A  28        V1CMSG        78   M
001050170919     A            V1HAGG        35A  H
001060170919     A            V1HFAG         1A  H
001070170919     A            V1HMTV        35A  H
001080170919     A            V1HFMT         1A  H
001090170919     A            V1HFRA         1A  H
001100170919     A N05                             12  2'Tipo gestione..............:'
001110170919     A  01                             12  2'Data apertura .............:'
001120170919     A N05        V1CFPR         1A  B 12 31VALUES('P' 'T')
001130170919     A  44                                  DSPATR(PC)
001140170919     A                                      DSPATR(PR)
001150170919     A  02                                  DSPATR(UL)
001160170919     A  02                                  DSPATR(HI)
001170170919     A  01        V1CDCA         8Y 0B 12 31EDTCDE(8)
001180170919     A                                      CHECK(RB)
001190170919     A  41                                  DSPATR(PC)
001200170919     A                                      DSPATR(PR)
001210170919     A N05                             12 35'(T=Liquidazione Transattiva, P=Pra-
001220170919     A                                      tica assic.)'
001230170919     A  34                             13  2'Beneficiario...............:'
001240170919     A  34        V1CPTR         1A  B 13 31VALUES('M' 'D' ' ')
001250170919     A  38                                  DSPATR(PR)
001260170919     A N38                                  DSPATR(HI)
001270170919     A  46                                  DSPATR(PC)
001280170919     A N38                                  DSPATR(UL)
001290170919     A  34                             13 35'(M=Mittente, D=Destinatario)'
001300170919     A  34        V1DPTR         7A  O 13 68DSPATR(HI)
001310170919     A                                 14  2'Numero Evento...........(?):'
001320170919     A            V1CNEV         7A  B 14 31
001330170919     A  42                                  DSPATR(PC)
001340170919     A  06                                  DSPATR(PR)
001350170919     A N06                                  DSPATR(HI)
001360170919     A                                      CHECK(RB)
001370170919     A N06                                  DSPATR(UL)
001380170919     A            V1CAAE         4Y 0B 14 40EDTCDE(Z)
001390170919     A                                      CHECK(RB)
001400170919     A  06                                  DSPATR(PR)
001410170919     A N06                                  DSPATR(HI)
001420170919     A N06                                  DSPATR(UL)
001430170919     A            V1CTAE         2A  O 14 47
001440170919     A            V1DTAE        25A  O 14 50
001450020124     A*
001460170919     A  33                             15  2'Franchigia.................:'
001470170919     A  33        V1CFRA         1A  B 15 31VALUES(' ' 'F')
001480170919     A  33 51                               DSPATR(PC)
001490170919     A  33                             15 35'(F=SI)'
001500020124     A*
001510170919     A            V1DNEV        35A  O 15 46
001520170919     A                                 16  2'Descrizione anomalia.......:'
001530170919     A            V1DAGG        35A  B 16 31CHECK(LC)
001540170919     A  48                                  DSPATR(PC)
001550170919     A            V1CFAG         1A  B 16 68VALUES(' ' '+')
001560170919     A                                 16 70'("+"=Segue)'
001570170919     A                                 17  2'Motivo del danno...........:'
001580170919     A            V1DMTV        35A  B 17 31CHECK(LC)
001590170919     A  49                                  DSPATR(PC)
001600170919     A            V1CFMT         1A  B 17 68VALUES(' ' '+')
001610170919     A                                 17 70'("+"=Segue)'
001620170919     A                                 18  2'Presentata riserva.........:'
001630170919     A            V1CCRC         1A  B 18 31VALUES('S' 'N')
001640170919     A  45                                  DSPATR(PC)
001650170919     A                                 18 35'(S/N)'
001660170919     A                                 19  2'Controllo dati DDT.........:'
001670170919     A            V1CTDT         1A  B 19 31
001680170919     A  43                                  DSPATR(PC)
001690170919     A  06                                  DSPATR(PR)
001700170919     A N06                                  DSPATR(HI)
001710170919     A N06                                  DSPATR(UL)
001720170919     A                                      VALUES(' ' 'A' 'P')
001730170919     A                                 19 35'(P=Partenza, A=Arrivo, " "=Nessuno-
001740170919     A                                      )'
001750170919     A                                 20  2'Richiesta copia denuncia...:'
001760170919     A            V1CRCD         1A  B 20 31VALUES('S' ' ')
001770170919     A                                 20 35'(S=SI, " "=NO)'
001780170919     A  13                             20 52'Stampata copia il:'
001790170919     A  13        V1CDIC         8Y 0O 20 71EDTWRD('  /  /    ')
001800170919     A                                 21  2'Beneficiario alternativo...:'
001810170919     A            V1CKSC         7Y 0B 21 31CHECK(RB)
001820170919     A                                      EDTCDE(Z)
001830170919     A  47                                  DSPATR(PC)
001840170919     A  39                                  DSPATR(PR)
001850170919     A N39                                  DSPATR(HI)
001860170919     A N39                                  DSPATR(UL)
001870170919     A            V1DKSC        35A  B 21 40
001880170919     A  39                                  DSPATR(PR)
001890170919     A N39                                  DSPATR(UL)
001900170919     A N39                                  DSPATR(HI)
001910170919     A                                 22  2'Interlocutore..............:'
001920170919     A            V1DNOC        35A  B 22 31CHECK(LC)
001930170919     A  37                                  DSPATR(PR)
001940170919     A N37                                  DSPATR(HI)
001950170919     A N37                                  DSPATR(UL)
001960020827     A*---------------------------------------------------------------*
001970990409     A          R FI03Z01
001980990409     A                                      OVERLAY
001990020129     A     25                          23 50'F5=Vis.Evento'
002000990409     A  19                             23 69'F16=Annulla'
002010990409     A N16                             24  1'F3=Fine'
002020990409     A N01                             24 10'F4=Note Stampa'
002030990409     A  15                             24 26'F8=Benef.Alt'
002040990409     A                                 24 40'F18=Note'
002050020125     A  24                                  DSPATR(HI)
002060020125     A  24                                  DSPATR(BL)
002070990409     A                                 24 50'F9=Mandato Ass.'
002080990409     A N16                             24 69'F12=Ritorno'
002090020827     A*---------------------------------------------------------------*
002100990510     A          R FI03D02
002110020129     A N01                                  CF04
002120020129     A     25                               CF05
002130020827     A N01                                  CF06
002140990510     A  18                                  CF07
002150020129     A  06                                  CF08
002160020129     A                                      CF09
002170990510     A                                      CF12
002180990510     A                                      CF18
002190990510     A N01                                  CF21
002200990510     A                                      OVERLAY
002210990510     A  28        V1CMSG        78   M
002220990510     A            V2HPRS        35A  H
002230990510     A            V2HFPS         1A  H
002240990510     A            V2HNPZ        35A  H
002250990510     A            V2HFPZ         1A  H
002260990510     A                                 12  2'Colli Danneggiati/Mancanti.:'
002270990510     A            V2CNCN         5Y 0B 12 31EDTCDE(Z)
002280990510     A                                      CHECK(RB)
002290990510     A  81                                  DSPATR(PC)
002300020827     A                                      DSPATR(HI)
002310020827     A                                      DSPATR(UL)
002320990510     A                                 13  2'Kg Danneggiati/Mancanti....:'
002330990510     A            V2CPKD         7Y 1B 13 31EDTCDE(3)
002340990510     A                                      CHECK(RB)
002350990510     A  82                                  DSPATR(PC)
002360990510     A                                 14  2'Pezzi Danneggiati/Mancanti.:'
002370990510     A            V2CNPZ         5Y 0B 14 31EDTCDE(Z)
002380990510     A                                      CHECK(RB)
002390990510     A  86                                  DSPATR(PC)
002400990510     A                                 15  8'Desc. Pezzi Dan./Man.:'
002410990510     A            V2DNPZ        35A  B 15 31CHECK(LC)
002420990510     A  87                                  DSPATR(PC)
002430990510     A            V2CFPZ         1A  B 15 68VALUES(' ' '+')
002440990510     A                                 15 70'("+"=Segue)'
002450990510     A                                 16  8'Desc. Pezzi Presenti.:'
002460990510     A            V2CPRS        35A  B 16 31CHECK(LC)
002470990510     A            V2CFPS         1A  B 16 68VALUES(' ' '+')
002480990510     A                                 16 70'("+"=Segue)'
002490990510     A                                 17  2'Disposizioni merce dannegg.:'
002500990510     A            V2CDSD         1A  B 17 31
002510990510     A  85                                  DSPATR(PC)
002520990510     A                                      VALUES(' ' 'C' 'D' 'R' 'M')
002530990510     A                                 17 36'(C=Conseg., D=Distrutta, R=Resa, M-
002540990510     A                                      =Magazzino)'
002550990510     A  08                             18  2'Responsabilità Internaz. ..:'
002560990510     A  08        V2CRES         1A  B 18 31VALUES(' ' 'V' 'P')
002570990510     A  80                                  DSPATR(PC)
002580990510     A  08                             18 36'(V=Vettore, P=Partner)'
002590990510     A                                 19  2'Importo massimo risarcibile:'
002600990510     A            V2CIPV        13Y 3B 19 31EDTCDE(3)
002610990510     A                                      CHECK(RB)
002620990510     A  83                                  DSPATR(PC)
002630010904     A            V2CVPV         3A  B 19 47
002640990510     A                                      DSPATR(PR)
002650990510     A            V2DFPV        25A  O 19 56
002660990510     A  09                             20  2'Importo trattenuto.........:'
002670990510     A  09        V2CIPT        13Y 3B 20 31CHECK(RB)
002680990510     A                                      EDTCDE(3)
002690990510     A  76                                  DSPATR(PC)
002700010904     A  09        V2CVPT         3A  B 20 47
002710990510     A                                      DSPATR(PR)
002720990510     A  09                             20 56'il'
002730990510     A  09        V2CDPT         8Y 0B 20 60CHECK(RB)
002740990510     A                                      EDTWRD('  /  /    ')
002750990510     A  78                                  DSPATR(PC)
002760990510     A  07                             20  2'Importo concordato.........:'
002770990510     A  07        V2CIPR        13Y 3B 20 31CHECK(RB)
002780990510     A                                      EDTCDE(3)
002790990510     A  84                                  DSPATR(PC)
002800010904     A  07        V2CVPR         3A  B 20 47
002810990510     A                                      DSPATR(PR)
002820120712     ***A N01N05                          21  2'Rimborso a carico..........:'
002830120712     ***A N01N05     V2CPGD         1A  B 21 31VALUES('V' 'C')
002840120712     ***A  35                                  DSPATR(PR)
002850120712     ***A N35                                  DSPATR(HI)
002860120712     ***A N35                                  DSPATR(UL)
002870120712     ***A  79                                  DSPATR(PC)
002880120712     ***A N01N05                          21 36'(V=Vettore, C=Consuldanni)'
002890120712     A N01N05                          21  2'Rivalsa....................:'
002900120712     A N01N05     V2CRAG        35A  B 21 31
002910990510     A  36                                  DSPATR(PR)
002920990510     A N36                                  DSPATR(HI)
002930990510     A N36                                  DSPATR(UL)
002940120712     A  77                                  DSPATR(PC)
002950020827     A*---------------------------------------------------------------*
002960990409     A          R FI03Z02
002970990409     A                                      OVERLAY
002980020129     A     25                          23 14'F5=Vis.Evento'
002990990409     A                                 23 52'F9=Mandato As.'
003000990409     A  18                             23 68'F7=Man.Bolla'
003010020827     A N01                             24  1'F6=CONFERMA'
003020990409     A                                      DSPATR(HI)
003030990409     A N01                             24 14'F4=Note Stampa'
003040990409     A  06                             24 30'F8=Rivalsa'
003050990409     A                                 24 42'F18=Note'
003060020125     A  24                                  DSPATR(HI)
003070020125     A  24                                  DSPATR(BL)
003080990409     A N01                             24 52'F21=Segnacolli'
003090990409     A                                 24 68'F12=Ritorno'
003100020827     A*---------------------------------------------------------------*
003110990409     A          R FI03D03
003120990409     A N16                                  CA03
003130990409     A N16                                  CF12
003140990409     A                                      CF05
003150990409     A                                      OVERLAY
003160990409     A  28        V1CMSG        78   M
003170990409     A                                 14  2'Numero Evento...........(?):'
003180990409     A            V1CNEV         7A  O 14 31
003190990409     A            V1CAAE         4Y 0O 14 40EDTCDE(Z)
003200990409     A            V1CTAE         2A  O 14 47
003210990409     A            V1DTAE        25A  O 14 50
003220020129     A*
003230020129     A  33                             15  2'Franchigia.................:'
003240020129     A  33        V1CFRA         1A  O 15 31
003250020129     A  33                             15 35'(F=SI)'
003260020129     A*
003270020129     A            V1DNEV        35A  O 15 46
003280990409     A                                 16  2'Descrizione anomalia.......:'
003290990409     A            V1DAGG        35A  O 16 31
003300990409     A                                 17  2'Motivo del danno ..........:'
003310990409     A            V1DMTV        35A  O 17 31
003320990409     A                                 18  2'Presentata riserva.........:'
003330990409     A            V1CCRC         1A  O 18 31
003340990409     A                                 18 35'(S/N)'
003350990409     A                                 19  2'Controllo dati DDT.........:'
003360990409     A            V1CTDT         1A  O 19 31
003370990409     A                                 19 35'(P=Partenza, A=Arrivo, " "=Nessuno-
003380990409     A                                      )'
003390990409     A                                 20  2'Richiesta copia denuncia...:'
003400990409     A            V1CRCD         1A  O 20 31
003410990409     A                                 20 35'(S=SI, " "=NO)'
003420990409     A  13                             20 52'Stampata copia il:'
003430990409     A  13        V1CDIC         8Y 0O 20 71EDTWRD('  /  /    ')
003440990409     A                                 21  2'Beneficiario alternativo...:'
003450990409     A            V1CKSC         7Y 0O 21 31EDTCDE(Z)
003460990409     A            V1DKSC        35A  O 21 40
003470990409     A                                 22  2'Interlocutore..............:'
003480990409     A            V1DNOC        35A  O 22 31
003490020827     A*---------------------------------------------------------------*
003500981209     A          R FI03Z03
003510981209     A                                      OVERLAY
003520981209     A N16                             24  1'F3=Fine'
003530981209     A                                 24 45'F5=RIPRISTINA'
003540981209     A                                      DSPATR(HI)
003550981209     A N16                             24 69'F12=Ritorno'
003560020827     A*---------------------------------------------------------------*
003570981117     A          R FI03T04
003580981117     A            RSUT          20A  O  1  2
003590981117     A                                  1 28'** COMUNICAZIONE DI ANOMALIA **'
003600981117     A                                      DSPATR(RI)
003610981117     A                                      DSPATR(UL)
003620981117     A            VTCPGM        10A  O  1 61
003630981117     A                                  1 72DATE
003640981117     A                                      EDTCDE(Y)
003650981117     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
003660981117     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
003670981117     A            VTCMOD        14A  O  2 36DSPATR(HI)
003680981117     A                                  2 72TIME
003690981117     A N01                              3  2'C.A.      :'
003700981117     A                                      DSPATR(UL)
003710981117     A N01        VTCFIL         3S 0O  3 14
003720981117     A N01        VTCNCA         7Y 0O  3 18EDTCDE(Z)
003730981117     A N01                              3 31'del'
003740981117     A N01        VTCDC1         8Y 0O  3 35EDTCDE(8)
003750981117     A                                  3 46'ANOMALIA:'
003760981117     A                                      DSPATR(UL)
003770981117     A            VTCTAD         2A  O  3 56DSPATR(HI)
003780981117     A            VTDTAD        22A  O  3 59DSPATR(HI)
003790981117     A                                  4  2'SPEDIZIONE:'
003800981117     A                                      DSPATR(UL)
003810020827     A            VTCLNP         3S 0O  4 14
003820020827     A            VTCNRS         2Y 0O  4 18EDTCDE(Z)
003830020827     A                                  4 21'-'
003840020827     A            VTCNSP         7Y 0O  4 23EDTCDE(Z)
003850020827     A                                  4 31'del'
003860020827     A            VTCDSP         8Y 0O  4 35EDTCDE(8)
003870020827     A                                  4 46'LINEA ARRIVO :'
003880981117     A                                      DSPATR(UL)
003890020827     A            VTCLNA         3S 0O  4 61
003900020827     A            VTDLNA        16A  O  4 65
003910981117     A N01                              5  2'FASE C.A. :'
003920981117     A                                      DSPATR(UL)
003930981117     A N01        VTCFCA         3S 0O  5 14
003940981117     A N01        VTDFCA        25A  O  5 18
003950981117     A N01                              5 46'P.O. GESTIONE:'
003960981117     A                                      DSPATR(UL)
003970981117     A N01        VTCGFC         3S 0O  5 61
003980981117     A N01        VTDGFC        16A  O  5 65
003990981117     A                                  6  2'-----------------------------------
004000981117     A                                      ------------------------------------
004010981117     A                                      ----------'
004020020827     A*---------------------------------------------------------------*
004030990309     A          R FI03S04                   SFL
004040990309     A  22                                  SFLNXTCHG
004050990309     A            V1HI74         1A  H
004060990309     A            V1HCAN         1A  H
004070990309     A            V1HLNA         3S 0H
004080990309     A            V1SSEL         1A  B  9  2
004090990309     A  72                                  DSPATR(PC)
004100990309     A  73                                  DSPATR(ND)
004110990309     A  73                                  DSPATR(PR)
004120990309     A                                      VALUES('I' 'E' ' ')
004130990309     A            V1SFLS         3S 0O  9  6
004140990309     A  74                                  DSPATR(RI)
004150990309     A            V1SNSC         7Y 0O  9 10EDTCDE(Z)
004160990309     A  74                                  DSPATR(RI)
004170990309     A            V1SCAN         1A  B  9 20
004180990309     A  71                                  DSPATR(PC)
004190990309     A  73                                  DSPATR(PR)
004200990309     A N73                                  DSPATR(UL)
004210990309     A            V1DCAN        25A  O  9 22
004220990309     A            V1SDCM         8Y 0O  9 50EDTWRD('  /  /    ')
004230990309     A            V1SAAC         4Y 0O  9 63EDTCDE(Z)
004240990309     A            V1SFIL         3Y 0O  9 68EDTCDE(4)
004250990309     A            V1SNCA         7Y 0O  9 72EDTCDE(Z)
004260020827     A*---------------------------------------------------------------*
004270990201     A          R FI03C04                   SFLCTL(FI03S04)
004280990201     A                                      CF12
004290990201     A                                      CF06
004300990201     A                                      OVERLAY
004310990201     A                                      SFLCSRRRN(&V1CPOS)
004320990201     A  20                                  SFLDSP
004330990201     A  21                                  SFLDSPCTL
004340990201     A N21                                  SFLCLR
004350990201     A  23                                  SFLEND
004360990201     A                                      SFLSIZ(0015)
004370990201     A                                      SFLPAG(0014)
004380990201     A            V1CNRR         4S 0H      SFLRCDNBR(CURSOR)
004390990201     A  28        V1CMSG        78   M
004400990201     A            V1CPOS         5S 0H
004410990201     A                                  7 17'TIPO SCELTA SEGNACOLLI:'
004420990201     A            VCCTSL         1A  B  7 41VALUES('T' ' ')
004430990201     A  70                                  DSPATR(PR)
004440990201     A                                  7 43'(T=Tutti)'
004450990201     A                                  8  1'I/E  Segnacollo    ? Anomalia     -
004460990201     A                                                    Dt.Consegna    Numero-
004470990201     A                                       C.A.     '
004480990201     A                                      DSPATR(UL)
004490990201     A                                      DSPATR(HI)
004500020827     A*---------------------------------------------------------------*
004510981021     A          R FI03Z04
004520980720     A                                      OVERLAY
004530980720     A                                 24  2'I=Inclusione'
004540980720     A                                 24 16'E=Esclusione'
004550980720     A                                 24 46'F6=CONFERMA'
004560980720     A                                      DSPATR(HI)
004570980720     A                                 24 69'F12=Ritorno'
004580020827     A*---------------------------------------------------------------*
004590981021     A          R FI03D04
004600981019     A                                      OVERLAY
004610981019     A                                  9 13'(Non trovati segnacolli da visuali-
004620981019     A                                      zzare per questa C.A.)'
004630020827     A*---------------------------------------------------------------*
004640990209     A          R FI03T05
004650990209     A            RSUT          20A  O  1  2
004660990209     A                                  1 28'** COMUNICAZIONE DI ANOMALIA **'
004670990209     A                                      DSPATR(RI)
004680990209     A                                      DSPATR(UL)
004690990209     A            VTCPGM        10A  O  1 61
004700990209     A                                  1 72DATE
004710990209     A                                      EDTCDE(Y)
004720990209     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004730990209     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004740990209     A            VTCMOD        14A  O  2 36DSPATR(HI)
004750990209     A                                  2 72TIME
004760990209     A                                  3  2'C.A.      :'
004770990209     A                                      DSPATR(UL)
004780990209     A            VTCFIL         3S 0O  3 14
004790990209     A            VTCNCA         7Y 0O  3 18EDTCDE(Z)
004800990209     A                                  3 31'del'
004810990209     A            VTCDC1         8Y 0O  3 35EDTCDE(8)
004820990209     A                                  3 46'ANOMALIA:'
004830990209     A                                      DSPATR(UL)
004840990209     A            VTCTAD         2A  O  3 56DSPATR(HI)
004850990209     A            VTDTAD        22A  O  3 59DSPATR(HI)
004860990209     A                                  4  2'SPEDIZIONE:'
004870990209     A                                      DSPATR(UL)
004880990209     A            VTCLNP         3S 0O  4 14
004890990209     A            VTCNRS         2Y 0O  4 18EDTCDE(Z)
004900990209     A                                  4 21'-'
004910990209     A            VTCNSP         7Y 0O  4 23EDTCDE(Z)
004920990209     A                                  4 31'del'
004930990209     A            VTCDSP         8Y 0O  4 35EDTCDE(8)
004940990209     A                                  4 46'LINEA ARRIVO :'
004950990209     A                                      DSPATR(UL)
004960990209     A            VTCLNA         3S 0O  4 61
004970990209     A            VTDLNA        16A  O  4 65
004980990209     A                                  5  2'FASE C.A. :'
004990990209     A                                      DSPATR(UL)
005000990209     A            VTCFCA         3S 0O  5 14
005010990209     A            VTDFCA        25A  O  5 18
005020990209     A                                  5 46'P.O. GESTIONE:'
005030990209     A                                      DSPATR(UL)
005040990209     A            VTCGFC         3S 0O  5 61
005050990209     A            VTDGFC        16A  O  5 65
005060990209     A                                  6  2'-----------------------------------
005070990209     A                                      ------------------------------------
005080990209     A                                      ----------'
005090990209     A                                  7  2'Colli Danneggiati/Mancanti'
005100990209     A            VTCNCN         5Y 0O  7 31EDTCDE(2)
005110990209     A                                  7 46'Colli spedizione'
005120990209     A            VTCNCL         5Y 0O  7 65EDTCDE(2)
005130990209     A                                  8  2'-----------------------------------
005140990209     A                                      ------------------------------------
005150990209     A                                      ----------'
005160020827     A*---------------------------------------------------------------*
005170131106     A          R FI03S05                   SFL
005180131106     A*%%TS  SD  20131106  122520  EDPRM       REL-V7R1M0  5770-WDS
005190131106     A            V6HNSC         7Y 0H
005200131106     A            V6HPER         5Y 2H
005210131106     A            V6HPOR         3A  H
005220131106     A            V6HTCR         1A  H
005230131106     A            V6HTRE         4A  H
005240131106     A            V6HCAL         1A  H
005250131106     A            V6HTPR         3A  H
005260131106     A            V6SNSC         7Y 0B 13  2CHECK(RB)
005270131106     A                                      EDTCDE(Z)
005280131106     A  91                                  DSPATR(PR)
005290131106     A  92
005300131106     AO 91                                  DSPATR(PC)
005310131106     A            V6SPER         5Y 2B 13 11
005320131106     A  91                                  DSPATR(PR)
005330131106     A                                      CHECK(RB)
005340131106     A                                      EDTCDE(2)
005350131106     A  93                                  DSPATR(PC)
005360131106     A            V6SPOR         3A  B 13 19CHECK(RZ)
005370131106     A  91                                  DSPATR(PR)
005380131106     A  94                                  DSPATR(PC)
005390131106     A            V6SDPO        10A  O 13 23
005400131106     A            V6SDTC         3A  O 13 35
005410131106     A            V6STRE         4A  B 13 40
005420131106     A  91                                  DSPATR(PR)
005430131106     A  95                                  DSPATR(PC)
005440131106     A            V6SDTR        31A  O 13 45
005450131106     A            V6STPR         3A  B 13 77CHECK(RZ)
005460131106     A  91                                  DSPATR(PR)
005470131106     A  96                                  DSPATR(PC)
005480020827     A*---------------------------------------------------------------*
005490131106     A          R FI03C05                   SFLCTL(FI03S05)
005500131106     A*%%TS  SD  20131106  122520  EDPRM       REL-V7R1M0  5770-WDS
005510131106     A                                      SFLSIZ(0011)
005520131106     A                                      SFLPAG(0010)
005530131106     A N91                                  CF06
005540131106     A                                      OVERLAY
005550131106     A  20                                  SFLDSP
005560131106     A  21                                  SFLDSPCTL
005570131106     A N21                                  SFLCLR
005580131106     A  23                                  SFLEND
005590131106     A            V6CNRR         4S 0H      SFLRCDNBR(CURSOR)
005600131106     A  28        V6CMSG        78   M
005610131106     A                                 10  2'CALCOLO RESPONSABILITA'' DANNO ...-
005620131106     A                                      ..:'
005630131106     A            V6CDCA        35A  O 10 39
005640131106     A                                 12  2'Segnac.  Colli   P.O. Responsabile-
005650131106     A                                           ?   Tipo attribuzione         -
005660131106     A                                            Ter'
005670131106     A                                      DSPATR(UL)
005680131106     A                                      DSPATR(HI)
005690020827     A*---------------------------------------------------------------*
005700990212     A          R FI03Z05
005710990212     A                                      OVERLAY
005720990212     A N91                             24  2'F6=CONFERMA'
005730990212     A                                      DSPATR(HI)
005740990212     A                                 24  2'ENTER=Prosegui'
005750020827     A*---------------------------------------------------------------*
005760981019     A          R FI03W01
005770981019     A                                      CF12
005780981019     A                                      CF06
005790981019     A                                      OVERLAY
005800981019     A                                      WINDOW(10 35 5 41)
005810981019     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
005820981019     A                                          '))
005830981019     A            W1CTAD         2A  B  2 14
005840981019     A  40                                  DSPATR(PC)
005850981019     A                                      CHECK(RZ)
005860981019     A            W1DTAD        25A  O  2 17
005870981019     A                                  4 31'F12=Ritorno'
005880981019     A                                  2  1'Anomalia(?):'
005890981019     A  28        W1CMSG        40   M
005900981019     A                                  4  1'F6=Conferma'
005910020827     A*---------------------------------------------------------------*
005920981209     A          R FI03W02
005930981209     A                                      WINDOW(5 1 12 68)
005940981209     A                                      CF12
005950981209     A                                      OVERLAY
005960981209     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
005970981209     A                                          '))
005980981209     A  28        W2CMSG        65   M
005990981209     A                                  2  2'Ragione sociale :'
006000981209     A            W2CRAG        48A  B  2 20
006010981209     A  60                                  DSPATR(PC)
006020990128     A  69                                  DSPATR(PR)
006030990128     A N69                                  DSPATR(HI)
006040990128     A N69                                  DSPATR(UL)
006050981209     A                                  3  2'Indirizzo ......:'
006060981209     A            W2CVIA        30A  B  3 20
006070981209     A  61                                  DSPATR(PC)
006080990128     A  69                                  DSPATR(PR)
006090990128     A N69                                  DSPATR(HI)
006100990128     A N69                                  DSPATR(UL)
006110981209     A                                  4  2'C.A.P. .........:'
006120981209     A            W2CCAP         9A  B  4 20
006130981209     A  62                                  DSPATR(PC)
006140990128     A  69                                  DSPATR(PR)
006150990128     A N69                                  DSPATR(HI)
006160990128     A N69                                  DSPATR(UL)
006170981209     A                                  5  2'Località........:'
006180981209     A            W2CLOC        20A  B  5 20
006190981209     A  63                                  DSPATR(PC)
006200990128     A  69                                  DSPATR(PR)
006210990128     A N69                                  DSPATR(HI)
006220990128     A N69                                  DSPATR(UL)
006230981209     A                                  6  2'Provincia ......:'
006240981209     A            W2CPRV         2A  B  6 20
006250981209     A  64                                  DSPATR(PC)
006260990128     A  69                                  DSPATR(PR)
006270990128     A N69                                  DSPATR(HI)
006280990128     A N69                                  DSPATR(UL)
006290981209     A                                  7  2'Nazione .....(?):'
006300981209     A            W2CNAZ         3A  B  7 20
006310981209     A  65                                  DSPATR(PC)
006320990128     A  69                                  DSPATR(PR)
006330990128     A N69                                  DSPATR(HI)
006340990128     A N69                                  DSPATR(UL)
006350981209     A                                  8  2'Partita IVA ....:'
006360981209     A            W2CIVA        14A  B  8 20
006370981209     A  68                                  DSPATR(PC)
006380990128     A  69                                  DSPATR(PR)
006390990128     A N69                                  DSPATR(HI)
006400990128     A N69                                  DSPATR(UL)
006410981209     A            W2CIVE         2A  B  8 35
006420990128     A  69                                  DSPATR(PR)
006430990128     A N69                                  DSPATR(HI)
006440990128     A N69                                  DSPATR(UL)
006450981209     A                                  9  2'Numero Telefono.:'
006460981209     A            W2CTEL        16A  B  9 20
006470981209     A  67                                  DSPATR(PC)
006480990128     A  69                                  DSPATR(PR)
006490990128     A N69                                  DSPATR(HI)
006500990128     A N69                                  DSPATR(UL)
006510981209     A                                 10  2'Numero Fax......:'
006520981209     A            W2CFAX        16A  B 10 20
006530981209     A  66                                  DSPATR(PC)
006540990128     A  69                                  DSPATR(PR)
006550990128     A N69                                  DSPATR(HI)
006560990128     A N69                                  DSPATR(UL)
006570981209     A                                 11 57'F12=Ritorno'
