000100050113     A*%%TS  SD  20050113  095456  EDPGA       REL-V4R4M0  5769-PW1
000200040129     A*** FILE : FIDN43D *------------------------------------------***
000300040129     A*          ELENCO C.A.                                          *
000400040129     A***-----------------------------------------------------------***
000500050113     A*%%EC
000600050113     A                                      DSPSIZ(24 80 *DS3)
000700050113     A                                      PRINT
000800050113     A                                      CA03
000900050113     A                                      CF06
001000040129     A*------------------------------------*
001100050113     A          R DND2D01
001200050113     A*%%TS  SD  20050113  095456  EDPGA       REL-V4R4M0  5769-PW1
001300050113     A                                      CF11
001400050113     A  28        V1CMSG        78   M
001500050113     A            RSUT          20A  O  1  2
001600050113     A                                  1 26'    Statistica per Cliente    '
001700050113     A                                      DSPATR(RI)
001800050113     A                                      DSPATR(UL)
001900050329     A                                  1 62'FIDND2R'
002000050113     A                                  1 72DATE
002100050113     A                                      EDTCDE(Y)
002200050113     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
002300050113     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
002400050113     A                                  2 26'Richiesta  Assistenza  Clienti'
002500050113     A                                      DSPATR(UL)
002600050113     A                                      DSPATR(RI)
002700050113     A                                  2 72TIME
002800050113     A                                  5  2'Codice Cliente .....:'
002900050113     A                                  8  2'---------------- SELEZIONI SULLE R-
003000050113     A                                      ICHIESTE DI ASSISTENZA -------------
003100050113     A                                      ---------'
003200050113     A                                  9  2'P.O. responsabile ..:'
003300050113     A            V1CPRS         3Y 0B  9 25DSPATR(HI)
003400050113     A                                      CHECK(RB)
003500050113     A  40                                  DSPATR(PC)
003600050113     A                                      EDTCDE(Z)
003700050113     A            V1DPRS        15A  O  9 29
003800050113     A                                 10  2'P.O. di apertura ...:'
003900050113     A            V1CFIL         3Y 0B 10 25CHECK(RB)
004000050113     A                                      DSPATR(HI)
004100050113     A  41                                  DSPATR(PC)
004200050113     A                                      EDTCDE(Z)
004300050113     A            V1DFIL        15A  O 10 29
004400050113     A                                 12  2'Data Richiesta ..dal:'
004500050113     A            V1CDCD         8Y 0B 12 25DSPATR(HI)
004600050113     A                                      CHECK(RB)
004700050113     A                                      EDTWRD('  /  /    ')
004800050113     A  42                                  DSPATR(PC)
004900050113     A                                 12 36'al'
005000050113     A            V1CDCA         8Y 0B 12 40DSPATR(HI)
005100050113     A                                      CHECK(RB)
005200050113     A                                      EDTWRD('  /  /    ')
005300050113     A  43                                  DSPATR(PC)
005400050113     A                                 13  2'Data Chiusura  ..dal:'
005500050113     A            V1CDHD         8Y 0B 13 25DSPATR(HI)
005600050113     A                                      CHECK(RB)
005700050113     A                                      EDTWRD('  /  /    ')
005800050113     A  44                                  DSPATR(PC)
005900050113     A                                 13 36'al'
006000050113     A            V1CDHA         8Y 0B 13 40DSPATR(HI)
006100050113     A                                      CHECK(RB)
006200050113     A                                      EDTWRD('  /  /    ')
006300050113     A  45                                  DSPATR(PC)
006400050113     A                                 16  2'Tipo Comunicazione ?:'
006500050113     A            V1CTC1         1A  B 16 25DSPATR(HI)
006600050113     A  46                                  DSPATR(PC)
006700050113     A            V1CTC2         1A  B 16 27DSPATR(HI)
006800050113     A  47                                  DSPATR(PC)
006900050113     A            V1CTC3         1A  B 16 29DSPATR(HI)
007000050113     A  48                                  DSPATR(PC)
007100050113     A            V1CTC4         1A  B 16 31DSPATR(HI)
007200050113     A  49                                  DSPATR(PC)
007300050113     A                                 17  2'Motivo Apertura ...?:'
007400050113     A            V1CMA1         3A  B 17 25DSPATR(HI)
007500050113     A  50                                  DSPATR(PC)
007600050113     A            V1CMA2         3A  B 17 29DSPATR(HI)
007700050113     A  51                                  DSPATR(PC)
007800050113     A            V1CMA3         3A  B 17 33DSPATR(HI)
007900050113     A  52                                  DSPATR(PC)
008000050113     A            V1CMA4         3A  B 17 37DSPATR(HI)
008100050113     A  53                                  DSPATR(PC)
008200050113     A            V1CMA5         3A  B 17 41DSPATR(HI)
008300050113     A  54                                  DSPATR(PC)
008400050113     A            V1CMA6         3A  B 17 45DSPATR(HI)
008500050113     A  55                                  DSPATR(PC)
008600050113     A            V1CMA7         3A  B 17 49DSPATR(HI)
008700050113     A  56                                  DSPATR(PC)
008800050113     A            V1CMA8         3A  B 17 53DSPATR(HI)
008900050113     A  57                                  DSPATR(PC)
009000050113     A                                 18  2'Codice Chiusura ...?:'
009100050113     A            V1CCC1         3A  B 18 25DSPATR(HI)
009200050113     A  58                                  DSPATR(PC)
009300050113     A            V1CCC2         3A  B 18 29DSPATR(HI)
009400050113     A  59                                  DSPATR(PC)
009500050113     A            V1CCC3         3A  B 18 33DSPATR(HI)
009600050113     A  60                                  DSPATR(PC)
009700050113     A                                 14  2'Solo aperte ........:'
009800050113     A            V1CSRA         1A  B 14 25DSPATR(HI)
009900050113     A                                      VALUES(' ' 'S')
010000050113     A  61                                  DSPATR(PC)
010100050113     A                                 14 27'(S=Si)'
010200050113     A                                 24  2'F3=Fine'
010300050113     A                                 24 69'F6=Conferma'
010400050113     A            V1CKSC         7Y 0B  5 25DSPATR(HI)
010500050113     A                                      CHECK(RB)
010600050113     A                                      EDTCDE(Z)
010700050113     A  11                                  DSPATR(PC)
010800050113     A                                  4  2'Scelta .............:'
010900050113     A            V1CSCE         1A  B  4 25DSPATR(HI)
011000050113     A                                      VALUES('1' '2' ' ')
011100050113     A  10                                  DSPATR(PC)
011200050113     A                                  4 28'(1=Un solo cliente;2=Un cliente un-
011300050113     A                                      ificante)'
011400050113     A                                 24 25'F11=Interr. P.d.C.'
011500050113     A            V1DKSC        45A  O  5 33
011600050113     A                                 20  2'---------------------------- OPZIO-
011700050113     A                                      NI DI STAMPA -----------------------
011800050113     A                                      ---------'
011900050113     A                                 21  2'Stampa Note ........:'
012000050113     A                                 21 45'Stampa P.O. responsabile .:'
012100050113     A                                 22  2'Stampa solo totali .:'
012200050113     A            V1CNOT         1A  B 21 25DSPATR(HI)
012300050113     A                                      VALUES('S' ' ')
012400050113     A            V1CPOR         1A  B 21 73DSPATR(HI)
012500050113     A                                      VALUES('S' ' ')
012600050113     A            V1CTOT         1A  B 22 25DSPATR(HI)
012700050113     A                                      VALUES('S' ' ')
012800050113     A                                 21 27'(S=Si)'
012900050113     A                                 21 75'(S=Si)'
013000050113     A                                 22 27'(S=Si)'
013100050113     A  12        V1DCLI         7S 0O  6 25
013200050113     A  12                              6 33'Cliente selezionato non unificante'
013300050113     A                                  7 25'Dettaglio suddiviso per figlio'
013400050113     A            V1CDET         1   B  7 57DSPATR(HI)
013500050113     A                                      VALUES(' ' 'S')
013600050113     A                                  7 59'(S=Si)'
