000100050811      *PARMS MBR(*NONE)
000200050811      *--------------------------------------------------------------*
000300050811      *?DS per Lista Rimborsi C.A. affidate ad A.I.G.               ?*
000400050811      *--------------------------------------------------------------*
000500050831     A          R D8BREC                    TEXT('DS DI LISTA RIMBORSI-
000600050811     A                                      C.A. AFFIDATE AD A.I.G.')
000700050905     A            D8BDCI    R               REFFLD(DCTDCH  FNDCT00F)
000800050905     A            D8BDCF    R               REFFLD(DCTDCH  FNDCT00F)
000900051011     A            D8BSE1         1A         TEXT('S=Sì C.A. per le qua-
001000051011     A                                      li si deve ancora chiedere-
001100051011     A                                       ilrimborso')
001200051011     A            D8BSE2         1A         TEXT('S=Sì C.A. per le qua-
001300050811     A                                      li è già stato chiesto il -
001400050811     A                                      rimborso')
001500051011     A            D8BSE3         1A         TEXT('S=Sì C.A. già rimbor-
001600051011     A                                      sate')
