000010170228     A*%%TS  SD  20170228  121035  EDPES       REL-V7R2M0  5770-WDS
000020131014     A*/*PRM RSTDSP(*YES) DFRWRT(*YES) DECFMT(*JOB)
000030131014     A*/*END
000040131014     A*---------------------------------------------------------------*
000050170228     A*%%EC
000060170228     A                                      DSPSIZ(24 80 *DS3)
000070170228     A                                      CHGINPDFT(HI UL)
000080170228     A                                      PRINT
000090131014      *---------------------------------------------------------------*
000100130726     A          R FI01D01
000110130726     A                                      CF03
000120130726     A  07                                  CF07
000130130726     A  08                                  CF08
000140130726     A  09                                  CF09
000150130726     A                                      CF10
000160130726     A                                      CF12
000170130726     A                                      CF13
000180130726     A  03                                  CF14
000190130726     A                                      CF15
000200130726     A                                      CF18
000210130726     A                                      CF19
000220130726     A                                      CF20
000230130726     A                                      CF21
000240130726     A                                      CF24
000250130726     A  28        V1CMSG        78   M
000260130726     A            RSUT          20A  O  1  2
000270130726     A                                  1 28'** INTERROGAZIONE C.ANOMALIA **'
000280130726     A                                      DSPATR(RI)
000290130726     A                                      DSPATR(UL)
000300130726     A            VTCPGM        10A  O  1 61
000310130726     A                                  1 72DATE
000320130726     A                                      EDTCDE(Y)
000330130726     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000340130726     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000350130726     A  35                              2 38'ANNULLATA'
000360130726     A                                      DSPATR(HI)
000370130726     A                                      DSPATR(BL)
000380130726     A                                      DSPATR(RI)
000390130726     A                                  2 72TIME
000400050928     A*
000410130726     A                                  3  2'C.A.    :'
000420130726     A                                      DSPATR(UL)
000430130726     A                                      DSPATR(HI)
000440130726     A            VTCFIL         3S 0O  3 12DSPATR(HI)
000450130726     A            VTCNCA         7Y 0O  3 16EDTCDE(Z)
000460130726     A                                      DSPATR(HI)
000470130726     A                                  3 25'del'
000480130726     A                                      DSPATR(HI)
000490130726     A            VTCDC1         8Y 0O  3 29EDTCDE(8)
000500130726     A                                      DSPATR(HI)
000510130726     A                                  3 40'SPEDIZIONE:'
000520130726     A                                      DSPATR(UL)
000530130726     A                                      DSPATR(HI)
000540130726     A            VTCLNP         3S 0O  3 52DSPATR(HI)
000550130726     A            VTCNRS         2Y 0O  3 56EDTCDE(Z)
000560130726     A                                      DSPATR(HI)
000570130726     A            VTCNSP         7Y 0O  3 59EDTCDE(Z)
000580130726     A                                      DSPATR(HI)
000590130726     A                                  3 67'del'
000600130726     A                                      DSPATR(HI)
000610130726     A            VTCDSP         8Y 0O  3 71EDTCDE(8)
000620130726     A                                      DSPATR(HI)
000630050928     A*
000640130726     A            VTDCBO         9A  O  4 61DSPATR(HI)
000650130726     A                                  4 71'Arrivo'
000660130726     A            VTCLNA         3S 0O  4 78DSPATR(HI)
000670050928     A*
000680130726     A                                  5  2'ANOMALIA:'
000690130726     A            VTCTAD         2A  O  5 12DSPATR(UL)
000700130726     A            VTDTAD        22A  O  5 16DSPATR(UL)
000710130726     A            VTDAGG        35A  O  5 40DSPATR(UL)
000720130726     A  80        V1CFAG         1A  B  5 76VALUES(' ' '+')
000730130726     A                                      DSPATR(HI)
000740130726     A  80                              5 78'(+)'
000750050928     A*
000760130726     A  07                              6  2'EVENTO  :'
000770130726     A  07        VTCAAE         4Y 0O  6 12EDTCDE(Z)
000780130726     A  07        VTCNEV         7Y 0O  6 17EDTCDE(Z)
000790130726     A  07                              6 25'del'
000800130726     A  07        VTCDEV         8Y 0O  6 29EDTWRD('  /  /    ')
000810130726     A  07        VTDAEV        25A  O  6 40
000820130726     A  07        VTDFOR        12A  O  6 69DSPATR(HI)
000830050928     A*
000840130726     A                                  7  2'-----------------------------------
000850130726     A                                      ------------------------------------
000860130726     A                                      ----------'
000870050928     A*
000880130726     A                                  8  2'Mitt.'
000890130726     A            VTCKSM         7Y 0O  8  8EDTCDE(Z)
000900130726     A                                      DSPATR(UL)
000910130726     A            VTCRSM        25A  O  8 16DSPATR(UL)
000920130726     A                                  8 42'Dest.'
000930130726     A            VTCKSD         7Y 0O  8 48EDTCDE(Z)
000940130726     A                                      DSPATR(UL)
000950130726     A            VTCRSD        25A  O  8 56DSPATR(UL)
000960050928     A*
000970130726     A            VTCCAM         9A  O  9  6DSPATR(UL)
000980130726     A            VTCLOM        18A  O  9 16DSPATR(UL)
000990130726     A            VTCPRM         2A  O  9 35DSPATR(UL)
001000130726     A            VTCNAM         3A  O  9 38DSPATR(UL)
001010130726     A            VTCCAD         9A  O  9 46DSPATR(UL)
001020130726     A            VTCLOD        18A  O  9 56DSPATR(UL)
001030130726     A            VTCPRD         2A  O  9 75DSPATR(UL)
001040130726     A            VTCNAD         3A  O  9 78DSPATR(UL)
001050050928     A*
001060130726     A                                 10 28'Colli'
001070130726     A            VTCNCL         5Y 0O 10 34EDTCDE(Z)
001080130726     A                                      DSPATR(HI)
001090130726     A                                 10 41'Kg'
001100130726     A            VTCPKF         7Y 1O 10 44EDTCDE(4)
001110130726     A                                      DSPATR(HI)
001120130726     A                                 10 54'Mc'
001130130726     A            VTCFVF         1A  O 10 57DSPATR(HI)
001140130726     A            VTCVLF         5Y 3O 10 59EDTCDE(4)
001150130726     A                                      DSPATR(HI)
001160130726     A            VTCNAS        15A  O 10 66DSPATR(HI)
001170130726     A                                 10  2'Rif.Mit.'
001180130726     A            VTCRMN        15Y 0O 10 11DSPATR(HI)
001190130726     A                                      EDTCDE(Z)
001200050928     A*
001210130726     A                                 11  2'-----------------------------------
001220130726     A                                      ------------------------------------
001230130726     A                                      ----------'
001240050928     A*
001250130726     A N19                             12  2'Fase  C.A.'
001260130726     A                                      DSPATR(RI)
001270130726     A  19                             12  2'Chiusa il '
001280130726     A                                      DSPATR(RI)
001290130726     A N19        V1CFCA         3S 0O 12 13DSPATR(UL)
001300130726     A  19        V1CDCH         8Y 0O 12 13EDTWRD('  /  /    ')
001310130726     A                                      DSPATR(UL)
001320130726     A                                      DSPATR(RI)
001330130726     A N19        V1DFCA        32A  O 12 17DSPATR(UL)
001340130726     A                                      DSPATR(RI)
001350130726     A  19        V1CCCH         2A  O 12 27DSPATR(UL)
001360130726     A  19        V1DCCH        25A  O 12 30DSPATR(UL)
001370130726     A                                      DSPATR(RI)
001380130726     A N19                             12 51'in gestione a'
001390130726     A                                      DSPATR(RI)
001400130726     A N19        V1CGFC         3S 0O 12 65DSPATR(UL)
001410130726     A N19        V1DGFC        12A  O 12 69DSPATR(RI)
001420130726     A  36                                  DSPATR(BL)
001430130726     A  19 39                          12 56'Estratta per il pagamento'
001440130726     A                                      DSPATR(RI)
001450130726     A  19 38                          12 65'Pagata'
001460130726     A                                      DSPATR(RI)
001470050928     A*
001480130726     A                                 13  2'Denuncia '
001490130726     A            V1CAAD         4Y 0O 13 13EDTCDE(Z)
001500130726     A                                      DSPATR(UL)
001510130726     A            V1CPOD         3A  O 13 18DSPATR(UL)
001520130726     A            V1CNDE         7Y 0O 13 22DSPATR(UL)
001530130726     A                                      EDTCDE(Z)
001540130726     A            V1CDSB         8Y 0O 13 30EDTWRD('  /  /    ')
001550130726     A                                      DSPATR(UL)
001560130726     A                                 13 41'Copia'
001570130726     A            V1DRCD         3A  O 13 47DSPATR(UL)
001580130726     A                                 13 51'Pr.Assicurat.'
001590130726     A            V1CDIT         3A  O 13 65DSPATR(UL)
001600130726     A            V1CPRA         4Y 0O 13 69EDTCDE(Z)
001610130726     A                                      DSPATR(UL)
001620130726     A            V1CPRN         7Y 0O 13 74DSPATR(UL)
001630130726     A                                      EDTCDE(Z)
001640050928     A*
001650130726     A                                 14  2'-----------------------------------
001660130726     A                                      ------------------------------------
001670130726     A                                      ----------'
001680050928     A*
001690130726     A                                 15  2'Tipo gestione'
001700130726     A            V1DFPR        32A  O 15 30DSPATR(UL)
001710130726     A                                      DSPATR(HI)
001720130726     A                                 15 63'con'
001730130726     A            V1DPTR        14A  O 15 67DSPATR(UL)
001740130726     A                                      DSPATR(HI)
001750050928     A*
001760130726     A                                 16  2'Beneficiario Alternativo'
001770130726     A            V1CKSC         7Y 0O 16 30EDTCDE(Z)
001780130726     A                                      DSPATR(UL)
001790130726     A            V1DKSC        35A  O 16 38DSPATR(UL)
001800050928     A*
001810130726     A  16                             17  2'Rivalsa                   '
001820130726     A  16        V1CASS        35A  O 17 30DSPATR(UL)
001830130726     A  15                             17  2'Interlocutore'
001840130726     A  15        V1DNOC        35A  O 17 30DSPATR(UL)
001850050928     A*
001860130726     A N13                             18  2'-----------------------------------
001870130726     A                                      ------------------------------------
001880130726     A                                      ----------'
001890130726     A  13                             18  2'Responsabilità Internaz.'
001900130726     A  13        V1DRES         7A  O 18 30DSPATR(UL)
001910050928     A*
001920130726     A                                 19  2'Quantità Dannegg./Mancante '
001930130726     A                                 19 30'Pezzi'
001940130726     A            V1CNPZ         5Y 0O 19 38EDTCDE(2)
001950130726     A                                      DSPATR(UL)
001960130726     A                                 19 48'Colli'
001970130726     A            V1CNCN         5Y 0O 19 56EDTCDE(2)
001980130726     A                                      DSPATR(UL)
001990130726     A                                 19 67'Kg'
002000130726     A            V1CPKD         7Y 1O 19 72EDTCDE(2)
002010130726     A                                      DSPATR(UL)
002020050928     A*
002030130726     A                                 20  2'Descr. Pezzi Dann./Mancanti'
002040130726     A            V1DNPZ        35A  O 20 30DSPATR(UL)
002050130726     A  81        V1CFPZ         1A  B 20 67VALUES(' ' '+')
002060130726     A                                      DSPATR(HI)
002070130726     A  81                             20 70'("+"=Segue)'
002080050928     A*
002090130726     A                                 21  2'Descrizione Pezzi Presenti '
002100130726     A            V1DPRS        35A  O 21 30DSPATR(UL)
002110130726     A  82        V1CFPS         1A  B 21 67VALUES(' ' '+')
002120130726     A                                      DSPATR(HI)
002130130726     A  82                             21 70'("+"=Segue)'
002140050928     A*
002150130726     A                                 22  2'Motivo del Danno           '
002160130726     A            V1DMTV        35A  O 22 30DSPATR(UL)
002170130726     A  83        V1CFMT         1A  B 22 67VALUES(' ' '+')
002180130726     A                                      DSPATR(HI)
002190130726     A  83                             22 70'("+"=Segue)'
002200050928     A*
002210130726     A                                 23  2'DDT verificato dal P.O. di'
002220130726     A            V1DTDT         8A  O 23 30DSPATR(UL)
002230130726     A                                 23 41'Riserva'
002240130726     A            V1DCRC         2A  O 23 49DSPATR(UL)
002250130726     A                                 23 53'Merce danneggiata'
002260130726     A            V1DDSD        10A  O 23 71DSPATR(UL)
002270050928     A*
002280130726     A            V1CCMD        78A  O 24  2DSPATR(HI)
002290131014     A*---------------------------------------------------------------*
002300161206     A          R FI01D02
002310161206     A*%%TS  SD  20161206  115112  EDPMB       REL-V7R1M0  5770-WDS
002320161206     A  17                                  CF02
002330161206     A  18                                  CF08
002340161206     A N70                                  CF09
002350161206     A  47                                  CF11
002360161206     A                                      CF12
002370161206     A  28        V2CMSG        78   M
002380161206     A            RSUT          20A  O  1  2
002390161206     A                                  1 28'** INTERROGAZIONE C.ANOMALIA **'
002400161206     A                                      DSPATR(RI)
002410161206     A                                      DSPATR(UL)
002420161206     A            VTCPGM        10A  O  1 61
002430161206     A                                  1 72DATE
002440161206     A                                      EDTCDE(Y)
002450161206     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
002460161206     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
002470161206     A                                  2 72TIME
002480050928     A*
002490161206     A                                  4  2'C.A.    :'
002500161206     A                                      DSPATR(UL)
002510161206     A                                      DSPATR(HI)
002520161206     A            VTCFIL         3S 0O  4 12DSPATR(HI)
002530161206     A            VTCNCA         7Y 0O  4 16EDTCDE(Z)
002540161206     A                                      DSPATR(HI)
002550161206     A                                  4 25'del'
002560161206     A                                      DSPATR(HI)
002570161206     A            VTCDC1         8Y 0O  4 29EDTCDE(8)
002580161206     A                                      DSPATR(HI)
002590161206     A                                  4 40'SPEDIZIONE:'
002600161206     A                                      DSPATR(UL)
002610161206     A                                      DSPATR(HI)
002620161206     A            VTCLNP         3S 0O  4 52DSPATR(HI)
002630161206     A            VTCNRS         2Y 0O  4 56EDTCDE(Z)
002640161206     A                                      DSPATR(HI)
002650161206     A            VTCNSP         7Y 0O  4 59EDTCDE(Z)
002660161206     A                                      DSPATR(HI)
002670161206     A                                  4 67'del'
002680161206     A                                      DSPATR(HI)
002690161206     A            VTCDSP         8Y 0O  4 71EDTCDE(8)
002700161206     A                                      DSPATR(HI)
002710050928     A*
002720161206     A                                  5  2'ANOMALIA:'
002730161206     A            VTCTAD         2A  O  5 12DSPATR(UL)
002740161206     A            VTDTAD        22A  O  5 16DSPATR(UL)
002750161206     A            VTDAGG        35A  O  5 40DSPATR(UL)
002760050928     A*
002770161206     A  07                              6  2'EVENTO  :'
002780161206     A  07        VTCAAE         4Y 0O  6 12EDTCDE(Z)
002790161206     A  07        VTCNEV         7Y 0O  6 17EDTCDE(Z)
002800161206     A  07                              6 25'del'
002810161206     A  07        VTCDEV         8Y 0O  6 29EDTWRD('  /  /    ')
002820161206     A  07        VTDAEV        25A  O  6 40
002830161206     A  07        VTDFOR        12A  O  6 69DSPATR(HI)
002840050928     A*
002850161206     A                                  7  2'-Imp. Da Assicurare -----|---Imp. -
002860161206     A                                      C/Assegno -------|--Imp. Ft. Immedi-
002870161206     A                                      ata ------'
002880161206     A                                      DSPATR(HI)
002890050928     A*
002900161206     A            V2CIAS        13Y 3O  8  4EDTCDE(2)
002910161206     A  04                                  DSPATR(UL)
002920161206     A  04                                  DSPATR(HI)
002930161206     A            V2CVAS         3A  O  8 23
002940161206     A  04                                  DSPATR(HI)
002950161206     A            V2CCAS        13Y 3O  8 30EDTCDE(2)
002960161206     A  06                                  DSPATR(UL)
002970161206     A  06                                  DSPATR(HI)
002980161206     A            V2CVCA         3A  O  8 49
002990161206     A  06                                  DSPATR(HI)
003000161206     A            V2CFTI        13Y 3O  8 57EDTCDE(2)
003010161206     A  05                                  DSPATR(UL)
003020161206     A  05                                  DSPATR(HI)
003030161206     A            V2CVFI         3A  O  8 76
003040161206     A  05                                  DSPATR(HI)
003050050928     A*
003060161206     A                                  9  2'-----------------------------------
003070161206     A                                      ------------------------------------
003080161206     A                                      ----------'
003090161206     A                                      DSPATR(HI)
003100050928     A*
003110161206     A                                 10  2'Importo Mass.Risarc.'
003120161206     A            V2CIPV        15Y 3O 10 23EDTCDE(2)
003130161206     A                                      DSPATR(UL)
003140161206     A            V2CVPV         3A  O 10 43
003150161206     A            V2DFPV        20A  O 10 47DSPATR(UL)
003160050928     A*
003170161206     A                                 11  2'Importo Richiesto'
003180161206     A            V2CIPR        15Y 3O 11 23EDTCDE(2)
003190161206     A                                      DSPATR(UL)
003200161206     A            V2CVPR         3A  O 11 43
003210050928     A*
003220161206     A                                 12  2'Importo Trattenuto'
003230161206     A            V2CIPT        15Y 3O 12 23EDTCDE(2)
003240161206     A                                      DSPATR(UL)
003250161206     A            V2CVPT         3A  O 12 43
003260161206     A                                 12 47'il'
003270161206     A            V2CDPT         8Y 0O 12 50EDTWRD('  /  /    ')
003280161206     A                                      DSPATR(UL)
003290050928     A*
003300161206     A  72N73N74                       13  2'-------------------- ESTREMI PAGAM-
003310161206     A                                      ENTO PRATICA -----------------------
003320161206     A                                      ----------'
003330161206     A                                      DSPATR(HI)
003340161206     A N72 73N74                       13  2'-------------------- ESTREMI PAGAM-
003350161206     A                                      ENTO L.T. --------------------------
003360161206     A                                      ----------'
003370161206     A                                      DSPATR(HI)
003380161206     A  74                             13  2'---------------- ESTREMI PAGAMENTO-
003390161206     A                                       PRATICA IN FRANCHIGIA -------------
003400161206     A                                      ----------'
003410161206     A                                      DSPATR(HI)
003420050928     A*
003430161206     A                                 14  2'Importo Liquidato'
003440161206     A            V2CIPL        15Y 3O 14 23EDTCDE(2)
003450161206     A                                      DSPATR(UL)
003460161206     A            V2CVPL         3A  O 14 43
003470161205     A***                              14 48'Assegno'
003480161206     A            V2DASN         8A  O 14 47
003490161206     A            V2CASN        10A  O 14 56DSPATR(UL)
003500161206     A                                 14 67'del'
003510161206     A            V2CDEA         8Y 0O 14 71EDTWRD('  /  /    ')
003520161206     A                                      DSPATR(UL)
003530050928     A*
003540161206     A                                 15  2'Banca :'
003550161206     A            V2CBAN        50A  O 15 10
003560161206     A                                 15 61'ABI'
003570161206     A            V2CABI         5A  O 15 65DSPATR(UL)
003580161206     A                                 15 72'CAB'
003590161206     A            V2CCAB         5A  O 15 76DSPATR(UL)
003600161206     A N17N38
003610161206     AON17 19 38
003620161206     A  72N73N74                       16  2'------------------------------ PRA-
003630161206     A                                      TICA -------------------------------
003640161206     A                                      ----------'
003650161206     A                                      DSPATR(HI)
003660161206     A N17 19 38
003670161206     A N72 73N74                       16  2'--------------------- LIQUIDAZIONE-
003680161206     A                                       TRANSATTIVA -----------------------
003690161206     A                                      ----------'
003700161206     A                                      DSPATR(HI)
003710161206     A N17 19 38
003720161206     A  74                             16  2'--------------------- PRATICA IN F-
003730161206     A                                      RANCHIGIA --------------------------
003740161206     A                                      ----------'
003750161206     A                                      DSPATR(HI)
003760161206     A  17                             16  2'-------------------- PRATICA  AFFI-
003770161206     A                                      DATA  AD  A.I.G. -------------------
003780161206     A                                      ----------'
003790161206     A                                      DSPATR(HI)
003800161206     A  17
003810161206     AON38
003820161206     AO 72N73N74                       17  2'Intestatar.Prog.Liquidazione'
003830161206     A N17 19 38
003840161206     A N72 73
003850161206     AON17 19 38
003860161206     A  74                             17  2'Beneficiario Pagamento'
003870151110     A*
003880161206     A            V2CPLI         7Y 0O 17 35EDTCDE(Z)
003890161206     A                                      DSPATR(UL)
003900161206     A            V2DPLI        35A  O 17 43DSPATR(UL)
003910161206     A  17
003920161206     AON38
003930161206     AO 72N73N74                       18  2'Dta Stampa Prog.Liquidazione'
003940161206     A  17
003950161206     AON38
003960161206     AO 72N73N74  V2CDDS         8Y 0O 18 32EDTWRD('  /  /    ')
003970161206     A                                      DSPATR(UL)
003980161206     A  17
003990161206     AON38
004000161206     AO 72N73N74                       18 49'Dta Accettazione'
004010161206     A  17
004020161206     AON38
004030161206     AO 72N73N74  V2CDPL         8Y 0O 18 69EDTWRD('  /  /    ')
004040161206     A                                      DSPATR(UL)
004050161206     A  17
004060161206     AON38
004070161206     AO 72N73N74                       19  2'Importo Liquidato'
004080161206     A  17
004090161206     AON38
004100161206     AO 72N73N74  V2CIPP        15Y 3O 19 23EDTCDE(2)
004110161206     A                                      DSPATR(UL)
004120161206     A  17
004130161206     AON38
004140161206     AO 72N73N74  V2CVPP         3A  O 19 43
004150161206     A  17
004160161206     AON38
004170161206     AO 72N73N74                       19 49'Valuta pagamento'
004180161206     A  17
004190161206     AON38
004200161206     AO 72N73N74  V2CVLP         8Y 0O 19 69EDTWRD('  /  /    ')
004210161206     A                                      DSPATR(UL)
004220161206     A  17
004230161206     AON38
004240161206     AO 72N73N74                       20 24'Note Calcolo risarcimento'
004250161206     A                                      DSPATR(UL)
004260161206     A                                      DSPATR(HI)
004270161206     A  17
004280161206     AON38
004290161206     AO 72N73N74  V2CPL1        70A  O 21  2
004300161206     A  17
004310161206     AON38
004320161206     AO 72N73N74  V2CPL2        70A  O 22  2
004330050928     A*
004340161206     A N70                             24  2'F9=Mandato'
004350161206     A  17                             24 14'F2=Disp.AIG'
004360161206     A  47                             24 31'F11=Recup.AIG'
004370161206     A  18N73N74                       24 50'F8=Dati intest.P.L.'
004380161206     A  18 73
004390161206     AO 18 74                          24 50'F8=Beneficiario'
004400161206     A                                 24 70'F12=Ritorno'
004410131014      *---------------------------------------------------------------*
004420990610     A          R FI01T03
004430990610     A                                      CF12
004440990610     A                                      OVERLAY
004450990610     A            RSUT          20A  O  1  2
004460990610     A                                  1 28'** INTERROGAZIONE C.ANOMALIA **'
004470990610     A                                      DSPATR(RI)
004480990610     A                                      DSPATR(UL)
004490990610     A            VTCPGM        10A  O  1 61
004500990610     A                                  1 72DATE
004510990610     A                                      EDTCDE(Y)
004520990610     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004530990610     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004540990610     A                                  2 72TIME
004550990610     A                                  4  2'C.A.    :'
004560990610     A                                      DSPATR(UL)
004570990610     A                                      DSPATR(HI)
004580990610     A            VTCFIL         3S 0O  4 12DSPATR(HI)
004590990610     A            VTCNCA         7Y 0O  4 16EDTCDE(Z)
004600990610     A                                      DSPATR(HI)
004610990610     A                                  4 25'del'
004620990610     A                                      DSPATR(HI)
004630990610     A            VTCDC1         8Y 0O  4 29EDTCDE(8)
004640990610     A                                      DSPATR(HI)
004650990610     A                                  4 40'SPEDIZIONE:'
004660990610     A                                      DSPATR(UL)
004670990610     A                                      DSPATR(HI)
004680990610     A            VTCLNP         3S 0O  4 52DSPATR(HI)
004690990610     A            VTCNRS         2Y 0O  4 56EDTCDE(Z)
004700990610     A                                      DSPATR(HI)
004710990610     A            VTCNSP         7Y 0O  4 59EDTCDE(Z)
004720990610     A                                      DSPATR(HI)
004730990610     A                                  4 67'del'
004740990610     A                                      DSPATR(HI)
004750990610     A            VTCDSP         8Y 0O  4 71EDTCDE(8)
004760990610     A                                      DSPATR(HI)
004770990610     A                                  5  2'ANOMALIA:'
004780990610     A            VTCTAD         2A  O  5 12DSPATR(UL)
004790990610     A            VTDTAD        22A  O  5 16DSPATR(UL)
004800990610     A            VTDAGG        35A  O  5 40
004810990610     A  07                              6  2'EVENTO  :'
004820990610     A N07 71                           6  2'DENUNCIA:'
004830990610     A  07        VTCAAE         4Y 0O  6 12EDTCDE(Z)
004840990610     A N07 71     V1CAAD         4Y 0O  6 12EDTCDE(Z)
004850990610     A  07        VTCNEV         7Y 0O  6 17EDTCDE(Z)
004860990610     A N07 71     V1CPOD         3A  O  6 17
004870990610     A N07 71     V1CNDE         7Y 0O  6 21EDTCDE(Z)
004880990610     A  07                              6 25'del'
004890990610     A  07        VTCDEV         8Y 0O  6 29EDTWRD('  /  /    ')
004900990610     A N07 71     V1CDSB         8Y 0O  6 29EDTWRD('  /  /    ')
004910990610     A  71                              6 40'Inviata copia al cliente il..:'
004920990610     A  71        V1CDIC         8Y 0O  6 71EDTWRD('  /  /    ')
004930131014      *---------------------------------------------------------------*
004940990305     A          R FI01S03                   SFL
004950990305     A  22                                  SFLNXTCHG
004960990305     A            V1SFLS         3S 0O  9  3
004970990305     A  11                                  DSPATR(RI)
004980990305     A            V1SNSC         7Y 0O  9  7EDTCDE(Z)
004990990305     A  11                                  DSPATR(RI)
005000990305     A            V1SCAN         1A  O  9 17
005010990305     A            V1DCAN        25A  O  9 20
005020990305     A            V1SNCA         7Y 0O  9 72EDTCDE(Z)
005030990305     A            V1SAAC         4Y 0O  9 63EDTCDE(Z)
005040990305     A            V1SFIL         3A  O  9 68
005050990305     A            V1SDTC         8Y 0O  9 50EDTWRD('  /  /    ')
005060990305     A                                 10  3'Ritrovato il'
005070990305     A N65                                  DSPATR(ND)
005080990305     A            V1SFGS         3A  O 10 30DSPATR(HI)
005090990305     A N65                                  DSPATR(ND)
005100990305     A            V1SDFV         8Y 0O 10 16EDTWRD('  /  /    ')
005110990305     A                                      DSPATR(HI)
005120990305     A N65                                  DSPATR(ND)
005130990305     A                                 10 34'Pist.'
005140990305     A N65                                  DSPATR(ND)
005150990305     A            V1SNPS         2  0O 10 40
005160990305     A N65                                  DSPATR(ND)
005170990305     A                                 10 27'da'
005180990305     A N65                                  DSPATR(ND)
005190990305     A                                 10 43'Chiuso il'
005200990305     A N66                                  DSPATR(ND)
005210990305     A            V1SDCH         8  0O 10 53EDTWRD('  /  /    ')
005220990305     A                                      DSPATR(HI)
005230990305     A N66                                  DSPATR(ND)
005240990305     A            V1SCCH        14   O 10 65
005250990305     A N66                                  DSPATR(ND)
005260131014      *---------------------------------------------------------------*
005270990215     A          R FI01C03                   SFLCTL(FI01S03)
005280990215     A                                      CF12
005290990215     A                                      CF09
005300990215     A                                      OVERLAY
005310990215     A  20                                  SFLDSP
005320990215     A  21                                  SFLDSPCTL
005330990215     A N21                                  SFLCLR
005340990215     A  20                                  SFLEND
005350990215     A                                      SFLDROP(CF09)
005360990215     A                                      SFLSIZ(0008)
005370990215     A                                      SFLPAG(0007)
005380990215     A            V1CNRR         4S 0H      SFLRCDNBR
005390050928     A            V1CPOS         5S 0H
005400990215     A  28        V1CMSG        78   M
005410990215     A                                  8  2' Segnacollo       Anomalia        -
005420990215     A                                                   Dt.Consegna    Numero -
005430990215     A                                      C.A.     '
005440990215     A                                      DSPATR(UL)
005450990215     A                                      DSPATR(HI)
005460131014      *---------------------------------------------------------------*
005470080715     A          R FI01Z03
005480080715     A                                      OVERLAY
005490080715     A  75                             24  3'F5=Spunta senza Anomalia'
005500080715     A  67                             24 32'F9=Altri Dati'
005510080715     A                                 24 69'F12=Ritorno'
005520131014      *---------------------------------------------------------------*
005530981113     A          R FI01D03
005540981113     A                                      CF12
005550981113     A                                      OVERLAY
005560981113     A                                  9 13'(Non trovati segnacolli da visuali-
005570981113     A                                      zzare per questa C.A.)'
005580131014      *---------------------------------------------------------------*
005590020124     A          R FI01S04                   SFL
005600020124     A            V4SDFC         6Y 0O  9  2EDTWRD('  /  /  ')
005610020124     A            V4SHFC         4Y 0O  9 11EDTWRD('  :  ')
005620020124     A            V4SFCA         3S 0O  9 17DSPATR(HI)
005630020124     A            V4DFCA        38A  O  9 21
005640050928     A            V4SPFR         1   O  9 60
005650050928     A            V4SPTR         1A  O  9 63
005660020124     A            V4SFEV         3S 0O  9 66
005670020124     A            V4SPRU        10A  O  9 70
005680131014      *---------------------------------------------------------------*
005690020124     A          R FI01C04                   SFLCTL(FI01S04)
005700020124     A                                      SFLSIZ(0015)
005710020124     A                                      SFLPAG(0014)
005720020124     A                                      CF12
005730020124     A                                      OVERLAY
005740020124     A  40                                  SFLDSP
005750020124     A  41                                  SFLDSPCTL
005760020124     A N41                                  SFLCLR
005770020124     A  40                                  SFLEND
005780020124     A            V4CNRR         4S 0H      SFLRCDNBR
005790020124     A                                  8  2' Data  &  Ora |                   -
005800020124     A                                       FASE                  |F|M/D|P.O| -
005810020124     A                                      Utente   '
005820020124     A                                      DSPATR(UL)
005830020124     A                                      DSPATR(HI)
005840131014      *---------------------------------------------------------------*
005850050912     A          R FI01W02
005860050912     A                                      CF12
005870050912     A                                      OVERLAY
005880050912     A                                      WINDOW(5 1 12 68)
005890050912     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
005900050912     A                                          '))
005910050912     A  28        W2CMSG        65   M
005920050912     A                                  2  2'Ragione sociale :'
005930050912     A            W2CRAG        48A  O  2 20
005940050912     A                                  3  2'Indirizzo ......:'
005950050912     A            W2CVIA        30A  O  3 20
005960050912     A                                  4  2'C.A.P. .........:'
005970050912     A            W2CCAP         9A  O  4 20
005980050912     A                                  5  2'Località........:'
005990050912     A            W2CLOC        20A  O  5 20
006000050912     A                                  6  2'Provincia ......:'
006010050912     A            W2CPRV         2A  O  6 20
006020050912     A                                  7  2'Nazione ........:'
006030050912     A            W2CNAZ         3A  O  7 20
006040050912     A                                  8  2'Partita IVA ....:'
006050050912     A            W2CIVA        14A  O  8 20
006060050912     A            W2CIVE         2A  O  8 35
006070050912     A                                  9  2'Numero Telefono.:'
006080050912     A            W2CTEL        16A  O  9 20
006090050912     A                                 10  2'Numero Fax......:'
006100050912     A            W2CFAX        16A  O 10 20
006110050912     A                                 11 57'F12=Ritorno'
006120131014      *---------------------------------------------------------------*
006130981201     A          R FI01S05                   SFL
006140981201     A            V5SDRZ         8Y 0O  9  4EDTWRD('  /  /    ')
006150981201     A                                      DSPATR(HI)
006160981201     A            V5SCDD         2A  O  9 17
006170981201     A            V5SDOC        60A  O  9 20
006180981201     A                                 10 20'NUM/DTA DOC'
006190981201     A N10                                  DSPATR(ND)
006200981201     A            V5SNDC         7Y 0O 10 32
006210981201     A N10                                  DSPATR(ND)
006220981201     A                                      EDTCDE(Z)
006230981201     A                                      DSPATR(UL)
006240981201     A                                      DSPATR(HI)
006250981201     A            V5SDDC         8Y 0O 10 40EDTWRD('  /  /    ')
006260981201     A N10                                  DSPATR(ND)
006270981201     A                                      DSPATR(UL)
006280981201     A                                      DSPATR(HI)
006290981201     A                                 10 51'IMPORTO'
006300981201     A N10                                  DSPATR(ND)
006310981201     A            V5SIPR        15Y 3O 10 59EDTWRD('            ,   ')
006320981201     A N10                                  DSPATR(ND)
006330981201     A                                      DSPATR(UL)
006340981201     A                                      DSPATR(HI)
006350981201     A            V5SVPR         3A  O 10 76
006360981201     A N10                                  DSPATR(ND)
006370131014      *---------------------------------------------------------------*
006380990129     A          R FI01C05                   SFLCTL(FI01S05)
006390990129     A                                      CF12
006400990129     A                                      OVERLAY
006410990129     A  50                                  SFLDSP
006420990129     A  51                                  SFLDSPCTL
006430990129     A N51                                  SFLCLR
006440990129     A  50                                  SFLEND
006450990129     A                                      SFLSIZ(0008)
006460990129     A                                      SFLPAG(0007)
006470990129     A            V5CNRR         4S 0H      SFLRCDNBR
006480990129     A  11                              6  2'Ultimo Sollecito'
006490990129     A                                      DSPATR(HI)
006500990129     A  11        V5CULS         8Y 0O  6 20EDTWRD('  /  /    ')
006510050928     A                                  8  2' Ricevimento  |           D O C U -
006520050928     A                                      M E N T O                          -
006530050928     A                                              '
006540050928     A                                      DSPATR(UL)
006550050928     A                                      DSPATR(HI)
006560131014      *---------------------------------------------------------------*
006570990216     A          R FI01T05
006580990216     A                                      CF12
006590990216     A                                      OVERLAY
006600990216     A            RSUT          20A  O  1  2
006610990216     A                                  1 28'** INTERROGAZIONE C.ANOMALIA **'
006620990216     A                                      DSPATR(RI)
006630990216     A                                      DSPATR(UL)
006640990216     A            VTCPGM        10A  O  1 61
006650990216     A                                  1 72DATE
006660990216     A                                      EDTCDE(Y)
006670990216     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
006680990216     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
006690990216     A                                  2 72TIME
006700990216     A                                  4  2'C.A.    :'
006710990216     A                                      DSPATR(UL)
006720990216     A                                      DSPATR(HI)
006730990216     A            VTCFIL         3S 0O  4 12DSPATR(HI)
006740990216     A            VTCNCA         7Y 0O  4 16EDTCDE(Z)
006750990216     A                                      DSPATR(HI)
006760990216     A                                  4 25'del'
006770990216     A                                      DSPATR(HI)
006780990216     A            VTCDC1         8Y 0O  4 29EDTCDE(8)
006790990216     A                                      DSPATR(HI)
006800990216     A                                  4 40'SPEDIZIONE:'
006810990216     A                                      DSPATR(UL)
006820990216     A                                      DSPATR(HI)
006830990216     A            VTCLNP         3S 0O  4 52DSPATR(HI)
006840990216     A            VTCNRS         2Y 0O  4 56EDTCDE(Z)
006850990216     A                                      DSPATR(HI)
006860990216     A            VTCNSP         7Y 0O  4 59EDTCDE(Z)
006870990216     A                                      DSPATR(HI)
006880990216     A                                  4 67'del'
006890990216     A                                      DSPATR(HI)
006900990216     A            VTCDSP         8Y 0O  4 71EDTCDE(8)
006910990216     A                                      DSPATR(HI)
006920131014      *---------------------------------------------------------------*
006930090324     A          R FI01S06                   SFL
006940090324     A            V6SNSC         7Y 0O  9  2EDTCDE(Z)
006950090324     A            V6SPER         5Y 2O  9 10EDTCDE(2)
006960090324     A            V6SPOR         3A  O  9 17DSPATR(UL)
006970090324     A  69                                  DSPATR(ND)
006980090324     A                                      DSPATR(HI)
006990090324     A            V6SDPO        20A  O  9 21
007000090324     A  69                                  DSPATR(ND)
007010090324     A                                      DSPATR(HI)
007020090324     A            V6STCR        15A  O  9 42
007030090324     A  69                                  DSPATR(ND)
007040090324     A                                 10 12'Term'
007050090324     A N01                                  DSPATR(ND)
007060090324     A            V6STER         3   O 10 17
007070090324     A N01                                  DSPATR(ND)
007080090324     A            V6SDTER       10   O 10 21
007090090324     A N01                                  DSPATR(ND)
007100090324     A            V6STRE         4A  O 10 35
007110090324     A                                 10 40'-'
007120090324     A            V6SDTR        35A  O 10 42
007130131014     A*---------------------------------------------------------------*
007140170228     A          R FI01C06                   SFLCTL(FI01S06)
007150170228     A*%%TS  SD  20170228  121035  EDPES       REL-V7R2M0  5770-WDS
007160170228     A                                      SFLSIZ(0010)
007170170228     A                                      SFLPAG(0007)
007180170228     A                                      CF12
007190170228     A  75                                  CF05
007200170228     A                                      OVERLAY
007210170228     A                                      SFLCSRRRN(&V6CPOS)
007220170228     A  60                                  SFLDSP
007230170228     A  61                                  SFLDSPCTL
007240170228     A N61                                  SFLCLR
007250170228     A  60                                  SFLEND
007260170228     A            V6CNRR         4S 0H      SFLRCDNBR(CURSOR)
007270170228     A            V6CPOS         5S 0H
007280170228     A  28        V6CMSG        78   M
007290170228     A                                  6  2'CALCOLO RESPONSABILITA'' DANNO ...-
007300170228     A                                      ..:'
007310170228     A  62                              6 39'Manuale'
007320170228     A                                      DSPATR(HI)
007330170228     A                                      DSPATR(UL)
007340170228     A  63                              6 39'Automatico'
007350170228     A                                      DSPATR(HI)
007360170228     A                                      DSPATR(UL)
007370170228     A  64                              6 39'In Attesa di ricalcolo'
007380170228     A                                      DSPATR(HI)
007390170228     A                                      DSPATR(UL)
007400170228     A            V6CDES        25   O  6 54COLOR(BLU)
007410170228     A  68                              7 12'La responsabilità non viene consid-
007420170228     A                                      erata dalla reportistica'
007430170228     A                                      DSPATR(RI)
007440170228     A                                      DSPATR(BL)
007450170228     A                                  8  2' Colli         Punto Operativo Res-
007460170228     A                                      ponsabile                          -
007470170228     A                                              '
007480170228     A                                      DSPATR(UL)
007490131014      *---------------------------------------------------------------*
007500081218     A          R FI01W06
007510081218     A                                      ALTNAME('y')
007520081218     A                                      WINDOW(14 22 8 54 *NOMSGLIN)
007530081218     A                                      CF12
007540081218     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
007550081218     A                                       (*CHAR '        '))
007560081218     A                                  1  1'Segnacollo'
007570081218     A            W06LNP         3S 0O  1 13DSPATR(HI)
007580081218     A                                  1 17'-'
007590081218     A            W06LNA         3S 0O  1 19DSPATR(HI)
007600081218     A            W06NRS         2Y 0O  1 24DSPATR(HI)
007610081218     A                                      EDTCDE(Z)
007620081218     A            W06NSC         7Y 0O  1 28DSPATR(HI)
007630081218     A                                      EDTCDE(Z)
007640081218     A N48                              2 13'Foglio'
007650081218     A            W06NPG         1S 0O  2 21DSPATR(UL)
007660081218     A            W06FGS         3S 0O  2 23DSPATR(UL)
007670081218     A            W06NFV         6Y 0O  2 29DSPATR(UL)
007680081218     A                                      EDTCDE(Z)
007690081218     A                                  2 37'del'
007700081218     A N48        W06DFV         8Y 0O  2 41EDTCDE(8)
007710081218     A                                  3  9'Spunta senza Anomalia |Spunta con -
007720081218     A                                      Anomalia'
007730081218     A                                      DSPATR(UL)
007740081218     A                                      DSPATR(HI)
007750081218     A            W06CAN         3A  O  3 52DSPATR(UL)
007760081218     A                                      DSPATR(HI)
007770081218     A                                  4  1'Imm/Var'
007780081218     A            W06DFS         8Y 0O  4 10EDTCDE(8)
007790081218     A            W06HMS         6Y 0O  4 22EDTWRD('0 :  :  ')
007800081218     A                                  4 31'|'
007810081218     A            W06CDFS        8Y 0O  4 33EDTCDE(8)
007820081218     A            W06CHMS        6Y 0O  4 45EDTWRD('0 :  :  ')
007830081218     A                                  5  1'Caricam'
007840081218     A            W06DCS         8Y 0O  5 10EDTCDE(8)
007850081218     A            W06HCS         6Y 0O  5 22EDTWRD('0 :  :  ')
007860081218     A                                  5 31'|'
007870081218     A            W06CDCS        8Y 0O  5 33EDTCDE(8)
007880081218     A            W06CHCS        6Y 0O  5 45EDTWRD('0 :  :  ')
007890081218     A                                  6  1'Pistola'
007900081218     A            W06NPS         2A  O  6 10DSPATR(UL)
007910081218     A                                      DSPATR(HI)
007920081218     A            W06TAP        11A  O  6 14
007930081218     A                                  6 31'|'
007940081218     A            W06CNPS        2A  O  6 33DSPATR(UL)
007950081218     A                                      DSPATR(HI)
007960081218     A            W06CTAP       11A  O  6 36
007970081218     A                                  8 42'F12=Ritorno'
007980081218     A                                      DSPATR(HI)
007990131014      *---------------------------------------------------------------*
008000120515     A          R FI01W22
008010131014     A                                      WINDOW(9 44 7 32 *NOMSGLIN)
008020120515     A                                      CF12
008030120515     A                                      WDWBORDER((*COLOR BLU) (*DSPATR RI)-
008040120515     A                                       (*CHAR '        '))
008050131014     A                                  1  8'Recupero da A.I.G.'
008060120515     A                                      DSPATR(UL)
008070120515     A                                      DSPATR(HI)
008080120515     A N48                              3  1'Data richiesta    '
008090120515     A N48        W22DRR         8Y 0O  3 23EDTCDE(8)
008100120515     A                                      DSPATR(UL)
008110120515     A N48                              4  1'Data ricezione    '
008120120515     A N48        W22DVR         8Y 0O  4 23EDTCDE(8)
008130120515     A                                      DSPATR(UL)
008140120515     A  48                              4 11'E S C L U S A'
008150120515     A                                      DSPATR(HI)
008160120515     A                                      DSPATR(RI)
008170120515     A                                      DSPATR(BL)
008180120515     A N48                              5  1'Importo Recuperato'
008190120515     A N48        W22IRI        10Y 3O  5 21EDTWRD('    .   ,   ')
008200120515     A                                      DSPATR(UL)
008210131014     A                                  7 22'F12=Ritorno'
008220120515     A                                      DSPATR(HI)
