000100050202             pgm
000200050202
000300050209    /* Ripulisco il file --------------------------------------------*/
000400111021             clrpfm     file(WFEEX00F)
000500050202
000600050202    /* Richiamo il pgm. per impostare i dati nel wrkf ---------------*/
000700111021             call       pgm(FIDN82R)
000800050202
000900050202             endpgm
