000100050726      *** FIDN89D *-------------------------------------------------***
000200051025      *   Gestione recupero C.A. affidate ad A.I.G.                   *
000300050713      ***-----------------------------------------------------------***
000400050914     A                                      REF(CNDIZION)
000500050713     A                                      DSPSIZ(24 80 *DS3)
000600050713     A                                      CHGINPDFT(HI UL)
000700050713     A                                      PRINT
000800050713     A                                      CA03
000900050713      *---------------------------------------------------------------*
001000050726     A          R FI89T01
001100050713     A                                      TEXT('Testata')
001200050713     A            RSUT          20A  O  1  2
001300051025     A                                  1 27'* GESTIONE RECUPERO C.A. -
001400051007     A                                      *'
001500050713     A                                      DSPATR(RI)
001600050713     A                                      DSPATR(UL)
001700050914     A            V1TPGM    R        O  1 59REFFLD($PGM)
001800050713     A                                  1 70DATE(*YY)
001900050713     A                                      EDTCDE(Y)
002000050713     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
002100050713     A                                   + 1USER
002200050713     A                                  2 70TIME
002300050713      *---------------------------------------------------------------*
002400050726     A          R FI89D01
002500050713     A                                      TEXT('Parametri')
002600050725      *
002700050915     A                                      CF14
002800050713     A                                      OVERLAY
002900050915      *
003000050713     A  28        V1DMSG        78   M
003100050713      *
003200050914     A                                  7  2'Comunicazione Anomalia ....:'
003300050914     A                                   + 2'P.O.'
003400050914     A            V1CFIL    R     Y  B   + 2
003500050914     A                                      REFFLD(DRAFIL FNDRA00F)
003600050727     A                                      EDTCDE(Z)
003700050725     A                                      CHECK(RZ)
003800050728     A  51                                  DSPATR(PC)
003900050914     A                                   + 2'Numero'
004000050914     A            V1CNCA    R     Y  B   + 2
004100050914     A                                      REFFLD(DRANCA FNDRA00F)
004200050725     A                                      EDTCDE(Z)
004300050914     A                                      CHECK(RB)
004400050728     A  52                                  DSPATR(PC)
004500050914     A                                   + 2'Anno'
004600050914     A            V1CAAC    R     Y  B   + 2
004700050914     A                                      REFFLD(DRAAAC FNDRA00F)
004800050725     A                                      EDTCDE(Z)
004900050725     A                                      CHECK(RB)
005000050728     A  53                                  DSPATR(PC)
005100050725      *---------------------------------------------------------------*
005200050726     A          R FI89D02
005300051025     A                                      TEXT('Gest. recupero singo-
005400050726     A                                      la C.A. affidata ad AIG')
005500050725     A                                      CF06
005600050725     A                                      CA12
005700050802     A                                      CF14
005800050725      *
005900050725     A                                      OVERLAY
006000050725     A  28        V1DMSG        78   M
006100050914      *
006200050915     A                                  4  2'C.A. .....:'
006300050914     A                                      DSPATR(UL)
006400050915     A            V2CFIL    R     S  O   + 1REFFLD(DRAFIL  FNDRA00F)
006500050914     A                                      DSPATR(HI)
006600050915     A            V2CNCA    R     Y  O   + 1REFFLD(DRANCA  FNDRA00F)
006700050914     A                                      EDTCDE(Z)
006800050914     A                                      DSPATR(HI)
006900050915     A                                   + 4'del'
007000050915     A            V2CDCA    R     Y  O   + 1REFFLD($DA8)
007100050914     A                                      TEXT('Data Apertura C.A.')
007200050914     A                                      EDTCDE(8)
007300050914     A                                      DSPATR(HI)
007400050915     A                                   + 1'ANOMALIA:'
007500050914     A                                      DSPATR(UL)
007600050915     A            V2CTAD    R        O   + 1REFFLD($TAD)
007700050914     A                                      DSPATR(HI)
007800050915     A            V2DTAD        23A  O   + 1TEXT('Decod. Tipo Anomalia')
007900050914     A                                      DSPATR(HI)
008000050915     A                                  5  2'SPEDIZIONE:'
008100050914     A                                      DSPATR(UL)
008200050915     A            V2CLNP    R     S  O   + 1REFFLD($LNP)
008300050914     A                                      DSPATR(HI)
008400050915     A            V2CNRS    R     Y  O   + 1REFFLD($NRS)
008500050914     A                                      EDTCDE(Z)
008600050914     A                                      DSPATR(HI)
008700050915     A            V2CNSP    R     Y  O   + 1REFFLD($NSP)
008800050914     A                                      EDTCDE(Z)
008900050914     A                                      DSPATR(HI)
009000050914     A                                   + 1'del'
009100050915     A            V2CDSP    R     Y  O   + 1REFFLD($DA8)
009200050914     A                                      TEXT('Data Spedizione')
009300050914     A                                      EDTCDE(8)
009400050914     A                                      DSPATR(HI)
009500050915     A     42                            + 1'PRATICA :'
009600050914     A                                      DSPATR(UL)
009700050915     A     42     V2CPRN    R     Y  O   + 1REFFLD($PRN)
009800050914     A                                      DSPATR(HI)
009900050914     A                                      EDTCDE(Z)
010000050914     A     42                            + 1'del'
010100050915     A     42     V2CPRA    R     Y  O   + 1REFFLD(DCTPRA  FNDCT00F)
010200050914     A                                      DSPATR(HI)
010300050914     A                                      EDTCDE(Z)
010400050915     A  41                              6  2'EVENTO ...:'
010500050914     A                                      DSPATR(UL)
010600050915     A  41        V2CAAE    R     S  O   + 1REFFLD(DCTAAE  FNDCT00F)
010700050914     A                                      DSPATR(HI)
010800050915     A  41        V2CNEV    R     Y  O   + 1REFFLD(DCTNEV  FNDCT00F)
010900050914     A                                      EDTCDE(Z)
011000050914     A                                      DSPATR(HI)
011100050915     A  41                               + 3'del'
011200050915     A  41        V2CDEV    R     Y  O   + 1REFFLD($DA8)
011300050914     A                                      TEXT('Data Evento')
011400050914     A                                      EDTCDE(8)
011500050914     A                                      DSPATR(HI)
011600050915     A  41        V2DTAE        25A  O   + 1DSPATR(HI)
011700050914      *
011800050914     A                                  7  2'--------------------------
011900050914     A                                      ---------------------------
012000050914     A                                      ---------------------------'
012100050914     A                                  8  2'Beneficiario:'
012200050915     A            V2CKSC    R     S  O   + 1
012300050915     A                                      REFFLD($KSC)
012400050915     A            V2CRSC    R        O  8 26
012500050915     A                                      REFFLD($RAGSOC)
012600050915     A            V2CCAP    R        O  9 26
012700050915     A                                      REFFLD($CAD)
012800050915     A            V2CLOC    R        O   + 1
012900050915     A                                      REFFLD($LOC)
013000050915     A            V2CPRV    R        O   + 2
013100050915     A                                      REFFLD($PRO)
013200050915     A            V2CNAZ    R        O   + 2
013300050915     A                                      REFFLD($NAZ)
013400050914     A                                 10  2'--------------------------
013500050914     A                                      ---------------------------
013600050914     A                                      ---------------------------'
013700050914      *
013800050914     A                                 12  2'Importo liquidato .......:'
013900050915     A            V2CIPL    R   10  2O   + 1
014000050802     A                                      REFFLD(DCLIPL  FNDCL00F)
014100050802     A                                      EDTCDE(1)
014200050802     A                                      DSPATR(HI)
014300050915     A            V2CVPL    R        O   + 1
014400050802     A                                      REFFLD(DCLVPL  FNDCL00F)
014500050802     A                                      DSPATR(HI)
014600050726      *
014700051025     A                                 14  2'Data richiesta Recupero .:'
014800050915     A            V2CDRR    R        B   + 1
014900050914     A                                      REFFLD(DRADVR  FNDRA00F)
015000050726     A                                      EDTWRD('  /  /    ')
015100050802     A  49                                  DSPATR(PR)
015200050802     A  50                                  DSPATR(PC)
015300050725      *
015400051025     A                                 17  2'Data ricezione Recupero .:'
015500050915     A            V2CDVR    R        B   + 1
015600050914     A                                      REFFLD(DRADVR  FNDRA00F)
015700050725     A                                      EDTWRD('  /  /    ')
015800050725     A                                      CHECK(RB)
015900050728     A  51                                  DSPATR(PC)
016000051025     A                                 19  2'Importo Recuperato ......:'
016100050915     A            V2CIRI    R   10  2B   + 1
016200050914     A                                      REFFLD(DRAIRI  FNDRA00F)
016300050728     A                                      EDTCDE(2)
016400050725     A                                      CHECK(RB)
016500050728     A  52                                  DSPATR(PC)
016600050915     A            V2CDIR    R        O   + 2
016700050914     A                                      REFFLD(DRADIR  FNDRA00F)
016800050725     A                                      DSPATR(HI)
016900050713      *---------------------------------------------------------------*
017000050726     A          R FI89Z01
017100050713     A                                      TEXT('Elenco tasti funzion-
017200050713     A                                      ali abilitati alla videata-
017300050726     A                                       D01')
017400050713     A                                      OVERLAY
017500050713     A                                 24  2'F3=Fine'
017600050713     A                                      COLOR(BLU)
017700050916     A                                   + 3'F14=Interr.C.A.'
017800050915     A                                      COLOR(BLU)
017900050725      *---------------------------------------------------------------*
018000050726     A          R FI89Z02
018100050725     A                                      TEXT('Elenco tasti funzion-
018200050726     A                                      ali abilitati al fmt D02')
018300050725     A                                      OVERLAY
018400050914     A N40                             24  2'F3=Fine'
018500050725     A                                      COLOR(BLU)
018600050725     A                                   + 3'F6=Conferma'
018700050725     A                                      COLOR(BLU)
018800050725     A                                   + 3'F12=Ritorno'
018900050725     A                                      COLOR(BLU)
019000050916     A                                   + 3'F14=Interr.C.A.'
019100050802     A                                      COLOR(BLU)
