000100980622      *--------------------------------------------------------------*
000200991207      *  DS PER PGM CONTROLLO C.A. ATTIVE IN SEDE PER LA STESSA SPEDIZIONE
000300980622      *--------------------------------------------------------------*
000400971021     A                                      REF(CNDIZION)
000500991207     A          R D58REC                    TEXT('DS CONTROLLO CONSEGNA COLLI')
000600980622      *********************************
000700980622      * C A M P  I   D I    I N P U T
000800980622      *********************************
000900990217      * KEY SPEDIZIONE
001000991207     A            I58AAS    R     S         REFFLD($AAA)
001100991207     A            I58LNP    R     S         REFFLD($FIL)
001200991207     A            I58NRS    R     S         REFFLD($NRS)
001300991207     A            I58NSP    R               REFFLD($NSP)
001400050222     A            I58SED         1          TEXT('S=RICHIAMATO DA SEDE')
001500061211     A            O58FDA         1          TEXT('S=TROVATA C.A.')
