000100040108      *--------------------------------------------------------------*
000200040213      * PARAMETRI RITORNO DATI DA INTERROGAZIONI OGGETTI RECLAMI     *
000300040108      *--------------------------------------------------------------*
000400040205     A                                      REF(FITGD00F)
000500040203     A          R DA1REC                    TEXT('DS PER INTERROGAZIO -
000600040203     A                                      NE OGGETTO RECLAMO')
000700040108      *
000800040108      ****************************************************************
000900040130      * C A M P I   D I   I N P U T
001000040108      ****************************************************************
001100040203      *
001200040308     A            IA1INS         1A         TEXT('FLAG INSERIMENTO S/N -
001300040308     A                                      I = INTERROGAZIONE')
001400040421      *                       ANNO   RECLAMO
001500040421     A            IA1ANT    R               REFFLD(TGDANT)
001600040205      *                       NUMERO RECLAMO
001700040205     A            IA1NUT    R               REFFLD(TGDNUT)
001800040205      *                       PROGRESSIVO RECLAMO
001900040205     A            IA1PDT    R               REFFLD(TGDPDT)
002000040205      *                       TIPO CHIAVE (S=SPEDIZIONE /O=ORM)
002100040205     A            IA1TOR    R               REFFLD(TGDTOR)
002200040205      *                       CHIAVE
002300040205     A            IA1OGG    R               REFFLD(TGDOGG)
002400040203      *
