000100070515     A*%%***********************************************************************
000200070515     A*%%TS  RD  20070515  121110  EDPGA       REL-V5R3M0  5722-WDS
000300070515     A*%%FI+10660100000000000000000000000000000000000000000000000000
000400070515     A*%%FI       0000000000000000000000000000000000000000000000000
000500070515     A*%%***********************************************************************
000600070515     A*PARMS PAGESIZE(66 124) CPI(16,7) OVRFLW(61) SAVE(*YES)
000700070515     A*PARMS USRDTA('A_Mancanze') FORMTYPE(DENUNCIA)
000800070515     A*PARMS DECFMT(*JOB)
000900070515      *****************************************************************
001000070515      *
001100070515      *  STAMPA AUTODICHIARAZIONE PER MANCANZE
001200070515      *
001300070515      *  Compilare con: PAGESIZE(66 124) CPI(16,7) OVRFLW(61)
001400070515      *                 SAVE(*YES) USRDTA('A_Mancanze')
001500070515      *                 FORMTYPE(DENUNCIA)
001600070515      *
001700070515      *****************************************************************
001800070515      *====================================*
001900070515     A          R DN37P3I
002000070515     A*%%***********************************************************************
002100070515     A*%%RI 00000
002200070515     A*%%FS 013
002300070515     A*%%***********************************************************************
002400070515      *====================================*
002500070515     A                                      SKIPB(014)
002600070515     A*%%***********************************************************************
002700070515     A*%%SS
002800070515     A*%%***********************************************************************
002900070515      *====================================*
003000070515     A          R DN37P3T
003100070515     A*%%***********************************************************************
003200070515     A*%%RI 00000
003300070515     A*%%***********************************************************************
003400070515     A                                      TEXT('Testo in Italiano')
003500070515      *====================================*
003600070515     A                                      SPACEB(001)
003700070515     A                                    58
003800070515     A                                      'Spett.le'
003900070515      *
004000070515     A            P1TRSB    R             58
004100070515     A                                      REFFLD(SPERAG FNSPE00F)
004200070515     A                                      SPACEB(001)
004300070515      *
004400070515     A            P1TINB    R             58
004500070515     A                                      REFFLD(SPEIND FNSPE00F)
004600070515     A                                      SPACEB(001)
004700070515      *
004800070515     A            P1TCAB    R             48
004900070515     A                                      REFFLD(SPECAP FNSPE00F)
005000070515     A                                      SPACEB(001)
005100070515     A            P1TLOB    R             +1
005200070515     A                                      REFFLD(SPELOC FNSPE00F)
005300070515     A            P1TPRB    R             +1
005400070515     A                                      REFFLD(SPENAZ FNSPE00F)
005500070515      *
005600070515     A            P1TLOC1   R  +15        10
005700070515     A                                      REFFLD(§DADAULO DDAD)
005800070515     A                                      SPACEB(002)
005900070515      *------------------------------------*
006000070515     A                                    10
006100070515     A                                      'C.A. nr.'
006200070515     A                                      SPACEB(002)
006300070515     A                                      HIGHLIGHT
006400070515     A            P1TNCA        11A       +1
006500070515     A                                      HIGHLIGHT
006600070515     A                                    +1
006700070515     A                                      'del'
006800070515     A                                      HIGHLIGHT
006900070515     A            P1TDCA    R             +1
007000070515     A                                      REFFLD($DA8     CNDIZION)
007100070515     A                                      EDTCDE(Y)
007200070515     A                                      HIGHLIGHT
007300070515      *------------------------------------*
007400070515     A                                    10
007500070515     A                                      'DICHIARAZIONE DI SMARRIMENTO DELLA-
007600070515     A                                       SPEDIZIONE N°'
007700070515     A                                      SPACEB(003)
007800070515     A                                      HIGHLIGHT
007900070515     A            P1TLNP    R             +1
008000070515     A                                      REFFLD(DCTLNP   FNDCT00F)
008100070515     A                                      HIGHLIGHT
008200070515     A            P1TNRS    R             +1
008300070515     A                                      REFFLD(DCTNRS   FNDCT00F)
008400070515     A                                      EDTCDE(Z)
008500070515     A                                      HIGHLIGHT
008600070515     A            P1TNSP    R             +1
008700070515     A                                      REFFLD(DCTNSP   FNDCT00F)
008800070515     A                                      EDTCDE(Z)
008900070515     A                                      HIGHLIGHT
009000070515     A                                    +1
009100070515     A                                      'DEL'
009200070515     A                                      HIGHLIGHT
009300070515     A            P1TDSP    R             +1
009400070515     A                                      REFFLD($DA8     CNDIZION)
009500070515     A                                      EDTCDE(Y)
009600070515     A                                      HIGHLIGHT
009700070515      *
009800070515     A                                    10
009900070515     A                                      'FORMATA DI N.'
010000070515     A                                      SPACEB(001)
010100070515     A                                      HIGHLIGHT
010200070515     A            P1TNCL    R             +1
010300070515     A                                      REFFLD(ARBNCL   FNARB00F)
010400070515     A                                      EDTCDE(Z)
010500070515     A                                      HIGHLIGHT
010600070515     A                                    +1
010700070515     A                                      'COLLI PER COMPLESSIVI KG'
010800070515     A                                      HIGHLIGHT
010900070515     A            P1TPKF    R             +1
011000070515     A                                      REFFLD(ARBPKF   FNARB00F)
011100070515     A                                      EDTCDE(3)
011200070515     A                                      HIGHLIGHT
011300070515      *
011400070515     A                                    10
011500070515     A                                      'VOSTRO RIFERIMENTO:'
011600070515     A                                      SPACEB(001)
011700070515     A                                      HIGHLIGHT
011800070515     A            P1TRMN    R             +1
011900070515     A                                      REFFLD(ARBRMN   FNARB00F)
012000070515     A                                      EDTCDE(Z)
012100070515     A                                      HIGHLIGHT
012200070515     A                                   +10
012300070515     A                                      'DESTINATARIO:'
012400070515     A                                      HIGHLIGHT
012500070515     A            P1TRSD    R             +1
012600070515     A                                      REFFLD(ARBRSD   FNARB00F)
012700070515     A                                      HIGHLIGHT
012800070515      *
012900070515     A                                    10
013000070515     A                                      'Gentile Cliente,'
013100070515     A                                      SPACEB(002)
013200070515      *------------------------------------*
013300070515     A                                    10
013400070515     A                                      'facciamo seguito alla nostra Comun-
013500070515     A                                      icazione di Presunta Anomalia nr.'
013600070515     A                                      SPACEB(001)
013700070515     A            P1TNCA2       11        +2
013800070515     A                                    +2
013900070515     A                                      'Anno'
014000070515     A            P1TAAC    R             +1
014100070515     A                                      REFFLD(DCTAAC   FNDCT00F)
014200070515     A                                      EDTCDE(Z)
014300070515     A                                    +1
014400070515     A                                      'del'
014500070515     A                                    10
014600070515     A                                      'giorno'
014700070515     A                                      SPACEB(001)
014800070515     A            P1TMGC    R             +1
014900070515     A                                      REFFLD(DCTMGC   FNDCT00F)
015000070515     A                                      EDTWRD('  /  ')
015100070515      *
015200070515     A                                    +1
015300070515     A                                      'e, consapevoli delle responsabilit-
015400070515     A                                      a'' che assumiamo a tutti gli effet-
015500070515     A                                      ti di legge,'
015600070515      *
015700070515     A                                    10
015800070515     A                                      'dichiariamo che la spedizione in o-
015900070515     A                                      ggetto non risulta essere stata ril-
016000070515     A                                      evata elettronicamente ad'
016100070515     A                                      SPACEB(001)
016200070515      *
016300070515     A                                    10
016400070515     A                                      'uno dei controlli effettuati dal n-
016500070515     A                                      ostro sistema di tracciabilita''(tr-
016600070515     A                                      ack & tracing) per nr.'
016700070515     A                                      SPACEB(001)
016800070515     A            P1TNCN2   R             +1
016900070515     A                                      REFFLD(DCTNCN   FNDCT00F)
017000070515     A                                      EDTCDE(Z)
017100070515     A                                    10
017200070515     A                                      'collo/i e per un peso complessivo -
017300070515     A                                      di KG.'
017400070515     A                                      SPACEB(001)
017500070515     A            P1TPKD2   R             +1
017600070515     A                                      REFFLD(DCTPKD   FNDCT00F)
017700070515     A                                      EDTCDE(3)
017800070515     ***A                                   + 0'.'
017900070515      *
018000070515      *------------------------------------*
018100070515      *
018200070515     A  44                                10
018300070515     A                                      'Descrizione:'
018400070515     A                                      SPACEB(002)
018500070515     A                                      HIGHLIGHT
018600070515     A*%%***********************************************************************
018700070515     A*%%SS
018800070515     A*%%CL 001
018900070515     A*%%CL 001
019000070515     A*%%CL 001
019100070515     A*%%CL 002
019200070515     A*%%CL 002
019300070515     A*%%CL 003
019400070515     A*%%CL 001
019500070515     A*%%CL 001
019600070515     A*%%CL 002
019700070515     A*%%CL 001
019800070515     A*%%CL 001
019900070515     A*%%CL 001
020000070515     A*%%CL 001
020100070515     A*%%CL 001
020200070515     A*%%CL 002
020300070515     A*%%***********************************************************************
020400070515      *------------------------------------*
020500070515     A          R DN37P3N
020600070515     A*%%***********************************************************************
020700070515     A*%%RI 00000
020800070515     A*%%***********************************************************************
020900070515      *------------------------------------*
021000070515     A                                      SPACEB(001)
021100070515     A            P1TPDD1   R             10
021200070515     A                                      REFFLD(DCSNOT   FNDCS00F)
021300070515     A                                      HIGHLIGHT
021400070515     A            P1TPDD2   R             +0
021500070515     A                                      REFFLD(DCSNOT   FNDCS00F)
021600070515     A                                      HIGHLIGHT
021700070515     A            P1TPDD3   R             +0
021800070515     A                                      REFFLD(DCSNOT   FNDCS00F)
021900070515     A                                      HIGHLIGHT
022000070515     A*%%***********************************************************************
022100070515     A*%%SS
022200070515     A*%%***********************************************************************
022300070515      *------------------------------------*
022400070515     A          R DN37P3F
022500070515     A*%%***********************************************************************
022600070515     A*%%RI 00000
022700070515     A*%%***********************************************************************
022800070515     A                                    10
022900070515     A                                      'La stessa e'' purtroppo da ritener-
023000070515     A                                      si smarrita per cause di natura for-
023100070515     A                                      tuita.'
023200070515     A                                      SPACEB(002)
023300070515     A                                    10
023400070515     A                                      'Spiacenti per l''inconveniente, ri-
023500070515     A                                      maniamo a disposizione per qualsias-
023600070515     A                                      i ulteriore chiarimento.       '
023700070515     A                                      SPACEB(002)
023800070515     A                                    10
023900070515     A                                      'Distinti saluti.                  -
024000070515     A                                          '
024100070515     A                                      SPACEB(001)
024200070515      *------------------------------------*
024300070515     A                                    60
024400110505     A                                      'BRT S.p.A.'
024500070515     A                                      SPACEB(002)
024600070515     A                                      HIGHLIGHT
024700070515      *
024800070515     A                                    60
024900070515     A                                      'Filiale di'
025000070515     A                                      SPACEB(001)
025100070515     A                                      HIGHLIGHT
025200070515     A            P1TPOF    R             +1
025300070515     A                                      REFFLD(ORGDES   AZORG00F)
025400070515     A                                      HIGHLIGHT
025500070515     A*%%***********************************************************************
025600070515     A*%%SS
025700070515     A*%%CL 001
025800070515     A*%%CL+001
025900070515     A*%%CL                         a.
026000070515     A*%%CL 002
026100070515     A*%%CL 001
026200070515     A*%%CL 002
026300070515     A*%%CL 001
026400070515     A*%%***********************************************************************
026500070515      *====================================*
026600070515     A          R DN37P3T2
026700070515     A*%%***********************************************************************
026800070515     A*%%RI 00000
026900070515     A*%%***********************************************************************
027000070515     A                                      TEXT('Testo in Inglese')
027100070515      *====================================*
027200070515     A                                      SPACEB(001)
027300070515     A                                    58
027400070515     A                                      'Messrs.'
027500070515      *
027600070515     A            P1TRSB    R             58
027700070515     A                                      REFFLD(SPERAG FNSPE00F)
027800070515     A                                      SPACEB(001)
027900070515      *
028000070515     A            P1TINB    R             58
028100070515     A                                      REFFLD(SPEIND FNSPE00F)
028200070515     A                                      SPACEB(001)
028300070515      *
028400070515     A            P1TCAB    R             48
028500070515     A                                      REFFLD(SPECAP FNSPE00F)
028600070515     A                                      SPACEB(001)
028700070515     A            P1TLOB    R             +1
028800070515     A                                      REFFLD(SPELOC FNSPE00F)
028900070515     A            P1TPRB    R             +1
029000070515     A                                      REFFLD(SPENAZ FNSPE00F)
029100070515      *
029200070515     A            P1TLOC1   R  +15        10
029300070515     A                                      REFFLD(§DADAULO DDAD)
029400070515     A                                      SPACEB(002)
029500070515      *------------------------------------*
029600070515     A                                    10
029700070515     A                                      'Claim file nr.'
029800070515     A                                      SPACEB(002)
029900070515     A                                      HIGHLIGHT
030000070515     A            P1TNCA        11A       +1
030100070515     A                                      HIGHLIGHT
030200070515     A                                    +1
030300070515     A                                      'dated'
030400070515     A                                      HIGHLIGHT
030500070515     A            P1TDCA    R             +1
030600070515     A                                      REFFLD($DA8     CNDIZION)
030700070515     A                                      EDTCDE(Y)
030800070515     A                                      HIGHLIGHT
030900070515      *------------------------------------*
031000070515     A                                    10
031100070515     A                                      'DECLARATION N.'
031200070515     A                                      SPACEB(003)
031300070515     A                                      HIGHLIGHT
031400070515     A            P1TLNP    R             +1
031500070515     A                                      REFFLD(DCTLNP   FNDCT00F)
031600070515     A                                      HIGHLIGHT
031700070515     A            P1TNRS    R             +1
031800070515     A                                      REFFLD(DCTNRS   FNDCT00F)
031900070515     A                                      EDTCDE(Z)
032000070515     A                                      HIGHLIGHT
032100070515     A            P1TNSP    R             +1
032200070515     A                                      REFFLD(DCTNSP   FNDCT00F)
032300070515     A                                      EDTCDE(Z)
032400070515     A                                      HIGHLIGHT
032500070515     A                                    +1
032600070515     A                                      'DATED'
032700070515     A                                      HIGHLIGHT
032800070515     A            P1TDSP    R             +1
032900070515     A                                      REFFLD($DA8     CNDIZION)
033000070515     A                                      EDTCDE(Y)
033100070515     A                                      HIGHLIGHT
033200070515      *
033300070515     A                                    10
033400070515     A                                      'FOR N.'
033500070515     A                                      SPACEB(001)
033600070515     A                                      HIGHLIGHT
033700070515     A            P1TNCL    R             +1
033800070515     A                                      REFFLD(ARBNCL   FNARB00F)
033900070515     A                                      EDTCDE(Z)
034000070515     A                                      HIGHLIGHT
034100070515     A                                    +1
034200070515     A                                      'PARCEL GROSS WEIGHT KG'
034300070515     A                                      HIGHLIGHT
034400070515     A            P1TPKF    R             +1
034500070515     A                                      REFFLD(ARBPKF   FNARB00F)
034600070515     A                                      EDTCDE(3)
034700070515     A                                      HIGHLIGHT
034800070515      *
034900070515     A                                    10
035000070515     A                                      'YOUR REFERENCE NUMBER:'
035100070515     A                                      SPACEB(001)
035200070515     A                                      HIGHLIGHT
035300070515     A            P1TRMN    R             +1
035400070515     A                                      REFFLD(ARBRMN   FNARB00F)
035500070515     A                                      EDTCDE(Z)
035600070515     A                                      HIGHLIGHT
035700070515     A                                   +10
035800070515     A                                      'CONSIGNEE:'
035900070515     A                                      HIGHLIGHT
036000070515     A            P1TRSD    R             +1
036100070515     A                                      REFFLD(ARBRSD   FNARB00F)
036200070515     A                                      HIGHLIGHT
036300070515      *------------------------------------*
036400070515     A                                    10
036500070515     A                                      'Following to our notice concerning-
036600070515     A                                       the alleged claim nr.'
036700070515     A                                      SPACEB(002)
036800070515     A            P1TNCA2   R             +1
036900070515     A                                      REFFLD(DCTNCA   FNDCT00F)
037000070515     A                                      EDTCDE(Z)
037100070515     A                                    +1
037200070515     A                                      'dated'
037300070515     A            P1TMGC    R             +1
037400070515     A                                      REFFLD(DCTMGC   FNDCT00F)
037500070515     A                                      EDTWRD('0 /  ')
037600070515     A                                    +0
037700070515     A                                      '/'
037800070515     A            P1TAAC    R             +0
037900070515     A                                      REFFLD(DCTAAC   FNDCT00F)
038000070515     A                                    +0
038100070515     A                                      ', and being aware of'
038200070515      *
038300070515     A                                    10
038400070515     A                                      'the responsibilities we hereby ass-
038500070515     A                                      ume by law, we declare that, despit-
038600070515     A                                      e the research carried out by'
038700070515     A                                      SPACEB(001)
038800070515      *
038900070515     A                                    10
039000070515     A                                      'means of our track & tracing syste-
039100070515     A                                      m, the above mentioned goods where -
039200070515     A                                      not electronically scanned at one'
039300070515     A                                      SPACEB(001)
039400070515      *
039500070515     A                                    10
039600070515     A                                      'of the controls. To be more precis-
039700070515     A                                      e, we are referring to nr.'
039800070515     A                                      SPACEB(001)
039900070515     A            P1TNCN2   R             +1
040000070515     A                                      REFFLD(DCTNCN   FNDCT00F)
040100070515     A                                      EDTCDE(Z)
040200070515     A                                    +1
040300070515     A                                      'parcel/s belonging to this shipmen-
040400070515     A                                      t'
040500070515      *
040600070515     A                                    10
040700070515     A                                      'for a total weight of'
040800070515     A                                      SPACEB(001)
040900070515     A            P1TPKD2   R             +1
041000070515     A                                      REFFLD(DCTPKD   FNDCT00F)
041100070515     A                                      EDTCDE(3)
041200070515     A                                    +1
041300070515     A                                      'KG.  Therefore, we have to declare-
041400070515     A                                       these goods missing because of'
041500070515      *
041600070515     A                                    10
041700070515     A                                      'accidental reasons.'
041800070515     A                                      SPACEB(001)
041900070515      *------------------------------------*
042000070515     A                                    10
042100070515     A                                      'We regret the drawback and remain -
042200070515     A                                      with our best regards.'
042300070515     A                                      SPACEB(002)
042400070515      *------------------------------------*
042500070515     A                                    60
042600110505     A                                      'BRT S.p.A.'
042700070515     A                                      SPACEB(003)
042800070515     A                                      HIGHLIGHT
042900070515      *
043000070515     A                                    60
043100070515     A                                      'Local branch'
043200070515     A                                      SPACEB(001)
043300070515     A                                      HIGHLIGHT
043400070515     A            P1TPOF    R             +1
043500070515     A                                      REFFLD(ORGDES   AZORG00F)
043600070515     A                                      HIGHLIGHT
043700070515     A*%%***********************************************************************
043800070515     A*%%SS
043900070515     A*%%CL 001
044000070515     A*%%CL 001
044100070515     A*%%CL 001
044200070515     A*%%CL 002
044300070515     A*%%CL 002
044400070515     A*%%CL 003
044500070515     A*%%CL 001
044600070515     A*%%CL 001
044700070515     A*%%CL 002
044800070515     A*%%CL 001
044900070515     A*%%CL 001
045000070515     A*%%CL 001
045100070515     A*%%CL 001
045200070515     A*%%CL 001
045300070515     A*%%CL 002
045400070515     A*%%CL 003
045500070515     A*%%CL 001
045600070515     A*%%CP+999CRTPRTF
045700070515     A*%%CP+    FILE(GAITRASRC/FIDN37P3)
045800070515     A*%%CP+    DEVTYPE(*SCS)
045900070515     A*%%CP     PAGESIZE(*N       198      *N     )
046000070515     A*%%***********************************************************************
