000001120405     A*%%***********************************************************************
000002120405     A*%%TS  RD  20120405  122702  EDPMB       REL-V6R1M0  5761-WDS
000003120405     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004120405     A*%%FI       0000000000000000000000000000000000000000000000000
000005120405     A*%%***********************************************************************
000006120405      *----------------------------------------------------------------
000007120405      * COMPILARE CON LUNG. RCD 198 E CPI 15
000008120405      *?          E ? PAGRTT(0) ?
000009120405      *----------------------------------------------------------------
000010120405     A          R DN35MP
000011120405     A*%%***********************************************************************
000012120405     A*%%RI 00000
000013120405     A*%%***********************************************************************
000014120405     A                                  1 63
000015120405     A                                      ' '
000016120405     A*%%***********************************************************************
000017120405     A*%%SS
000018120405     A*%%***********************************************************************
000019120405      *----------------------------------------------------------------
000020120405     A          R DN35MI
000021120405     A*%%***********************************************************************
000022120405     A*%%RI 00000
000023120405     A*%%***********************************************************************
000024120405     A                                     1
000025120405     A                                      'Ufficio SERVIZI ASSICURATIVI'
000026120405     A                                      SKIPB(003)
000027120405     A                                     1
000028120405     A                                      'Via Mattei 42'
000029120405     A                                      SPACEB(001)
000030120405     A            PICRAG        35   O    54
000031120405     A                                     1
000032120405     A                                      '40138'
000033120405     A                                      SPACEB(001)
000034120405     A                                     7
000035120405     A                                      'Bologna'
000036120405     A                                    16
000037120405     A                                      'BO'
000038120405     A            PICIND        35A  O    54
000039120405     A            PICCAP         9A  O    54
000040120405     A                                      SPACEB(001)
000041120405     A            PICLOC        30A  O    64
000042120405     A            PICPRV         2A  O    95
000043120405     A            PICNAZ        25A  O    54
000044120405     A                                      SPACEB(001)
000045120405     A            PICFRA         1A  O     1
000046120405     A                                      HIGHLIGHT
000047120405     A                                      SPACEB(002)
000048120405     A            PICDAL        30A  O     1
000049120405     A                                      SPACEB(002)
000050120405     A            PICPEC        45A  O    54
000051120405     A*%%***********************************************************************
000052120405     A*%%SS
000053120405     A*%%CL 001
000054120405     A*%%CL 001
000055120405     A*%%CL 001
000056120405     A*%%CL 001
000057120405     A*%%CL 001
000058120405     A*%%CL 002
000059120405     A*%%CL 002
000060120405     A*%%***********************************************************************
000061120405      *----------------------------------------------------------------
000062120405     A          R DN35MO
000063120405     A*%%***********************************************************************
000064120405     A*%%RI 00000
000065120405     A*%%***********************************************************************
000066120405     A            POCOGG       100A  O     1
000067120405     A                                      HIGHLIGHT
000068120405     A                                      SPACEB(003)
000069120405     A N08                                 2
000070120405     A                                      'Spedizione'
000071120405     A                                      SPACEB(001)
000072120405     A  08                                 2
000073120405     A                                      'Shipment nr'
000074120405     A                                      SPACEB(001)
000075120405     A            POCLNP         3S 0O    24
000076120405     A            POCNRS         2S 0O    29
000077120405     A                                      EDTCDE(Z)
000078120405     A            POCNSP         7S 0O    33
000079120405     A                                      EDTCDE(Z)
000080120405     A N08                                42
000081120405     A                                      'del'
000082120405     A            POCDAT         6S 0O    47
000083120405     A                                      EDTCDE(Y)
000084120405     A N08                                62
000085120405     A                                      'Colli'
000086120405     A  08                                62
000087120405     A                                      'Parcels'
000088120405     A            POCNCL         5S 0O    70
000089120405     A                                      EDTCDE(2)
000090120405     A N08                                83
000091120405     A                                      'Peso Kg'
000092120405     A  08                                85
000093120405     A                                      'Wgt Kg'
000094120405     A            POCPKF         7S 1O    92
000095120405     A                                      EDTCDE(2)
000096120405     A N08                                 2
000097120405     A                                      'Mittente'
000098120405     A                                      SPACEB(001)
000099120405     A  08                                 2
000100120405     A                                      'Sender'
000101120405     A                                      SPACEB(001)
000102120405     A            POCRSM        35A  O    24
000103120405     A N08                                62
000104120405     A                                      'Riferimento Mittente'
000105120405     A  08                                62
000106120405     A                                      'Sender Ref. Nr'
000107120405     A            POCRMN        15S 0O    86
000108120405     A                                      EDTCDE(Z)
000109120405     A  12        POCRMA        15A  O    86
000110120405     A                                      SPACEB(001)
000111120405     A N08                                 2
000112120405     A                                      'Destinatario'
000113120405     A                                      SPACEB(001)
000114120405     A  08                                 2
000115120405     A                                      'Consignee'
000116120405     A                                      SPACEB(001)
000117120405     A            POCRSD        35A  O    24
000118120405     A            POCLOD        35A  O    62
000119120405     A            POCPRD         3A  O    98
000120120405     A  03N08                              2
000121120405     A                                      'Evento'
000122120405     A                                      SPACEB(001)
000123120405     A  03 08                              2
000124120405     A                                      'Damage description'
000125120405     A                                      SPACEB(001)
000126120405     A  03        POCKEV        12A  O    24
000127120405     A  03        POCTAE        35A  O    39
000128120405     A N08                                 2
000129120405     A                                      'Anomalia lamentata'
000130120405     A                                      SPACEB(001)
000131120405     A  08                                 2
000132120405     A                                      'Damage type'
000133120405     A                                      SPACEB(001)
000134120405     A            POCTAD        35A  O    24
000135120405     A            POCDAN        35A  O    64
000136120405     A*%%***********************************************************************
000137120405     A*%%SS
000138120405     A*%%CL 003
000139120405     A*%%CL 001
000140120405     A*%%CL 001
000141120405     A*%%CL 001
000142120405     A*%%CL 001
000143120405     A*%%CL 001
000144120405     A*%%CL 001
000145120405     A*%%CL 001
000146120405     A*%%CL 001
000147120405     A*%%CL 001
000148120405     A*%%CL 001
000149120405     A*%%CL 001
000150120405     A*%%***********************************************************************
000151120405      *----------------------------------------------------------------
000152120405     A          R DN35MO1
000153120405     A*%%***********************************************************************
000154120405     A*%%RI 00000
000155120405     A*%%***********************************************************************
000156120405     A N08                                 2
000157120405     A                                      'Quantita'' danneggiate'
000158120405     A                                      SPACEB(001)
000159120405     A  08                                 2
000160120405     A                                      'Pieces involved'
000161120405     A                                      SPACEB(001)
000162120405     A            POCQTD        38A  O    24
000163120405     A            POCDPZ        35A  O    +2
000164120405     A*%%***********************************************************************
000165120405     A*%%SS
000166120405     A*%%CL 001
000167120405     A*%%CL 001
000168120405     A*%%***********************************************************************
000169120405      *----------------------------------------------------------------
000170120405     A          R DN35MO2
000171120405     A*%%***********************************************************************
000172120405     A*%%RI 00000
000173120405     A*%%***********************************************************************
000174120405     A            POCKOS        70A  O    24
000175120405     A                                      SPACEB(001)
000176120405     A*%%***********************************************************************
000177120405     A*%%SS
000178120405     A*%%CL 001
000179120405     A*%%***********************************************************************
000180120405      *----------------------------------------------------------------
000181120405     A          R DN35MO3
000182120405     A*%%***********************************************************************
000183120405     A*%%RI 00000
000184120405     A*%%***********************************************************************
000185120405     A N08                                 1
000186120405     A                                      'Spettabile Cliente,'
000187120405     A                                      SPACEB(002)
000188120405     A  08                                 1
000189120405     A                                      'Dear customer,'
000190120405     A                                      SPACEB(002)
000191120405     A*%%***********************************************************************
000192120405     A*%%SS
000193120405     A*%%CL 002
000194120405     A*%%CL 002
000195120405     A*%%***********************************************************************
000196120405      *----------------------------------------------------------------
000197120405     A          R DN35MT
000198120405     A*%%***********************************************************************
000199120405     A*%%RI 00000
000200120405     A*%%***********************************************************************
000201120405     A            PTCTES       100A  O     1
000202120405     A                                      SPACEB(001)
000203120405     A  04                                  HIGHLIGHT
000204120405     A*%%***********************************************************************
000205120405     A*%%SS
000206120405     A*%%CL 001
000207120405     A*%%***********************************************************************
000208120405      *----------------------------------------------------------------
000209120405     A          R DN35M0
000210120405     A*%%***********************************************************************
000211120405     A*%%RI 00000
000212120405     A*%%***********************************************************************
000213120405     A                                      SPACEB(001)
000214120405     A*%%***********************************************************************
000215120405     A*%%SS
000216120405     A*%%***********************************************************************
000217120405      *----------------------------------------------------------------
000218120405     A          R DN35MACB
000219120405     A*%%***********************************************************************
000220120405     A*%%RI 00000
000221120405     A*%%***********************************************************************
000222120405     A                                      SPACEB(001)
000223120405     A            PTCACB       100A  O     1
000224120405     A*%%***********************************************************************
000225120405     A*%%SS
000226120405     A*%%CP+999CRTPRTF
000227120405     A*%%CP+    FILE(GAITRAFIL/FIDN35PM)
000228120405     A*%%CP+    DEVTYPE(*SCS)
000229120405     A*%%CP+    PAGESIZE(*N 198)
000230120405     A*%%CP+    CPI(15)
000231120405     A*%%CP     PAGRTT(0)
000232120405     A*%%***********************************************************************
