000100090414     A*%%***********************************************************************
000200090414     A*%%TS  RD  20090414  114811  EDPMB       REL-V5R4M0  5722-WDS
000300090414     A*%%FI+10660100000000000000000000000000000000000000000000000000
000400090414     A*%%FI       0000000000000000000000000000000000000000000000000
000500090414     A*%%***********************************************************************
000600090414      *PARMS SAVE(*YES)
000700090414      *PARMS PAGESIZE(66 128) CPI(15) OVRFLW(63)
000800120724      */*PRM PAGESIZE(66 198) CPI(15) OVRFLW(63)
000900120724      */*PRM SAVE(*YES)
001000120724      */*END
001100090414      *------------------------------------------------------------------------*
001200090414      *  ARCHIVIAZIONE C.A.
001300090414      *------------------------------------------------------------------------*
001400090414     A          R DN91T1
001500090414     A*%%***********************************************************************
001600090414     A*%%RI 00000
001700090414     A*%%***********************************************************************
001800090414     A                                      SKIPB(001)
001900090414     A            RSUT          20A        1
002000090414     A                                    70
002100090414     A                                      'C.A. ARCHIVIATE'
002200090414     A                                    +1
002300090414     A                                      'anno'
002400090414     A            WAACA          4S 0O    +1
002500090414     A                                   140
002600090414     A                                      'FNDN91R'
002700090414     A            WDATA          8S 0    165
002800090414     A                                      EDTWRD('  /  /    ')
002900090414     A                                   187
003000090414     A                                      'Pag.'
003100090414     A            PAGE           7S 0O   192
003200090414     A                                      EDTCDE(Z)
003300090414     A*%%***********************************************************************
003400090414     A*%%SS
003500090414     A*%%***********************************************************************
003600090414      *------------------------------------------------------------------------*
003700090414     A          R DN91D1
003800090414     A*%%***********************************************************************
003900090414     A*%%RI 00000
004000090414     A*%%***********************************************************************
004100090414     A                                      SPACEB(001)
004200090414     A                                     1
004300090414     A                                      '-----------------------------------
004400090414     A                                      ------------------------------------
004500090414     A                                      ------------------------------------
004600090414     A                                      ------------------------------------
004700090414     A                                      ------------------------------------
004800090414     A                                      ------------------------'
004900090414      *-
005000090414     A                                     1
005100090414     A                                      'C.A.:'
005200090414     A                                      SPACEB(001)
005300090414     A            PDCTFIL        3S 0     +1
005400090414     A            PDCTNCA        7S 0     +1
005500090414     A                                      EDTCDE(Z)
005600090414     A                                    +1
005700090414     A                                      'del'
005800090414     A            DATACA         8S 0O    +1
005900090414     A                                      EDTWRD('  /  /    ')
006000090414     A                                    +4
006100090414     A                                      'Pratica Assicurativa:'
006200090414     A            PDCTDIT        3A  O    +1
006300090414     A            PDCTPRA        4S 0O    +1
006400090414     A                                      EDTCDE(Z)
006500090414     A            PDCTPRN        7S 0O    +1
006600090414     A                                      EDTCDE(Z)
006700090414     A                                    +4
006800090414     A                                      'Tipo gestione:'
006900090414     A            DESFPR        52A  O    +1
007000090414     A                                    +4
007100090414     A                                      'Denuncia:'
007200090414     A            PDCTAAD        4S 0O    +1
007300090414     A                                      EDTCDE(Z)
007400090414     A            PDCTPOD        3S 0O    +1
007500090414     A                                      EDTCDE(Z)
007600090414     A            PDCTNDE        7S 0O    +1
007700090414     A                                      EDTCDE(Z)
007800090414     A                                    +1
007900090414     A                                      'del'
008000090414     A            DATADE         8S 0O    +1
008100090414     A                                      EDTWRD('  /  /    ')
008200090414      *--
008300090414     A  04                                 1
008400090414     A                                      'Evento:'
008500090414     A                                      SPACEB(001)
008600090414     A  04        PDCTAAE        4S 0O    +1
008700090414     A                                      EDTCDE(Z)
008800090414     A  04        PDCTNEV        7S 0O    +1
008900090414     A                                      EDTCDE(Z)
009000090414     A  04                                +1
009100090414     A                                      'del'
009200090414     A  04        DATAEV         8S 0O    +1
009300090414     A                                      EDTWRD('  /  /    ')
009400090414     A  04        DESTEV        25A  O    +1
009500090414     A  04        DESEVA        35A  O    +1
009600090414      *-
009700090414     A                                     1
009800090414     A                                      'Mittente ...:'
009900090414     A                                      SPACEB(001)
010000090414     A            CLIMIT         7S 0O    +1
010100090414     A                                      EDTCDE(Z)
010200090414     A            PTMDRSM       35A  O    +1
010300090414     A            DESLOM        90A  O    +1
010400090414     A                                    +4
010500090414     A                                      'Riferimenti Mittente:'
010600090414     A            PTASRMN       15S 0O    +1
010700090414     A                                      EDTCDE(Z)
010800090414      *-
010900090414     A                                     1
011000090414     A                                      'Destinatario:'
011100090414     A                                      SPACEB(001)
011200090414     A            CLIDES         7S 0O    +1
011300090414     A                                      EDTCDE(Z)
011400090414     A            PTMDRSD       35A  O    +1
011500090414     A            DESLOD        90A  O    +1
011600090414     A            PTA4RMA       15A  O   +26
011700090414      *-
011800090414     A                                     1
011900090414     A                                      'Spedizione:'
012000090414     A                                      SPACEB(001)
012100090414     A            PDCTLNP        3S 0O    +1
012200090414     A            PDCTNRS        2S 0O    +1
012300090414     A                                      EDTCDE(Z)
012400090414     A            PDCTNSP        7S 0O    +1
012500090414     A                                      EDTCDE(Z)
012600090414     A                                    +1
012700090414     A                                      'del'
012800090414     A            DATASP         8S 0O    +1
012900090414     A                                      EDTWRD('  /  /    ')
013000090414     A            DESCBO         9A  O    +1
013100090414     A                                    +4
013200090414     A                                      'Linea Arrivo:'
013300090414     A            PDCTLNA        3S 0O    +1
013400090414     A                                    +4
013500090414     A                                      'Colli:'
013600090414     A            PTASNCL        5S 0O    +1
013700090414     A                                      EDTCDE(Z)
013800090414     A                                    +4
013900090414     A                                      'Kg.:'
014000090414     A            PTASPKF        7S 1O    +1
014100090414     A                                      EDTCDE(4)
014200090414     A                                    +4
014300090414     A                                      'Mc.:'
014400090414     A            PTASFVF        1A  O    +1
014500090414     A            PTASVLF        5S 3O    +1
014600090414     A                                      EDTCDE(4)
014700090414     A                                    +4
014800090414     A                                      'Natura merce:'
014900090414     A            PDCTNAS       15A  O    +1
015000090414     A*%%***********************************************************************
015100090414     A*%%SS
015200090414     A*%%CL 001
015300090414     A*%%CL 001
015400090414     A*%%CL 001
015500090414     A*%%CL 001
015600090414     A*%%CL 001
015700090414     A*%%***********************************************************************
015800090414      *------------------------------------------------------------------------*
015900090414     A          R DN91D2
016000090414     A*%%***********************************************************************
016100090414     A*%%RI 00000
016200090414     A*%%***********************************************************************
016300090414     A                                      SPACEB(001)
016400090414     A                                     1
016500090414     A                                      'Anomalia:'
016600090414     A            PDCTTAD        2A  O    +1
016700090414     A            DESTAD        25A  O    +1
016800090414     A                                    +1
016900090414     A                                      'Descrizione:'
017000090414     A            DESTAG       143A  O    +1
017100090414     A*%%***********************************************************************
017200090414     A*%%SS
017300090414     A*%%***********************************************************************
017400090414      *------------------------------------------------------------------------*
017500090414     A          R DN91D3
017600090414     A*%%***********************************************************************
017700090414     A*%%RI 00000
017800090414     A*%%***********************************************************************
017900090414     A                                      SPACEB(001)
018000090414     A            DESTA1       143A  O    53
018100090414     A*%%***********************************************************************
018200090414     A*%%SS
018300090414     A*%%***********************************************************************
018400090414      *------------------------------------------------------------------------*
018500090414     A          R DN91D4
018600090414     A*%%***********************************************************************
018700090414     A*%%RI 00000
018800090414     A*%%***********************************************************************
018900090414     A                                      SPACEB(001)
019000090414     A                                     1
019100090414     A                                      'Motivo del danno:'
019200090414     A            DESMTV       143A  O    +1
019300090414     A*%%***********************************************************************
019400090414     A*%%SS
019500090414     A*%%***********************************************************************
019600090414      *------------------------------------------------------------------------*
019700090414     A          R DN91D5
019800090414     A*%%***********************************************************************
019900090414     A*%%RI 00000
020000090414     A*%%***********************************************************************
020100090414     A                                      SPACEB(001)
020200090414     A            DESMTV1      179A  O    12
020300090414     A*%%***********************************************************************
020400090414     A*%%SS
020500090414     A*%%***********************************************************************
020600090414      *------------------------------------------------------------------------*
020700090414     A          R DN91D6
020800090414     A*%%***********************************************************************
020900090414     A*%%RI 00000
021000090414     A*%%***********************************************************************
021100090414     A                                      SPACEB(001)
021200090414     A                                     1
021300090414     A                                      'Descrizione Pezzi presenti:'
021400090414     A            DESPRS       143A  O    +1
021500090414     A*%%***********************************************************************
021600090414     A*%%SS
021700090414     A*%%***********************************************************************
021800090414      *------------------------------------------------------------------------*
021900090414     A          R DN91D7
022000090414     A*%%***********************************************************************
022100090414     A*%%RI 00000
022200090414     A*%%***********************************************************************
022300090414     A                                      SPACEB(001)
022400090414     A            DESPRS1      179A  O    13
022500090414     A*%%***********************************************************************
022600090414     A*%%SS
022700090414     A*%%***********************************************************************
022800090414      *------------------------------------------------------------------------*
022900090414     A          R DN91D8
023000090414     A*%%***********************************************************************
023100090414     A*%%RI 00000
023200090414     A*%%***********************************************************************
023300090414     A                                      SPACEB(001)
023400090414     A                                     1
023500090414     A                                      'Descr.pezzi Dann/Mancanti:'
023600090414     A            DESNPZ       143A  O    +2
023700090414     A*%%***********************************************************************
023800090414     A*%%SS
023900090414     A*%%***********************************************************************
024000090414      *------------------------------------------------------------------------*
024100090414     A          R DN91D9
024200090414     A*%%***********************************************************************
024300090414     A*%%RI 00000
024400090414     A*%%***********************************************************************
024500090414     A                                      SPACEB(001)
024600090414     A            DESNPZ1      179A  O    13
024700090414     A*%%***********************************************************************
024800090414     A*%%SS
024900090414     A*%%***********************************************************************
025000090414      *------------------------------------------------------------------------*
025100090414     A          R DN91D10
025200090414     A*%%***********************************************************************
025300090414     A*%%RI 00000
025400090414     A*%%***********************************************************************
025500090414     A                                      SPACEB(001)
025600090414     A                                     1
025700090414     A                                      'Q.tà Dann./Mancante:'
025800090414     A                                    +1
025900090414     A                                      'Pezzi:'
026000090414     A            PDCTNPZ        5S 0O    +1
026100090414     A                                      EDTCDE(Z)
026200090414     A                                    +4
026300090414     A                                      'Colli:'
026400090414     A            PDCTNCN        5S 0O    +1
026500090414     A                                      EDTCDE(Z)
026600090414     A                                    +4
026700090414     A                                      'Kg.:'
026800090414     A            PDCTPKD        7S 1O    +1
026900090414     A                                      EDTCDE(4)
027000090414     A                                    +4
027100090414     A                                      'DDT verificato dal P.O.di:'
027200090414     A            DESTDT         8A  O    +1
027300090414     A                                    +4
027400090414     A                                      'Riserva:'
027500090414     A            DESCRC         2A  O    +1
027600090414     A                                    +4
027700090414     A                                      'Merce Danneggiata:'
027800090414     A            DESDSD        10A  O    +1
027900090414      *-
028000090414     A                                     1
028100090414     A                                      'Beneficiario alternativo:'
028200090414     A                                      SPACEB(001)
028300090414     A            PDCTKSC        7S 0O    +1
028400090414     A                                      EDTCDE(Z)
028500090414     A            DESKSC        35A  O    +1
028600090414     A                                    +2
028700090414     A                                      'Interlocutore:'
028800090414     A            DESINT        35A  O    +1
028900090414     A  02                                +2
029000090414     A                                      'Responsabilità Internazionale:'
029100090414     A  02        DESRES        35A  O    +1
029200090414      *-
029300090414     A  01                                 1
029400090414     A                                      'Rivalsa'
029500090414     A                                      SPACEB(001)
029600090414     A  01        CODASS         7S 0O    +1
029700090414     A                                      EDTCDE(Z)
029800090414     A  01        DESASS        35A  O    +1
029900090414     A  01        VIAASS        30A  O    +1
030000090414     A  01        CAPASS         9A  O    +1
030100090414     A  01        LOCASS        20A  O    +1
030200090414     A  01        PRVASS         2A  O    +1
030300090414     A  01        NAZASS         3A  O    +1
030400090414     A  01                                +1
030500090414     A                                      'Tel.'
030600090414     A  01        TELASS        16A  O    +1
030700090414     A  01                                +1
030800090414     A                                      'Fax'
030900090414     A  01        FAXASS        16A  O    +1
031000090414      *-
031100090414     A                                     1
031200090414     A                                      'Causale chiusura:'
031300090414     A                                      SPACEB(001)
031400090414     A            PDCTCCH        2A  O    +1
031500090414     A            DESCCH        25A  O    +1
031600090414     A            DESPAG        25A  O    +1
031700090414      *-
031800090414     A  05                                 1
031900090414     A                                      'Mandato assicurativo:'
032000090414     A                                      SPACEB(001)
032100090414     A  05        DESMAN        21A  O    +1
032200090414     A  05                                +1
032300090414     A                                      'Cliente'
032400090414     A  05        PDPTKSC        7S 0O    +1
032500090414     A  05        RAGDPT        35A  O    +1
032600090414     A  05                                +1
032700090414     A                                      'Codice Tariffa'
032800090414     A  05        PDPTCTR        3S 0O    +1
032900090414     A  05        DESCTR        20A  O    +1
033000090414     A  05                                +1
033100090414     A                                      'Valore merce:'
033200090414     A  05        PDPTVLM       15S 3O    +1
033300090414     A                                      EDTCDE(4)
033400090414     A  05        PDPTVVM        3A  O    +1
033500090414     A  05        DESVVM        20A  O    +1
033600090414     A*%%***********************************************************************
033700090414     A*%%SS
033800090414     A*%%CL 001
033900090414     A*%%CL 001
034000090414     A*%%CL 001
034100090414     A*%%CL 001
034200090414     A*%%***********************************************************************
034300090414      *------------------------------------------------------------------------*
034400090414     A          R DN91D11
034500090414     A*%%***********************************************************************
034600090414     A*%%RI 00000
034700090414     A*%%***********************************************************************
034800090414     A                                      SPACEB(001)
034900090414     A                                     1
035000090414     A                                      'Imp. da Assicurare:'
035100090414     A  03        PTASIAS       13S 3O    +1
035200090414     A                                      EDTCDE(4)
035300090414     A  03        PTASVAS        3   O    +1
035400090414     A                                    +4
035500090414     A                                      'Imp. Max Risarcibile:'
035600090414     A            PDCTIPV       13S 3O    +1
035700090414     A                                      EDTCDE(4)
035800090414     A            PDCTVPV        3A  O    +1
035900090414     A            DESFPV        20A  O    +1
036000090414     A                                    +4
036100090414     A                                      'Imp. Richiesto:'
036200090414     A            PDCLIPR       13S 3O    +1
036300090414     A                                      EDTCDE(4)
036400090414     A            PDCLVPR        3A  O    +1
036500090414     A                                    +4
036600090414     A                                      'Imp. Trattenuto:'
036700090414     A            PDCLIPT       13S 3O    +1
036800090414     A                                      EDTCDE(4)
036900090414     A            PDCLVPT        3A  O    +1
037000090414     A                                    +1
037100090414     A                                      'il'
037200090414     A            DATAPT         8S 0O    +1
037300090414     A                                      EDTWRD('  /  /    ')
037400090414      *-
037500090414     A            TDESPAG       40A  O     1
037600090414     A                                      SPACEB(001)
037700090414     A                                    +2
037800090414     A                                      'Imp. Liquidato:'
037900090414     A            PDCLIPL       13S 3O    +1
038000090414     A                                      EDTCDE(4)
038100090414     A            PDCLVPL        3A  O    +1
038200090414     A                                    +1
038300090414     A                                      'Assegno:'
038400090414     A            DCLASN        10A  O    +1
038500090414     A                                    +1
038600090414     A                                      'del'
038700090414     A            DATAEA         8S 0O    +1
038800090414     A                                      EDTWRD('  /  /    ')
038900090414     A                                    +1
039000090414     A                                      'Banca:'
039100090414     A            DESBAN        50A  O    +1
039200090414     A                                    +1
039300090414     A                                      'ABI'
039400090414     A            DCLABI         5A  O    +1
039500090414     A                                    +1
039600090414     A                                      'CAB'
039700090414     A            DCLCAB         5A  O    +1
039800090414     A*%%***********************************************************************
039900090414     A*%%SS
040000090414     A*%%CL 001
040100090414     A*%%***********************************************************************
040200090414      *------------------------------------------------------------------------*
040300090414     A          R DN91D12
040400090414     A*%%***********************************************************************
040500090414     A*%%RI 00000
040600090414     A*%%***********************************************************************
040700090414     A                                      SPACEB(001)
040800090414     A                                     1
040900090414     A                                      'PROGETTO DI LIQUIDAZIONE'
041000090414     A                                    +2
041100120724     A                                      '                  '
041200120724     A                                    +1
041300120724     A                                      '               '
041400090414     A                                    +2
041500090414     A                                      'Intestatario:'
041600090414     A            CODPLI         7S 0O    +1
041700090414     A                                      EDTCDE(Z)
041800090414     A            DESPLI        35A  O    +1
041900090414     A            VIAPLI        30A  O    +1
042000090414     A            LOCPLI        37A  O    +1
042100090414      *-
042200090414     A                                    27
042300090414     A                                      'Data Stampa:'
042400090414     A                                      SPACEB(001)
042500090414     A            DATADS         8S 0O    +1
042600090414     A                                      EDTWRD('  /  /    ')
042700090414     A                                    +2
042800090414     A                                      'Data Accettazione:'
042900090414     A            DATAPL         8S 0O    +1
043000090414     A                                      EDTWRD('  /  /    ')
043100090414     A                                    +2
043200090414     A                                      'Importo Liquidato:'
043300090414     A            IMPIPP        13S 3O    +1
043400090414     A                                      EDTCDE(4)
043500090414     A            VALIPP         3A  O    +1
043600090414     A                                    +2
043700090414     A                                      'Valuta pagamento:'
043800090414     A            DATALP         8S 0O    +1
043900090414     A                                      EDTWRD('  /  /    ')
044000090414      *-
044100090414     A  06                                27
044200090414     A                                      SPACEB(001)
044300090414     A                                      'Note calcolo risarcimento:'
044400090414     A  06        DESPLT       143A  O    +1
044500090414     A*%%***********************************************************************
044600090414     A*%%SS
044700090414     A*%%CL 001
044800090414     A*%%CL 001
044900090414     A*%%***********************************************************************
045000090414      *------------------------------------------------------------------------*
045100090414     A*****     R DN91D20
045200090414     A*****                                 SPACEB(001)
045300090414     A*****                                1
045400090414     A*****                                 'RECUPERO DA A.I.G.'
045500090414     A*****                               +2
045600090414     A*****                                 'Data richiesta:'
045700090414     A*****       DATARR         8S  O    +1
045800090414     A*****                                 EDTCDE(Y)
045900090414     A*****                               +2
046000090414     A*****                                 'Data ricezione:'
046100090414     A*****       DATAVR         8S  O    +1
046200090414     A*****                                 EDTCDE(Y)
046300090414     A*****                               +2
046400090414     A*****                                 'Importo recuperato:'
046500090414     A*****       DRAIRI        15S 3O    +1
046600090414     A*****                                 EDTCDE(4)
046700090414     A*****       DRADIR         3A  O    +1
046800090414      *------------------------------------------------------------------------*
046900090414     A*****     R DN91D21
047000090414     A*****                                 SPACEB(001)
047100090414     A*N08                                21
047200090414     A*****                                 'DISPOSIZIONI'
047300090414     A*N08                                +1
047400090414     A*****                                 'Data ricezione:'
047500090414     A*N08        DATARD         8S  O    +1
047600090414     A*****                                 EDTCDE(Y)
047700090414     A*****       RIGADISP     135A  O    +1
047800090414      *------------------------------------------------------------------------*
047900090414     A*****     R DN91D22
048000090414     A*****                                 SPACEB(001)
048100090414     A*****                                1
048200090414     A*****                                 'RECUPERO DA A.I.G.'
048300090414     A*****                               +2
048400090414     A*****                                 'ESCLUSA DAL RECUPERO'
048500090414      *---------------------------------------------------------------*
048600090414     A          R DN91D13
048700090414     A*%%***********************************************************************
048800090414     A*%%RI 00000
048900090414     A*%%FS 001
049000090414     A*%%***********************************************************************
049100090414     A                                      SPACEB(002)
049200090414     A                                     1
049300090414     A                                      '-----------------------------------
049400090414     A                                      ------------------------------------
049500090414     A                                      --------'
049600090414     A                                    +3
049700090414     A                                      'F  A  S  I     E  S  E  G  U  I  T-
049800090414     A                                        E'
049900090414     A                                    +3
050000090414     A                                      '-----------------------------------
050100090414     A                                      ------------------------------------
050200090414     A                                      ---------'
050300090414     A                                     2
050400090414     A                                      'Data'
050500090414     A                                      SPACEB(001)
050600090414     A                                    +7
050700090414     A                                      'Ora'
050800090414     A                                    +7
050900090414     A                                      'Fase'
051000090414     A                                   +46
051100090414     A                                      'FR'
051200090414     A                                    +2
051300090414     A                                      'M/D'
051400090414     A                                    +3
051500090414     A                                      'P.O.'
051600090414     A                                    +1
051700090414     A                                      'Utente'
051800090414     A                                    +9
051900090414     A                                      'Data'
052000090414     A                                    +7
052100090414     A                                      'Ora'
052200090414     A                                    +6
052300090414     A                                      'Fase'
052400090414     A                                   +47
052500090414     A                                      'FR'
052600090414     A                                    +2
052700090414     A                                      'M/D'
052800090414     A                                    +3
052900090414     A                                      'P.O.'
053000090414     A                                    +1
053100090414     A                                      'Utente'
053200090414     A*%%***********************************************************************
053300090414     A*%%SS
053400090414     A*%%CL 001
053500090414     A*%%***********************************************************************
053600090414      *---------------------------------------------------------------*
053700090414     A          R DN91D14
053800090414     A*%%***********************************************************************
053900090414     A*%%RI 00000
054000090414     A*%%***********************************************************************
054100090414     A                                      SPACEB(001)
054200090414     A            RIGAFASE1     97A  O     1
054300090414     A            RIGAFASE2     97A  O    +4
054400090414     A*%%***********************************************************************
054500090414     A*%%SS
054600090414     A*%%***********************************************************************
054700090414      *---------------------------------------------------------------*
054800090414     A          R DN91D15
054900090414     A*%%***********************************************************************
055000090414     A*%%RI 00000
055100090414     A*%%FS 001
055200090414     A*%%***********************************************************************
055300090414     A                                      SPACEB(002)
055400090414     A                                     1
055500090414     A                                      '-----------------------------------
055600090414     A                                      ------------------------------------
055700090414     A                                      --------'
055800090414     A                                    +3
055900090414     A                                      'D O C U M E N T I   R I C H I E S -
056000090414     A                                      T I'
056100090414     A                                    +3
056200090414     A                                      '-----------------------------------
056300090414     A                                      ------------------------------------
056400090414     A                                      ---------'
056500090414     A                                     2
056600090414     A                                      'Ricevuto'
056700090414     A                                      SPACEB(001)
056800090414     A                                    +5
056900090414     A                                      'Tipo documento'
057000090414     A                                   +74
057100090414     A                                      'Ricevuto'
057200090414     A                                    +5
057300090414     A                                      'Tipo documento'
057400090414     A*%%***********************************************************************
057500090414     A*%%SS
057600090414     A*%%CL 001
057700090414     A*%%***********************************************************************
057800090414      *---------------------------------------------------------------*
057900090414     A          R DN91D16
058000090414     A*%%***********************************************************************
058100090414     A*%%RI 00000
058200090414     A*%%***********************************************************************
058300090414     A                                      SPACEB(001)
058400090414     A            RIGADOC1      74A  O     1
058500090414     A            RIGADOC2      74A  O   +27
058600090414     A*%%***********************************************************************
058700090414     A*%%SS
058800090414     A*%%***********************************************************************
058900090414      *---------------------------------------------------------------*
059000090414     A          R DN91D17
059100090414     A*%%***********************************************************************
059200090414     A*%%RI 00000
059300090414     A*%%FS 001
059400090414     A*%%***********************************************************************
059500090414     A                                      SPACEB(002)
059600090414     A                                     1
059700090414     A                                      '-----------------------------------
059800090414     A                                      ------------------------------------
059900090414     A                                      --------------------'
060000090414     A                                    +3
060100090414     A                                      'N  O  T  E'
060200090414     A                                    +3
060300090414     A                                      '-----------------------------------
060400090414     A                                      ------------------------------------
060500090414     A                                      ------------------------'
060600090414     A                                     2
060700090414     A                                      'Data'
060800090414     A                                      SPACEB(001)
060900090414     A                                    +7
061000090414     A                                      'Ora'
061100090414     A                                    +2
061200090414     A                                      'Fase'
061300090414     A                                    +2
061400090414     A                                      'P.O.'
061500090414     A                                    +1
061600090414     A                                      'Utente'
061700090414     A                                    +5
061800090414     A                                      'Nota'
061900090414     A*%%***********************************************************************
062000090414     A*%%SS
062100090414     A*%%CL 001
062200090414     A*%%***********************************************************************
062300090414      *---------------------------------------------------------------*
062400090414     A          R DN91D18
062500090414     A*%%***********************************************************************
062600090414     A*%%RI 00000
062700090414     A*%%***********************************************************************
062800090414     A                                      SPACEB(001)
062900090414     A N07        DATANOT        8S 0O     1
063000090414     A                                      EDTWRD('  /  /    ')
063100090414     A N07        OLDHIM         4S 0O    +1
063200090414     A                                      EDTWRD('  :  ')
063300090414     A N07        PFASENO        3A  O    +2
063400090414     A N07        PDCSPOS        3S 0O    +2
063500090414     A N07        PDCSPRU       10A  O    +2
063600090414     A            RIGANOTA     143A  O    +1
063700090414     A*%%***********************************************************************
063800090414     A*%%SS
063900090414     A*%%***********************************************************************
064000090414      *---------------------------------------------------------------*
064100090414     A          R DN91D19
064200090414     A*%%***********************************************************************
064300090414     A*%%RI 00000
064400090414     A*%%***********************************************************************
064500090414     A                                      SPACEB(001)
064600090414     A                                     1
064700090414     A                                      '    '
064800090414     A*%%***********************************************************************
064900090414     A*%%SS
065000090414     A*%%CP+999CRTPRTF
065100090414     A*%%CP+    FILE(GAITRAFIL/FIDN91P)
065200090414     A*%%CP+    DEVTYPE(*SCS)
065300090414     A*%%CP+    PAGESIZE(66 198)
065400090414     A*%%CP+    CPI(15)
065500090414     A*%%CP+    OVRFLW(63)
065600090414     A*%%CP     SAVE(*YES)
065700090414     A*%%***********************************************************************
