000010050516     A*%%TS  SD  20050516  114432  EDPMB       REL-V4R4M0  5769-PW1
000020050516     A*%%EC
000030050516     A                                      DSPSIZ(24 80 *DS3)
000040050516     A                                      CHGINPDFT(UL)
000050050516     A                                      PRINT
000060050516     A          R DN90D01
000070050516     A*%%TS  SD  20050516  114432  EDPMB       REL-V4R4M0  5769-PW1
000080050516     A                                      CF06
000090050516     A                                      CA03
000100050516     A            RSUT          20A  O  1  2
000110050516     A            VTCTIT        35A  O  1 24DSPATR(RI)
000120050516     A                                      DSPATR(UL)
000130050516     A            VTCPGM        10A  O  1 61
000140050516     A                                  1 72DATE
000150050516     A                                      EDTCDE(Y)
000160050516     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000170050516     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000180050516     A                                  2 72TIME
000190050516     A  28        V1CMSG        35   M
000200050516     A                                 23  2'F3=Fine'
000210050516     A                                 23 29'F6=Conferma'
000220050516     A            V1CAAC         4Y 0B  8 28DSPATR(HI)
000230050516     A                                      CHECK(RZ)
000240050516     A                                      EDTCDE(Z)
000250050516     A  40                                  DSPATR(PC)
000260050516     A                                  8  7'Archivia C.A. anno:'
