000100110729     A*%%***********************************************************************
000200110729     A*%%TS  RD  20110729  143013  EDPGA       REL-V6R1M0  5761-WDS
000300110729     A*%%FI+10660100000000000000000000000000000000000000000000000000
000400110729     A*%%FI       0000000000000000000000000000000000000000000000000
000500110729     A*%%***********************************************************************
000600110801     A*PARMS PAGESIZE(66 198) CPI(15) USRDTA('CA_RIV_EEX')
000700110729     A*PARMS DECFMT(*JOB)
000800120502      */*PRM PAGESIZE(66 198) CPI(15) USRDTA('CA_RIV_EEX')
000900120502      */*PRM DECFMT(*JOB)
001000120502      */*END
001100110729      *****************************************************************
001200110729      *
001300110801      *  ELENCO C.A. PER RIVALSA EUROEXPRESS
001400110729      *
001500120502      *  Compilare con:  PAGESIZE(66 198) CPI(15) USRDTA('CA_RIV_EEX')
001600110729      *
001700110729      *****************************************************************
001800110729     A          R DN77PT
001900110729     A*%%***********************************************************************
002000110729     A*%%RI 00000
002100110729     A*%%FS 001
002200110729     A*%%***********************************************************************
002300110729     A                                      SKIPB(002)
002400110729     A                                      SPACEA(001)
002500110729     A*
002600110729     A            RSUT          20A  O     1
002700110729     A                                    62
002800110729     A                                      'E L E N C O   C. A.   P E R   R I -
002900110729     A                                      V A L S A   E U R O E X P R E S S'
003000110729     A                                      HIGHLIGHT
003100110729     A                                   160
003200110729     A                                      'FIDN77R'
003300110729     A                                   175
003400110729     A                                      DATE(*YY)
003500110729     A                                      EDTCDE(Y)
003600110729     A                                   190
003700110729     A                                      'PAG.'
003800110729     A                                   195
003900110729     A                                      PAGNBR
004000110729     A                                      EDTCDE(Z)
004100110729     A*
004200110729     A            KNSIF     R        O     1
004300110729     A                                      REFFLD(KNSIF KPJBA)
004400110729     A                                      SPACEB(001)
004500110729     A            KNMUS     R        O    12
004600110729     A                                      REFFLD(KNMUS KPJBA)
004700110729     A                                    62
004800110729     A                                      '**********************************-
004900110729     A                                      *********************************'
005000110729     A                                   175
005100110729     A                                      TIME
005200110729     A*
005300110729     A                                     1
005400110729     A                                      'Pratiche Assicurative'
005500110729     A                                      SPACEB(002)
005600110729     ***A  09                                +1
005700110729     ***A                                      'in Franchigia'
005800110729     A                                    +2
005900110729     A                                      '-'
006000110729     A                                      HIGHLIGHT
006100110729     A N01                                41
006200110729     A                                      'Stampa  '
006300110729     A                                      HIGHLIGHT
006400110729     A  01                                41
006500110729     A                                      'Ristampa'
006600110729     A                                      HIGHLIGHT
006700110729     A                                    +1
006800110729     A                                      'del giorno'
006900110729     A                                      HIGHLIGHT
007000110729     A            PTDATA         8S 0O    +1
007100110729     A                                      EDTCDE(Y)
007200110729     A                                      HIGHLIGHT
007300110729     A                                    +9
007400110729     A                                      'PARTNER'
007500110729     A                                      HIGHLIGHT
007600110729     A            PTDCOD         7S 0O    +1
007700110729     A                                      HIGHLIGHT
007800110729     A            PTDDES        48A  O    +1
007900110729     A                                      HIGHLIGHT
008000110729     A*
008100110729     A                                     1
008200110729     A                                      'Avviso Danno      '
008300110729     A                                      SPACEB(002)
008400110729     A                                    +5
008500110729     A                                      'Numero C.A.      '
008600110729     A                                   +31
008700110729     A                                      'Numero e  Data'
008800110729     A                                    +1
008900110729     A                                      'Spedizione'
009000110729     A                                    +3
009100110729     A                                      'Mittente                          -
009200110729     A                                                   '
009300110729     A                                    +3
009400110729     A                                      'Destinatario                      -
009500110729     A                                                   '
009600110729     A*
009700110729     A                                     1
009800110729     A                                      '-----------------------------------
009900110729     A                                      ------------------------------------
010000110729     A                                      ------------------------------------
010100110729     A                                      ------------------------------------
010200110729     A                                      ------------------------------------
010300110729     A                                      ------------------------'
010400110729     A                                      SPACEB(001)
010500110729     A*%%***********************************************************************
010600110729     A*%%SS
010700110729     A*%%CL 001
010800110729     A*%%CL 002
010900110729     A*%%CL 002
011000110729     A*%%CL 001
011100110729     A*%%CL 001
011200110729     A*%%***********************************************************************
011300110729      *----------------------------------------------------------------
011400110729     A          R DN77PD0
011500110729     A*%%***********************************************************************
011600110729     A*%%RI 00000
011700110729     A*%%***********************************************************************
011800110729     A                                      SPACEB(001)
011900110729     A                                     1
012000110729     A                                      'Nessuna C.A. per la data indicata'
012100110729     A*%%***********************************************************************
012200110729     A*%%SS
012300110729     A*%%***********************************************************************
012400110729      *----------------------------------------------------------------
012500110729     A          R DN77PD1
012600110729     A*%%***********************************************************************
012700110729     A*%%RI 00000
012800110729     A*%%***********************************************************************
012900110729     A                                      SPACEB(001)
013000110729     A* Avviso Presunto Danno
013100110729     A  02        PD1DIT    R        O     1
013200110729     A                                      REFFLD(DCTDIT FNDCT00F)
013300110729     A  02        PD1PRN    R        O    +1
013400110729     A                                      REFFLD(DCTPRN FNDCT00F)
013500110729     A                                      EDTCDE(Z)
013600110729     A  02        PD1PRA    R        O    +3
013700110729     A                                      REFFLD(DCTPRA FNDCT00F)
013800110729     A* Comunicazione Anomalia
013900110729     A            PD1AAC    R        O    +5
014000110729     A                                      REFFLD(DCTAAC FNDCT00F)
014100110729     A            PD1FIL    R        O    +2
014200110729     A                                      REFFLD(DCTFIL FNDCT00F)
014300110729     A            PD1NCA    R        O    +1
014400110729     A                                      REFFLD(DCTNCA FNDCT00F)
014500110729     A                                      EDTCDE(Z)
014600110729     A* Spedizione
014700120502     A            PD1LNP    R        O   +31
014800110729     A                                      REFFLD(DCTLNP FNDCT00F)
014900110729     A            PD1NRS    R        O    +1
015000110729     A                                      REFFLD(DCTNRS FNDCT00F)
015100110729     A                                      EDTCDE(Z)
015200110729     A            PD1NSP    R        O    +1
015300110729     A                                      REFFLD(DCTNSP FNDCT00F)
015400110729     A                                      EDTCDE(Z)
015500110729     A* del
015600110729     A            PD1DSP         8S 0O    +1
015700110729     A                                      TEXT('Data Spedizione')
015800110729     A                                      EDTCDE(Y)
015900110729     A* Mittente
016000110729     A            PD1RSM    R        O    +3
016100110729     A                                      REFFLD(TMDRSM TNTMD00F)
016200110729     A* Destinatario
016300110729     A            PD1RSD    R        O   +15
016400110729     A                                      REFFLD(TMDRSD TNTMD00F)
016500110729      *
016600110729     A                                     1
016700110729     A                                      ' '
016800110729     A* Indirizzo Mittente
016900110729     A            PD1INM    R        O   100
017000110729     A                                      REFFLD(TMDINM TNTMD00F)
017100110729     A                                      SPACEB(001)
017200110729     A* Indirizzo Destinatario
017300110729     A            PD1IND    R        O   150
017400110729     A                                      REFFLD(TMDIND TNTMD00F)
017500110729      *
017600110729     A                                     1
017700110729     A                                      ' '
017800110729     A* C.A.P. Mittente
017900110729     A            PD1CAM    R        O   100
018000110729     A                                      REFFLD(TMDCAM TNTMD00F)
018100110729     A                                      SPACEB(001)
018200110729     A* Località Mittente
018300110729     A            PD1LOM    R   30   O   110
018400110729     A                                      REFFLD(TMDLOM TNTMD00F)
018500110729     A* Provincia Mittente
018600110729     A            PD1PRM    R        O   141
018700110729     A                                      REFFLD(TMDPRM TNTMD00F)
018800110729     A* Nazione Mittente
018900110729     A            PD1NZM    R        O   144
019000110729     A                                      REFFLD(TMDNZM TNTMD00F)
019100110729     A* C.A.P. Destinatario
019200110729     A            PD1CAD    R        O   150
019300110729     A                                      REFFLD(TMDCAD TNTMD00F)
019400110729     A* Località Destinatario
019500110729     A            PD1LOD    R   30   O   160
019600110729     A                                      REFFLD(TMDLOD TNTMD00F)
019700110729     A* Provincia Destinatario
019800110729     A            PD1PRD    R        O   191
019900110729     A                                      REFFLD(TMDPRD TNTMD00F)
020000110729     A* Nazione Destinatario
020100110729     A            PD1NZD    R        O   194
020200110729     A                                      REFFLD(TMDNZD TNTMD00F)
020300110729     A*%%***********************************************************************
020400110729     A*%%SS
020500110729     A*%%CL 001
020600110729     A*%%CL 001
020700110729     A*%%***********************************************************************
020800110729      *----------------------------------------------------------------
020900110729     A          R DN77PD2
021000110729     A*%%***********************************************************************
021100110729     A*%%RI 00000
021200110729     A*%%***********************************************************************
021300110729     A                                      SPACEB(001)
021400110729     A                                    44
021500110729     A                                      'Quantita'' in bolla   '
021600110729     A* Colli in bolla
021700110729     A                                    68
021800110729     A                                      'Colli'
021900110729     A            PD2NCL    R        O    74
022000110729     A                                      REFFLD(TASNCL TITAS00F)
022100110729     A                                      EDTCDE(2)
022200110729     A                                    84
022300110729     A                                      'Kg'
022400110729     A            PD2PKF    R        O    87
022500110729     A                                      REFFLD(TASPKF TITAS00F)
022600110729     A                                      EDTCDE(2)
022700110729     A* Evento
022800110729     A  03                               128
022900110729     A                                      'Evento'
023000110729     A  03        PD2KEV        12A  O   135
023100110729     A  03        PD2TAE        35A  O   150
023200110729     A*%%***********************************************************************
023300110729     A*%%SS
023400110729     A*%%***********************************************************************
023500110729      *----------------------------------------------------------------
023600110729     A          R DN77PD3
023700110729     A*%%***********************************************************************
023800110729     A*%%RI 00000
023900110729     A*%%***********************************************************************
024000110729     A                                      SPACEB(001)
024100110729     A                                    44
024200110729     A                                      'Quantita'' danneggiate'
024300110729     A* Colli danneggiati/mancanti
024400110729     A                                    68
024500110729     A                                      'Colli'
024600110729     A            PD3NCN    R        O    74
024700110729     A                                      REFFLD(DCTNCN FNDCT00F)
024800110729     A                                      EDTCDE(2)
024900110729     A* Peso Kg danneggiati/mancanti
025000110729     A                                    84
025100110729     A                                      'Kg'
025200110729     A            PD3PKD    R        O    87
025300110729     A                                      REFFLD(DCTPKD FNDCT00F)
025400110729     A                                      EDTCDE(2)
025500110729     A* Pezzi danneggiati/mancanti
025600110729     A                                   100
025700110729     A                                      'Pezzi'
025800110729     A            PD3NPZ    R        O   106
025900110729     A                                      REFFLD(DCTNPZ FNDCT00F)
026000110729     A                                      EDTCDE(2)
026100110729     A            PD3DPZ        35A  O   128
026200110729     A*%%***********************************************************************
026300110729     A*%%SS
026400110729     A*%%***********************************************************************
026500110729      *----------------------------------------------------------------
026600110729     A          R DN77PD4
026700110729     A*%%***********************************************************************
026800110729     A*%%RI 00000
026900110729     A*%%***********************************************************************
027000110729     A                                      SPACEB(001)
027100110729     A* Anomalia
027200110729     A                                    44
027300110729     A                                      'Tipo anomalia'
027400110729     A            PD4TAD    R        O   +11
027500110729     A                                      REFFLD(§TADDESC DTAD)
027600110729     A* Note
027700110729     A            PD4DAN    R        O    94
027800110729     A                                      REFFLD(DCSNOT FNDCS00F)
027900110729     A            PD4KOS        70A  O   129
028000110729     A*%%***********************************************************************
028100110729     A*%%SS
028200110729     A*%%***********************************************************************
028300110729      *----------------------------------------------------------------
028400110729     A          R DN77PD5
028500110729     A*%%***********************************************************************
028600110729     A*%%RI 00000
028700110729     A*%%***********************************************************************
028800110729     A                                      SPACEB(001)
028900110729     A* Importo rimborsato
029000110729     A                                    44
029100110729     A                                      'Importo rimborsato'
029200110729     A            PD5IPR        25A  O    68
029300110729     A* Causale di chiusura
029400110729     A  04                               100
029500110729     A                                      'Causale chiusura'
029600110729     A  04        PD5CCH    R        O    +3
029700110729     A                                      REFFLD(DCTCCH FNDCT00F)
029800110729     A  04        PD5CCD    R        O   128
029900110729     A                                      REFFLD(§CCHDESC DCCH)
030000110729     A*%%***********************************************************************
030100110729     A*%%SS
030200110729     A*%%***********************************************************************
030300110729      *----------------------------------------------------------------
030400110729     A          R DN77P1
030500110729     A*%%***********************************************************************
030600110729     A*%%RI 00000
030700110729     A*%%***********************************************************************
030800110729     A                                      SPACEB(001)
030900110729     A                                     1
031000110729     A                                      '                                  -
031100110729     A                                               - - - - - - - - - - - - - -
031200110729     A                                      - - - - - - - - - - - - - - - - - --
031300110729     A                                       - - - - - - - - - - - - - - - - - -
031400110729     A                                      - - - - - - - - - - - - - - - - - --
031500110729     A                                       - - - - - - - - - - - -'
031600110729     A*%%***********************************************************************
031700110729     A*%%SS
031800110729     A*%%***********************************************************************
031900110729      *----------------------------------------------------------------
032000110729     A          R DN77PE
032100110729     A*%%***********************************************************************
032200110729     A*%%RI 00000
032300110729     A*%%FS 001
032400110729     A*%%***********************************************************************
032500110729     A                                      SPACEB(002)
032600110729     A                                    68
032700110729     A                                      '***  FINE  STAMPA  ***'
032800110729     A                                      HIGHLIGHT
032900110729     A*%%***********************************************************************
033000110729     A*%%SS
033100110729     A*%%CP+999CRTPRTF
033200110729     A*%%CP+    FILE(GAITRAFIL/FIDN77P)
033300110729     A*%%CP+    DEVTYPE(*SCS)
033400110729     A*%%CP     PAGESIZE(*N       198      *N     )
033500110729     A*%%***********************************************************************
