000100951009     H DECEDIT('0,') DATEDIT(*DMY.)
000200980625      * ---------------------------------------------------------
000300990820     D KPJBA         E DS
000400990820     D fidn11ds      E DS
000500980625      * ---------------------------------------------------------
000600990820     c                   clear                   fidn11ds
000700000511     c                   movel     flag          i11mod
000800000511     c                   move      anno          i11aac
000900000511     c                   move      lnp           i11fil
001000000511     c                   move      nca           i11nca
001100990820     c                   call      'FIDN11R'
001200990820     c                   parm                    kpjba
001300990820     c                   parm                    fidn11ds
001400990908     c*
001500000511    1c                   seton                                        lr
001600980722      *****************************************************************
001700980623      *  ROUTINE INIZIALE
001800980722      *****************************************************************
001900951009     C     *INZSR        BEGSR
002000000511     c     *entry        plist
002100000511     c                   parm                    anno              4
002200000511     c                   parm                    lnp               3
002300000511     c                   parm                    nca               7
002400000511     c                   parm                    flag              1
002500951009     C                   ENDSR
