000001140925     A*%%***********************************************************************
000002140925     A*%%TS  RD  20140925  140636  EDPMB       REL-V7R1M0  5770-WDS
000003140925     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004140925     A*%%FI       0000000000000000000000000000000000000000000000000
000005140925     A*%%***********************************************************************
000006140925      *---------------------------------------------------------------*
000007140925      *  STAMPA ELENCO C.A.
000008140925      *---------------------------------------------------------------*
000009140925      *      COMPILARE CON:     PAGESIZE(66 198)
000010140925      *                         CPI(15)
000011140925      *---------------------------------------------------------------*
000012140925      * ?  T E S T A T A    D I    S T A M P A  ?
000013140925     A          R DND3T1
000014140925     A*%%***********************************************************************
000015140925     A*%%RI 00000
000016140925     A*%%FS 001
000017140925     A*%%***********************************************************************
000018140925     A                                      SKIPB(002)
000019140925     A            RSUT          20A        1
000020140925     A                                    75
000021140925     A                                      HIGHLIGHT
000022140925     A                                      'Statistica Richiesta Assistenza Cl-
000023140925     A                                      ienti per Cliente'
000024140925     A                                   155
000025140925     A                                      'FNDND3R'
000026140925     A            WDATE          8S 0    171
000027140925     A                                      EDTWRD('  /  /    ')
000028140925     A                                   191
000029140925     A                                      'PAG.'
000030140925     A                                   195
000031140925     A                                      PAGNBR
000032140925     A                                      EDTCDE(Z)
000033140925     A*%%***********************************************************************
000034140925     A*%%SS
000035140925     A*%%***********************************************************************
000036140925      *---------------------------------------------------------------*
000037140925     A          R DND3TS
000038140925     A*%%***********************************************************************
000039140925     A*%%RI 00000
000040140925     A*%%***********************************************************************
000041140925     A                                      SPACEB(001)
000042140925     A            KNSIF     R              1
000043140925     A                                      REFFLD(KNSIF KPJBA)
000044140925     A            KNMUS     R             12
000045140925     A                                      REFFLD(KNMUS KPJBA)
000046140925     A            WORA           6S 0    171
000047140925     A                                      EDTWRD('  :  :  ')
000048140925     A*%%***********************************************************************
000049140925     A*%%SS
000050140925     A*%%***********************************************************************
000051140925      *---------------------------------------------------------------*
000052140925     A          R DND302
000053140925     A*%%***********************************************************************
000054140925     A*%%RI 00000
000055140925     A*%%***********************************************************************
000056140925     A                                      SPACEB(001)
000057140925     A                                      SPACEA(013)
000058140925     A                                    12
000059140925     A                                      '--- Selezioni sulle Richieste Assi-
000060140925     A                                      stenza Clienti ---'
000061140925     A                                      SPACEB(001)
000062140925     A                                      HIGHLIGHT
000063140925     A                                    12
000064140925     A                                      'Tipo scelta .................:'
000065140925     A                                      SPACEB(002)
000066140925     A            ID2SCE         1A  O    +2
000067140925     A            DESSCE        25A  O    +7
000068140925     A                                    12
000069140925     A                                      'Cliente .....................:'
000070140925     A                                      SPACEB(001)
000071140925     A            ID2KSC         7S 0O    +2
000072140925     A                                      EDTCDE(Z)
000073140925     A            ID2RAG        40A  O    +1
000074140925     A  17                                52
000075140925     A                                      'Dettaglio suddiviso per figlio'
000076140925     A                                      SPACEB(001)
000077140925     A                                    12
000078140925     A                                      'P.O.     Responsabile .......:'
000079140925     A                                      SPACEB(002)
000080140925     A            ID2PRS         3S 0O    +2
000081140925     A                                      EDTCDE(Z)
000082140925     A            DESPRS        25A  O    +5
000083140925     A                                    12
000084140925     A                                      'P.O. di Apertura ............:'
000085140925     A                                      SPACEB(002)
000086140925     A            ID2FIL         3S 0O    +2
000087140925     A                                      EDTCDE(Z)
000088140925     A            DESFIL        25A  O    +5
000089140925     A                                    12
000090140925     A                                      'Data Richiesta .........: dal:'
000091140925     A                                      SPACEB(002)
000092140925     A            ID2DCD         8S 0O    +2
000093140925     A                                      EDTWRD('  /  /    ')
000094140925     A                                    +2
000095140925     A                                      'al'
000096140925     A            ID2DCA         8S 0O    +1
000097140925     A                                      EDTWRD('  /  /    ')
000098140925     A                                    12
000099140925     A                                      'Data Chiusura ..........: dal:'
000100140925     A                                      SPACEB(002)
000101140925     A            ID2DHD         8S 0O    +2
000102140925     A                                      EDTWRD('  /  /    ')
000103140925     A                                    +2
000104140925     A                                      'al'
000105140925     A            ID2DHA         8S 0O    +1
000106140925     A                                      EDTWRD('  /  /    ')
000107140925     A                                    12
000108140925     A                                      'Tipo Comunicazione ..........:'
000109140925     A                                      SPACEB(002)
000110140925     A            ID2TC1         1A  O    +2
000111140925     A            ID2TC2         1A  O    +2
000112140925     A            ID2TC3         1A  O    +2
000113140925     A            ID2TC4         1A  O    +2
000114140925     A                                    12
000115140925     A                                      'Motivo Apertura .............:'
000116140925     A                                      SPACEB(002)
000117140925     A            ID2MA1         3A  O    +2
000118140925     A            ID2MA2         3A  O    +2
000119140925     A            ID2MA3         3A  O    +2
000120140925     A            ID2MA4         3A  O    +2
000121140925     A            ID2MA5         3A  O    +2
000122140925     A            ID2MA6         3A  O    +2
000123140925     A            ID2MA7         3A  O    +2
000124140925     A            ID2MA8         3A  O    +2
000125140925     A                                    12
000126140925     A                                      'Codice Chiusura .............:'
000127140925     A                                      SPACEB(002)
000128140925     A            ID2CC1         3A  O    +2
000129140925     A            ID2CC2         3A  O    +2
000130140925     A            ID2CC3         3A  O    +2
000131140925     A                                    12
000132140925     A                                      'Solo le aperte ..............:'
000133140925     A                                      SPACEB(002)
000134140925     A            ID2SRA         1A  O    +2
000135140925     A                                    12
000136140925     A                                      '-------------- Opzioni di Stampa --
000137140925     A                                      -------------  '
000138140925     A                                      HIGHLIGHT
000139140925     A                                      SPACEB(006)
000140140925     A                                    12
000141140925     A                                      'Solo Totali .................:'
000142140925     A                                      SPACEB(002)
000143140925     A            ID2TOT         1A  O    +2
000144140925     A                                    12
000145140925     A                                      'Stampa Note .................:'
000146140925     A                                      SPACEB(002)
000147140925     A            ID2NOT         1A  O    +2
000148140925     A                                    12
000149140925     A                                      SPACEB(002)
000150140925     A                                      'Stampo P.O. responsabile ....:'
000151140925     A            ID2POR         1A  O    +2
000152140925     A*%%***********************************************************************
000153140925     A*%%SS
000154140925     A*%%CL 001
000155140925     A*%%CL 002
000156140925     A*%%CL 001
000157140925     A*%%CL 001
000158140925     A*%%CL 002
000159140925     A*%%CL 002
000160140925     A*%%CL 002
000161140925     A*%%CL 002
000162140925     A*%%CL 002
000163140925     A*%%CL 002
000164140925     A*%%CL 002
000165140925     A*%%CL 002
000166140925     A*%%CL 006
000167140925     A*%%CL 002
000168140925     A*%%CL 002
000169140925     A*%%CL 002
000170140925     A*%%CL 013
000171140925     A*%%***********************************************************************
000172140925      *---------------------------------------------------------------*
000173140925     A          R DND3T2
000174140925     A*%%***********************************************************************
000175140925     A*%%RI 00000
000176140925     A*%%***********************************************************************
000177140925     A                                    67
000178140925     A                                      'Data'
000179140925     A                                      SPACEB(001)
000180140925     A                                   +20
000181140925     A                                      'Destinatario (Ritirante)'
000182140925     A                                   130
000183140925     A                                      'Chi'
000184140925     A                                    +4
000185140925     A                                      'Motivo'
000186140925     A                                    +4
000187140925     A                                      'Causale'
000188140925     A N16                                +5
000189140925     A                                      'P.O.'
000190140925     A                                     2
000191140925     A                                      'Anno P.O.  Numero/Prg Dt.Richiesta'
000192140925     A                                      SPACEB(001)
000193140925     A                                    37
000194140925     A                                      '-------- Oggetto ---------'
000195140925     A                                    +1
000196140925     A                                      'Sped.(ORM)'
000197140925     A                                    +5
000198140925     A                                      'Riferimento'
000199140925     A                                    +1
000200140925     A                                      'Località Destino (Ritiro)'
000201140925     A                                    +6
000202140925     A                                      'Prov'
000203140925     A                                   129
000204140925     A                                      'Chiama'
000205140925     A                                    +2
000206140925     A                                      'Apertura'
000207140925     A                                    +2
000208140925     A                                      'Chiusura'
000209140925     A N16                                +4
000210140925     A                                      'Resp.'
000211140925     A N18                               +13
000212140925     A                                      'Note'
000213140925     A*%%***********************************************************************
000214140925     A*%%SS
000215140925     A*%%CL 001
000216140925     A*%%CL 001
000217140925     A*%%***********************************************************************
000218140925      *---------------------------------------------------------------*
000219140925      * ?  R I G A    D I    S E P A R A Z I O N E  ?
000220140925     A          R DND3T3
000221140925     A*%%***********************************************************************
000222140925     A*%%RI 00000
000223140925     A*%%***********************************************************************
000224140925     A                                      SPACEB(001)
000225140925     A                                     1
000226140925     A                                      '-----------------------------------
000227140925     A                                      ------------------------------------
000228140925     A                                      ------------------------------------
000229140925     A                                      ------------------------------------
000230140925     A                                      ------------------------------------
000231140925     A                                      ------------------------'
000232140925     A*%%***********************************************************************
000233140925     A*%%SS
000234140925     A*%%***********************************************************************
000235140925      *---------------------------------------------------------------*
000236140925      * ?  INTESTAZIONE CLIENTE                    ?
000237140925     A          R DND3T5
000238140925     A*%%***********************************************************************
000239140925     A*%%RI 00000
000240140925     A*%%***********************************************************************
000241140925     A                                      SPACEB(001)
000242140925     A                                     1
000243140925     A                                      'CLIENTE '
000244140925     A            CODCLI         7S 0O    +1
000245140925     A                                      EDTCDE(Z)
000246140925     A            RAGCLI        45A  O    +1
000247140925     A                                      HIGHLIGHT
000248140925     A*%%***********************************************************************
000249140925     A*%%SS
000250140925     A*%%***********************************************************************
000251140925      *---------------------------------------------------------------*
000252140925     A          R DND3D03
000253140925     A*%%***********************************************************************
000254140925     A*%%RI 00000
000255140925     A*%%***********************************************************************
000256140925     A                                      SPACEB(001)
000257140925     A            TGDANT    R        O     2
000258140925     A                                      SPACEB(001)
000259140925     A                                      REFFLD(TGDANT FITGD00F)
000260140925     A            TGDPOT    R        O    +1
000261140925     A                                      REFFLD(TGDPOT FITGD00F)
000262140925     A            TGDNUT    R        O    +0
000263140925     A                                      REFFLD(TGDNUT FITGD00F)
000264140925     A                                      EDTCDE(Z)
000265140925     A                                    +0
000266140925     A                                      '/'
000267140925     A            TGDPDT    R        O    +0
000268140925     A                                      REFFLD(TGDPDT FITGD00F)
000269140925     A                                      EDTCDE(Z)
000270140925     A            P3CDAC         8S 0O    +1
000271140925     A                                      EDTWRD('  /  /    ')
000272140925     A            P3COGG        26A  O    +3
000273140925     A            DTAOGG         8S 0O    +1
000274140925     A                                      EDTCDE(8)
000275140925     A            RIFERI        15A  O    +1
000276140925     A            DESTIN        35A  O    +1
000277140925     A            DECTCH    R    7   O    +2
000278140925     A                                      REFFLD(TGDTCH FITGD00F)
000279140925     A            DECMAD    R   10   O    +1
000280140925     A                                      REFFLD(TGDCDT FITGD00F)
000281140925     A            DECCDT        11A  O    +1
000282140925     A N16        TGDPOR    R        O    +1
000283140925     A                                      REFFLD(TGDPOR FITGD00F)
000284140925     A            P3CNO1        35A  O    +2
000285140925     A*%%***********************************************************************
000286140925     A*%%SS
000287140925     A*%%CL 001
000288140925     A*%%***********************************************************************
000289140925      *---------------------------------------------------------------*
000290140925     A          R DND3D04
000291140925     A*%%***********************************************************************
000292140925     A*%%RI 00000
000293140925     A*%%***********************************************************************
000294140925     A                                      SPACEB(001)
000295140925     A  15        LOCDES        32A  O    91
000296140925     A  15        PRODES         2A  O    +1
000297140925     A            P3CNO2        35A  O   164
000298140925     A*%%***********************************************************************
000299140925     A*%%SS
000300140925     A*%%***********************************************************************
000301140925     A          R DND3TT
000302140925     A*%%***********************************************************************
000303140925     A*%%RI 00000
000304140925     A*%%FS 001
000305140925     A*%%***********************************************************************
000306140925     A                                      SPACEB(002)
000307140925     A                                    36
000308140925     A                                      '|'
000309140925     A                                      HIGHLIGHT
000310140925     A                                    41
000311140925     A                                      'APERTE'
000312140925     A                                      HIGHLIGHT
000313140925     A                                    +2
000314140925     A                                      '|'
000315140925     A                                      HIGHLIGHT
000316140925     A                                    +3
000317140925     A                                      '|'
000318140925     A                                      HIGHLIGHT
000319140925     A                                   +24
000320140925     A                                      'CHIUSE'
000321140925     A                                      HIGHLIGHT
000322140925     A                                   +22
000323140925     A                                      '|'
000324140925     A                                      HIGHLIGHT
000325140925     A                                    +3
000326140925     A                                      '|'
000327140925     A                                      HIGHLIGHT
000328140925     A                                   +11
000329140925     A                                      'CHI CHIAMA'
000330140925     A                                      HIGHLIGHT
000331140925     A                                   +17
000332140925     A                                      '|'
000333140925     A                                      HIGHLIGHT
000334140925     A                                    31
000335140925     A                                      '     |------------|   |------------
000336140925     A                                      ------------------------------------
000337140925     A                                      ------|'
000338140925     A                                      SPACEB(001)
000339140925     A                                      HIGHLIGHT
000340140925     A                                    +3
000341140925     A                                      '|----------------------------------
000342140925     A                                      -----|'
000343140925     A                                      HIGHLIGHT
000344140925     A                                    36
000345140925     A                                      '|'
000346140925     A                                      SPACEB(001)
000347140925     A                                      HIGHLIGHT
000348140925     A                                    49
000349140925     A                                      '|'
000350140925     A                                      HIGHLIGHT
000351140925     A                                    +3
000352140925     A                                      '|'
000353140925     A                                      HIGHLIGHT
000354140925     A                                   +15
000355140925     A                                      '|'
000356140925     A                                      HIGHLIGHT
000357140925     A                                   +36
000358140925     A                                      '|'
000359140925     A                                      HIGHLIGHT
000360140925     A                                    +3
000361140925     A                                      '|'
000362140925     A                                      HIGHLIGHT
000363140925     A                                   +38
000364140925     A                                      '|'
000365140925     A                                      HIGHLIGHT
000366140925     A                                    36
000367140925     A                                      '|'
000368140925     A                                      SPACEB(001)
000369140925     A                                      HIGHLIGHT
000370140925     A                                    49
000371140925     A                                      '|'
000372140925     A                                      HIGHLIGHT
000373140925     A                                    +3
000374140925     A                                      '|'
000375140925     A                                      HIGHLIGHT
000376140925     A                                    +1
000377140925     A                                      'TOTALE'
000378140925     A                                      HIGHLIGHT
000379140925     A                                    +1
000380140925     A                                      '|'
000381140925     A                                      HIGHLIGHT
000382140925     A                                    +4
000383140925     A                                      '%'
000384140925     A                                      HIGHLIGHT
000385140925     A                                    +1
000386140925     A                                      '|'
000387140925     A                                      HIGHLIGHT
000388140925     A                                    +1
000389140925     A                                      'Fondate'
000390140925     A                                      HIGHLIGHT
000391140925     A                                    +1
000392140925     A                                      '|'
000393140925     A                                      HIGHLIGHT
000394140925     A                                    +2
000395140925     A                                      'Infondate'
000396140925     A                                      HIGHLIGHT
000397140925     A                                    +1
000398140925     A                                      '|'
000399140925     A                                      HIGHLIGHT
000400140925     A                                    +1
000401140925     A                                      'Informative'
000402140925     A                                      HIGHLIGHT
000403140925     A                                    +1
000404140925     A                                      '|'
000405140925     A                                      HIGHLIGHT
000406140925     A                                    +3
000407140925     A                                      '|'
000408140925     A                                      HIGHLIGHT
000409140925     A                                    +1
000410140925     A                                      'Mitt./Cliente'
000411140925     A                                      HIGHLIGHT
000412140925     A                                    +1
000413140925     A                                      '|'
000414140925     A                                      HIGHLIGHT
000415140925     A                                    +0
000416140925     A                                      'Destinatario'
000417140925     A                                      HIGHLIGHT
000418140925     A                                    +1
000419140925     A                                      '|'
000420140925     A                                      HIGHLIGHT
000421140925     A                                    +2
000422140925     A                                      'Altro'
000423140925     A                                      HIGHLIGHT
000424140925     A                                    +1
000425140925     A                                      '|'
000426140925     A                                      HIGHLIGHT
000427140925     A*%%***********************************************************************
000428140925     A*%%SS
000429140925     A*%%CL 001
000430140925     A*%%CL 001
000431140925     A*%%CL+001
000432140925     A*%%CL                   e
000433140925     A*%%***********************************************************************
000434140925      * ?  R I G A    D I    S E P A R A Z I O N E  ?
000435140925     A          R DND3T3B
000436140925     A*%%***********************************************************************
000437140925     A*%%RI 00000
000438140925     A*%%***********************************************************************
000439140925     A                                      SPACEB(001)
000440140925     A                                     1
000441140925     A                                      '-----------------------------------
000442140925     A                                      ---------------   ------------------
000443140925     A                                      ------------------------------------
000444140925     A                                      --   -------------------------------
000445140925     A                                      ------------------------------------
000446140925     A                                      ------------------------'
000447140925     A*%%***********************************************************************
000448140925     A*%%SS
000449140925     A*%%***********************************************************************
000450140925      *---------------------------------------------------------------*
000451140925     A          R DND3DT2
000452140925     A*%%***********************************************************************
000453140925     A*%%RI 00000
000454140925     A*%%***********************************************************************
000455140925     A                                      SPACEB(001)
000456140925     A            PTCDES        30A  O     1
000457140925     A                                      SPACEB(001)
000458140925     A  10                                  HIGHLIGHT
000459140925     A            PTTOTA         7S 0O    +9
000460140925     A                                      EDTCDE(Z)
000461140925     A                                    +4
000462140925     A                                      '|'
000463140925     A                                      HIGHLIGHT
000464140925     A            PCTOTCH        7S 0O    +2
000465140925     A                                      EDTCDE(Z)
000466140925     A  11        PCPERM         4S 1O    +2
000467140925     A                                      EDTWRD(' 0 , ')
000468140925     A            PTTOTF         7S 0O    +3
000469140925     A                                      EDTCDE(Z)
000470140925     A            PTTOTN         7S 0O    +6
000471140925     A                                      EDTCDE(Z)
000472140925     A            PTTOTI         7S 0O    +7
000473140925     A                                      EDTCDE(Z)
000474140925     A                                    +3
000475140925     A                                      '|'
000476140925     A                                      HIGHLIGHT
000477140925     A            PTTOMC         7S 0O    +9
000478140925     A                                      EDTCDE(Z)
000479140925     A            PTTOTD         7S 0O    +7
000480140925     A                                      EDTCDE(Z)
000481140925     A            PTTOTX         7S 0O    +2
000482140925     A                                      EDTCDE(Z)
000483140925     A                                    +1
000484140925     A                                      '|'
000485140925     A                                      HIGHLIGHT
000486140925     A*%%***********************************************************************
000487140925     A*%%SS
000488140925     A*%%CL 001
000489140925     A*%%***********************************************************************
000490140925      *---------------------------------------------------------------*
000491140925     A          R DND3DT4
000492140925     A*%%***********************************************************************
000493140925     A*%%RI 00000
000494140925     A*%%***********************************************************************
000495140925     A                                      SPACEB(001)
000496140925     A                                    51
000497140925     A                                      '|'
000498140925     A                                      SPACEB(001)
000499140925     A                                      HIGHLIGHT
000500140925     A  20        TCFPER         4S 1O    72
000501140925     A                                      EDTWRD(' 0 , ')
000502140925     A  20                                +0
000503140925     A                                      '%'
000504140925     A  21        TIFPER         4S 1O    +7
000505140925     A                                      EDTWRD(' 0 , ')
000506140925     A  21                                +0
000507140925     A                                      '%'
000508140925     A  22        TINPER         4S 1O    +8
000509140925     A                                      EDTWRD(' 0 , ')
000510140925     A  22                                +0
000511140925     A                                      '%'
000512140925     A                                    +3
000513140925     A                                      '|'
000514140925     A                                      HIGHLIGHT
000515140925     A  23        MCLPER         4S 1O   +10
000516140925     A                                      EDTWRD(' 0 , ')
000517140925     A  23                                +0
000518140925     A                                      '%'
000519140925     A  24        DESPER         4S 1O    +8
000520140925     A                                      EDTWRD(' 0 , ')
000521140925     A  24                                +0
000522140925     A                                      '%'
000523140925     A  26        ALTPER         4S 1O    +3
000524140925     A                                      EDTWRD(' 0 , ')
000525140925     A  26                                +0
000526140925     A                                      '%'
000527140925     A                                    +1
000528140925     A                                      '|'
000529140925     A                                      HIGHLIGHT
000530140925     A*%%***********************************************************************
000531140925     A*%%SS
000532140925     A*%%CL 001
000533140925     A*%%***********************************************************************
000534140925      *---------------------------------------------------------------*
000535140925     A          R DND3DT3
000536140925     A*%%***********************************************************************
000537140925     A*%%RI 00000
000538140925     A*%%***********************************************************************
000539140925     A                                      SPACEB(001)
000540140925     A                                     1
000541140925     A                                      SPACEB(001)
000542140925     A                                      'M O T I V O   A P E R T U R A '
000543140925     A                                      HIGHLIGHT
000544140925     A                                   +20
000545140925     A                                      '|'
000546140925     A                                      HIGHLIGHT
000547140925     A                                   +56
000548140925     A                                      '|'
000549140925     A                                      HIGHLIGHT
000550140925     A                                   +40
000551140925     A                                      '|'
000552140925     A                                      HIGHLIGHT
000553140925     A*%%***********************************************************************
000554140925     A*%%SS
000555140925     A*%%CL 001
000556140925     A*%%***********************************************************************
000557140925      *---------------------------------------------------------------*
000558140925     A          R DND3LE3
000559140925     A*%%***********************************************************************
000560140925     A*%%RI 00000
000561140925     A*%%***********************************************************************
000562140925     A                                     2
000563140925     A                                      'Leggenda:'
000564140925     A                                      SPACEB(003)
000565140925     A                                      HIGHLIGHT
000566140925     A                                     2
000567140925     A                                      'Le percentuali relative alle colon-
000568140925     A                                      ne delle "CHIUSE" Fondate Infondate-
000569140925     A                                       e Info sono calcolate rispetto al -
000570140925     A                                      Totale Richieste Assistenza Clienti-
000571140925     A                                       CHIUSE del periodo'
000572140925     A                                      SPACEB(001)
000573140925     A                                     2
000574140925     A                                      'Le percentuali relative alle colon-
000575140925     A                                      ne del "CHI CHIAMA" sono calcolate -
000576140925     A                                      rispetto al Totale Richieste Assist-
000577140925     A                                      enza Clienti APERTE + Totale CHIUSE-
000578140925     A                                       del periodo.'
000579140925     A                                      SPACEB(001)
000580140925     A*%%***********************************************************************
000581140925     A*%%SS
000582140925     A*%%CL 003
000583140925     A*%%CL 001
000584140925     A*%%CL 001
000585140925     A*%%CP+999CRTPRTF
000586140925     A*%%CP+    FILE(GAITRAFIL/FIDND3P)
000587140925     A*%%CP+    DEVTYPE(*SCS)
000588140925     A*%%CP+    PAGESIZE(*N 198)
000589140925     A*%%CP     CPI(15)
000590140925     A*%%CS+999CRTPRTF
000591140925     A*%%CS+    FILE(QTEMP/QPRDRPT)
000592140925     A*%%CS+    DEVTYPE(*SCS)
000593140925     A*%%CS     PAGESIZE(*N 198)
000594140925     A*%%***********************************************************************
000595140925      *---------------------------------------------------------------*
000596140925      *---------------------------------------------------------------*
