000100050719     A*%%TS  SD  20050719  143549  EDPGA       REL-V4R4M0  5769-PW1
000200970224     A*---------------------------------------------------------------*
000300050719     A*%%EC
000400050719     A                                      DSPSIZ(24 80 *DS3)
000500050719     A                                      CHGINPDFT(HI UL)
000600050719     A                                      PRINT
000700990503     A          R FI59T01
000800990503     A*%%TS  SD  19990503  103239  EDPND       REL-V4R2M0  5769-PW1
000900990503     A            RSUT          20A  O  1  2
001000990503     A            VTCTIT        34A  O  1 25DSPATR(RI)
001100990503     A                                      DSPATR(UL)
001200990503     A            VTCPGM        10A  O  1 61
001300990503     A                                  1 72DATE
001400990503     A                                      EDTCDE(Y)
001500990503     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
001600990503     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
001700990503     A                                  2 72TIME
001800000314     A          R FI59D01
001900000314     A*%%TS  SD  20000314  163253  EDPGA       REL-V4R2M0  5769-PW1
002000000314     A                                      CF03
002100000314     A                                      OVERLAY
002200000314     A  28        V1CMSG        78   M
002300000314     A                                  7  2'Comunicazione Anomalia.....:'
002400000314     A                                  7 31'P.O.'
002500000314     A            V1CFIL         3Y 0B  7 37CHECK(RZ)
002600000314     A  36                                  DSPATR(PC)
002700000314     A                                      EDTCDE(Z)
002800000314     A                                  7 43'Numero'
002900000314     A            V1CNCA         7Y 0B  7 51EDTCDE(Z)
003000000314     A                                      CHECK(RB)
003100000314     A                                  7 61'Anno'
003200000314     A            V1CAAC         4Y 0B  7 67CHECK(RB)
003300000314     A                                      EDTCDE(Z)
003400000314     A          R FI59Z01
003500000314     A*%%TS  SD  20000314  163253  EDPGA       REL-V4R2M0  5769-PW1
003600000314     A                                      OVERLAY
003700000314     A                                 24  2'F3=Fine'
003800050719     A          R FI59T02
003900050719     A*%%TS  SD  20050719  125615  EDPGA       REL-V4R4M0  5769-PW1
004000050719     A            RSUT          20A  O  1  2
004100050719     A            VTCTIT        34A  O  1 25DSPATR(RI)
004200050719     A                                      DSPATR(UL)
004300050719     A            VTCPGM        10A  O  1 61
004400050719     A                                  1 72DATE
004500050719     A                                      EDTCDE(Y)
004600050719     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004700050719     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004800050719     A                                  2 72TIME
004900050719     A                                  4  2'C.A.      :'
005000050719     A                                      DSPATR(UL)
005100050719     A            VTCFIL         3S 0O  4 14
005200050719     A            VTCNCA         7Y 0O  4 18EDTCDE(Z)
005300050719     A                                  4 31'del'
005400050719     A            VTCDC1         8Y 0O  4 35EDTCDE(8)
005500050719     A                                  4 46'ANOMALIA:'
005600050719     A                                      DSPATR(UL)
005700050719     A            VTCTAD         2A  O  4 56DSPATR(HI)
005800050719     A            VTDTAD        22A  O  4 59DSPATR(HI)
005900050719     A                                  5  2'SPEDIZIONE:'
006000050719     A                                      DSPATR(UL)
006100050719     A            VTCLNP         3S 0O  5 14
006200050719     A            VTCNRS         2Y 0O  5 18EDTCDE(Z)
006300050719     A                                  5 21'-'
006400050719     A            VTCNSP         7Y 0O  5 23EDTCDE(Z)
006500050719     A                                  5 31'del'
006600050719     A            VTCDSP         8Y 0O  5 35EDTCDE(8)
006700050719     A                                  5 46'LINEA ARRIVO :'
006800050719     A                                      DSPATR(UL)
006900050719     A            VTCLNA         3S 0O  5 61
007000050719     A            VTDLNA        16A  O  5 65
007100050719     A  10                              6  2'CHIUSA IL :'
007200050719     A                                      DSPATR(UL)
007300050719     A  10        VTDCCH        50A  O  6 31
007400050719     A  01                              7  2'EVENTO    :'
007500050719     A                                      DSPATR(UL)
007600051014     A  01        VTCNEV         7Y 0O  7 14
007700051014     A                                      EDTCDE(Z)
007800050719     A  01        VTCAAE         4S 0O  7 23
007900050719     A  01                              7 31'del'
008000050719     A  01        VTCDEV         8Y 0O  7 35EDTCDE(8)
008100050719     A  02                              7 46'NUM. PRATICA :'
008200050719     A                                      DSPATR(UL)
008300050719     A  02        VTCDIT         3A  O  7 61
008400050719     A  02        VTCPRN         7S 0O  7 65
008500050719     A  02        VTCPRA         4S 0O  7 73
008600050719     A                                  8  2'-----------------------------------
008700050719     A                                      ------------------------------------
008800050719     A                                      ----------'
008900050719     A                                  9  2'Mitt.'
009000050719     A            VTCKSM         7Y 0O  9  8EDTCDE(Z)
009100050719     A            VTCRSM        25A  O  9 16DSPATR(UL)
009200050719     A                                  9 42'Dest.'
009300050719     A            VTCKSD         7Y 0O  9 48EDTCDE(Z)
009400050719     A            VTCRSD        25A  O  9 56DSPATR(UL)
009500050719     A            VTCCAM         9A  O 10  6DSPATR(UL)
009600050719     A            VTCLOM        18A  O 10 16DSPATR(UL)
009700050719     A            VTCPRM         2A  O 10 35DSPATR(UL)
009800050719     A            VTCNAM         3A  O 10 38DSPATR(UL)
009900050719     A            VTCCAD         9A  O 10 46DSPATR(UL)
010000050719     A            VTCLOD        18A  O 10 56DSPATR(UL)
010100050719     A            VTCPRD         2A  O 10 75DSPATR(UL)
010200050719     A            VTCNAD         3A  O 10 78DSPATR(UL)
010300050719     A                                 11  2'Imp.Ass.'
010400050719     A            VTCIAS        13Y 3O 11 11EDTCDE(3)
010500050719     A            VTCVAS         3A  O 11 26
010600050719     A            VTDCBO         9A  O 11 31
010700050719     A                                 11 43'Colli'
010800050719     A            VTCNCL         5Y 0O 11 49EDTCDE(Z)
010900050719     A                                      DSPATR(UL)
011000050719     A                                 11 56'Kg'
011100050719     A            VTCPKF         7Y 1O 11 59EDTCDE(4)
011200050719     A                                      DSPATR(UL)
011300050719     A                                 11 70'Mc'
011400050719     A            VTCFVF         1A  O 11 73DSPATR(UL)
011500050719     A            VTCVLF         5Y 3O 11 75EDTCDE(4)
011600050719     A                                      DSPATR(UL)
011700050719     A                                 12  2'-----------------------------------
011800050719     A                                      ------------------------------------
011900050719     A                                      ----------'
012000050719     A  10        VTCDCH         8  0O  6 14EDTCDE(8)
012100050719     A  10        VTCCCH         2A  O  6 28
012200050719     A N10 20                           6  2'FASE C.A. :'
012300050719     A N10                                  DSPATR(UL)
012400050719     A N10 20     VTCFCA         3S 0O  6 14
012500050719     A N10 20     VTDFCA        25A  O  6 18
012600120515     A  04                              3 28'PRATICA IN GESTIONE A CHARTIS'
012700050719     A                                      DSPATR(RI)
012800050719     A                                      DSPATR(HI)
012900000412     A          R FI59D02
013000000412     A*%%TS  SD  20000412  114203  EDPGA       REL-V4R2M0  5769-PW1
013100000412     A                                      CF03
013200000412     A                                      CF06
013300000412     A                                      CF18
013400000412     A                                      CF12
013500000412     A                                      CF07
013600000412     A                                      OVERLAY
013700000412     A  28        V2CMSG        78   M
013800000412     A  17                             16  2'----------------------------- O P -
013900000412     A                                      P U R E ----------------------------
014000000412     A                                      ---------'
014100000412     A                                      DSPATR(HI)
014200000412     A  17                             18  2'Beneficiario alternativo.:'
014300000412     A  17        V2CKSC         7Y 0B 18 29CHECK(RB)
014400000412     A                                      EDTCDE(Z)
014500000412     A  41                                  DSPATR(PC)
014600000412     A  17        V2DKSC        35A  O 18 38
014700000412     A  17                             20  2'Importo da liquidare ....:'
014800000412     A  17        V2CIPL        13Y 3O 20 29EDTCDE(1)
014900000412     A  17        V2CVPV         3A  O 20 49
015000000412     A  17                             21  2'Importo Trattenuto ......:'
015100000412     A  17        V2CIPT        13Y 3B 21 29EDTCDE(1)
015200000412     A  42                                  DSPATR(PC)
015300000412     A                                      CHECK(RB)
015400000412     A  17        V2CVLT         3A  O 21 49
015500000412     A  17                             21 54'Data ....:'
015600000412     A  17        V2CDPT         8Y 0B 21 66CHECK(RB)
015700000412     A                                      EDTWRD('  /  /    ')
015800000412     A                                      DSPATR(HI)
015900000412     A                                      DSPATR(UL)
016000000412     A  43                                  DSPATR(PC)
016100000412     A                                 14  2'Forzatura C.A. pagata ...:'
016200000412     A            V2CFPP         2A  B 14 29DSPATR(HI)
016300000412     A                                      DSPATR(UL)
016400000412     A                                      VALUES('  ' 'SI')
016500000412     A  40                                  DSPATR(PC)
016600000412     A                                 14 32'(SI/  )'
016700000412     A          R FI59Z02
016800000412     A*%%TS  SD  20000412  110039  EDPGA       REL-V4R2M0  5769-PW1
016900000412     A                                      OVERLAY
017000000412     A                                 24  2'F3=Fine'
017100000412     A                                 24 14'F6=CONFERMA'
017200000412     A                                      DSPATR(HI)
017300000412     A                                 24 55'F18=Note'
017400000412     A                                 24 69'F12=Ritorno'
017500000412     A                                 24 31'F7=Visualizza CA'
017600000412     A          R FI59D03
017700000412     A*%%TS  SD  20000412  170759  EDPGA       REL-V4R2M0  5769-PW1
017800000412     A                                      CF03
017900000412     A                                      CF06
018000000412     A                                      CF18
018100000412     A                                      CF12
018200000412     A                                      CF07
018300000412     A                                      OVERLAY
018400000412     A  28        V2CMSG        78   M
018500000412     A                                 16  2'----------------------------- O P -
018600000412     A                                      P U R E ----------------------------
018700000412     A                                      ---------'
018800000412     A                                      DSPATR(HI)
018900000412     A                                 18  2'Importo massimo risarcibile .:'
019000000412     A            V3CIPV        13Y 3O 18 33EDTCDE(1)
019100000412     A            V3CVPV         3A  O 18 51
019200000412     A                                 21  2'Importo Richiesto .....:'
019300000412     A            V3CIPR        13Y 3B 21 27EDTCDE(1)
019400000412     A  61                                  DSPATR(PC)
019500000412     A                                      CHECK(RB)
019600000412     A            V3CVPR         3A  O 21 45
019700000412     A                                 19 56'il'
019800000412     A            V3CDPT         8Y 0O 19 60EDTWRD('  /  /    ')
019900000412     A  43                                  DSPATR(PC)
020000000412     A                                 14  2'Ritorno alla Fase Precedente :'
020100000412     A            V3CFPP         2A  B 14 33DSPATR(HI)
020200000412     A                                      DSPATR(UL)
020300000412     A                                      VALUES('  ' 'SI')
020400000412     A  60                                  DSPATR(PC)
020500000412     A                                 14 36'(SI/  )'
020600000412     A                                 19  2'Importo Trattenuto ..........:'
020700000412     A            V3CIPT        13Y 3O 19 33EDTCDE(1)
020800000412     A            V3CVPT         3A  O 19 51
020900000412     A                                 21 49'Documento'
021000000412     A                                 21 67'del'
021100000412     A            V3CNDC         7Y 0B 21 59DSPATR(HI)
021200000412     A                                      DSPATR(UL)
021300000412     A  62                                  DSPATR(PC)
021400000412     A                                      CHECK(RB)
021500000412     A                                      EDTCDE(Z)
021600000412     A            V3CDDC         8Y 0B 21 71DSPATR(HI)
021700000412     A                                      DSPATR(UL)
021800000412     A  63                                  DSPATR(PC)
021900000412     A                                      CHECK(RB)
022000000412     A                                      EDTWRD('  /  /    ')
022100000412     A            V3CPFA         3S 0O 14 46
022200000412     A            V3DPFA        30A  O 14 50
022300050719     A          R FI59W01
022400050719     A*%%TS  SD  20050719  143549  EDPGA       REL-V4R4M0  5769-PW1
022500050719     A                                      CF06
022600050719     A                                      OVERLAY
022700050719     A                                      WINDOW(10 4 7 70)
022800050719     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
022900050719     A                                          '))
023000050719     A                                  5 45'F6=Conferma'
023100120515     A                                  3  1'Togliere gestione pratica a Charti-
023200120515     A                                      s ..?'
023300050719     A            W01AFF         2A  B  3 42VALUES('SI' 'NO')
023400050719     A                                  3 45'(SI/NO)'
