000100150629      *PARMS MBR(*NONE) SIZE(1 0 0)
000200150629      */*PRM mbr(*none) size(1 0 0)
000300150629      */*END
000400150629      *---------------------------------------------------------------*
000500150629      *?Gestione dati nel file FNDKA00F                              ?*
000600150629      *?(nato come: Gestione Beneficiario pagamento C.A. in FNDKA00F)?*
000700150629      *---------------------------------------------------------------*
000800150629     A                                      REF(FNDKA00F)
000900150629      *
001000150629     A          R FIDNU1S                   TEXT('Gest. dati nel file -
001100150629     A                                      FNDKA00F')
001200150629      *
001300150629      *?Campi di INPUT:?
001400150629      *
001500150629     A            IDNU1MOD       1A         TEXT('MODALITÀ: +
001600150629     A                                            "C"=CANCELLAZ., +
001700150629     A                                            "R"=REPERIM., +
001800150629     A                                            "S"=SCRITTURA')
001900150629     A            IDNU1AAC  R               REFFLD(DKAAAC)
002000150629     A            IDNU1FIL  R               REFFLD(DKAFIL)
002100150629     A            IDNU1NCA  R               REFFLD(DKANCA)
002200150629     A            IDNU1TRC  R               REFFLD(DKATRC)
002300150629      *
002400150629      *?Campi di INPUT/OUTPUT:?
002500150629      *?- Input  per Scrittura,?
002600150629      *?- Output per Cancellazione e Reperimento.?
002700150629      *
002800150629     A            IODNU1KCC R               REFFLD(DKAKCC)
002900150629     A            IODNU1KSC R               REFFLD(DKAKSC)
003000150629     A            IODNU1RAG R               REFFLD(DKARAG)
003100150629     A            IODNU1VIA R               REFFLD(DKAVIA)
003200150629     A            IODNU1CAP R               REFFLD(DKACAP)
003300150629     A            IODNU1LOC R               REFFLD(DKALOC)
003400150629     A            IODNU1PRV R               REFFLD(DKAPRV)
003500150629     A            IODNU1NAZ R               REFFLD(DKANAZ)
003600150629     A            IODNU1IVA R               REFFLD(DKAIVA)
003700150629     A            IODNU1TEL R               REFFLD(DKATEL)
003800150629     A            IODNU1FAX R               REFFLD(DKAFAX)
003900150629      *
004000150629      *?Campi di OUTPUT:?
004100150629      *
004200150629     A            ODNU1ERR       1A         TEXT('FLAG *ON=ERRORE')
004300150629     A            ODNU1MSG      78A         TEXT('MESSAGGIO DI ERRORE')
