000100000000     A*------------------------------------------------------------------------*
000200000000     A                                      DSPSIZ(24 80 *DS3)
000300000000     A                                      CHGINPDFT(HI CS)
000400000000     A                                      PRINT
000500000000     A                                      CF01
000600000000     A                                      CF02
000700000000     A                                      CF03
000800000000     A                                      CF04
000900000000     A                                      CF05
001000000000     A                                      CF06
001100000000     A                                      CF07
001200000000     A                                      CF08
001300000000     A                                      CF09
001400000000     A                                      CF10
001500000000     A                                      CF11
001600000000     A                                      CF12
001700000000     A                                      CF13
001800000000     A                                      CF14
001900000000     A                                      CF15
002000000000     A                                      CF16
002100000000     A                                      CF17
002200000000     A                                      CF18
002300000000     A                                      CF19
002400000000     A                                      CF20
002500000000     A                                      CF21
002600000000     A                                      CF22
002700000000     A                                      CF23
002800000000     A                                      CF24
002900000000     A                                      ROLLUP(97)
003000000000     A                                      ROLLDOWN(97)
003100000000     A                                      HELP
003200000000     A*------------------------------------------------------------------------*
003300000000     A          R TL05DVT
003400000000     A                                      KEEP
003500000000     A                                      OVERLAY
003600000000     A                                      ASSUME
003700000000     A                                      PUTOVR
003800000000     A                                  2 63' '
003900000000     A                                      OVRATR
004000000000     A*------------------------------------------------------------------------*
004100000000     A          R TL05DV1
004200000000     A                                      CHGINPDFT(HI CS)
004300000000     A                                      WINDOW(17 2 5 74)
004400000000     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
004500000000     A                                          '))
004600000000     A            VFD003        19A  H
004700000000     A            VFD004        19A  H
004800000000     A            VFD005        19A  H
004900000000     A            VFD006        19A  H
005000000000     A            VFD007        19A  H
005100000000     A            VFD008        19A  H
005200000000     A                                  1  2'Seq A/R _____ Filiale _____  ___AR-
005300000000     A                                      RIVO___   __PARTENZA__  Aper KM   T-
005400000000     A                                      empo'
005500000000     A                                      DSPATR(HI)
005600000000     A                                  2  2'                             gg  o-
005700000000     A                                      ra  sca   gg  ora  car   FV       h-
005800000000     A                                      h:mm'
005900000000     A                                      DSPATR(HI)
006000000000     A            V1CSEQ    R        B  3  2REFFLD(TLRNFM TNTLR00F)
006100000000     A                                      EDTCDE(Z)
006200000000     A N60                                  DSPATR(HI)
006300000000     A  60                                  DSPATR(RI)
006400000000     A  60                                  DSPATR(PC)
006500000000     A  90                                  DSPATR(PR)
006600000000     A                                      CHECK(RB)
006700000000     A            V1CTFM    R        B  3  7REFFLD(TLRTFM TNTLR00F)
006800000000     A N61                                  DSPATR(HI)
006900000000     A  61                                  DSPATR(RI)
007000000000     A  61                                  DSPATR(PC)
007100000000     A  90                                  DSPATR(PR)
007200000000     A            V1CFIL    R        B  3 10REFFLD(TLRFIL TNTLR00F)
007300000000     A N62                                  DSPATR(HI)
007400000000     A  62                                  DSPATR(RI)
007500000000     A  62                                  DSPATR(PC)
007600000000     A  90                                  DSPATR(PR)
007700000000     A                                      EDTCDE(Z)
007800000000     A                                      CHECK(RB)
007900000000     A            V1DFIL        15A  O  3 14
008000000000     A            V1CGGA    R        B  3 31REFFLD(TLOGGA TNTLO00F)
008100000000     A N63                                  DSPATR(HI)
008200000000     A  63                                  DSPATR(RI)
008300000000     A  63                                  DSPATR(PC)
008400000000     A  90                                  DSPATR(PR)
008500000000     A            V1CHHA    R        B  3 34REFFLD(TLOHHA TNTLO00F)
008600000000     A N64                                  DSPATR(HI)
008700000000     A  64                                  DSPATR(RI)
008800000000     A  64                                  DSPATR(PC)
008900000000     A  90                                  DSPATR(PR)
009000000000     A                                      EDTWRD('  :  ')
009100000000     A            V1CSCA    R        B  3 41REFFLD(TLRSCA TNTLR00F)
009200000000     A N65                                  DSPATR(HI)
009300000000     A  65                                  DSPATR(RI)
009400000000     A  65                                  DSPATR(PC)
009500000000     A  90                                  DSPATR(PR)
009600000000     A            V1CGGP    R        B  3 46REFFLD(TLOGGP TNTLO00F)
009700000000     A N66                                  DSPATR(HI)
009800000000     A  66                                  DSPATR(RI)
009900000000     A  66                                  DSPATR(PC)
010000000000     A  90                                  DSPATR(PR)
010100000000     A            V1CHHP    R        B  3 49REFFLD(TLOHHP TNTLO00F)
010200000000     A N67                                  DSPATR(HI)
010300000000     A  67                                  DSPATR(RI)
010400000000     A  67                                  DSPATR(PC)
010500000000     A  90                                  DSPATR(PR)
010600000000     A                                      EDTWRD('  :  ')
010700000000     A            V1CCAR    R        B  3 56REFFLD(TLRCAR TNTLR00F)
010800000000     A N68                                  DSPATR(HI)
010900000000     A  68                                  DSPATR(RI)
011000000000     A  68                                  DSPATR(PC)
011100000000     A  90                                  DSPATR(PR)
011200000000     A            V1CGFV    R        B  3 61REFFLD(TLRGFV TNTLR00F)
011300000000     A N71                                  DSPATR(HI)
011400000000     A  71                                  DSPATR(RI)
011500000000     A  71                                  DSPATR(PC)
011600000000     A  90                                  DSPATR(PR)
011700000000     A            V1CKMT    R        B  3 64REFFLD(TLRKMT TNTLR00F)
011800000000     A N69                                  DSPATR(HI)
011900000000     A  69                                  DSPATR(RI)
012000000000     A  69                                  DSPATR(PC)
012100000000     A  90                                  DSPATR(PR)
012200000000     A                                      CHECK(RB)
012300000000     A                                      EDTCDE(Z)
012400000000     A            V1CTEM    R        B  3 70REFFLD(TLRTEM TNTLR00F)
012500000000     A N70                                  DSPATR(HI)
012600000000     A  70                                  DSPATR(RI)
012700000000     A  70                                  DSPATR(PC)
012800000000     A  90                                  DSPATR(PR)
012900000000     A                                      EDTWRD('  :  ')
013000000000     A            VFD001        19A  O  4  2
013100000000     A            VFD002        19A  O  4 25
013200000000     A*------------------------------------------------------------------------*
013300000000     A          R TL05DVM                   SFL
013400000000     A                                      SFLMSGRCD(24)
013500000000     A            VMCKEY                    SFLMSGKEY
013600000000     A            VMCQUE                    SFLPGMQ
013700000000     A*------------------------------------------------------------------------*
013800000000     A          R TL05DVK                   SFLCTL(TL05DVM)
013900000000     A                                      SFLSIZ(0002)
014000000000     A                                      SFLPAG(0001)
014100000000     A                                      OVERLAY
014200000000     A                                      SFLDSP
014300000000     A  40                                  SFLCLR
014400000000     A  44                                  SFLEND
