000010060321     A*%%TS  SD  20060321  125946  EDPRM       REL-V5R3M0  5722-WDS
000020000000     A*------------------------------------------------------------------------*
000030060321     A*%%EC
000040060321     A                                      DSPSIZ(24 80 *DS3)
000050060321     A                                      CHGINPDFT(HI CS)
000060060321     A                                      PRINT
000070060321     A                                      CF01
000080060321     A                                      CF02
000090060321     A                                      CF03
000100060321     A                                      CF04
000110060321     A                                      CF05
000120060321     A                                      CF06
000130060321     A                                      CF07
000140060321     A                                      CF08
000150060321     A                                      CF09
000160060321     A                                      CF10
000170060321     A                                      CF11
000180060321     A                                      CF12
000190060321     A                                      CF13
000200060321     A                                      CF14
000210060321     A                                      CF15
000220060321     A                                      CF16
000230060321     A                                      CF17
000240060321     A                                      CF18
000250060321     A                                      CF19
000260060321     A                                      CF20
000270060321     A                                      CF21
000280060321     A                                      CF22
000290060321     A                                      CF23
000300060321     A                                      CF24
000310060321     A                                      ROLLUP(97)
000320060321     A                                      ROLLDOWN(97)
000330060321     A                                      HELP
000340000000     A*------------------------------------------------------------------------*
000350000000     A          R TL13DVT
000360000000     A                                      KEEP
000370000000     A                                      OVERLAY
000380000000     A                                      ASSUME
000390000000     A                                      PUTOVR
000400000000     A                                  2 63' '
000410000000     A                                      OVRATR
000420000000     A*------------------------------------------------------------------------*
000430060321     A          R TL13DV1
000440060321     A*%%TS  SD  20060321  125946  EDPRM       REL-V5R3M0  5722-WDS
000450060321     A                                      CHGINPDFT(HI CS)
000460060321     A                                      WINDOW(16 2 6 74)
000470060321     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
000480060321     A                                          '))
000490060321     A            VFD003        19A  H
000500060321     A            VFD004        19A  H
000510060321     A            VFD005        19A  H
000520060321     A            VFD006        19A  H
000530060321     A            VFD007        19A  H
000540060321     A            VFD008        19A  H
000550060321     A            VTDFUN        15A  O  1 33DSPATR(RI)
000560060321     A                                  2  2'A Num Fil Prg ***                 -
000570060321     A                                            TESTO                        -
000580060321     A                                       ***'
000590060321     A                                      DSPATR(HI)
000600060321     A            V1CATB         1A  O  3  2
000610060321     A            V1CNFM         3Y 0O  3  4
000620060321     A N60                                  DSPATR(HI)
000630060321     A  60                                  DSPATR(RI)
000640060321     A            V1CFIL         3Y 0O  3  8EDTCDE(Z)
000650060321     A            V1CPNO    R     Y  B  3 12REFFLD(TLNPNO TNTLN00F)
000660060321     A                                      EDTCDE(Z)
000670060321     A N61                                  DSPATR(HI)
000680060321     A  61                                  DSPATR(RI)
000690060321     A  61                                  DSPATR(PC)
000700060321     A  90                                  DSPATR(PR)
000710060321     A                                      CHECK(RB)
000720060321     A            V1CTN1        59A  B  3 16
000730060321     A N62                                  DSPATR(HI)
000740060321     A  62                                  DSPATR(RI)
000750060321     A  62                                  DSPATR(PC)
000760060321     A  91                                  DSPATR(PR)
000770060321     A            VFD001        19A  O  5  2
000780060321     A            VFD002        19A  O  5 33
000790000000     A*------------------------------------------------------------------------*
000800000000     A          R TL13DVM                   SFL
000810000000     A                                      SFLMSGRCD(24)
000820000000     A            VMCKEY                    SFLMSGKEY
000830000000     A            VMCQUE                    SFLPGMQ
000840000000     A*------------------------------------------------------------------------*
000850000000     A          R TL13DVK                   SFLCTL(TL13DVM)
000860000000     A                                      SFLSIZ(0002)
000870000000     A                                      SFLPAG(0001)
000880000000     A                                      OVERLAY
000890000000     A                                      SFLDSP
000900000000     A  40                                  SFLCLR
000910000000     A  44                                  SFLEND
