000001020717     A*%%***********************************************************************
000002020717     A*%%TS  RD  20020717  120152  EDPMB       REL-V4R4M0  5769-PW1
000003020717     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004020717     A*%%FI       0000000000000000000000000000000000000000000000000
000005020717     A*%%***********************************************************************
000006020717     A*------------------------------------------------------------------------*
000007020717     A* Compilare --> Dimensione pagina : 198
000008020717     A*               CPI               : 15
000009020717     A*               PRTQLTY           : *DRAFT
000010020717     A*               USRDTA            : SCA_TRAINI
000011020717     A*------------------------------------------------------------------------*
000012020717     A* TESTATA
000013020717     A*------------------------------------------------------------------------*
000014020717     A          R TL54TE
000015020717     A*%%***********************************************************************
000016020717     A*%%RI 00000
000017020717     A*%%FS 001
000018020717     A*%%***********************************************************************
000019020717     A                                      SKIPB(001)
000020020717     A                                      SPACEB(001)
000021020717     A            RSUT          20A  O     1
000022020717     A                                    48
000023020717     A                                      'TNTL54R'
000024020717     A                                    80
000025020717     A                                      '*** FORZATURA SCADENZA TRAINI ***'
000026020717     A            TEDSIM        20A  O    +8
000027020717     A                                   +24
000028020717     A                                      'DATA'
000029020717     A                                   170
000030020717     A                                      DATE
000031020717     A                                      EDTWRD('  /  /  ')
000032020717     A                                   190
000033020717     A                                      'PAG.'
000034020717     A                                   195
000035020717     A                                      PAGNBR
000036020717     A                                      EDTCDE(Z)
000037020717     A*%%***********************************************************************
000038020717     A*%%SS
000039020717     A*%%***********************************************************************
000040020717     A*------------------------------------------------------------------------*
000041020717     A* SEPARAZIONE
000042020717     A*------------------------------------------------------------------------*
000043020717     A          R TL54IN
000044020717     A*%%***********************************************************************
000045020717     A*%%RI 00000
000046020717     A*%%FS 001
000047020717     A*%%***********************************************************************
000048020717     A                                      SPACEB(002)
000049020717     A                                     1
000050020717     A                                      '-----------------------------------
000051020717     A                                      ------------------------------------
000052020717     A                                      ------------------------------------
000053020717     A                                      ------------------------------------
000054020717     A                                      ------------------------------------
000055020717     A                                      ------------------------'
000056020717     A                                     1
000057020717     A                                      '_____________ T R A I N I ________-
000058020717     A                                      _____'
000059020717     A                                      SPACEB(001)
000060020717     A                                   +26
000061020717     A                                      'NUOVA'
000062020717     A                                    77
000063020717     A                                      'MODIFICA'
000064020717     A                                    87
000065020717     A                                      '****                          A N -
000066020717     A                                      O M A L I E                        -
000067020717     A                                         ****'
000068020717     A                                     1
000069020717     A                                      'TRAINO'
000070020717     A                                      SPACEB(001)
000071020717     A                                    14
000072020717     A                                      'DECORRENZA'
000073020717     A                                    31
000074020717     A                                      'SCADENZA'
000075020717     A                                    48
000076020717     A                                      '-------->'
000077020717     A                                    65
000078020717     A                                      'SCADENZA'
000079020717     A                                    80
000080020717     A                                      'OK'
000081020717     A                                     1
000082020717     A                                      '-----------------------------------
000083020717     A                                      ------------------------------------
000084020717     A                                      ------------------------------------
000085020717     A                                      ------------------------------------
000086020717     A                                      ------------------------------------
000087020717     A                                      ------------------------'
000088020717     A                                      SPACEB(001)
000089020717     A*%%***********************************************************************
000090020717     A*%%SS
000091020717     A*%%CL 001
000092020717     A*%%CL 001
000093020717     A*%%CL 001
000094020717     A*%%***********************************************************************
000095020717     A*------------------------------------------------------------------------*
000096020717     A* DETTAGLIO
000097020717     A*------------------------------------------------------------------------*
000098020717     A          R TL54DE
000099020717     A*%%***********************************************************************
000100020717     A*%%RI 00000
000101020717     A*%%***********************************************************************
000102020717     A                                      SPACEB(001)
000103020717     A            PDETRN         7S 0O     1
000104020717     A                                      EDTCDE(Z)
000105020717     A            PDEDDE         8S 0O    14
000106020717     A                                      EDTCDE(8)
000107020717     A            PDEDSC         8S 0O    30
000108020717     A                                      EDTCDE(8)
000109020717     A                                    48
000110020717     A                                      '-------->'
000111020717     A            PDEDS2         8S 0O    64
000112020717     A                                      EDTCDE(8)
000113020717     A            PDEMOK         2A  O    80
000114020717     A            PDEANM        66A  O    87
000115020717     A*%%***********************************************************************
000116020717     A*%%SS
000117020717     A*%%***********************************************************************
000118020717     A*------------------------------------------------------------------------*
000119020717     A* PARAMETRI DI LANCIO
000120020717     A*------------------------------------------------------------------------*
000121020717     A          R TL54PA
000122020717     A*%%***********************************************************************
000123020717     A*%%RI 00000
000124020717     A*%%FS 003
000125020717     A*%%***********************************************************************
000126020717     A                                      SPACEB(004)
000127020717     A                                    80
000128020717     A                                      '***   PARAMETRI  DI  LANCIO   ***'
000129020717     A                                    80
000130020717     A                                      'UTENTE .........................:'
000131020717     A                                      SPACEB(001)
000132020717     A            PROFIL        10A  O   116
000133020717     A                                    80
000134020717     A                                      'SIMULAZIONE LANCIO .............:'
000135020717     A                                      SPACEB(001)
000136020717     A            PACSIM         2A  O    +3
000137020717     A                                    80
000138020717     A                                      'DA NUMERO TRAINO ...............:'
000139020717     A                                      SPACEB(001)
000140020717     A            PACTR1         7S 0O   116
000141020717     A                                      EDTCDE(Z)
000142020717     A                                    80
000143020717     A                                      'A  NUMERO TRAINO ...............:'
000144020717     A                                      SPACEB(001)
000145020717     A            PACTR2         7S 0O   116
000146020717     A                                      EDTCDE(Z)
000147020717     A                                    83
000148020717     A                                      'TRANNE ......................:'
000149020717     A                                      SPACEB(001)
000150020717     A            PACTE1         7S 0O   116
000151020717     A                                      EDTCDE(Z)
000152020717     A            PACTE2         7S 0O   124
000153020717     A                                      EDTCDE(Z)
000154020717     A            PACTE3         7S 0O   132
000155020717     A                                      EDTCDE(Z)
000156020717     A            PACTE4         7S 0O   140
000157020717     A                                      EDTCDE(Z)
000158020717     A            PACTE5         7S 0O   148
000159020717     A                                      EDTCDE(Z)
000160020717     A            PACTE6         7S 0O   156
000161020717     A                                      EDTCDE(Z)
000162020717     A            PACTE7         7S 0O   116
000163020717     A                                      EDTCDE(Z)
000164020717     A                                      SPACEB(001)
000165020717     A            PACTE8         7S 0O   124
000166020717     A                                      EDTCDE(Z)
000167020717     A            PACTE9         7S 0O   132
000168020717     A                                      EDTCDE(Z)
000169020717     A            PACTE0         7S 0O   140
000170020717     A                                      EDTCDE(Z)
000171020717     A            PACTEA         7S 0O   148
000172020717     A                                      EDTCDE(Z)
000173020717     A            PACTEB         7S 0O   156
000174020717     A                                      EDTCDE(Z)
000175020717     A                                    80
000176020717     A                                      'CON DATA DECORRENZA ............:'
000177020717     A                                      SPACEB(001)
000178020717     A            PACDDE         8S 0O   116
000179020717     A                                      EDTCDE(8)
000180020717     A                                    80
000181020717     A                                      'CON DATA SCADENZA ..............:'
000182020717     A                                      SPACEB(001)
000183020717     A            PACDSC         8S 0O   116
000184020717     A                                      EDTCDE(8)
000185020717     A                                    80
000186020717     A                                      'NUOVA DATA SCADENZA ............:'
000187020717     A                                      SPACEB(001)
000188020717     A            PACDS2         8S 0O   116
000189020717     A                                      EDTWRD('  /  /    ')
000190020717     A*%%***********************************************************************
000191020717     A*%%SS
000192020717     A*%%CL 001
000193020717     A*%%CL 001
000194020717     A*%%CL 001
000195020717     A*%%CL 001
000196020717     A*%%CL 001
000197020717     A*%%CL 001
000198020717     A*%%CL 001
000199020717     A*%%CL 001
000200020717     A*%%CL 001
000201020717     A*%%***********************************************************************
000202020717     A*------------------------------------------------------------------------*
000203020717     A* FINE PROSPETTO (SKIPB 64)
000204020717     A*------------------------------------------------------------------------*
000205020717     A          R TL54FI
000206020717     A*%%***********************************************************************
000207020717     A*%%RI 00000
000208020717     A*%%FS 043
000209020717     A*%%***********************************************************************
000210020717     A                                      SKIPB(065)
000211020717     A                                    80
000212020717     A                                      '*  F I N E   P R O S P E T T O  *'
000213020717     A*%%***********************************************************************
000214020717     A*%%SS
000215020717     A*%%CP+999CRTPRTF
000216020717     A*%%CP+    FILE(GAITRAFIL/TNTL54P)
000217020717     A*%%CP+    DEVTYPE(*SCS)
000218020717     A*%%CP+    PAGESIZE(*N 198)
000219020717     A*%%CP+    CPI(15)
000220020717     A*%%CP+    PRTQLTY(*DRAFT)
000221020717     A*%%CP     USRDTA(SCA_TRAINI)
000222020717     A*%%***********************************************************************
000223020717     A*------------------------------------------------------------------------*
