000100951113     A*---------------------------------------------------------------*
000200960912     A* DS PER PULIZIA TRAINI E FOGLI VIAGGIO PARTENZA                *
000300951113     A*---------------------------------------------------------------*
000400951113     A                                      REF(CNDIZION)
000500960912     A          R D57REC                    TEXT('DS PER PULIZIA TRAINI +
000600960912     A                                      E F.VIAGGIO PARTENZA')
000700951113     A*
000800940919     A* C A M P I   I N   I N P U T:
000900940921     A*
001000960912     A* D57DFV DEVE ESSERE PASSATA NEL FORMATO  AAAA/MM/GG
001100960916     A            D57DEA    R     S         REFFLD($DA8)
001200960912     A                                      TEXT('DATA ELABORAZIONE')
001300960305     A*
