000100050930     H DFTACTGRP(*NO) ACTGRP(*CALLER)
000200050930
000300060323     Ffnlg13d   CF   E             WORKSTN
000400050930     F                                     SFILE(S01:S01RRN)
000500060323     Ftignp01l  IF   E           K DISK
001300050930
001500060323     D fnlg13ds      E DS
001700050930
001800050930     D S01RRN          S              5I 0
001900050930     D S01RRNFirst     S              5I 0
002000050930     D S01RRNLast      S              5I 0
002100060302      *--------------------------------------------------------------------
002200060302     c                   exsr      elabora
002300060302     c                   seton                                        lr
002400050930
002500060302      *___________________________________________________                  ****
002600060302     C     elabora       BEGSR
002700060302      *___________________________________________________                  ****
002800060302      * reperisco progressivi precedenti ed escludo il progressivo 0
002900060323     c     kgnp          setll     tignp01l
003000060302     c                   do        *hival
003100060323     c     kgnp          reade     tignp01l
003200060323     c                   if        %eof(tignp01l)
003300060302     c                   leave
003400060302     c                   endif
003401060323      * solo fase 20
003402060323     c                   if        gnpfas <> 20
003403060323     c                   iter
003404060323     c                   endif
003800060302      * caricamento sfl
003900060302     c                   exsr      carica
004000060302     c                   enddo
004100060302      * emissione sfl
004101060302     c     s01rrn        comp      0                                  0101
004200060302     c                   if        s01rrn > 0
004300060302     c                   z-add     1             s01rrn
004400060302     c                   exsr      emissione
004500060302     c                   endif
004600060302     c                   endsr
004700060302      *___________________________________________________                  ****
004800060302     C     carica        BEGSR
004900060302      *___________________________________________________                  ****
005000060323     c                   movel     gnpnpr        s01npr
005100060323     c                   movel     gnpdmc        s01dmc
005200060323     c                   movel     gnptpn        s01tpn
007616060323
007700060323     c                   if        s01rrn < 100
007800060302     c                   add       1             s01rrn
007900060302     c                   write     s01
008000060302     c                   endif
008100060302     c                   endsr
008200060302      *___________________________________________________                  ****
008300060302     C     emissione     BEGSR
008400060302      *___________________________________________________                  ****
008500051005
008501060323     c                   do        *hival
008701060302     C                   WRITE     f01
008702060302     C                   exfmt     c01
008900060302     c   kc              leave
009000060302     c                   enddo
009200050930
009201060323     C                   endsr
009300060302      *___________________________________________________                  ****
009400060302     C     *INZSR        BEGSR
009500060302      *___________________________________________________                  ****
009600060302     C     *ENTRY        PLIST
009700060323     C                   PARM                    fnlg13ds
009900060323     c                   movel     i13agc        c01agc
010000060323     c                   movel     i13fgc        c01fgc
010100060323     c                   movel     i13ngc        c01ngc
010200060302
010300060323     C     kgnp          KLIST
010400060323     C                   KFLD                    i13Agc
010500060323     C                   KFLD                    i13Fgc
010600060323     C                   KFLD                    i13Ngc
010601060323     C                   KFLD                    i13frg
010700060302
011500060302      *inizializza sfl
011600060302     C                   SETOn                                        02
011700060302     C                   WRITE     C01
011800060302     C                   SETOff                                       02
011900060302     C                   CLEAR                   S01RRN
012000060302     C                   CLEAR                   S01RRNLast
012100060302
012200060302     C                   ENDSR
012300060302
