000100970526     A*--------------------------------------------------------------------------------------------*
000200141121     A* CREAZIONE FILE FILIALI (WFTWF)           DS DI PROCEDURA                                   *
000300970526     A*--------------------------------------------------------------------------------------------*
000400970526     A                                      REF(CNDIZION)
000500141121     A          R TLS5REC                   TEXT('CREAZIONE FILE FILIALI')
002000970526     A
002100141121     A            TLS5DRF   R     S         REFFLD($DA8)
002200970526     A                                      TEXT('DATA RIFERIMENTO')
002300970526     A                                      COLHDG('RIFERIMENTO')
