000100000000     A*----------------------------------------------------------------
000200011211     A*  L.F. STORICO AUTOMEZZI X AUTISTA
000300000000     A*----------------------------------------------------------------
000400890918     A                                      FIFO
000500011121     A          R MZAMH000                  PFILE(MZAMH00F)
000600000000      *
000700011211     A          K AMHCAU
000800011211     A          K AMHDAL
000801011211     A          K AMHNRF
