000100000000     A*----------------------------------------------------------------
000200011119     A* -MZAMH00F-    STORICO VARIAZIONI AUTOMEZZI
000300000000     A*----------------------------------------------------------------
000400011119     A          R MZAMH000                  TEXT('STORICO VARIAZ.AUTOMEZZI')
000500000000      *
000600000000     A            AMHNRF         7  0       TEXT('N° RIFERIMENTO')
000700000000     A                                      COLHDG('RIF')
000800000000     A            AMHTGA         2          TEXT('TARGA')
000900880902     A            AMHTGN         9          TEXT('TARGA')
001000000000     A                                      COLHDG('TARGA')
001100000000     A            AMHTLA        18          TEXT('TELAIO')
001200000000     A                                      COLHDG('TELAIO')
001300000000     A            AMHDTA         8  0       TEXT('DATA VARIAZIONE')
001400000000     A                                      COLHDG('DATA')
001500000000     A            AMHDS1        25          TEXT('DESCRIZIONE VARIAZ')
001600000000     A                                      COLHDG('DESCRIZ')
001700000000     A            AMHDS2        25          TEXT('DESTINATARIO')
001800000000     A                                      COLHDG('DESTINAT')
001900000000     A            AMHTNA         2          TEXT('NUOVA TARGA')
002000880902     A            AMHTNN         9          TEXT('NUOVA TARGA')
002100000000     A                                      COLHDG('NEW TAR')
002200011119     A            AMHCAU         2          TEXT('COD. AUTISTA')
002300910201     A                                      COLHDG('COD. AUTISTA')
002400910201     A            AMHDAL         8  0       TEXT('AUTISTA DAL')
002500910201     A                                      COLHDG('AUTISTA DAL')
002600011121     A            AMHAL          8  0       TEXT('AUTISTA AL')
002700011121     A                                      COLHDG('AUTISTA AL')
002800011121     A            AMHCSP         2          TEXT('COD. SITUAZIONE PROPRIETA')
002900910201     A                                      COLHDG('COD. SIT. PROPR.')
003000910201     A            AMHTIP         2          TEXT('TIPO VARIAZIONE')
003100910201     A                                      COLHDG('TIPO VARIAZ.')
003200910201     A            AMHFIL         3  0
003300910201     A                                      TEXT('COD. FILIALE DOTAZ.')
003400910201     A                                      COLHDG('FILIALE DOTAZ.')
003500020607     A            AMHSOC         3
003600020607     A                                      TEXT('SOCIETA DOTAZIONE')
003700020607     A                                      COLHDG('SOC.DOTAZ.')
003800030113     A            AMHCAT         2
003900030113     A                                      TEXT('CATEGORIA')
004000030113     A                                      COLHDG('CATEGORIA')
004100030113     A            AMHCDC         8
004200030113     A                                      TEXT('CENTRO DI COSTO')
004300030113     A                                      COLHDG('CDC')
