000100000000     A*----------------------------------------------------------------
000200020605     A*  L.F. TESSERA AGIP
000300000000     A*----------------------------------------------------------------
000400020605     A          R MZAGI000                  PFILE(MZAGI00F)
000500000000      *
000600020709     A          K AGIANN
000601020709     A          K AGITGA
000700020605     A          K AGITGN
000800020605     A          K AGIDTU
