000100000000     A*----------------------------------------------------------------
000200070730     A* GIUSTIFICATIVI ASSENZE DIPENDENTI
000300000000     A*----------------------------------------------------------------
000400111216     A          R MZGADPC0
000500000000      *
000600111219     A            PCSOC          3  0       TEXT('SOCIETÀ DIP.')
000700111219     A            PCMAT          5  0       TEXT('CODICE DIPENDENTE')
000800111216     A            PCDEC         35          TEXT('NOME E COGNOME')
000900111219     A            PCDTA           L         TEXT('DATA GIUSTIF. ASSENZA')
001000111216     A            PCCAU         10          TEXT('CAUSALE GIUSTIF. ASSENZA')
001100111219     A            PCORA          4  0       TEXT('NR. ORE ASSENZA')
001200111216     A            PCDECCAU      35          TEXT('DECODIFICA CAUSALE')
