000100000000     A*----------------------------------------------------------------
000200011210     A* -MZNOT00F-  DESCRIZIONI AGGIUNTIVE GRANDE MANUTENZIONE        *
000300000000     A*----------------------------------------------------------------
000400011210     A          R MZNOT000                  TEXT('DESCRIZ.AGG.VE +
000500890918     A                                      GRANDE MANUTENZ.')
000600000000      *
000700891127     A            NOTTIP         2          TEXT('TIPO NOTA     ')
000800891127     A                                      COLHDG('TIP')
000900891127     A*  '  ' = NOTA PER MANUTENZIONE E SINISTRI
001000891127     A*  '01' = NOTA PER ANAGRAFICA
001100891127     A*
001200890112     A            NOTNOT         7  0       TEXT('N° RIFERIMENTO')
001300890112     A                                      COLHDG('NUM')
001400890113     A            NOTPRG         4  0       TEXT('PROGRESSIVO ')
001500890113     A                                      COLHDG('RIGA')
001600000000     A            NOTDES        50          TEXT('NOTA')
001700000000     A                                      COLHDG('NOTA')
