000100000000     A*----------------------------------------------------------------
000200070727     A*  L.F. STORICO ANAGRAFICO AUTISTI
000300000000     A*----------------------------------------------------------------
000400011128     A                                      UNIQUE
000500070727     A          R MZXNH000                  PFILE(MZXNH00F)
000600000000      *
000700070727     A          K XNHCAU
000800070727     A          K XNHDTA
