000100960524     A*--------------------------------------------------------------*
000200090408      * X PASSAGGIO PARAMETRI FRA PROGRAMMI
000300090408     A
000400150623     A          R TRMZ70SDS7
000500150623     A            DS7OPZ         1A         TEXT('OPZ-             ')
000600150623     A            DS7FLG         1A         TEXT('FLG-             ')
000700150623     A            DS7RET         1A         TEXT('RET-             ')
000800150623     A            DS7OPR         1A         TEXT('OPR-             ')
000900150623     A            DS7ERR         1A         TEXT('ERR-             ')
001000150623     A            DS7SOCG        3A         TEXT('SOCIETA GESTIONE')
001100150623     A            DS7IVA        16A         TEXT('PIVA SOCIETA')
001200150623     A            DS7IVAA       16A         TEXT('PIVA COOP CONSORZIATA')
001300090408      *----
