000001120511     A*%%***********************************************************************
000002120511     A*%%TS  RD  20120511  102937  EDPAB       REL-V6R1M0  5761-WDS
000003120511     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004120511     A*%%FI       0000000000000000000000000000000000000000000000000
000005120511     A*%%***********************************************************************
000006120511      *PARMS PAGESIZE(66 198) CPI(15) OVRFLW(60)
000007120511      *PARMS USRDTA(AFFDEFCTR) SAVE(*YES)
000008120511     A          R TESTA
000009120511     A*%%***********************************************************************
000010120511     A*%%RI 00000
000011120511     A*%%***********************************************************************
000012120511     A                                      SKIPB(001)
000013120511     A                                      CPI(15)
000014120511     A            RSUT          20A  O     2
000015120511     A                                    47
000016120511     A                                      'Controllo TARIFFE Affl.Def / Trazi-
000017120511     A                                      onisti'
000018120511     A                                      UNDERLINE
000019120511     A            DAY            8S 0O   163
000020120511     A                                      EDTCDE(Y)
000021120511     A            ORE             T  O   175
000022120511     A                                   187
000023120511     A                                      'pag.'
000024120511     A            PAGE           3  0    195
000025120511     A                                      EDTCDE(Z)
000026120511     A            KNSIF         10A  O     2
000027120511     A                                      SPACEB(001)
000028120511     A            KNMUS         10A  O    14
000029120511     A                                   187
000030120511     A                                      'pgm'
000031120511     A                                   191
000032120511     A                                      'TRMZA3R'
000033120511     A                                   129
000034120511     A                                      '  A  U  T  I  S  T  A '
000035120511     A                                      HIGHLIGHT
000036120511     A                                      SPACEB(004)
000037120511     A                                   166
000038120511     A                                      '   T  R  A  I  N  I    '
000039120511     A                                      HIGHLIGHT
000040120511     A*%%***********************************************************************
000041120511     A*%%SS+
000042120511     A*%%SS                            I
000043120511     A*%%CL 001
000044120511     A*%%CL 003
000045120511     A*%%CL+001
000046120511     A*%%CL+
000047120511     A*%%CL                           T     |
000048120511     A*%%***********************************************************************
000049120511     A          R TESDETTA
000050120511     A*%%***********************************************************************
000051120511     A*%%RI 00000
000052120511     A*%%***********************************************************************
000053120511     A                                      SPACEA(001)
000054120511     A                                      SPACEB(001)
000055120511     A                                      CPI(15)
000056120511     A                                     1
000057120511     A                                      'Autista     Affl./Defl.    '
000058120511     A                                      HIGHLIGHT
000059120511     A                                    34
000060120511     A                                      'Prog.TAR.'
000061120511     A                                      HIGHLIGHT
000062120511     A                                    44
000063120511     A                                      'Periodo Tariffa'
000064120511     A                                      HIGHLIGHT
000065120511     A                                    63
000066120511     A                                      'Nr.Contr.'
000067120511     A                                      HIGHLIGHT
000068120511     A                                    73
000069120511     A                                      'Soc'
000070120511     A                                      HIGHLIGHT
000071120511     A                                    77
000072120511     A                                      'Fornitore'
000073120511     A                                      HIGHLIGHT
000074120511     A                                    87
000075120511     A                                      'Ragione Soc'
000076120511     A                                      HIGHLIGHT
000077120511     A                                   114
000078120511     A                                      'Partita IVA'
000079120511     A                                      HIGHLIGHT
000080120511     A                                   129
000081120511     A                                      'Data Disac.'
000082120511     A                                      HIGHLIGHT
000083120511     A                                   141
000084120511     A                                      'Ult.Valor.'
000085120511     A                                      HIGHLIGHT
000086120511     A                                   156
000087120511     A                                      'Accredit.'
000088120511     A                                      HIGHLIGHT
000089120511     A                                   166
000090120511     A                                      'Disaccred.'
000091120511     A                                      HIGHLIGHT
000092120511     A                                   177
000093120511     A                                      'Emissione'
000094120511     A                                      HIGHLIGHT
000095120511     A                                   187
000096120511     A                                      'Fine Contr.'
000097120511     A                                      HIGHLIGHT
000098120511     A*%%***********************************************************************
000099120511     A*%%SS+
000100120511     A*%%SS+
000101120511     A*%%SS                                 |
000102120511     A*%%CL 001
000103120511     A*%%***********************************************************************
000104120511     A          R DETTAGLI
000105120511     A*%%***********************************************************************
000106120511     A*%%RI 00000
000107120511     A*%%***********************************************************************
000108120511     A                                      CPI(15)
000109120511     A                                      SPACEA(001)
000110120511     A            ADTPDR    R              1
000111120511     A                                      REFFLD(ADTPDR FIADT00F)
000112120511     A                                      EDTCDE(Z)
000113120511     A                                      SPACEB(001)
000114120511     A            DESPDR        25         9
000115120511     A            ADTPRG    R             36
000116120511     A                                      REFFLD(ADTPRG FIADT00F)
000117120511     A                                      EDTCDE(Z)
000118120511     A            ADTDDT    R             41
000119120511     A                                      REFFLD(ADTDDT FIADT00F)
000120120511     A                                      EDTCDE(Y)
000121120511     A            ADTDST    R             52
000122120511     A                                      REFFLD(ADTDST FIADT00F)
000123120511     A                                      EDTCDE(Y)
000124120511     A            ADTNRC    R             64
000125120511     A                                      REFFLD(ADTNRC FIADT00F)
000126120511     A                                      EDTCDE(Z)
000127120511     A            ADTCSF    R             73
000128120511     A                                      REFFLD(ADTCSF FIADT00F)
000129120511     A            ADTCDF    R             77
000130120511     A                                      REFFLD(ADTCDF FIADT00F)
000131120511     A            DESFRN        25        87
000132120511     A            PIVA          16       113
000133120511     A                                      HIGHLIGHT
000134120511     A            DATDIS         8S 0    130
000135120511     A                                      EDTWRD('  /  /   0')
000136120511     A                                      HIGHLIGHT
000137120511     A            DATUVA         8S 0    141
000138120511     A                                      EDTWRD('  /  /   0')
000139120511     A                                      HIGHLIGHT
000140120511     A            DATTACC        8S 0    155
000141120511     A                                      EDTWRD('  /  /   0')
000142120511     A                                      HIGHLIGHT
000143120511     A            DATTDIS        8S 0    166
000144120511     A                                      EDTWRD('  /  /   0')
000145120511     A                                      HIGHLIGHT
000146120511     A            DATTNRC        8S 0    177
000147120511     A                                      EDTWRD('  /  /   0')
000148120511     A                                      HIGHLIGHT
000149120511     A            DATTDFC        8S 0    188
000150120511     A                                      EDTWRD('  /  /   0')
000151120511     A                                      HIGHLIGHT
000152120511     A                                    73
000153120511     A                                      '-->'
000154120511     A                                      SPACEB(001)
000155120511     A                                      HIGHLIGHT
000156120511     A            NOTE          75        77
000157120511     A*%%***********************************************************************
000158120511     A*%%SS
000159120511     A*%%CL+001
000160120511     A*%%CL+
000161120511     A*%%CL                                 |
000162120511     A*%%CL+001
000163120511     A*%%CL+
000164120511     A*%%CL                                 |
000165120511     A*%%CL 001
000166120511     A*%%***********************************************************************
000167120511     A          R TOTALE
000168120511     A*%%***********************************************************************
000169120511     A*%%RI 00000
000170120511     A*%%***********************************************************************
000171120511     A                                      SPACEB(001)
000172120511     A                                      CPI(15)
000173120511     A                                      SPACEA(003)
000174120511     A*%%***********************************************************************
000175120511     A*%%SS
000176120511     A*%%CL 003
000177120511     A*%%***********************************************************************
000178120511     A          R NODATI
000179120511     A*%%***********************************************************************
000180120511     A*%%RI 00000
000181120511     A*%%FS 003
000182120511     A*%%***********************************************************************
000183120511     A                                      SPACEB(004)
000184120511     A                                      CPI(15)
000185120511     A                                      SPACEA(004)
000186120511     A                                    41
000187120511     A                                      '*--  NON  TROVATI  ERRORI SULLE TA-
000188120511     A                                      RIFFE AFFL.DEFLUENZA --*'
000189120511     A                                      HIGHLIGHT
000190120511     A*%%***********************************************************************
000191120511     A*%%SS
000192120511     A*%%CL 004
000193120511     A*%%CP+999CRTPRTF
000194120511     A*%%CP+    CPI(15)
000195120511     A*%%CP+    FILE(GAITRAFIL/TRMZA3P)
000196120511     A*%%CP+    DEVTYPE(*SCS)
000197120511     A*%%CP     PAGESIZE(*N       198      *N     )
000198120511     A*%%CS+999CRTPRTF
000199120511     A*%%CS+    FILE(QTEMP/QPRDRPT)
000200120511     A*%%CS+    DEVTYPE(*SCS)
000201120511     A*%%CS+    PAGESIZE(*N 198)
000202120511     A*%%CS     CPI(15)
000203120511     A*%%***********************************************************************
000204120511     **
