000100950929     A*------------------------------------------------------------------------*
000200090721     A*  DS ESTERNA STAMPA REPORT AUTOCONTROLLO ALLEGATI E CONTRATTI
000300950929     A*------------------------------------------------------------------------*
000400120426     A          R TRMZA4                    TEXT('DS STAMPA REPORT AUTOCONTROLL-
000500090721     A                                      O ALL/CONTRATTI')
000501120426     A            A04SOLOR       1A         TEXT('S= SOLO A RISCHIO')
000600120426     A            A04FIL         3S 0       TEXT('P.O.')
