000010070731     A*%%TS  SD  20070731  142211  EDPBA       REL-V5R3M0  5722-WDS
000020000000     A*              IMMISSIONE GRANDI MANUTENZIONI                    *
000030070731     A*%%EC
000040070731     A                                      DSPSIZ(24 80 *DS3)
000050070731     A                                      PRINT
000060070731     A                                      CA03
000070070731     A          R GA28D001
000080070731     A*%%TS  SD  20070731  142211  EDPBA       REL-V5R3M0  5722-WDS
000090070731     A                                      CF06
000100070731     A            RSUT          20   O  1  2TEXT('DESCRIZIONE DITTA')
000110070731     A                                  1 26'Controllo rifornimenti carburante'
000120070731     A                                      DSPATR(HI)
000130070731     A                                  1 62'TRMZ92R'
000140070731     A                                  1 72DATE
000150070731     A                                      EDTCDE(Y)
000160070731     A                                  2 30'e passaggi autostradali'
000170070731     A                                      DSPATR(HI)
000180070731     A            KNMUS         10   O  2 70
000190070731     A                                 13 15'Data ............:'
000200070731     A                                      DSPATR(HI)
000210070731     A                                 13 35'Dal'
000220070731     A                                      DSPATR(HI)
000230070731     A            VDAL            L  B 13 39DATFMT(*JOB)
000240070731     A                                 13 50'Al'
000250070731     A                                      DSPATR(HI)
000260070731     A            VAL             L  B 13 53DATFMT(*JOB)
000270070731     A                                 24  2'F3=Fine'
000280070731     A                                      COLOR(BLU)
000290070731     A                                 24 25'F6=Conferma'
000300070731     A                                      COLOR(BLU)
