000100150310     A          R TRMZ63DS
000200090722      * OBBLIGATORIO
000300150310     A            I63TIPOELA     1          TEXT('S=STAMPA F=FILE E=ENTRAMBE')
000400150310     A            I63DATDAL      8S 0       TEXT('IN FORZA DAL')
000500150310     A            I63DATAL       8S 0       TEXT('IN FORZA AL')
000600150310     A            O63ERR         1          TEXT('ERRORE')
