000100030120             PGM        PARM(&KPJBA)
000101090406             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
000200971229
000201090406             RUNQRY     QRY(WRKQUERY/MZG.VECCHI) RCDSLT(*YES)
006400010803
006500031028 ENDPGM:     ENDPGM
