000100070727     A          R TRMZ47
000200000000      *
000900070727     A            D47SOC         3          TEXT('SOCIETÀ DIPENDENTE')
001000130201     A            D47MAT         5S 0       TEXT('MATRICOLA DIPENDENTE')
001100070727     A            D47ERRO        1          TEXT('FLAG DI RITORNO')
001200070727     A            D47COGO       40          TEXT('COGNOME DIP.')
001201070802     A            D47DLIO        8S 0       TEXT('DATA LICENZIAMENTO')
001300070727     A            D47NOMO       30          TEXT('NOME DIP.')
