000100090323     A                                      REF(CNDIZION)
000200090323     A          R TRMZ0100I
000300090323     A                                      TEXT('Stampa contratto trasporto +
000400090323     A                                      città: parametri input.')
000500090323     A            CONTRATDAT      L
000600111130     A                                      TEXT('Data contratto -
000700111130     A                                      (inizio validità).')
000800090323     A            CONTRATNUM     7S 0
000900090323     A                                      TEXT('Numero contratto.')
001000090323     A                                      EDTCDE(Z)
001100090323     A            SOCIETA   R
001200090323     A                                      REFFLD($SOC)
001300090323     A                                      TEXT('Società mittente.')
001400090323     A            FILIALE   R     S
001500090323     A                                      REFFLD($FIL)
001600090323     A                                      TEXT('Filiale.')
001700090323     A                                      EDTCDE(Z)
001800090407     A            VETRAGSOC     90A
001900090323     A                                      TEXT('Vettore: ragione sociale.')
002000090323     A                                      VARLEN
002100090323     A            VETSLCOM      50A
002200090323     A                                      TEXT('Vettore: sede legale comune.')
002300090323     A                                      VARLEN
002400090323     A            VETSLIND      50A
002500090323     A                                      TEXT('Vettore: sede legale +
002600090323     A                                      indirizzo.')
002700090323     A                                      VARLEN
002800090323     A            VETSLCAP       9A
002900090323     A                                      TEXT('Vettore: sede legale CAP.')
003000090323     A                                      VARLEN
003100090323     A            VETSLPRV       2A
003200090323     A                                      TEXT('Vettore: sede legale sigla +
003300090323     A                                      provincia.')
003400090323     A            VETSLNAZ       3A
003500090323     A                                      TEXT('Vettore: sede legale sigla +
003600090323     A                                      nazione.')
003700090323     A            VETCDFISCAR
003800090323     A                                      REFFLD($CDFISCAL)
003900090323     A                                      TEXT('Vettore: codice fiscale.')
004000090323     A                                      VARLEN
004100090323     A            VETCDIVA  R
004200090323     A                                      REFFLD($CDIVA)
004300090323     A                                      TEXT('Vettore: codice IVA.')
004400090323     A                                      VARLEN
004500090324     A            VETRIMLUO     50A
004600090323     A                                      TEXT('Vettore: registro imprese +
004700090324     A                                      luogo.')
004800090323     A                                      VARLEN
004900090323     A            VETRIMNUM     20A
005000090323     A                                      TEXT('Vettore: registro imprese +
005100090323     A                                      numero.')
005200090323     A                                      VARLEN
005300090324     A            VETREALUO     50A
005400090323     A                                      TEXT('Vettore: REA +
005500090324     A                                      luogo.')
005600090323     A                                      VARLEN
005700090323     A            VETREANUM     20A
005800090323     A                                      TEXT('Vettore: REA +
005900090323     A                                      numero.')
006000090323     A                                      VARLEN
006100090323     A            VETLEGRAP     50A
006200090323     A                                      TEXT('Vettore: legale +
006300090323     A                                      rappresentante.')
006400090323     A                                      VARLEN
006500090324     A            VETANAPRV      2A
006600090324     A                                      TEXT('Vettore: albo nazionale +
006700090324     A                                      autotrasportatori prov.')
006800090324     A            VETANANUM     20A
006900090324     A                                      TEXT('Vettore: albo nazionale +
007000090324     A                                      autotrasportatori numero.')
007100090324     A                                      VARLEN
007200090422     A            DATASTAMPA      L
007300111130     A                                      TEXT('Ultima data certa.')
007400111130     A            DATACERTAP      L
007500111130     A                                      TEXT('Prima data certa.')
007600111130     A            DATAFIRMAV      L
007700111130     A                                      TEXT('Data firma accettazione -
007800111130     A                                      vettore.')
