000010070926     A*%%TS  SD  20070926  155059  EDPBA       REL-V5R3M0  5722-WDS
000020011121     A***-------------------------------------------------------------**
000030000000     A*              GESTIONE ANAGRAFICA AUTOMEZZI                     *
000040000000     A***-------------------------------------------------------------**
000050070926     A*%%EC
000060070926     A                                      DSPSIZ(24 80 *DS3)
000070070926     A                                      PRINT
000080070926     A                                      CA03
000090011121     A*-------------------------------------
000100070926     A          R GA02D002
000110070926     A*%%TS  SD  20070926  155059  EDPBA       REL-V5R3M0  5722-WDS
000120070926     A            RSUT          20A  O  1  2TEXT('DESCRIZIONE DITTA')
000130070926     A                                      DSPATR(HI)
000140070926     A                                  1 33'STORICO AUTOMEZZI'
000150070926     A                                      DSPATR(RI)
000160070926     A                                      DSPATR(UL)
000170070926     A                                  1 58'* TRMZ02R6 *'
000180070926     A                                      DSPATR(HI)
000190070926     A                                  1 72DATE
000200070926     A                                      EDTCDE(Y)
000210070926     A                                      DSPATR(HI)
000220070926     A            KNMUS         10A  O  2 70DSPATR(HI)
000230070926     A                                  3  2'N° Riferimento........:'
000240070926     A                                      DSPATR(HI)
000250070926     A            VNRF           7Y 0O  3 26EDTCDE(Z)
000260070926     A                                  4  2'Data variazione.......:'
000270070926     A                                      DSPATR(HI)
000280070926     A            VDUR           8Y 0O  4 26EDTWRD('  /  /    ')
000290070926     A                                  5  2'Tipo variazione.......:'
000300070926     A                                      DSPATR(HI)
000310070926     A            VTIP           2A  O  5 26
000320070926     A            VDTIP         20A  O  5 29DSPATR(HI)
000330070926     A                                  6  2'Descrizione variazione:'
000340070926     A                                      DSPATR(HI)
000350070926     A            VDS1          25A  O  6 26
000360070926     A                                  8  2'Destinatario..........:'
000370070926     A                                      DSPATR(HI)
000380070926     A            VDS2          25A  O  8 26
000390070926     A                                 10  2'Autista...............:'
000400070926     A                                      DSPATR(HI)
000410070926     A            VCAU           2A  O 10 26
000420070926     A            VDAU          25A  O 10 29DSPATR(HI)
000430070926     A                                 10 61'Dal:'
000440070926     A                                      DSPATR(HI)
000450070926     A            DATAUT         8Y 0O 10 66EDTWRD('  /  /    ')
000460070926     A                                 12  2'Targa.................:'
000470070926     A                                      DSPATR(HI)
000480070926     A            VTGA           2A  O 12 26
000490070926     A            VTGN           9A  O 12 29
000500070926     A                                 12 40'Targa obsoleta........:'
000510070926     A                                      DSPATR(HI)
000520070926     A            VTGAO          2A  O 12 64
000530070926     A            VTGNO          9A  O 12 67
000540070926     A                                 13  2'Categoria.............:'
000550070926     A                                      DSPATR(HI)
000560070926     A            VCAT           2A  O 13 26
000570070926     A            VDCAT         20A  O 13 29DSPATR(HI)
000580070926     A                                 14  2'Nr. Telaio............:'
000590070926     A                                      DSPATR(HI)
000600070926     A            VTLA          18A  O 14 26
000610070926     A                                 15  2'Telepass..............:'
000620070926     A                                      DSPATR(HI)
000630070926     A            TELEV         10Y 0O 15 26EDTCDE(Z)
000640070926     A                                 17  2'Filiale...............:'
000650070926     A                                      DSPATR(HI)
000660070926     A            VFIL           3Y 0O 17 26EDTCDE(Z)
000670070926     A            VDFIL         25A  O 17 30DSPATR(HI)
000680070926     A                                 18  2'Società in dotazione..:'
000690070926     A                                      DSPATR(HI)
000700070926     A            VSOC           3A  O 18 26
000710070926     A            VDSOC         25A  O 18 30DSPATR(HI)
000720070926     A                                 19  2'Centro di costo.......:'
000730070926     A                                      DSPATR(HI)
000740070926     A            VCDC           8A  O 19 26
000750070926     A            VDCDC         20A  O 19 35DSPATR(HI)
000760070926     A                                 20  2'Situaz. proprietà.....:'
000770070926     A                                      DSPATR(HI)
000780070926     A            VPRO           2A  O 20 26
000790070926     A            VDPRO         15A  O 20 29DSPATR(HI)
000800070926     A                                 23  2'F3=Fine'
000810070926     A                                      COLOR(BLU)
