000010011219     A*%%TS  SD  20011219  125436  EDPBA       REL-V4R4M0  5769-PW1
000020950718     A*------------------------------------------------------------------------*
000030011219     A*%%EC
000040011219     A                                      DSPSIZ(24 80 *DS3)
000050011219     A                                      CHGINPDFT
000060011219     A                                      CF01
000070011219     A                                      CF02
000080011219     A                                      CF03
000090011219     A                                      CF04
000100011219     A                                      CF05
000110011219     A                                      CF06
000120011219     A                                      CF07
000130011219     A                                      CF08
000140011219     A                                      CF09
000150011219     A                                      CF10
000160011219     A                                      CF11
000170011219     A                                      CF12
000180011219     A                                      CF13
000190011219     A                                      CF14
000200011219     A                                      CF15
000210011219     A                                      CF16
000220011219     A                                      CF17
000230011219     A                                      CF18
000240011219     A                                      CF19
000250011219     A                                      CF20
000260011219     A                                      CF21
000270011219     A                                      CF22
000280011219     A                                      CF23
000290011219     A                                      CF24
000300011219     A                                      HELP
000310011120     A          R TOP
000320011120     A*%%TS  SD  20011120  141202  EDPBA       REL-V4R4M0  5769-PW1
000330011120     A                                      WINDOW(4 17 17 45)
000340950718     A*------------------------------------------------------------------------*
000350011219     A          R SFL01                     SFL
000360011219     A*%%TS  SD  20011219  122437  EDPBA       REL-V4R4M0  5769-PW1
000370011219     A            S01OPZ         1A  B  7  3DSPATR(UL)
000380011219     A            S01DES        18A  O  7  5
000390011219     A            S01TGA         2A  O  7 27
000400011219     A            S01TGN         9A  O  7 30
000410950718     A*------------------------------------------------------------------------*
000420011219     A          R CTL01                     SFLCTL(SFL01)
000430011219     A*%%TS  SD  20011219  125436  EDPBA       REL-V4R4M0  5769-PW1
000440011219     A                                      SFLSIZ(0010)
000450011219     A                                      SFLPAG(0009)
000460011219     A                                      WINDOW(TOP)
000470011219     A                                      OVERLAY
000480011219     A N41                                  SFLDSP
000490011219     A N40                                  SFLDSPCTL
000500011219     A  40                                  SFLCLR
000510011219     A                                      SFLDROP(CF09)
000520011219     A            RCDNBR         4S 0H      SFLRCDNBR(*TOP)
000530011219     A                                  3  3'Inizio elenco telaio'
000540011219     A                                      COLOR(WHT)
000550011219     A            VDES          19A  B  3 27DSPATR(UL)
000560011219     A                                  5  1'1=Scelta'
000570011219     A                                      COLOR(BLU)
000580011219     A                                  1 11'Ricerca per telaio'
000590011219     A                                      DSPATR(HI)
000600011219     A                                  6  3'O Telaio                Targa     -
000610011219     A                                        '
000620011219     A                                      DSPATR(UL)
000630011219     A                                      DSPATR(HI)
000640011219     A          R BOT
000650011219     A*%%TS  SD  20011219  122437  EDPBA       REL-V4R4M0  5769-PW1
000660011219     A                                      WINDOW(TOP)
000670011219     A                                      OVERLAY
000680011219     A                                 16  1'F12=Ritorno'
000690011219     A                                      COLOR(BLU)
000700011121     A          R ASSUME
000710011121     A*%%TS  SD  19940608  111038  CAMPORESI   REL-V2R2M0  5738-PW1
000720011121     A                                      TEXT('Serve x preservare il video p-
000730011121     A                                      recedente')
000740011121     A                                      ASSUME
000750011121     A                                  1  2' '
