000100070727     A          R TRMZ62
000200000000      *
000300070727     A            D62TPE         1          TEXT('TIPO ELABORAZIONE BLANK=RT-
000400021219     A                                      C=CHIUDE L=LR')
000402070730     A            D62CAU         2          TEXT('CODICE AUTISTA')
000403070730     A            D62DTA         8S 0       TEXT('DATA MOVIMENTO')
000404070730     A            D62SOCO        3          TEXT('SOCIETÀ DIPENDENTE')
000405070730     A            D62MATO        5S 0       TEXT('CODICE DIPENDENTE')
001100070727     A            D62ERRO        1          TEXT('FLAG DI RITORNO')
