000100170324     A*%%TS  SD  20170324  174339  EDPAB       REL-V7R2M0  5770-WDS
000200170324     A*%%EC
000300170324     A                                      DSPSIZ(24 80 *DS3)
000400170324     A                                      PRINT
000500170324     A                                      ERRSFL
000600170324     A                                      CF12
000700170324     A                                      HELP
000800090310     A*-------------------------------------*
000900090410     A          R D1
001000090410     A*%%TS  SD  20090410  145404  EDPAB       REL-V5R4M0  5722-WDS
001100090410     A                                      WINDOW(8 10 9 60)
001200090410     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
001300090410     A                                      CSRLOC(H1RIGA     H1COLO)
001400090410     A                                      OVERLAY
001500090410     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
001600090410     A                                          '))
001700090410     A            H1NMRC        10A  H      TEXT('Nome Record')
001800090410     A            H1NMFL        10A  H      TEXT('Nome Campo')
001900090410     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
002000090410     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
002100090410     A                                      ore')
002200090410     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
002300090410     A                                      ursore')
002400090410     A            H1NRC          7S 0H      TEXT('NUMERO UNIVOCO')
002500160107     A            H1RECTRS       9S 0H      TEXT('NREL REC TRS')
002600160107     A            H1RECTRA       9S 0H      TEXT('NREL REC TRA')
002700090410     A            D1FUN         20A  O  1  2DSPATR(RI)
002800090410     A                                  1 23'Anagrafica Società Vettore'
002900090410     A                                      DSPATR(UL)
003000090410     A            D1PGM         10A  O  1 50
003100090410     A N11                              2 24'Nr Contratto'
003200090410     A                                      DSPATR(HI)
003300090410     A N11        D1NRC          7  0O  2 37EDTCDE(Z)
003400090410     A  50                                  ERRMSG('Nr Univoco assente' 50)
003500090410     A                                      DSPATR(HI)
003600090410     A            D1ANN         14A  O  2 46
003700120323     A  23
003800120323     AO 25                                  DSPATR(RI)
003900090410     A                                  3  2'Fil.gest.Contr..:'
004000090410     A N07N03N06
004100090410     A N02                                  DSPATR(HI)
004200090410     A            D1FIL          3Y 0B  3 20EDTCDE(Z)
004300090410     A  02
004400090410     AO 06
004500090410     AO 07
004600090410     AO 03                                  DSPATR(PR)
004700090410     A  51                                  ERRMSG('Inserire una Filiale corret-
004800090410     A                                      ta' 51)
004900090410     A N02N03N07                            DSPATR(PC)
005000090410     A                                      CHECK(RB)
005100090410     A            D1DFIL        25A  O  3 24
005200090410     A                                  4  2'Soc.Operativa...:'
005300090410     A N07N03N06
005400090410     A N02                                  DSPATR(HI)
005500090410     A            D1SOCG         3A  B  4 20
005600090410     A  02
005700090410     AO 06
005800090410     AO 07
005900090410     AO 03                                  DSPATR(PR)
006000090410     A                                      CHECK(RB)
006100090410     A  52                                  ERRMSG('Inserire una Società corret-
006200090410     A                                      ta' 52)
006300090410     A            D1DSOCG       30A  O  4 24
006400090410     A                                  5  2'P.IVA Vettore...:'
006500090410     A N07N03N06
006600090410     A N02                                  DSPATR(HI)
006700090410     A            D1IVA         11A  B  5 20
006800090410     A  02
006900090410     AO 06
007000090410     AO 07
007100090410     AO 03                                  DSPATR(PR)
007200090410     A  53                                  ERRMSG('La P.IVA è già presente nel-
007300090410     A                                      la società' 53)
007400090410     A  54                                  ERRMSG('Inserire una P.IVA formalme-
007500090410     A                                      nte corretta' 54)
007600090410     A  55                                  ERRMSG('P.IVA inesistente sull''ana-
007700090410     A                                      grafica Fornitori' 55)
007800090410     A  56                                  ERRMSG('Manca il Cod.Fiscale o dati-
007900090410     A                                       anagrafica Fornitore incompleti' 5-
008000090410     A                                      6)
008100090410     A            D1PROJ        45A  O  6 15
008200090410     A            D1PROJ1       45A  O  7 15
008300090410     A                                  8  8'Enter=Dati Contratto'
008400090410     A                                  8 48'F12=Ritorno'
008500090310     A*-------------------------------------*
008600160217     A          R D2
008700160217     A*%%TS  SD  20160217  091101  EDPMM       REL-V7R1M0  5770-WDS
008800160217     A N06
008900160217     AO 01                                  CF06
009000160217     A                                      CF04
009100160217     A                                      RTNCSRLOC(&H2NMRC &H2NMFL &H2POSC)
009200160217     A                                      CSRLOC(H2RIGA     H2COLO)
009300160217     A                                      OVERLAY
009400160217     A            H2NMRC        10A  H      TEXT('Nome Record')
009500160217     A            H2NMFL        10A  H      TEXT('Nome Campo')
009600160217     A            H2POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
009700160217     A            H2RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
009800160217     A                                      ore')
009900160217     A            H2COLO         3S 0H      TEXT('Colonna dove posizionare il c-
010000160217     A                                      ursore')
010100160217     A            H2NRC          7S 0H      TEXT('NUMERO UNIVOCO')
010200160217     A            H2RECTRS       9S 0H      TEXT('NREL REC TRS')
010300160217     A            H2RECTRA       9S 0H      TEXT('NREL REC TRA')
010400160217     A            H2DEC          8S 0H      TEXT('DATA EMISS.CONTR. AMG')
010500160217     A            H2SAVDEC       8S 0H      TEXT('DTA EMIS.CONTR.ORIGINALE')
010600160217     A            H2DFC          8S 0H      TEXT('DATA FINE CONTR. AMG')
010700160217     A            H2DRC          8S 0H      TEXT('DATA RIENTR.COPIA FIRM.AMG')
010800160217     A            H2DSC          8S 0H      TEXT('DATA STAMPA CONTRATTO AMG')
010900160217     A            H2DIA          8S 0H      TEXT('DATA ISCRIZ.ALBO AMG')
011000160217     A            H2DIN          8S 0H      TEXT('DATA ACCRED.X MAC.DI SCORTA')
011100160217     A            H2FILA         3Y 0H      TEXT('FIL.MACC.DI SCORTA')
011200160217     A            H2SCO          1A  H      TEXT('MACC.DI SCORTA')
011300160217     A            H2UNODC        8S 0H      TEXT('PRIMA DATA CERTA')
011400160217     A            H2DDURC        8S 0H      TEXT('DATA DURC')
011500160217     A            H2DCIP         8S 0H      TEXT('DATA CIP')
011600160217     A            HTRSFLR       30A  H      TEXT('CAMPO FILLER')
011700160217     A            HTRSFLR1      30A  H      TEXT('CAMPO FILLER1')
011800160217     A                                  1  3SYSNAME
011900160217     A            NOMSIF        10A  O  1 13
012000160217     A                                  1 24'Gestione Anagrafica Società Vettor-
012100160217     A                                      e'
012200160217     A                                      DSPATR(UL)
012300160217     A                                      DSPATR(RI)
012400160217     A            D2PGM         10A  O  1 60
012500160217     A                                  1 71DATE
012600160217     A                                      EDTCDE(Y)
012700160217     A            NOMDIT        20A  O  2  3TEXT('DESCRIZIONE DITTA')
012800160217     A            D2FUN         20A  O  2 31DSPATR(RI)
012900160217     A                                  2 60USER
013000160217     A                                  2 71TIME
013100160217     A            D2MSG          1A  O  3  3TEXT('serve per emettere msg relati-
013200160217     A                                      vi a tutta la videata')
013300160217     A            D2ANN         15A  O  3  8
013400160217     A  23
013500160217     AO 25                                  DSPATR(RI)
013600160217     A  23
013700160217     AO 25                                  DSPATR(HI)
013800160217     A            D2OPE         30A  O  3 26DSPATR(HI)
013900160217     A  19                              3 69'RISTAMPATO'
014000160217     A                                      DSPATR(RI)
014100160217     A                                  4  3'Fil.Gest.Contratto..:'
014200160217     A            D2FIL          3Y 0O  4 26EDTCDE(Z)
014300160217     A  16                                  DSPATR(HI)
014400160217     A            D2DFIL        25A  O  4 30TEXT('DESCRIZIONE FILIALE')
014500160217     A                                  4 57'Nr Contratto'
014600160217     A                                      DSPATR(HI)
014700160217     A            D2NRC          7Y 0O  4 70EDTCDE(Z)
014800160217     A  16                                  DSPATR(HI)
014900160217     A                                  5  3'Società Operativa...:'
015000160217     A            D2SOCG         3A  O  5 26TEXT('SOCIETA DI GESTIONE')
015100160217     A  16                                  DSPATR(HI)
015200160217     A            D2DSCG        40A  O  5 30TEXT('DESCRIZIONE FILIALE')
015300160217     A                                  6  3'P.IVA Vettore ......:'
015400160217     A            D2IVA         11A  O  6 26TEXT('Partita IVA')
015500160217     A  16                                  DSPATR(HI)
015600160217     A                                  7  3'Rag.Sociale Vettore.:'
015700160217     A            D2PROJ        44A  O  7 26TEXT('SOCIETA AUTOTRASPORTATORE')
015800160217     A  16                                  DSPATR(HI)
015900160217     A  11                              8  3'                      '
016000160217     A                                      DSPATR(UL)
016100160217     A            D2PROJ1       44A  O  8 26TEXT('SOCIETA AUTOTRASPORTATORE')
016200160217     A  16                                  DSPATR(HI)
016300160217     A                                  8 80' '
016400160217     A                                  9  3'Data Emiss/Decorrenza Contratto:'
016500160217     A N15N03N06
016600160217     A N07                                  DSPATR(HI)
016700160217     A            D2DEC          8Y 0B  9 37
016800160217     A  06
016900160217     AO 07
017000160217     AO 15
017100160217     AO 03                                  DSPATR(PR)
017200160217     A N03N06N15                            DSPATR(PC)
017300160217     A                                      TEXT('Data emissione Contratto')
017400160217     A                                      EDTWRD('  /  /   0')
017500160217     A  48                                  ERRMSG('In modifica,la data di un v-
017600160217     A                                      ecchio contratto può solo essere: 1-
017700160217     A                                      /5/2009' 48)
017800160217     A  49                                  ERRMSG('In Immissione,la data deve -
017900160217     A                                      essere maggiore o uguale a: 1/5/200-
018000160217     A                                      9' 49)
018100160217     A  50                                  ERRMSG('Inserire una Data Valida' 5-
018200160217     A                                      0)
018300160217     A  61                                  ERRMSG('Data non Modificabile. Pres-
018400160217     A                                      esenti tariffe già Confermate' 61)
018500160217     A  62                                  ERRMSG('Tariffe con decorrenza Infe-
018600160217     A                                      riore alla Data Contratto' 62)
018700160217     A                                 10  3'Registro Imprese:'
018800160217     A N15N03N06
018900160217     A N07                                  DSPATR(HI)
019000160217     A            D2CIT         35A  B 10 21
019100160217     A  06
019200160217     AO 07
019300160217     AO 15
019400160217     AO 03                                  DSPATR(PR)
019500160217     A                                      TEXT('Iscrizione CCIAA  città')
019600160217     A  52                                  ERRMSG('Inserire la città di iscriz-
019700160217     A                                      ione' 52)
019800160217     A                                 10 57'Nr'
019900160217     A N15N03N06
020000160217     A N07                                  DSPATR(HI)
020100160217     A            D2NIS         16A  B 10 60
020200160217     A  06
020300160217     AO 07
020400160217     AO 15
020500160217     AO 03                                  DSPATR(PR)
020600160217     A                                      TEXT('NR.CCIAA')
020700160217     A  53                                  ERRMSG('Inserire il numero di Iscri-
020800160217     A                                      zione' 53)
020900160217     A                                 11  3'Iscr.ALBO trasp.:'
021000160217     A N15N03N06
021100160217     A N07                                  DSPATR(HI)
021200160217     A            D2PIA          2A  B 11 21
021300160217     A  06
021400160217     AO 07
021500160217     AO 15
021600160217     AO 03                                  DSPATR(PR)
021700160217     A                                      TEXT('iscrizione ALBO trasportatori-
021800160217     A                                      ')
021900160217     A  54                                  ERRMSG('Inserire una provincia vali-
022000160217     A                                      da' 54)
022100160217     A                                 11 24'Nr'
022200160217     A N15N03N06
022300160217     A N07                                  DSPATR(HI)
022400160217     A            D2NIA         16A  B 11 27
022500160217     A  06
022600160217     AO 07
022700160217     AO 15
022800160217     AO 03                                  DSPATR(PR)
022900160217     A                                      TEXT('nr.iscrizione ALBO trasportat-
023000160217     A                                      ori')
023100160217     A  55                                  ERRMSG('Inserire un numero signific-
023200160217     A                                      ativo' 55)
023300160217     A                                 11 46'Data rilascio REN..'
023400160217     A                                      DSPATR(HI)
023500160217     A            D2DIA          8Y 0B 11 66
023600160217     A  06
023700160309     AO 07
023800160217     AO 03                                  DSPATR(PR)
023900160217     A                                      TEXT('Data REN')
024000160217     A                                      EDTWRD('  /  /   0')
024100160217     A  56                                  ERRMSG('Inserire una Data Valida' 5-
024200160217     A                                      6)
024300160217     A                                 12  3'Data Stampa 1a data certa'
024400160217     A                                      DSPATR(HI)
024500160217     A            D2UNODC        8Y 0O 12 29TEXT('Data Stampa Contratto prima d-
024600160217     A                                      ata certa')
024700160217     A                                      EDTWRD('  /  /   0')
024800160217     A                                 12 46'Data Certa Ristampa'
024900160217     A N19                                  DSPATR(ND)
025000160217     A                                      DSPATR(HI)
025100160217     A            D2DSC          8Y 0O 12 66TEXT('Data ristampa ultima data cer-
025200160217     A                                      ta')
025300160217     A                                      EDTWRD('  /  /   0')
025400160217     A N19                                  DSPATR(ND)
025500160217     A                                 13  3'Data  Fine  Contratto...:'
025600160217     A                                      DSPATR(UL)
025700160217     A            D2DFC          8Y 0O 13 29TEXT('Data Fine Contratto')
025800160217     A                                      EDTWRD('  /  /   0')
025900160217     A  11                                  DSPATR(UL)
026000160217     A                                 13 46'Rientro Copia Firm.'
026100160217     A N03N06N07                            DSPATR(HI)
026200160217     A            D2DRC          8Y 0B 13 66
026300160217     A  06N01
026400160217     AO 03N01
026500160217     AO 07N01
026600160217     AO 11N01                               DSPATR(PR)
026700160217     A  15                                  DSPATR(PC)
026800160217     A                                      TEXT('Data rientro copia firmata')
026900160217     A  51                                  ERRMSG('Inserire una Data Valida o -
027000160217     A                                      superiore a Data Stampa e Data Emis-
027100160217     A                                      sione.' 51)
027200160217     A  57                                  ERRMSG('Non può essere superiore al-
027300160217     A                                      la data del giorno' 57)
027400160217     A  60                                  ERRMSG('Non si può inserire una Dat-
027500160217     A                                      a rientro se non c''è prima data di-
027600160217     A                                       stampa' 60)
027700160217     A                                      EDTWRD('  /  /   0')
027800160217     A                                 14  3'Data decor. D.U.R.C. ...:'
027900160217     A N03N06N07                            DSPATR(HI)
028000160217     A            D2DDURC        8Y 0B 14 29
028100160217     A  06
028200160217     AO 07
028300160217     AO 03                                  DSPATR(PR)
028400160217     A                                      TEXT('Data DURC')
028500160217     A                                      EDTWRD('  /  /   0')
028600160217     A  58                                  ERRMSG('Data Formalmente errata' 58)
028700160217     A  79                                  ERRMSG('Non amesse date successive -
028800160217     A                                      alla data odierna' 79)
028900160217     A                                 15  3'Regolarità L.190/14 data:'
029000160217     A N03N06N07                            DSPATR(HI)
029100160217     A            D2DCIP         8Y 0B 15 29
029200160217     A  06
029300160217     AO 07
029400160217     AO 03                                  DSPATR(PR)
029500160217     A                                      TEXT('Data regolarità')
029600160217     A                                      EDTWRD('  /  /   0')
029700160217     A  59                                  ERRMSG('Data Formalmente errata o n-
029800160217     A                                      on immessa' 59)
029900160217     A  78                                  ERRMSG('Data regolarità obbligatori-
030000160217     A                                      a o maggiore di 3 mesi' 78)
030100160217     A  11                             17 41'                                  -
030200160217     A                                          '
030300160217     A                                 22  3'F4=Ricerca'
030400160217     A                                      COLOR(BLU)
030500160217     A N06
030600160217     AO 01                             22 15'F6=Conferma'
030700160217     A                                      COLOR(BLU)
030800160217     A                                 22 67'F12=Ritorno'
030900160217     A                                      COLOR(BLU)
031000160217     A                                 23 67' '
031100160217     A            D2COR          1A  B 15 63
031200160309     A  06
031300160309     AO 07
031400160309     AO 03                                  DSPATR(PR)
031500160217     A  80                                  ERRMSG('Stato regolarità non inseri-
031600160217     A                                      to o non valido' 80)
031700160217     A  81                                  ERRMSG('Data e flag regolarità devo-
031800160217     A                                      no essere presenti entrambi' 81)
031900160217     A                                 15 46'Stato Regolarità'
032000160217     A                                      DSPATR(HI)
032100160217     A            D2CORD        15A  O 15 65
032200120127     A*                                23  3'F1=Appendici al contratto'
032300090317     A*--------------------------------------------------------*
032400160204     A          R D3
032500160204     A*%%TS  SD  20160204  112235  EDPMM       REL-V7R1M0  5770-WDS
032600160204     A                                      CHGINPDFT
032700160204     A                                      WINDOW(10 10 11 60)
032800160204     A                                      CF06
032900160204     A                                      RTNCSRLOC(&H3NMRC &H3NMFL &H3POSC)
033000160204     A                                      CSRLOC(H3RIGA     H3COLO)
033100160204     A                                      OVERLAY
033200160204     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
033300160204     A                                          '))
033400160204     A            H3NMRC        10A  H      TEXT('Nome Record')
033500160204     A            H3NMFL        10A  H      TEXT('Nome Campo')
033600160204     A            H3POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
033700160204     A            H3RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
033800160204     A                                      ore')
033900160204     A            H3COLO         3S 0H      TEXT('Colonna dove posizionare il c-
034000160204     A                                      ursore')
034100160204     A            H3NRC          7S 0H      TEXT('NUMERO UNIVOCO')
034200160204     A            H3RECTRS       9S 0H      TEXT('NREL REC TRS')
034300160204     A            H3RECTRA       9S 0H      TEXT('NREL REC TRA')
034400160204     A            H3DATA         8S 0H
034500160204     A            D3FUN         20A  O  1 37DSPATR(RI)
034600160204     A                                  2  2'INSERIRE'
034700160204     A                                      DSPATR(HI)
034800160204     A            D3MSG          1A  O  3  2TEXT('serve per emettere msg relati-
034900160204     A                                      vi a tutta la videata')
035000160204     A            D3COSA        31A  O  3  5DSPATR(HI)
035100160204     A            D3DATA         8Y 0B  3 37EDTWRD('  /  /   0')
035200160204     A  60                                  ERRMSG('Inserire una Data Valida' 6-
035300160204     A                                      0)
035400160204     A  67                                  ERRMSG('L''attuale contratto non ha-
035500160204     A                                      data di stampa o di rientro copia f-
035600160204     A                                      irmata' 67)
035700160204     A  68                                  ERRMSG('Sono presenti tariffe ancor-
035800160204     A                                      a NON fatte SCADERE' 68)
035900160204     A  69                                  ERRMSG('Le Tariffe NON sono SCADUTE-
036000160204     A                                       nello stesso giorno' 69)
036100160204     A  70                                  ERRMSG('Ci sono degli Autisti ancor-
036200160204     A                                      a Accreditati' 70)
036300160204     A  71                                  ERRMSG('Ci sono Autisti disaccredit-
036400160204     A                                      ati DOPO la data Fine Contratto' 71)
036500160204     A                                      DSPATR(UL)
036600160204     A            D3COD          7A  O  4  2
036700160204     A            D3SOCG         3A  B  4 10
036800160204     A N08                                  DSPATR(PR)
036900160204     A N08                                  DSPATR(ND)
037000160204     A                                      CHECK(RB)
037100160204     A  61                                  ERRMSG('La Società non è corretta' -
037200160204     A                                      61)
037300160204     A  65                                  ERRMSG('La Società è già presente c-
037400160204     A                                      on stessa P.IVA' 65)
037500160204     A  08                                  DSPATR(UL)
037600160204     A  08                                  DSPATR(PC)
037700160204     A            D3IVA         11A  B  4 14
037800160204     A N09                                  DSPATR(PR)
037900160204     A N09                                  DSPATR(ND)
038000160204     A  09                                  DSPATR(UL)
038100160204     A  09                                  DSPATR(PC)
038200160204     A  63                                  ERRMSG('La P.IVA è già presente nel-
038300160204     A                                      la società' 63)
038400160204     A  64                                  ERRMSG('Non ci sono Fornitori per l-
038500160204     A                                      a P.IVA inerenti la società' 64)
038600160204     A  66                                  ERRMSG('La P.IVA è già presente con-
038700160204     A                                       stessa Società' 66)
038800160204     A  67                                  ERRMSG('L''attuale contratto non è -
038900160204     A                                      ancora stato stampato' 67)
039000160204     A  68                                  ERRMSG('Sono presenti tariffe ancor-
039100160204     A                                      a NON fatte SCADERE' 68)
039200160204     A  69                                  ERRMSG('Le Tariffe NON sono SCADUTE-
039300160204     A                                       nello stesso giorno' 69)
039400160204     A            D3DES         45A  O  5  7
039500160204     A            D3DES1        45A  O  6  7
039600160204     A            D3FIL          3Y 0B  6 53
039700160204     A N08                                  DSPATR(PR)
039800160204     A N08                                  DSPATR(ND)
039900160204     A                                      CHECK(RB)
040000160204     A  08                                  DSPATR(UL)
040100160204     A  08                                  DSPATR(PC)
040200160204     A                                      EDTCDE(Z)
040300160204     A  62                                  ERRMSG('La Filiale non è corretta p-
040400160204     A                                      er la Società immessa' 62)
040500160204     A            D3NOT1        58A  O  7  2
040600160204     A N10                                  DSPATR(ND)
040700160204     A            D3NOT2        58A  O  8  2
040800160204     A N10                                  DSPATR(ND)
040900160204     A            D3NOT3        58A  O  9  2
041000160204     A N10                                  DSPATR(ND)
041100160204     A  10                             10  3' F6=Esegue Conferma '
041200160204     A                                      DSPATR(RI)
041300160204     A N10                             10 22'F6=Conferma'
041400160204     A                                 10 48'F12=Ritorno'
041500090320     A*---------------------------
041600170324     A          R D4
041700170324     A*%%TS  SD  20170324  174339  EDPAB       REL-V7R2M0  5770-WDS
041800170324     A                                      CF06
041900170324     A                                      CF04
042000170324     A                                      CF15
042100170324     A  92                                  CF07
042200170324     A                                      KEEP
042300170324     A                                      RTNCSRLOC(&H4NMRC &H4NMFL &H4POSC)
042400170324     A                                      CSRLOC(H4RIGA H4COLO)
042500170324     A                                      OVERLAY
042600170324     A                                      WINDOW(6 3 16 73)
042700170324     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
042800170324     A                                          '))
042900170324     A            H4NMRC        10A  H      TEXT('Nome Record')
043000170324     A            H4NMFL        10A  H      TEXT('Nome Campo')
043100170324     A            H4POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
043200170324     A            H4RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
043300170324     A                                      ore')
043400170324     A            H4COLO         3S 0H      TEXT('Colonna dove posizionare il c-
043500170324     A                                      ursore')
043600170324     A            H4NRC          7S 0H      TEXT('NUMERO UNIVOCO')
043700170324     A            H4RECTRS       9S 0H      TEXT('NREL REC TRS')
043800170324     A            H4RECTRA       9S 0H      TEXT('NREL REC TRA')
043900170324     A            H4AUTC         7S 0H      TEXT('AUT RIT/DIST')
044000170324     A            H4AUTAD        7S 0H      TEXT('AUT AFF/DEFL')
044100170324     A            H4PROTC        1A  H      TEXT('PROTECT AUT')
044200170324     A            H4PROTAD       1A  H      TEXT('PROTECT AUT AFF/DEF')
044300170324     A            H4DFC          8S 0H      TEXT('DATA FINE CONTR. AMG')
044400170324     A            H4FILA         3Y 0H
044500170324     A            H4SCO          1A  H      TEXT('MACCHINA SCORTA')
044600170324     A            H4RIS          1A  H      TEXT('EX DI RISERVA')
044700170324     A            H4IE           1A  H
044800170324     A            H4DIN          8S 0H
044900170324     A            H4DTSPS        8S 0H
045000170324     A            H4DTRPS        8S 0H
045100170324     A            H4DUNIL        8S 0H
045200170324     A                                  1  2'Data accreditamento '
045300170324     A                                      DSPATR(HI)
045400170324     A            D4DIN          8Y 0B  1 23EDTWRD('  /  /   0')
045500170324     A  13                                  DSPATR(PR)
045600170324     A  75                                  ERRMSG('Inserire una data VALIDA e -
045700170324     A                                      NON inferiore all''emissione del co-
045800170324     A                                      ntratto' 75)
045900170324     A  76                                  ERRMSG('Data Accreditamento NON con-
046000170324     A                                      gruente con le Tariffe' 76)
046100170324     A  88                              1 36'Scaduto il'
046200170324     A                                      DSPATR(HI)
046300170324     A N88                              1 36'nr.Contratto'
046400170324     A                                      DSPATR(HI)
046500170324     A  88        D4DFC          6Y 0O  1 47EDTCDE(Y)
046600170324     A N88        D4NRC          7S 0O  1 49
046700170324     A N88                              1 57'del'
046800170324     A                                      DSPATR(HI)
046900170324     A N88        D4DEC          8Y 0O  1 61EDTCDE(Y)
047000170324     A            D4ANN         14A  O  2 57
047100170324     A  23
047200170324     AO 25                                  DSPATR(RI)
047300170324     A                                      COLOR(RED)
047400170324     A                                  3  2'Ritiri/Distribuzione'
047500170324     A N03N06                               DSPATR(HI)
047600170324     A            D4AUTC         3Y 0B  3 23EDTCDE(Z)
047700170324     A  06
047800170324     AO 03                                  DSPATR(PR)
047900170324     A  07                                  DSPATR(PC)
048000170324     A                                      CHECK(RB)
048100170324     A  55                                  ERRMSG('Inserire un Codice AUT corr-
048200170324     A                                      etto' 55)
048300170324     A  65                                  ERRMSG('Inserire un Codice AUT NON -
048400170324     A                                      precedentemente utilizzato' 65)
048500170324     A  70                                  ERRMSG('Non presenti autisti per la-
048600170324     A                                       Funzione di Ricerca' 70)
048700170324     A  72                                  ERRMSG('Non appartiene alla Società-
048800170324     A                                       del Contratto verifica P.IVA' 72)
048900170324     A  62                                  ERRMSG('Tariffe AUT hanno decorrenz-
049000170324     A                                      a inferiore alla Data Contratto' 62)
049100170324     A            D4AUTC1        4Y 0B  3 27EDTCDE(Z)
049200170324     A  06
049300170324     AO 03                                  DSPATR(PR)
049400170324     A  07                                  DSPATR(PC)
049500170324     A                                      CHECK(RB)
049600170324     A  55                                  ERRMSG('Inserire un Codice AUT corr-
049700170324     A                                      etto' 55)
049800170324     A  65                                  ERRMSG('Inserire un Codice AUT NON -
049900170324     A                                      precedentemente utilizzato' 65)
050000170324     A  70                                  ERRMSG('Non presenti autisti per la-
050100170324     A                                       Funzione di Ricerca' 70)
050200170324     A  72                                  ERRMSG('Non appartiene alla Società-
050300170324     A                                       del Contratto verifica P.IVA' 72)
050400170324     A  62                                  ERRMSG('Tariffe AUT hanno decorrenz-
050500170324     A                                      a inferiore alla Data Contratto' 62)
050600170324     A            D4DAUTC       31A  O  3 36DSPATR(HI)
050700170324     A                                  4  2'Affluenze/Defluenze '
050800170324     A N03N06                               DSPATR(HI)
050900170324     A            D4AUTAD        3Y 0B  4 23EDTCDE(Z)
051000170324     A  06
051100170324     AO 03                                  DSPATR(PR)
051200170324     A                                      CHECK(RB)
051300170324     A  56                                  ERRMSG('Inserire un Codice AUT corr-
051400170324     A                                      etto' 56)
051500170324     A  66                                  ERRMSG('Inserire un Codice AUT NON -
051600170324     A                                      precedentemente utilizzato' 66)
051700170324     A  71                                  ERRMSG('Non presenti autisti per la-
051800170324     A                                       Funzione di Ricerca' 71)
051900170324     A  73                                  ERRMSG('Non appartiene alla Società-
052000170324     A                                       del Contratto verifica P.IVA' 73)
052100170324     A  74                                  ERRMSG('Il codice Filiale non è un -
052200170324     A                                      Terminal' 74)
052300170324     A  62                                  ERRMSG('Tariffe AUT hanno decorrenz-
052400170324     A                                      a inferiore alla Data Contratto' 62)
052500170324     A            D4AUTAD1       4Y 0B  4 27EDTCDE(Z)
052600170324     A  06
052700170324     AO 03                                  DSPATR(PR)
052800170324     A                                      CHECK(RB)
052900170324     A  56                                  ERRMSG('Inserire un Codice AUT corr-
053000170324     A                                      etto' 56)
053100170324     A  66                                  ERRMSG('Inserire un Codice AUT NON -
053200170324     A                                      precedentemente utilizzato' 66)
053300170324     A  71                                  ERRMSG('Non presenti autisti per la-
053400170324     A                                       Funzione di Ricerca' 71)
053500170324     A  73                                  ERRMSG('Non appartiene alla Società-
053600170324     A                                       del Contratto verifica P.IVA' 73)
053700170324     A  62                                  ERRMSG('Tariffe AUT hanno decorrenz-
053800170324     A                                      a inferiore alla Data Contratto' 62)
053900170324     A            D4DAUTAD      31A  O  4 36DSPATR(HI)
054000170324     A                                  6  2'Nazionalità.........'
054100170324     A                                      DSPATR(HI)
054200170324     A            D4IE           1A  B  6 23VALUES('I' 'E' ' ')
054300170324     A  63                                  ERRMSG('Inserire Italia o Estero' 6-
054400170324     A                                      3)
054500170324     A                                  6 27'(I/E)'
054600170324     A                                      DSPATR(HI)
054700170324     A                                  6 36'Codice fiscale...'
054800170324     A                                      DSPATR(HI)
054900170324     A            D4CFISC       16A  B  6 54
055000170324     A  92                                  DSPATR(RI PC)
055100170324     A  81                                  ERRMSG('Inserire un codice Fiscale -
055200170324     A                                      corretto' 81)
055300170324     A                                  7  2'Autista a perdere...'
055400170324     A  25
055500170324     AO 24                                  DSPATR(ND)
055600170324     A                                      DSPATR(HI)
055700170324     A            D4APER         1A  B  7 23VALUES(' ' 'S')
055800170324     A  25
055900170324     AO 24                                  DSPATR(ND)
056000170324     A  25
056100170324     AO 24                                  DSPATR(PR)
056200170324     A                                  7 27'(S=Si)'
056300170324     A  25
056400170324     AO 24                                  DSPATR(ND)
056500170324     A                                      DSPATR(HI)
056600170324     A                                  7 36'Senza Automezzo.?'
056700170324     A  25                                  DSPATR(ND)
056800170324     A N03N06N02                            DSPATR(HI)
056900170324     A            D4RIS          1A  B  7 54
057000170324     A  02
057100170324     AO 25
057200170324     AO 06
057300170324     AO 03                                  DSPATR(PR)
057400170324     A  25                                  DSPATR(ND)
057500170324     A  69                                  ERRMSG('Tipologia Autista NON corre-
057600170324     A                                      tta!' 69)
057700170324     A            D4RISD        18A  O  7 56DSPATR(HI)
057800170324     A  25
057900170324     AO 24                                  DSPATR(ND)
058000170324     A                                  8  2'Dipendente/Autonomo.'
058100170324     A  25
058200170324     AO 24                                  DSPATR(ND)
058300170324     A                                      DSPATR(HI)
058400170324     A            D4DIPA         1A  B  8 23
058500170324     A  25
058600170324     AO 24                                  DSPATR(ND)
058700170324     A  25
058800170324     AO 24                                  DSPATR(PR)
058900170324     A                                      VALUES('A' 'D' ' ')
059000170324     A  77                                  ERRMSG('Completare dipendente/auton-
059100170324     A                                      omo e ore settimanali' 77)
059200170324     A                                  8 27'(D/A)'
059300170324     A                                      DSPATR(HI)
059400170324     A  25
059500170324     AO 24                                  DSPATR(ND)
059600170324     A                                  8 36'CCNL............?'
059700170324     A                                      DSPATR(HI)
059800170324     A  25
059900170324     AO 24                                  DSPATR(ND)
060000170324     A            D4CCNL         1A  B  8 54
060100170324     A  25
060200170324     AO 24                                  DSPATR(ND)
060300170324     A  25
060400170324     AO 24                                  DSPATR(PR)
060500170324     A  87                                  ERRMSG('Cod.CCNL non valido o non p-
060600170324     A                                      resente tab. x CCNL' 87)
060700170324     A            D4CCNLD       18A  O  8 56DSPATR(HI)
060800170324     A  25
060900170324     AO 24                                  DSPATR(ND)
061000170324     A                                  9  2'Ore lavorative......'
061100170324     A  25
061200170324     AO 24                                  DSPATR(ND)
061300170324     A                                      DSPATR(HI)
061400170324     A            D4OREL         2Y 0B  9 23EDTCDE(Z)
061500170324     A  25
061600170324     AO 24                                  DSPATR(ND)
061700170324     A  25
061800170324     AO 24                                  DSPATR(PR)
061900170324     A  77                                  ERRMSG('Completare dipendente/auton-
062000170324     A                                      omo e ore settimanali' 77)
062100170324     A                                  9 36'Qualifica prof..?'
062200170324     A                                      DSPATR(HI)
062300170324     A  25
062400170324     AO 24                                  DSPATR(ND)
062500170324     A            D4QUAPR        1A  B  9 54
062600170324     A  25
062700170324     AO 24                                  DSPATR(ND)
062800170324     A  25
062900170324     AO 24                                  DSPATR(PR)
063000170324     A  89                                  ERRMSG('Cod.non valido e non presen-
063100170324     A                                      te tab Qualifiche prof.' 89)
063200170324     A            D4QUAPRD      18A  O  9 56DSPATR(HI)
063300170324     A  25
063400170324     AO 24                                  DSPATR(ND)
063500170324     A                                 10 36'Liv.contratto...?'
063600170324     A                                      DSPATR(HI)
063700170324     A  25
063800170324     AO 24                                  DSPATR(ND)
063900170324     A            D4LIV          1A  B 10 54
064000170324     A  25
064100170324     AO 24                                  DSPATR(ND)
064200170324     A  25
064300170324     AO 24                                  DSPATR(PR)
064400170324     A  90                                  ERRMSG('Cod.non valido e non presen-
064500170324     A                                      te tab.Livello Contr.' 90)
064600170324     A            D4LIVD        18A  O 10 56DSPATR(HI)
064700170324     A  25
064800170324     AO 24                                  DSPATR(ND)
064900170324     A                                 11  2'Scadenza UNILAV.....'
065000170324     A                                      DSPATR(HI)
065100170324     A            D4DUNIL        8Y 0B 11 23EDTWRD('  /  /   0')
065200170324     A  78                                  ERRMSG('Data Errata o Inferiore all-
065300170324     A                                      a decorrenza del Contratto' 78)
065400170324     A                                 12  2'Permesso Soggiorno..'
065500170324     A                                      DSPATR(HI)
065600170324     A            D4DTSPS        8Y 0B 12 23EDTWRD('  /  /   0')
065700170324     A  79                                  ERRMSG('Data Errata o oltre 5 Anni'-
065800170324     A                                       79)
065900170324     A  91                                  ERRMSG('Inserire o il Permesso di S-
066000170324     A                                      ogg. o il Rinnovo del Permesso' 91)
066100170324     A                                 12 36'Data Rinnovo Per.'
066200170324     A                                      DSPATR(HI)
066300170324     A            D4DTRPS        8Y 0B 12 54EDTWRD('  /  /   0')
066400170324     A  80                                  ERRMSG('Data Errata o oltre 5 Anni'-
066500170324     A                                       80)
066600170324     A  91                                  ERRMSG('Inserire o il Permesso di S-
066700170324     A                                      ogg. o il Rinnovo del Permesso' 91)
066800170324     A                                 13  2'P.IVA Consorziata..?'
066900170324     A                                      DSPATR(HI)
067000170324     A            D4IVAC        11A  B 13 23
067100170324     A  06
067200170324     AO 03                                  DSPATR(PR)
067300170324     A  82                                  ERRMSG('Inserire una PIVA x la cons-
067400170324     A                                      orziata' 82)
067500170324     A  83                                  ERRMSG('Non è un Consorzio. La part-
067600170324     A                                      ita IVA non deve esserci.' 83)
067700170324     A  84                                  ERRMSG('La PIVA è formalmente errat-
067800170324     A                                      a' 84)
067900170324     A  85                                  ERRMSG('Non esiste l''anagrafica co-
068000170324     A                                      nsorzi per la P.IVA. F15 per inseri-
068100170324     A                                      rla' 85)
068200170324     A  86                                  ERRMSG('La P.IVA consorziata non pu-
068300170324     A                                      ò essere uguale alla P.IVA del cons-
068400170324     A                                      orzio' 86)
068500170324     A            D4MSG         70A  O 14  2COLOR(BLU)
068600170324     A                                 15  2'F4=Ricerche Aut '
068700170324     A                                      COLOR(BLU)
068800170324     A                                 15 23'F6=Conferma'
068900170324     A                                      COLOR(BLU)
069000170324     A                                 15 38'F12=Ritorno'
069100170324     A                                      COLOR(BLU)
069200170324     A                                 15 54'F15=Anagr.Consorzi'
069300170324     A                                      COLOR(BLU)
069400160111     A          R D5
069500160111     A*%%TS  SD  20160111  125523  EDPAB       REL-V7R1M0  5770-WDS
069600160111     A                                      CF06
069700160111     A                                      KEEP
069800160111     A                                      OVERLAY
069900160111     A                                      WINDOW(16 3 5 73)
070000160111     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
070100160111     A                                          '))
070200160111     A            H5NMRC        10A  H      TEXT('Nome Record')
070300160111     A            H5NMFL        10A  H      TEXT('Nome Campo')
070400160111     A            H5POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
070500160111     A            H5RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
070600160111     A                                      ore')
070700160111     A            H5COLO         3S 0H      TEXT('Colonna dove posizionare il c-
070800160111     A                                      ursore')
070900160111     A            H5NRC          7S 0H      TEXT('NUMERO UNIVOCO')
071000160111     A            H5RECTRS       9S 0H      TEXT('NREL REC TRS')
071100160111     A            H5RECTRA       9S 0H      TEXT('NREL REC TRA')
071200160111     A            H5AUTC         7S 0H      TEXT('AUT RIT/DIST')
071300160111     A            H5AUTAD        7S 0H      TEXT('AUT AFF/DEFL')
071400160111     A            H5PROTC        1A  H      TEXT('PROTECT AUT')
071500160111     A            H5PROTAD       1A  H      TEXT('PROTECT AUT AFF/DEF')
071600160111     A            H5DFC          8S 0H      TEXT('DATA FINE CONTR. AMG')
071700160111     A            H5DIN          8S 0H
071800160111     A            D5FUN         20A  O  1  2DSPATR(RI)
071900160111     A            D5ANN         14A  O  1 59
072000160111     A  23
072100160111     AO 25                                  DSPATR(RI)
072200160111     A                                      COLOR(RED)
072300160111     A                                  2  2'Data accreditamento:'
072400160111     A                                      DSPATR(HI)
072500160111     A            D5DIN          8Y 0B  2 23EDTWRD('  /  /   0')
072600160111     A  13                                  DSPATR(PR)
072700160111     A  75                                  ERRMSG('Inserire una data NON Infer-
072800160111     A                                      iore all''emissione del contratto' -
072900160111     A                                      75)
073000160111     A  76                                  ERRMSG('Data Accreditamento NON con-
073100160111     A                                      gruente con le Tariffe' 76)
073200160111     A                                  3  7'Filiale ......:'
073300160111     A N13N03N06
073400160111     A N02                                  DSPATR(HI)
073500160111     A            D5FILA         3Y 0B  3 23EDTCDE(Z)
073600160111     A  13
073700160111     AO 02
073800160111     AO 06
073900160111     AO 03
074000160111     AO 25                                  DSPATR(PR)
074100160111     A  69                                  ERRMSG('Filiale non corretta' 69)
074200160111     A            D5FILAD       26A  O  3 27
074300160111     A                                  4 23'F6=Conferma'
074400160111     A                                      COLOR(BLU)
074500160111     A                                  4 42'F12=Ritorno'
074600160111     A                                      COLOR(BLU)
074700090410     A*--------------------------------------------------------*
074800090312     A          R FRCDTA
074900090312     A*%%TS  DD  20060228  142315  CussiniD    REL-V5.0.1  WDSc
075000090312     A                                      FRCDTA
075100090312     A                                      CLRL(*NO)
075200090312     A*--------------------------------------------------------*
075300090312     A          R ASSUME
075400090312     A*%%TS  SD  20090312  115708  EDPAB       REL-V5R4M0  5722-WDS
075500090312     A                                      TEXT('Serve x preservare il video p-
075600090312     A                                      recedente')
075700090312     A                                      ASSUME
075800090312     A                                  1  2' '
075900090410     A*--------------------------------------------------------*
076000090330     A          R ALERTWIND
076100090330     A*%%TS  SD  20090330  152440  EDPAB       REL-V5R4M0  5722-WDS
076200090330     A                                      WINDOW(12 5 9 60)
076300090330     A                                      RTNCSRLOC(&H4NMRC &H4NMFL &H4POSC)
076400090330     A                                      CSRLOC(H4RIGA     H4COLO)
076500090330     A                                      OVERLAY
076600090330     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
076700090330     A                                          '))
076800090330     A            H4NMRC        10A  H      TEXT('Nome Record')
076900090330     A            H4NMFL        10A  H      TEXT('Nome Campo')
077000090330     A            H4POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
077100090330     A            H4RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
077200090330     A                                      ore')
077300090330     A            H4COLO         3S 0H      TEXT('Colonna dove posizionare il c-
077400090330     A                                      ursore')
077500090330     A            H4NRC          7S 0H      TEXT('NUMERO UNIVOCO')
077600160107     A            H4RECTRS       9S 0H      TEXT('NREL REC TRS')
077700160107     A            H4RECTRA       9S 0H      TEXT('NREL REC TRA')
077800090330     A            D4FUN         20A  O  1  2DSPATR(RI)
077900090330     A                                  1 23'  Anagrafica Società  '
078000090330     A                                      DSPATR(UL)
078100090330     A            D4PGM         10A  O  1 50
078200090330     A            D4ANN         14A  O  2 27
078300120323     A  23
078400120323     AO 25                                  DSPATR(RI)
078500090330     A                                  2 50'Nr'
078600090330     A                                      DSPATR(HI)
078700090330     A            D4NRC          7Y 0O  2 53EDTCDE(Z)
078800090330     A  50                                  ERRMSG('Nr Univoco assente' 50)
078900090330     A                                      DSPATR(HI)
079000090330     A                                  4 10'Attenzione: Problemi di aggiorname-
079100090330     A                                      nto !!!'
079200090330     A N03N06N04                            DSPATR(HI)
079300090330     A                                  6  4'Il Data Base non è stato aggiornat-
079400090330     A                                      o Verificare i dati.'
079500090330     A                                      DSPATR(HI)
079600090330     A                                  8 44'Enter x avanzare'
079700090525     A*--------------------------------------------------------*
079800090525     A          R MSGWIND
079900090525     A*%%TS  SD  20090525  165239  EDPAB       REL-V5R4M0  5722-WDS
080000090525     A                                      WINDOW(12 8 9 60)
080100090525     A                                      RTNCSRLOC(&H4NMRC &H4NMFL &H4POSC)
080200090525     A                                      CSRLOC(H4RIGA     H4COLO)
080300090525     A                                      OVERLAY
080400090525     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
080500090525     A                                          '))
080600090525     A            H4NMRC        10A  H      TEXT('Nome Record')
080700090525     A            H4NMFL        10A  H      TEXT('Nome Campo')
080800090525     A            H4POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
080900090525     A            H4RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
081000090525     A                                      ore')
081100090525     A            H4COLO         3S 0H      TEXT('Colonna dove posizionare il c-
081200090525     A                                      ursore')
081300090525     A            H4NRC          7S 0H      TEXT('NUMERO UNIVOCO')
081400160107     A            H4RECTRS       9S 0H      TEXT('NREL REC TRS')
081500160107     A            H4RECTRA       9S 0H      TEXT('NREL REC TRA')
081600090525     A            D4FUN         20A  O  1  2DSPATR(RI)
081700090525     A                                  1 23'  Anagrafica Società  '
081800090525     A                                      DSPATR(UL)
081900090525     A            D4PGM         10A  O  1 50
082000090525     A            D4ANN         14A  O  2 27
082100120323     A  23
082200120323     AO 25                                  DSPATR(RI)
082300090525     A                                  2 50'Nr'
082400090525     A                                      DSPATR(HI)
082500090525     A            D4NRC          7Y 0O  2 53EDTCDE(Z)
082600090525     A                                      DSPATR(HI)
082700090525     A            D4MSG0        55A  O  3  3
082800090525     A            D4MSG1        55A  O  4  3
082900090525     A            D4MSG2        55A  O  5  3
083000090525     A            D4MSG3        55A  O  6  3
083100090525     A            D4MSG4        55A  O  7  3
083200090525     A            D4MSG5        35   O  8  3
083300090525     A                                  8 44'Enter x avanzare'
083400090525     A                                      DSPATR(HI)
083500091215     A          R DELWIND
083600091215     A                                      CF06
083700160107     A*%%TS  SD  200ù1215  090215  EDPAB       REL-V5R4M0  5722-WDS
083800091215     A                                      WINDOW(12 8 9 60)
083900091215     A                                      RTNCSRLOC(&WH4NMRC &WH4NMFL -
084000091215     A                                      &WH4POSC)
084100091215     A                                      CSRLOC(WH4RIGA   WH4COLO)
084200091215     A                                      OVERLAY
084300091215     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
084400091215     A                                          '))
084500091215     A            WH4NMRC       10A  H      TEXT('Nome Record')
084600091215     A            WH4NMFL       10A  H      TEXT('Nome Campo')
084700091215     A            WH4POSC        4S 0H      TEXT('Posizione Cursore nel Campo')
084800091215     A            WH4RIGA        3S 0H      TEXT('Riga dove posizionare il curs-
084900091215     A                                      ore')
085000091215     A            WH4COLO        3S 0H      TEXT('Colonna dove posizionare il c-
085100091215     A                                      ursore')
085200091215     A            WH4NRC         7S 0H      TEXT('NUMERO UNIVOCO')
085300160107     A            WH4RECTRS      9S 0H      TEXT('NREL REC TRS')
085400160107     A            WH4RECTRA      9S 0H      TEXT('NREL REC TRA')
085500091215     A            W4FUN         20A  O  1  2DSPATR(RI)
085600091215     A                                  1 23'  Anagrafica Società  '
085700091215     A                                      DSPATR(UL)
085800091215     A            W4PGM         10A  O  1 50
085900091215     A            W4ANN         14A  O  2  5
086000120323     A  23
086100120323     AO 25                                  DSPATR(RI)
086200091215     A                                  2 50'Nr'
086300091215     A                                      DSPATR(HI)
086400091215     A            W4NRC          7Y 0O  2 53EDTCDE(Z)
086500091215     A                                      DSPATR(HI)
086600091215     A            W4MSG0        55A  O  3  3
086700091215     A            W4MSG1        55A  O  4  3
086800091215     A            W4MSG2        55A  O  5  3
086900091215     A            W4MSG3        55A  O  6  3
087000091215     A            W4MSG4        55A  O  7  3
087100091215     A                                  8  3'F12=Non Annullare'
087200091215     A                                      DSPATR(HI)
087300091215     A                                  8 34'F6=Conferma Annullamento'
087400091215     A                                      DSPATR(HI)
