000100000000     A*----------------------------------------------------------------
000200070921     A* -WFCTRA0F-    ARCHIVIO CTR UTILIZZO AUTO AZIENDALI
000300000000     A*----------------------------------------------------------------
000400070921     A          R WFCTRA00                  TEXT('CTR UTILIZZO AUTO AZIENDALI')
000500000000      *
000501070926     A            CTRADIS        1          TEXT('DISTRETTO')
000502070926     A            CTRAAREA       3  0       TEXT('AREA')
000503070926     A            CTRAFIL        3  0       TEXT('FILIALE')
000900070921     A            CTRATGN       11          TEXT('TARGA')
001000070921     A                                      COLHDG('TARGA')
001001070921     A            CTRACAU        2          TEXT('AUTISTA')
001002070921     A            CTRADES       25          TEXT('DES. AUTISTA')
001003070921     A            CTRASOC        3          TEXT('SOCIETÀ DIPENDEMTE')
001004070921     A            CTRAMAT        5  0       TEXT('CODICE DIPENDENTE')
001006070926     A            CTRATPA        1          TEXT('ASSENZA F=FESTIVO A=ASSENTE -
001007070926     A                                      S=SABATO D=DOMENICA')
001008070921     A            CTRATPU        1          TEXT('UTILIZZO A=AGIP F=FAISERVICE')
001100070921     A            CTRADTU        8  0       TEXT('DATA UTILIZZO')
001200070921     A                                      COLHDG('DATA')
001201070926     A            CTRAORA        6  0       TEXT('ORA UTILIZZO')
001202070926     A                                      COLHDG('ORA')
002300070921     A            CTRADIV        3          TEXT('DIVISA')
002400070921     A                                      COLHDG('DIVISA')
002401070926     A            CTRAPRT       11  3       TEXT('IMPORTO')
002402070926     A                                      COLHDG('IMPORTO')
002700070926     A            CTRALUOGO     50          TEXT('LUOGO UTILIZZO')
002800070926     A                                      COLHDG('LUOGO')
