000100000000     A*----------------------------------------------------------------
000200011211     A*  L.F. AUTOMEZZI X  - AUTISTA
000300011211     A*---------------------------------------------------------------0
000400141203     A          R MZAME000                  PFILE(WRKAME0F)
000500000000      *
000600011211     A          K AMECAU
000700011211     A          K AMEDAL
000800011128     A          K AMENRF
