000100000000     A*----------------------------------------------------------------
000200890918     A*  L.F. AUTOMEZZI X  NUMERO RIFERIMENTO
000300000000     A*----------------------------------------------------------------
000400141203     A          R MZAME000                  PFILE(WRKAME0F)
000500000000      *
000600000000     A          K AMENRF
000700890918     A*  AMENRF  - NUMERO RIFERIMENTO
