000010070611     A*%%TS  SD  20070611  133700  EDPBA       REL-V5R3M0  5722-WDS
000020070611     A*%%EC
000030070611     A                                      DSPSIZ(24 80 *DS3)
000040070611     A          R DG95D01
000050070611     A*%%TS  SD  20070611  133700  EDPBA       REL-V5R3M0  5722-WDS
000060070611     A                                      WINDOW(5 15 15 40 *NOMSGLIN *NORSTC-
000070070611     A                                      SR)
000080070611     A                                      CA03
000090070611     A                                      CF06
000091070611     A                                      CF01
000100070611     A                                      CSRLOC(H1RIGA     H1COLO)
000110070611     A                                      OVERLAY
000120070611     A            H1RIGA         3S 0H
000130070611     A            H1COLO         3S 0H
000140070611     A                                  1  1'Data inizio Distinta Consegna Auto-
000150070611     A                                      matica'
000160070611     A                                      DSPATR(HI)
000170070611     A                                  4  1'Filiale:'
000180070611     A            W1CFIL         3Y 0B  4 10DSPATR(HI)
000190070611     A                                      DSPATR(UL)
000200070611     A                                      CHECK(RZ)
000210070611     A  40                                  DSPATR(PC)
000220070611     A            W1DFIL        20A  O  4 14
000230070611     A                                  6  1'Data...:'
000240070611     A            W1CDDA         8Y 0B  6 10EDTWRD('  /  /    ')
000250070611     A                                      EDTMSK('  &  &    ')
000251070611     A  03
000260070611     AO 41                                  DSPATR(PC)
000270070611     A                                      DSPATR(HI)
000280070611     A N03                                  DSPATR(PR)
000290070611     A N02                             11  1'Password:'
000300070611     A N02        W1CPSW        10A  B 11 11DSPATR(ND)
000310070611     A                                      DSPATR(PC)
000320070611     A                                 14  1'F3=Fine'
000330070611     A                                      COLOR(BLU)
000340070611     A                                 14 30'F6=Conferma'
000350070611     A                                      COLOR(BLU)
000360070611     A            W1CMSG        40A  O 15  1
000370070611     A                                 14 11'F1=Modifica data'
000380070611     A                                      COLOR(BLU)
000390070306     A**-------------------------------------------------------------**
000400070323     A          R ASSUME
000410070323     A*%%TS  SD  20070323  082312  EDPMB       REL-V5R3M0  5722-WDS
000420070323     A                                      ASSUME
000430070323     A                                  3  4' '
000440070323     A                                  4  4' '
