000010070112     A*%%TS  SD  20070112  110704  EDPBA       REL-V5R3M0  5722-WDS
000020950523     A*** FILE : FNLRF0D *--------------------------------------------*
000030950522     A*          GESTIONE FOGLI DISTINTE CONSEGNA                     **
000040000000     A***-------------------------------------------------------------**
000050070112     A*%%EC
000060070112     A                                      DSPSIZ(24 80 *DS3)
000070070112     A                                      CHGINPDFT(HI UL)
000080070112     A                                      PRINT
000090950522     A*
000100950522     A**-------------------------------------------------------------**
000110070112     A          R LRF0S03                   SFL
000120070112     A*%%TS  SD  20070112  110016  EDPBA       REL-V5R3M0  5722-WDS
000121070115     A            VSHNRF         9  0H
000130070112     A            VSCSCE         1A  B  6  2TEXT('Campo scelta')
000140070112     A                                      DSPATR(HI)
000150070112     A                                      VALUES(' ' '1' 'D')
000160070112     A            VSCATB         1A  O  6  5
000170070112     A            VSCFPP         1A  O  6  8
000180070112     A            VSCPDR         7S 0O  6 11TEXT('Codice padroncino')
000190070112     A            VSDPDR        25A  O  6 19TEXT('Decodifica padroncino')
000200070112     A            VSCDDE          L  O  6 45DATFMT(*JOB)
000210070112     A            VSCDSC          L  O  6 56DATFMT(*JOB)
000220950522     A*
000230950522     A**-------------------------------------------------------------**
000240070112     A          R LRF0C03                   SFLCTL(LRF0S03)
000250070112     A*%%TS  SD  20070112  110704  EDPBA       REL-V5R3M0  5722-WDS
000270070112     A                                      CA12
000290070112     A                                      CA03
000300070112     A                                      OVERLAY
000310070112     A N21                                  SFLDSP
000320070112     A N21                                  SFLDSPCTL
000330070112     A  21                                  SFLCLR
000340070112     A                                      SFLSIZ(0017)
000350070112     A                                      SFLPAG(0016)
000360070112     A            REC            4S 0H      SFLRCDNBR
000370070112     A  28        V2CMSG        78   M
000380070112     A            V1CRSU        20A  O  1  2
000390070112     A                                  1 24'*** RICERCA GIRI AUTOTRASPORTORE *-
000400070112     A                                      **'
000410070112     A                                      DSPATR(RI)
000420070112     A            V1CPGM         7A  O  1 62
000430070112     A                                  1 71DATE
000440070112     A                                      EDTCDE(Y)
000450070112     A            KNSIF         10A  O  2  2
000460070112     A            KNMUS         10A  O  2 13
000470070112     A                                  2 71TIME
000480070112     A                                  3  2'1=Scelta'
000490070112     A                                      COLOR(BLU)
000500070112     A                                  3 14'D=Dettaglio giri'
000510070112     A                                      COLOR(BLU)
000520070112     A                                  4  2'                                  -
000530070112     A                                                                         -
000540070112     A                                                '
000550070112     A                                      DSPATR(UL)
000560070112     A                                  5  2'   A M/P Autotrasportatore        -
000570070112     A                                               Dta dec.   Dta sca.       -
000580070112     A                                                '
000590070112     A                                      DSPATR(UL)
000600070112     A          R LRF0Z04
000610070112     A*%%TS  SD  20070112  110704  EDPBA       REL-V5R3M0  5722-WDS
000620070112     A                                      OVERLAY
000630070112     A                                 23  2'F3=Fine'
000640070112     A                                      COLOR(BLU)
000650070112     A                                 23 12'F12=Ritorno'
000660070112     A                                      COLOR(BLU)
