000100890918     A*--------------------------------------------------------------*
000200110801     A*  FIDG51DS - DS PASSAGGIO PARAMETRI FIDG51R
000300890918     A*--------------------------------------------------------------*
000400110801     A          R FIDG51
000500110801     A* OBB: SE PASSATA DA SOLA (NO RMA) AGGIORNA TUTTI I PERFECT ORDER
000600110801     C* DELLA LNA + £6
000700110801     A            D51FGSI        3S 0       TEXT('P.O. DI GESTIONE')
000800110801     A* OPZIONALE SE SI VUOLE CAMBIARE SOLO UN PERFECT ORDER
000900110801     A            D51RMAI       15          TEXT('PERFECT ORDER')
001000110801     A* OPZIONALE SE PASSATO LO CONTROLLA
001100110801     A            D51KSCI        7S 0       TEXT('CODICE CLIENTE')
001200110801     A* SE PASSATO IL GIRO LO IMPOSTA SU TUTTE LE SPEDIZIONI
001300110801     A* ALTRIMENTI METTE IL GIRO CHE LEGGE NELLA PRIMA SPEDIZIONE
001400110802     A* CON PESO MAGGIORE PER PERFECT ORDER
001500110802     A            D51CGII       10          TEXT('CODICE GIRO')
