000100110506     A*%%TS  SD  20110506  135215  EDPMB       REL-V6R1M0  5761-WDS
000200110506     A*%%EC
000300110506     A                                      DSPSIZ(24 80 *DS3)
000400110506     A                                      INDARA
000500070306     A**-------------------------------------------------------------**
000600110506     A          R DG50W01
000700110506     A*%%TS  SD  20110506  135215  EDPMB       REL-V6R1M0  5761-WDS
000800110506     A                                      WINDOW(10 10 10 54 *NORSTCSR)
000900110506     A                                      CA03
001000110506     A                                      CF06
001100110506     A                                      CF08
001200110506     A                                      OVERLAY
001300110506     A  28        W01MSG        50   M
001400110506     A                                  1 17'Controllo esiti da PDA'
001500110506     A                                      DSPATR(RI)
001600110506     A                                  4  5'Filiale:'
001700110506     A            W01FGS         3Y 0B  4 14CHECK(RZ)
001800110506     A                                      DSPATR(HI)
001900110506     A  50                                  DSPATR(PC)
002000110506     A            W01DFGS       25A  O  4 18
002100110506     A                                  5  5'Data...:'
002200110506     A            W01DATA        8Y 0B  5 14DSPATR(HI)
002300110506     A                                      CHECK(RZ)
002400110506     A                                      EDTCDE(Y)
002500110506     A  51                                  DSPATR(PC)
002600110506     A                                  7  1'Verrà creato il file WFPDA00F nell-
002700110506     A                                      a libreria GAITRAAZM'
002800110506     A                                  9  1'F3=Fine'
002900110506     A                                      COLOR(BLU)
003000110506     A                                  9 15'F8=Visualizza WFPDA00F'
003100110506     A                                      COLOR(BLU)
003200110506     A                                  9 43'F6=Conferma'
003300110506     A                                      COLOR(BLU)
003400070306     A**-------------------------------------------------------------**
003500070306     A          R ASSUME
003600070306     A                                      ASSUME
003700070306     A                                  3  4' '
