000010070528     A*%%TS  SD  20070528  115715  EDPMB       REL-V5R3M0  5722-WDS
000020070528     A*%%EC
000030070528     A                                      DSPSIZ(24 80 *DS3)
000040070528     A          R DG98D01
000050070528     A*%%TS  SD  20070528  115715  EDPMB       REL-V5R3M0  5722-WDS
000060070528     A                                      WINDOW(5 15 15 40 *NOMSGLIN *NORSTC-
000070070528     A                                      SR)
000080070528     A                                      CA03
000090070528     A                                      CF06
000100070528     A                                      CSRLOC(H1RIGA     H1COLO)
000110070528     A                                      OVERLAY
000120070528     A            H1RIGA         3S 0H
000130070528     A            H1COLO         3S 0H
000140070528     A  28        W1CMSG        40   M
000150070528     A                                  1  9'Filiale da Elaborare'
000160070528     A                                      DSPATR(HI)
000170070528     A                                  4  1'Filiale:'
000180070528     A            W1CFIL         3Y 0B  4 10DSPATR(HI)
000190070528     A                                      DSPATR(UL)
000200070528     A                                      CHECK(RZ)
000210070528     A  40                                  DSPATR(PC)
000220070528     A            W1DFIL        20A  O  4 14
000230070528     A                                  7  1'Fase 1 Una Tantum :'
000240070528     A            W1FAS1A        1A  B  7 21DSPATR(HI)
000250070528     A                                      VALUES(' ' 'S')
000260070528     A                                  7 23'(S=Sì)'
000270070528     A            W1DTA1A        8Y 0O  7 31EDTWRD('  /  /    ')
000280070528     A                                  8  1'Fase 1 giornaliera:'
000290070528     A            W1FAS1B        1A  B  8 21DSPATR(HI)
000300070528     A                                      VALUES(' ' 'S')
000310070528     A                                  8 23'(S=Sì)'
000320070528     A            W1DTA1B        8Y 0O  8 31EDTWRD('  /  /    ')
000330070528     A                                  9  1'Fase 2 simulazione:'
000340070528     A            W1FAS2         1A  B  9 21DSPATR(HI)
000350070528     A                                      VALUES(' ' 'S')
000360070528     A                                  9 23'(S=Sì)'
000370070528     A            W1DTA2         8Y 0O  9 31EDTWRD('  /  /    ')
000380070528     A N02                             11  1'Password:'
000390070528     A N02        W1CPSW        10A  B 11 11DSPATR(ND)
000400070528     A                                      DSPATR(PC)
000410070528     A                                 15  1'F3=Fine'
000420070528     A                                      COLOR(BLU)
000430070528     A                                 15 30'F6=Conferma'
000440070528     A                                      COLOR(BLU)
000450070306     A**-------------------------------------------------------------**
000460070502     A          R DG98S01                   SFL
000470070502     A*%%TS  SD  20070502  143044  EDPMB       REL-V5R3M0  5722-WDS
000480070502     A            W1SSCE         1A  B  4  5DSPATR(HI)
000490070502     A                                      VALUES(' ' '1')
000500070502     A            W1SFIL         3S 0O  4  7
000510070502     A            W1SDFIL       20A  O  4 11
000520070306     A**-------------------------------------------------------------**
000530070525     A          R DG98C01                   SFLCTL(DG98S01)
000540070525     A*%%TS  SD  20070525  093529  EDPMB       REL-V5R3M0  5722-WDS
000550070525     A                                      SFLSIZ(0030)
000560070525     A                                      SFLPAG(0010)
000570070525     A                                      WINDOW(DG98Z01)
000580070525     A                                      CA03
000590070525     A                                      CF06
000600070525     A                                      OVERLAY
000610070525     A  20                                  SFLDSP
000620070525     A  21                                  SFLDSPCTL
000630070525     A N21                                  SFLCLR
000640070525     A  31                                  SFLEND(*MORE)
000650070525     A            RECSF1         4S 0H      SFLRCDNBR
000660070525     A  28        W1CMSG        40   M
000670070525     A                                  1  9'Filiale da elaborare'
000680070525     A                                      DSPATR(HI)
000690070525     A                                  3  2'1=Scelta'
000700070525     A            W1FASE        18A  O  3 13DSPATR(HI)
000710070306     A**-------------------------------------------------------------**
000720070323     A          R DG98Z01
000730070323     A*%%TS  SD  20070323  102750  EDPMB       REL-V5R3M0  5722-WDS
000740070323     A                                      WINDOW(5 15 15 35 *NOMSGLIN *NORSTC-
000750070323     A                                      SR)
000760070323     A                                      OVERLAY
000770070323     A                                 15  2'F3=Fine'
000780070323     A                                      COLOR(BLU)
000790070323     A                                 15 24'F6=Conferma'
000800070323     A                                      COLOR(BLU)
000810070306     A**-------------------------------------------------------------**
000820070323     A          R ASSUME
000830070323     A*%%TS  SD  20070323  082312  EDPMB       REL-V5R3M0  5722-WDS
000840070323     A                                      ASSUME
000850070323     A                                  3  4' '
000860070323     A                                  4  4' '
