000010070927     A*%%TS  SD  20070927  175723  EDPAB       REL-V5R3M0  5722-WDS
000020070427     A*   FILE : FIDG35D
000030070427     A*          GESTIONE ESTENSIONE DISTINTA: VALORI ASSEGNATIO X GIRO
000040000000     A*-------------------------------------------------------------------------
000050070927     A*%%EC
000060070927     A                                      DSPSIZ(24 80 *DS3)
000070070927     A                                      PRINT
000080000000     A**************************************************************************
000090070724     A          R DG02T01
000100070724     A*%%TS  SD  20070724  130344  EDPBA       REL-V5R3M0  5722-WDS
000110070724     A                                      CA03
000120070724     A                                      OVERLAY
000130070724     A            VDSA          20A  O  1  2
000140070724     A                                  1 31'*** GESTIONE DISTINTE ***'
000150070724     A                                      DSPATR(RI)
000160070724     A                                  1 63'FIDG35R'
000170070724     A                                  1 72DATE
000180070724     A                                      EDTCDE(Y)
000190070724     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000200070724     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000210070724     A                                  2 72TIME
000220070724     A                                  2 27'*** DETTAGLIO ASSEGNAZIONE GIRI **'
000230070724     A                                      DSPATR(RI)
000240000000     A**************************************************************************
000250070724     A          R DG02S01                   SFL
000260070724     A*%%TS  SD  20070724  130344  EDPBA       REL-V5R3M0  5722-WDS
000270070724     A            VSCFGSG        3S 0H
000280070724     A            VSCOPZ         1A  B 12  2
000290070724     A  23                                  DSPATR(PR)
000300070724     A                                      VALUES('2' '3' ' ')
000310070724     A            VSCTP          1A  O 12  5
000320070724     A            VSCTASS        1A  O 12  9
000330070724     A            VSCCGI        10A  O 12 13TEXT('GIRO')
000340070724     A                                      DSPATR(HI)
000350070724     A            VSDCGI        25A  O 12 24
000360070724     A            VSCPRGG        2Y 0O 12 51TEXT('PRIORITÀ')
000370070724     A                                      EDTCDE(Z)
000380070724     A            VSCSQL         2Y 0O 12 54EDTCDE(Z)
000390070724     A            VSCNBL         5Y 0O 12 58EDTCDE(2)
000400070724     A            VSCPKL         7Y 1O 12 65EDTCDE(2)
000410070724     A            VSCVLU         5Y 3O 12 75EDTCDE(2)
000420070927     A          R DG02C01                   SFLCTL(DG02S01)
000430070927     A*%%TS  SD  20070927  175723  EDPAB       REL-V5R3M0  5722-WDS
000440070927     A                                      SFLSIZ(0011)
000450070927     A                                      SFLPAG(0010)
000460070927     A                                      CA03
000470070927     A                                      CA12
000480070927     A                                      CA09
000490070927     A                                      CA10
000500070927     A                                      CA11
000510070927     A                                      OVERLAY
000520070927     A  20                                  SFLDSP
000530070927     A N21                                  SFLDSPCTL
000540070927     A  21                                  SFLCLR
000550070927     A  22                                  SFLEND
000560070927     A            REC            4S 0H      SFLRCDNBR
000570070927     A                                  4  2'Numero distinta'
000580070927     A            VNFV           6Y 0O  4 18DSPATR(HI)
000590070927     A                                      EDTCDE(2)
000600070927     A                                  4 26'del'
000610070927     A            VDFV            L  O  4 30DSPATR(HI)
000620070927     A                                      DATFMT(*JOB)
000630070927     A                                  4 41'Fil.'
000640070927     A            VFGS           3S 0O  4 46DSPATR(HI)
000650070927     A            VDFGS         20A  O  4 50
000660070927     A            VDFPP         10A  O  4 71DSPATR(HI)
000670070927     A                                  5  2'Autotrasportat.'
000680070927     A            VPDR      R        O  5 18REFFLD(APDPDR *LIBL/FIAPD00F)
000690070927     A                                      DSPATR(HI)
000700070927     A            VDPDR     R        O  5 26REFFLD(APDRSC *LIBL/FIAPD00F)
000710070927     A                                  6  2'CONSEGNE:'
000720070927     A                                      DSPATR(UL)
000730070927     A                                  6 12'Peso DA ass.'
000740070927     A            VPKL           7Y 1O  6 25EDTCDE(2)
000750070927     A                                      DSPATR(HI)
000760070927     A                                  6 35'Vol.DA ass.'
000770070927     A            VVLU           5Y 3O  6 47EDTCDE(2)
000780070927     A                                      DSPATR(HI)
000790070927     A                                  6 54'MAX ferm.'
000800070927     A            VNFTL          3Y 0O  6 64EDTCDE(2)
000810070927     A                                      DSPATR(HI)
000820070927     A                                  7 12'Peso assegn.'
000830070927     A            VPKLA          7Y 1O  7 25EDTCDE(2)
000840070927     A                                      DSPATR(HI)
000850070927     A                                  7 35'Vol.assegn.'
000860070927     A            VVLUA          5Y 3O  7 47EDTCDE(2)
000870070927     A                                      DSPATR(HI)
000880070927     A                                  7 54'Ferm.ass.'
000890070927     A            VNFTLA         3Y 0O  7 64EDTCDE(2)
000900070927     A                                      DSPATR(HI)
000910070927     A                                  7 68'Sped.ass.'
000920070927     A            VNBLA          3Y 0O  7 78EDTCDE(2)
000930070927     A                                      DSPATR(HI)
000940070927     A                                  8  2'RITIRI  :'
000950070927     A                                      DSPATR(UL)
000960070927     A N55                                  DSPATR(ND)
000970070927     A                                  8 12'Peso DA ass.'
000980070927     A N55                                  DSPATR(ND)
000990070927     A            VRPKL          7  1O  8 25EDTCDE(2)
001000070927     A                                      DSPATR(HI)
001010070927     A N55                                  DSPATR(ND)
001020070927     A                                  8 35'Vol.DA ass.'
001030070927     A N55                                  DSPATR(ND)
001040070927     A            VRVLU          5  3O  8 47EDTCDE(2)
001050070927     A                                      DSPATR(HI)
001060070927     A N55                                  DSPATR(ND)
001070070927     A                                  8 54'MAX ferm.'
001080070927     A N55                                  DSPATR(ND)
001090070927     A            VRNFTL         3  0O  8 64EDTCDE(2)
001100070927     A                                      DSPATR(HI)
001110070927     A N55                                  DSPATR(ND)
001120070927     A                                  9 12'Peso assegn.'
001130070927     A N55                                  DSPATR(ND)
001140070927     A            VRPKLA         7  1O  9 25EDTCDE(2)
001150070927     A                                      DSPATR(HI)
001160070927     A N55                                  DSPATR(ND)
001170070927     A                                  9 35'Vol.assegn.'
001180070927     A N55                                  DSPATR(ND)
001190070927     A            VRVLUA         5  3O  9 47EDTCDE(2)
001200070927     A                                      DSPATR(HI)
001210070927     A N55                                  DSPATR(ND)
001220070927     A                                  9 54'Ferm.ass.'
001230070927     A N55                                  DSPATR(ND)
001240070927     A            VRNFTLA        3  0O  9 64EDTCDE(2)
001250070927     A                                      DSPATR(HI)
001260070927     A N55                                  DSPATR(ND)
001270070927     A                                  9 68'Rit. ass.'
001280070927     A N55                                  DSPATR(ND)
001290070927     A            VRNBLA         3  0O  9 78EDTCDE(2)
001300070927     A                                      DSPATR(HI)
001310070927     A N55                                  DSPATR(ND)
001320070927     A                                 10  2'Opzioni: 2=Togli   3=Trasferisci'
001330070927     A                                      COLOR(BLU)
001340070927     A  23                                  DSPATR(ND)
001350070927     A                                 11  2'O C/R A/M  Giro       Descrizione -
001360070927     A                                                     Pr.Sq. Sp/Rit.     P-
001370070927     A                                      eso Volume'
001380070927     A                                      DSPATR(UL)
001390070927     A                                      DSPATR(HI)
001400070905     A          R DG02D02
001410070905     A*%%TS  SD  20070905  122731  EDPAB       REL-V5R3M0  5722-WDS
001420070905     A                                      OVERLAY
001430070905     A                                 23  2'F3=Fine'
001440070905     A                                      COLOR(BLU)
001450070905     A                                 23 12'F12=Ritorno'
001460070905     A                                      COLOR(BLU)
001470070905     A                                 23 26'F9=Ord.GIRO'
001480070905     A                                      COLOR(BLU)
001490070905     A                                 23 40'F10=Ord.Con+Rit'
001500070905     A                                      COLOR(BLU)
001510070905     A                                 23 58'F11=Ord.Rit+Con'
001520070905     A                                      COLOR(BLU)
