000100140917      *------------------------------------------------------------
000200171227     ffiapd70f  uf   e             disk
000300000607      *--------------------------------------------------------------------
000400171204     c                   do        *hival        rr                7 0
000500171227     c     rr            delete    fiapd70f                             01
000600171204     c                   if        *in01
000700171204     c                   iter
000800171204     c                   end
000900171227     c                   if        not %found(fiapd70f)
001000171204     c                   leave
001100171204     c                   end
001200171204     c                   enddo
001300171204     c                   seton                                        lr
