000100040511      *---------------------------------------------------------------*
000200160212      *  SPEDIZIONI IN DISTINTA MANUALI E AUTOMATICHE                 *
000300040511      *---------------------------------------------------------------*
000400040511     A                                      REF(CNDIZION)
000500040511      *
000600160212     A          R FIARG520                  TEXT('SPEDIZIONI IN DIST-  GEO-REFE-
000700160212     A                                      INTA MAUALI E AUTOMATICHE')
000800040511      *
005604160212     A            WFGS      R     S         REFFLD($FGS)
005605070125     A                                      TEXT('P.O. GEST. DISTINTA CONSEGNA')
005606070125     A                                      COLHDG('P.O.' 'DIST.CONS')
005700160212     A            WDES          20
005800160212     A                                      TEXT('DESCRIZIONE FILIALE')
005900160212     A                                      COLHDG('FILIALE')
006000160212     A            WDDC      R     S         REFFLD($DDC)
006100070125     A                                      TEXT('DATA DISTINTA CONSEGNA')
006200070125     A                                      COLHDG('DATA' 'DIST.CONS')
006300160212     A            WMAN           9S 0       TEXT('SPEDIZIONI MANUALI')
006400160212     A            WAUT           9S 0       TEXT('SPEDIZIONI AUTOMATICHE')
