000010070110     A*%%TS  SD  20070110  113736  EDPMB       REL-V5R3M0  5722-WDS
000020070110     A*%%EC
000030070110     A                                      DSPSIZ(24 80 *DS3)
000040070110     A          R ST50D01
000050070110     A*%%TS  SD  20070110  113736  EDPMB       REL-V5R3M0  5722-WDS
000060070110     A                                      CHGINPDFT(HI CS)
000070070110     A                                      PRINT
000080070110     A                                      CF03
000090070110     A                                      CF06
000100070110     A  28        VIDMSG        78   M
000110070110     A            RSUT          20A  O  1  2
000120070110     A                                  1 25'*  VERIFICA  IMPORTANZA  CLIENTI  -
000130070110     A                                      *'
000140070110     A                                      DSPATR(RI)
000150070110     A                                      DSPATR(UL)
000160070110     A                                  1 62'TIST50R'
000170070110     A                                  1 71DATE
000180070110     A                                      EDTCDE(Y)
000190070110     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000200070110     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000210070110     A                                  2 71TIME
000220070110     A                                  4 28'DA'
000230070110     A                                  4 35'A'
000240070110     A                                  5  3'Categoria Clienti  D .:'
000250070110     A            VIDIDD         4Y 0B  5 27EDTCDE(Z)
000260070110     A  40                                  DSPATR(RI)
000270070110     A  40                                  DSPATR(PC)
000280070110     A                                  5 32'-'
000290070110     A            VIDIDA         4Y 0B  5 34EDTCDE(Z)
000300070110     A  40                                  DSPATR(RI)
000310070110     A                                  5 39'(Importi in migliaia di euro)'
000320070110     A                                  6  3'Categoria Clienti  T .:'
000330070110     A            VIDITD         4Y 0B  6 27EDTCDE(Z)
000340070110     A  40                                  DSPATR(RI)
000350070110     A                                  6 32'-'
000360070110     A            VIDITA         4Y 0B  6 34EDTCDE(Z)
000370070110     A  40                                  DSPATR(RI)
000380070110     A                                  6 46'  "         "  '
000390070110     A                                  7  3'Categoria Clienti  A .:'
000400070110     A            VIDIAD         4Y 0B  7 27EDTCDE(Z)
000410070110     A  40                                  DSPATR(RI)
000420070110     A                                  7 32'-'
000430070110     A            VIDIAA         4Y 0B  7 34EDTCDE(Z)
000440070110     A  40                                  DSPATR(RI)
000450070110     A                                  7 46'  "         "  '
000460070110     A                                  8  3'Categoria Clienti  B .:'
000470070110     A            VIDIBD         4Y 0B  8 27EDTCDE(Z)
000480070110     A  40                                  DSPATR(RI)
000490070110     A                                  8 32'-'
000500070110     A            VIDIBA         4Y 0B  8 34EDTCDE(Z)
000510070110     A  40                                  DSPATR(RI)
000520070110     A                                  8 46'  "         "  '
000530070110     A                                  9  3'Categoria Clienti  C .:'
000540070110     A            VIDICD         4Y 0B  9 27EDTCDE(Z)
000550070110     A  40                                  DSPATR(RI)
000560070110     A            VIDICA         4Y 0B  9 34EDTCDE(Z)
000570070110     A  40                                  DSPATR(RI)
000580070110     A                                  9 46'  "         "  '
000590070110     A                                 11  3'Fatturato ........ dal:'
000600070110     A            VIDMAI         6Y 0B 11 27CHECK(RB)
000610070110     A  41                                  DSPATR(RI)
000620070110     A  41                                  DSPATR(PC)
000630070110     A                                      EDTCDE(8)
000640070110     A                                 11 35'al:'
000650070110     A            VIDMAF         6Y 0B 11 39CHECK(RB)
000660070110     A  42                                  DSPATR(RI)
000670070110     A  42                                  DSPATR(PC)
000680070110     A                                      EDTCDE(8)
000690070110     A                                 11 47'(MM/AAAA)'
000700070110     A                                 12  3'Escludi no fatturato negli ultimi'
000710070110     A            VIDUMES        2Y 0B 12 37CHECK(RZ)
000720070110     A                                      RANGE(1 12)
000730070110     A                                 12 40'mesi'
000740070110     A                                 13  3'Aggiorna categoria ...:'
000750070110     A            VIDAGG         1A  B 13 27VALUES('S' 'N')
000760070110     A                                 13 29'(S/N)'
000770070110     A                                 15  3'SELEZIONI VALIDE SOLO PER LA STAMP-
000780070110     A                                      A'
000790070110     A                                      DSPATR(UL)
000800070110     A                                 16  3'Solo variazioni categoria:'
000810070110     A            VIDVAR         1A  B 16 30VALUES('S' 'N')
000820070110     A  43                                  DSPATR(RI)
000830070110     A  43                                  DSPATR(PC)
000840070110     A                                 16 32'(S/N)'
000850070110     A                                 17  3'Escludi cli.bloccati senza fattura-
000860070110     A                                      to:'
000870070110     A            VIDBLC         1A  B 17 41VALUES('S' 'N')
000880070110     A                                 17 43'(S/N)'
000890070110     A                                 24  2'F3=Fine Lavoro'
000900070110     A                                 24 36'F6=Lancio'
