000010041221     A*%%TS  SD  20041221  114119  EDPFG       REL-V4R4M0  5769-PW1
000020980304     A*------------------------------------------------------------------------*
000030041221     A*%%EC
000040041221     A                                      DSPSIZ(24 80 *DS3)
000050041221     A                                      CHGINPDFT(HI UL)
000060041221     A                                      PRINT
000070041221     A                                      CF01
000080041221     A                                      CF02
000090041221     A                                      CF03
000100041221     A                                      CF04
000110041221     A                                      CF05
000120041221     A                                      CF06
000130041221     A                                      CF07
000140041221     A                                      CF08
000150041221     A                                      CF09
000160041221     A                                      CF10
000170041221     A                                      CF11
000180041221     A                                      CF12
000190041221     A                                      CF13
000200041221     A                                      CF14
000210041221     A                                      CF15
000220041221     A                                      CF16
000230041221     A                                      CF17
000240041221     A                                      CF18
000250041221     A                                      CF19
000260041221     A                                      CF20
000270041221     A                                      CF21
000280041221     A                                      CF22
000290041221     A                                      CF23
000300041221     A                                      CF24
000310041221     A                                      HELP
000320980304     A*------------------------------------------------------------------------*
000330041221     A          R ST33D01
000340041221     A*%%TS  SD  20041221  111939  EDPFG       REL-V4R4M0  5769-PW1
000350041221     A                                      TEXT('Testata')
000360041221     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370041221     A                                  1 24'* ST.UTILIZZO SERVIZI VAS INTERNET-
000380041221     A                                      *'
000390041221     A                                      DSPATR(RI)
000400041221     A                                      DSPATR(UL)
000410041221     A                                  1 61'TIST33R'
000420041221     A                                  1 71DATE
000430041221     A                                      EDTCDE(Y)
000440041221     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000450041221     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000460041221     A                                  2 71TIME
000470980304     A*------------------------------------------------------------------------*
000480041221     A          R ST33D02
000490980304     A                                      TEXT('Funzioni')
000500980304     A                                      OVERLAY
000510980304     A            FUN001        19A  O 22  2
000520980304     A            FUN002        19A  O 22 22
000530980304     A            FUN003        19A  O 22 42
000540980304     A            FUN004        19A  O 22 62
000550980304     A            FUN005        19A  O 23  2
000560980304     A            FUN006        19A  O 23 22
000570980304     A            FUN007        19A  O 23 42
000580980304     A            FUN008        19A  O 23 62
000590991018     A*------------------------------------------------------------------------*
000600041221     A          R ST33D03
000610041221     A*%%TS  SD  20041221  114119  EDPFG       REL-V4R4M0  5769-PW1
000620041221     A                                      TEXT('Richiesta parametri')
000630041221     A                                      OVERLAY
000640041221     A                                  5  2'INPUT'
000650041221     A                                      DSPATR(HI)
000660041221     A                                  6  2'Ricavi/sped. periodo iniziale ....-
000670041221     A                                      .:'
000680041221     A            VIDDAI         6Y 0B  6 39CHECK(RB)
000690041221     A                                      EDTWRD('    /  ')
000700041221     A                                  6 47'(aaaa/mm)'
000710041221     A                                  7  2'Ricavi/sped. periodo finale ......-
000720041221     A                                      .:'
000730041221     A            VIDDAF         6Y 0B  7 39CHECK(RB)
000740041221     A                                      EDTWRD('    /  ')
000750041221     A                                  7 47'(aaaa/mm)'
000760980304     A*------------------------------------------------------------------------*
000770041221     A          R ST33DMS                   SFL
000780980304     A                                      TEXT('Sfl messaggi')
000790980304     A                                      SFLMSGRCD(24)
000800980304     A            MSGKEY                    SFLMSGKEY
000810980304     A            MSGQUE                    SFLPGMQ(10)
000820980304     A*------------------------------------------------------------------------*
000830041221     A          R ST33DMC                   SFLCTL(ST33DMS)
000840991018     A*%%TS  SD  19991018  094154  EDPMM       REL-V4R2M0  5769-PW1
000850991018     A                                      TEXT('Sflctl messaggi')
000860991018     A                                      OVERLAY
000870991018     A                                      SFLDSP
000880991018     A  40                                  SFLCLR
000890991018     A                                      SFLSIZ(0002)
000900991018     A                                      SFLPAG(0001)
