000100071212     A*%%TS  SD  20071212  182553  EDPFG       REL-V5R4M0  5722-WDS
000200000000     A*------------------------------------------------------------------------*
000300071212     A*%%EC
000400071212     A                                      DSPSIZ(24 80 *DS3)
000500071212     A                                      CHGINPDFT(HI CS)
000600071212     A                                      PRINT
000700071212     A                                      CF01
000800071212     A                                      CF02
000900071212     A                                      CF03
001000071212     A                                      CF04
001100071212     A                                      CF05
001200071212     A                                      CF06
001300071212     A                                      CF07
001400071212     A                                      CF08
001500071212     A                                      CF09
001600071212     A                                      CF10
001700071212     A                                      CF11
001800071212     A                                      CF12
001900071212     A                                      CF13
002000071212     A                                      CF14
002100071212     A                                      CF15
002200071212     A                                      CF16
002300071212     A                                      CF17
002400071212     A                                      CF18
002500071212     A                                      CF19
002600071212     A                                      CF20
002700071212     A                                      CF21
002800071212     A                                      CF22
002900071212     A                                      CF23
003000071212     A                                      CF24
003100071212     A                                      HELP
003200000000     A*------------------------------------------------------------------------*
003300000000     A* TESTATA
003400000000     A*------------------------------------------------------------------------*
003500000922     A          R ST42D01
003600000922     A*%%TS  SD  20000922  131105  EDPFG       REL-V4R2M0  5769-PW1
003700000922     A            DSFIRS        20A  O  1  2
003800000922     A                                  1 25'* ESTRAZIONE DATI PER INTERPOSTA  -
003900000922     A                                      *'
004000000922     A                                      DSPATR(RI)
004100000922     A                                      DSPATR(UL)
004200000922     A                                  1 62'TIST42R'
004300000922     A                                  1 71DATE
004400000922     A                                      EDTCDE(Y)
004500000922     A                                  2 71TIME
004600000922     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004700000922     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004800000000     A*------------------------------------------------------------------------*
004900000000     A* FUNZIONI
005000000000     A*------------------------------------------------------------------------*
005100000922     A          R ST42D02
005200000000     A                                      OVERLAY
005300000000     A            FUN001        19A  O 22  2
005400000000     A            FUN002        19A  O 22 22
005500000000     A            FUN003        19A  O 22 42
005600000000     A            FUN004        19A  O 22 62
005700000000     A            FUN005        19A  O 23  2
005800000000     A            FUN006        19A  O 23 22
005900000000     A            FUN007        19A  O 23 42
006000000000     A            FUN008        19A  O 23 62
006100000000     A*------------------------------------------------------------------------*
006200000927     A* CORPO DEL VIDEO
006300000927     A*------------------------------------------------------------------------*
006400071212     A          R ST42D03
006500071212     A*%%TS  SD  20071212  182553  EDPFG       REL-V5R4M0  5722-WDS
006600071212     A                                      OVERLAY
006700071212     A                                  4  3'---------------------------- S E L-
006800071212     A                                       E Z I O N I -----------------------
006900071212     A                                      -------'
007000071212     A                                  5  3'Codice Cliente .... ? :'
007100071212     A            VIDKSC         7A  B  5 27CHECK(RZ)
007200071212     A  70                                  DSPATR(RI)
007300071212     A            DESKSC        20A  O  5 40
007400071212     A                                  6 37'Oppure'
007500071212     A                                      DSPATR(HI)
007600071212     A                                  7  3'Singola Società ......:'
007700071212     A            VIDSOC         3A  B  7 27CHECK(RZ)
007800071212     A  80                                  DSPATR(RI)
007900071212     A            DESSOC        20A  O  7 40
008000071212     A                                  8  3'Punto Operativo ......:'
008100071212     A            VIDFIL         3Y 0B  8 27CHECK(RB)
008200071212     A  71                                  DSPATR(RI)
008300071212     A                                      EDTCDE(Z)
008400071212     A            DESFIL        20A  O  8 40
008500071212     A                                  9  3'Clienti o Fornitori ..:'
008600071212     A                                  9 40'("C"=Clienti/"F"=Fornitori)'
008700071212     A            VIDCOF         1A  B  9 27VALUES('C' 'F')
008800071212     A                                 10  3'Blocco Clienti .......:'
008900071212     A            VIDABL         1A  B 10 27VALUES(' ' 'B' 'N')
009000071212     A                                 10 40'("B"-Blocc./"N"-Non Blocc./" "-Tut-
009100071212     A                                      ti)'
009200071212     A                                 11  3'Nuovi soggetti .......:'
009300071212     A            VIDSOGN        1A  B 11 27VALUES('S' 'N')
009400071212     A                                 11 29'(S/N)'
009500071212     A                                 12  3'Nazione ........... ? :'
009600071212     A            VIDNAR         3A  B 12 27
009700071212     A  72                                  DSPATR(RI)
009800071212     A            DESNAR        20A  O 12 40
009900071212     A                                 13  3'Provincia ......... ? :'
010000071212     A            VIDPRO         2A  B 13 27
010100071212     A  74                                  DSPATR(RI)
010200071212     A            DESPRO        20A  O 13 40
010300071212     A                                 14  3'C.A.P. ...............:'
010400071212     A            VIDCAP         9A  B 14 27
010500071212     A  73                                  DSPATR(RI)
010600071212     A                                 14 40'Sub-raggr. x mail .:'
010700071212     A            VIDRAGR        1A  B 14 61
010800071212     A  78                                  DSPATR(RI)
010900071212     A                                      VALUES('S' 'N')
011000071212     A                                 14 63'(S=Sì  N=No)'
011100071212     A                                 15  3'Elimina indir. doppi .:'
011200071212     A            VIDIND         1A  B 15 27VALUES('S' 'N')
011300071212     A                                 15 29'(S/N)'
011400071212     A                                 15 40'Elimina bloccati ..:'
011500071212     A            VIDTBC         1A  B 15 61VALUES('S' 'N')
011600071212     A                                 15 63'(S/N)'
011700071212     A                                 16  3'Fatturato >= ......di :'
011800071212     A            VIDFAT        12Y 0B 16 27CHECK(RZ)
011900071212     A                                      EDTCDE(4)
012000071212     A                                 16 40'Raggr. dati anagr. :'
012100071212     A            VIDRGR         1A  B 16 61VALUES('S' 'N')
012200071212     A                                 16 63'(S/N)'
012300071212     A                                 17  3'Fatturato .........dal:'
012400071212     A            VIDDAD         8Y 0B 17 27CHECK(RB)
012500071212     A  75                                  DSPATR(RI)
012600071212     A                                      EDTCDE(8)
012700071212     A                                 17 40'al:'
012800071212     A            VIDDAA         8Y 0B 17 44CHECK(RB)
012900071212     A  76                                  DSPATR(RI)
013000071212     A                                      EDTCDE(8)
013100071212     A                                 18  3'Soggetti senza P.IVA .:'
013200071212     A                                 18 40'("S"=Includere  "N"=Escludere)'
013300071212     A            VIDCPI         1A  B 18 27VALUES('S' 'N')
013400071212     A                                 19  3'Soggetti BARTOLINI ...:'
013500071212     A            VIDBAR         1A  B 19 27VALUES('S' 'N' ' ')
013600071212     A  77                                  DSPATR(RI)
013700071212     A                                 19 29'(S/N)'
013800071212     A                                 19 40'Note e-mail:'
013900071212     A            VIDNTE1        2A  B 19 53
014000071212     A  79                                  DSPATR(RI)
014100071212     A            VIDNTE2        2A  B 19 56
014200071212     A  79                                  DSPATR(RI)
014300071212     A            VIDNTE3        2A  B 19 59
014400071212     A  79                                  DSPATR(RI)
014500071212     A            VIDNTE4        2A  B 19 62
014600071212     A  79                                  DSPATR(RI)
014700071212     A            VIDNTE5        2A  B 19 65
014800071212     A  79                                  DSPATR(RI)
014900071212     A            VIDNTE6        2A  B 19 68
015000071212     A  79                                  DSPATR(RI)
015100071212     A            VIDNTE7        2A  B 19 71
015200071212     A  79                                  DSPATR(RI)
015300071212     A            VIDNTE8        2A  B 19 74
015400071212     A  79                                  DSPATR(RI)
015500060615     A*                                20  3'Soggetti SDI .........:'
015600071212     A            VIDSDI         1A  H
015700060615     A*                                20 29'(S/N)'
015800050711     A*                                20 39'Note nomin. :'
015900050711     A*           VIDNTN1        2A  B 20 53
016000050711     A* 78                                  DSPATR(RI)
016100050711     A*           VIDNTN2        2A  B 20 56
016200050711     A* 78                                  DSPATR(RI)
016300050711     A*           VIDNTN3        2A  B 20 59
016400050711     A* 78                                  DSPATR(RI)
016500050711     A*           VIDNTN4        2A  B 20 62
016600050711     A* 78                                  DSPATR(RI)
016700071212     A                                 20 40'Sovrapporre cli FAT:'
016800071212     A            VIDOVR         1A  B 20 61VALUES('S' 'N')
016900071212     A                                 20 63'(S/N)'
017000071212     A                                 21  3'Altri soggetti .......:'
017100071212     A            VIDPIC         1A  B 21 27VALUES('S' 'N' ' ')
017200071212     A  77                                  DSPATR(RI)
017300071212     A                                 21 29'(S/N)'
017400071212     A                                 21 40'Esegui pulizia CHK :'
017500071212     A            VIDCHK         1A  B 21 61VALUES('S' 'N')
017600071212     A                                 21 63'(S/N)'
017700000927     A*------------------------------------------------------------------------*
017800000000     A* SUBFILE MESSAGGI
017900000000     A*------------------------------------------------------------------------*
018000000922     A          R ST42DMS                   SFL
018100000000     A                                      SFLMSGRCD(24)
018200000000     A            MSGKEY                    SFLMSGKEY
018300000000     A            MSGQUE                    SFLPGMQ
018400000000     A*------------------------------------------------------------------------*
018500000000     A* SUBFILE CONTROL MESSAGGI
018600000000     A*------------------------------------------------------------------------*
018700000922     A          R ST42DMC                   SFLCTL(ST42DMS)
018800000000     A                                      OVERLAY
018900000000     A                                      SFLDSP
019000000000     A  40                                  SFLCLR
019100000000     A                                      SFLSIZ(0002)
019200000000     A                                      SFLPAG(0001)
