000001151203     A*%%***********************************************************************
000002151203     A*%%TS  RD  20151203  152816  EDPRM       REL-V7R1M0  5770-WDS
000003151203     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004151203     A*%%FI       0000000000000000000000000000000000000000000000000
000005151203     A*%%***********************************************************************
000006151203     A*------------------------------------------------------------------------*
000007151203     A* TESTATA
000008151203     A*------------------------------------------------------------------------*
000009151203     A          R ST74TE
000010151203     A*%%***********************************************************************
000011151203     A*%%RI 00000
000012151203     A*%%FS 001
000013151203     A*%%***********************************************************************
000014151203     A                                      SKIPB(001)
000015151203     A                                      SPACEB(001)
000016151203     A            DSFIRS        20A  O     1
000017151203     A                                    30
000018151203     A                                      'TIST74R'
000019151203     A                                   +44
000020151203     A                                      '***  STATISTICA MANUTENZIONE BOLLE-
000021151203     A                                        ***'
000022151203     A                                   151
000023151203     A                                      'DATA:'
000024151203     A                                   157
000025151203     A                                      DATE(*YY)
000026151203     A                                      EDTCDE(Y)
000027151203     A                                   172
000028151203     A                                      'ORA:'
000029151203     A                                   177
000030151203     A                                      TIME
000031151203     A                                   190
000032151203     A                                      'PAG.'
000033151203     A                                   195
000034151203     A                                      PAGNBR
000035151203     A                                      EDTCDE(Z)
000036151203     A                                     1
000037151203     A                                      'PARAMETRI ==> '
000038151203     A                                      SPACEB(002)
000039151203     A                                    16
000040151203     A                                      'Data consegna da: '
000041151203     A            STPDAI         8S 0O    35
000042151203     A                                      EDTCDE(Y)
000043151203     A                                    46
000044151203     A                                      'a:'
000045151203     A            STPDAF         8S 0O    49
000046151203     A                                      EDTCDE(Y)
000047151203     A                                    16
000048151203     A                                      'Fil. arrivo:'
000049151203     A                                      SPACEB(001)
000050151203     A            STPFIL         3S 0O    30
000051151203     A            STPFILD       35A  O    35
000052151203     A  72                                16
000053151203     A                                      'Cliente Mittente: '
000054151203     A                                      SPACEB(001)
000055151203     A  72        STPCCM         7S 0O    +1
000056151203     A  72        STPCCMD       30A  O    +1
000057151203     A  72        STPCCMK       10A  O    +2
000058151203     A                                     1
000059151203     A                                      '-----------------------------------
000060151203     A                                      ------------------------------------
000061151203     A                                      ------------------------------------
000062151203     A                                      ------------------------------------
000063151203     A                                      ------------------------------------
000064151203     A                                      ------------------------'
000065151203     A                                      SPACEB(002)
000066151203     A                                     1
000067151203     A                                      '!'
000068151203     A                                      SPACEB(001)
000069151203     A                                     4
000070151203     A                                      'SPEDIZIONE'
000071151203     A                                    28
000072151203     A                                      'DESTINATARIO'
000073151203     A                                   102
000074151203     A                                      '!'
000075151203     A                                   113
000076151203     A                                      'L/AVV.'
000077151203     A                                   127
000078151203     A                                      'APERTURE'
000079151203     A                                   140
000080151203     A                                      'NON'
000081151203     A                                   149
000082151203     A                                      'F/DEP.'
000083151203     A                                   159
000084151203     A                                      'TURNO CHIUS.'
000085151203     A                                   175
000086151203     A                                      'CONS. RICH.'
000087151203     A                                   189
000088151203     A                                      'SUPERM.'
000089151203     A                                   198
000090151203     A                                      '!'
000091151203     A                                     1
000092151203     A                                      '!'
000093151203     A                                      SPACEB(001)
000094151203     A                                   102
000095151203     A                                      '!'
000096151203     A                                   107
000097151203     A                                      '(di cui no priv.)'
000098151203     A                                   129
000099151203     A                                      'GIAC.'
000100151203     A                                   139
000101151203     A                                      'FATTE'
000102151203     A                                   149
000103151203     A                                      'ARRIVO'
000104151203     A                                   162
000105151203     A                                      'ARRIVO'
000106151203     A                                   175
000107151203     A                                      'PART./ ARR.'
000108151203     A                                   198
000109151203     A                                      '!'
000110151203     A                                     1
000111151203     A                                      '-----------------------------------
000112151203     A                                      ------------------------------------
000113151203     A                                      ------------------------------------
000114151203     A                                      ------------------------------------
000115151203     A                                      ------------------------------------
000116151203     A                                      ------------------------'
000117151203     A                                      SPACEB(001)
000118151203     A*%%***********************************************************************
000119151203     A*%%SS
000120151203     A*%%CL 002
000121151203     A*%%CL 001
000122151203     A*%%CL 001
000123151203     A*%%CL 002
000124151203     A*%%CL 001
000125151203     A*%%CL 001
000126151203     A*%%CL 001
000127151203     A*%%***********************************************************************
000128151203     A          R ST74DE
000129151203     A*%%***********************************************************************
000130151203     A*%%RI 00000
000131151203     A*%%***********************************************************************
000132151203     A                                      SPACEB(001)
000133151203     A                                     1
000134151203     A                                      '!'
000135151203     A            STPKEY        19A  O    +2
000136151203     A            STPRSD        35A  O    28
000137151203     A                                   102
000138151203     A                                      '!'
000139151203     A            STPLAV         2S 0O   112
000140151203     A                                      EDTCDE(4)
000141151203     A  70                               114
000142151203     A                                      '('
000143151203     A            STPLANP        2S 0O   115
000144151203     A                                      EDTCDE(4)
000145151203     A  70                               117
000146151203     A                                      ')'
000147151203     A            STPFGC         2S 0O   130
000148151203     A                                      EDTCDE(4)
000149151203     A            STPNNF         2S 0O   141
000150151203     A                                      EDTCDE(4)
000151151203     A            STPFFDA        1S 0O   151
000152151203     A                                      EDTCDE(4)
000153151203     A            STPGGCA        1S 0O   164
000154151203     A                                      EDTCDE(4)
000155151203     A            STPDCRP        1S 0O   179
000156151203     A                                      EDTCDE(4)
000157151203     A  71                               180
000158151203     A                                      '/'
000159151203     A            STPDCRA        1S 0O   181
000160151203     A                                      EDTCDE(4)
000161151203     A            STPSUP         1S 0O   192
000162151203     A                                      EDTCDE(4)
000163151203     A                                   198
000164151203     A                                      '!'
000165151203     A*%%***********************************************************************
000166151203     A*%%SS
000167151203     A*%%***********************************************************************
000168151203     A          R ST74TT
000169151203     A*%%***********************************************************************
000170151203     A*%%RI 00000
000171151203     A*%%***********************************************************************
000172151203     A                                      SPACEB(001)
000173151203     A                                     1
000174151203     A                                      '!'
000175151203     A                                     4
000176151203     A                                      'TOTALE BOLLE: '
000177151203     A            STPTBOL        7S 0O    28
000178151203     A                                      EDTCDE(4)
000179151203     A                                   102
000180151203     A                                      '!'
000181151203     A            STPTLAV        5S 0O   109
000182151203     A                                      EDTCDE(4)
000183151203     A  70                               114
000184151203     A                                      '('
000185151203     A            STPTLANP       5S 0O   115
000186151203     A                                      EDTCDE(4)
000187151203     A  70                               120
000188151203     A                                      ')'
000189151203     A            STPTFGC        5S 0O   128
000190151203     A                                      EDTCDE(4)
000191151203     A            STPTNNF        5S 0O   139
000192151203     A                                      EDTCDE(4)
000193151203     A            STPTFFDA       5S 0O   149
000194151203     A                                      EDTCDE(4)
000195151203     A            STPTGGCA       5S 0O   162
000196151203     A                                      EDTCDE(4)
000197151203     A            STPTDCRP       5S 0O   175
000198151203     A                                      EDTCDE(4)
000199151203     A  71                               180
000200151203     A                                      '/'
000201151203     A            STPTDCRA       5S 0O   181
000202151203     A                                      EDTCDE(4)
000203151203     A            STPTSUP        5S 0O   190
000204151203     A                                      EDTCDE(4)
000205151203     A                                   198
000206151203     A                                      '!'
000207151203     A*%%***********************************************************************
000208151203     A*%%SS
000209151203     A*%%***********************************************************************
000210151203     A          R ST74RI
000211151203     A*%%***********************************************************************
000212151203     A*%%RI 00000
000213151203     A*%%***********************************************************************
000214151203     A                                      SPACEB(001)
000215151203     A                                     1
000216151203     A                                      '-----------------------------------
000217151203     A                                      ------------------------------------
000218151203     A                                      ------------------------------------
000219151203     A                                      ------------------------------------
000220151203     A                                      ------------------------------------
000221151203     A                                      ------------------------'
000222151203     A*%%***********************************************************************
000223151203     A*%%SS
000224151203     A*%%***********************************************************************
000225151203     A*------------------------------------------------------------------------*
000226151203     A* FINE PROSPETTO
000227151203     A*------------------------------------------------------------------------*
000228151203     A          R ST74FI
000229151203     A*%%***********************************************************************
000230151203     A*%%RI 00000
000231151203     A*%%***********************************************************************
000232151203     A                                      SPACEB(001)
000233151203     A                                    81
000234151203     A                                      '***    F I N E    P R O S P E T T -
000235151203     A                                      O    ***'
000236151203     A*%%***********************************************************************
000237151203     A*%%SS
000238151203     A*%%CP+999CRTPRTF
000239151203     A*%%CP+    FILE(GAITRAFIL/TIST74P)
000240151203     A*%%CP+    DEVTYPE(*SCS)
000241151203     A*%%CP+    PAGESIZE(*N 198)
000242151203     A*%%CP+    CPI(15)
000243151203     A*%%CP     USRDTA(ST.MANBOL)
000244151203     A*%%***********************************************************************
000245151203     A*------------------------------------------------------------------------*
