000100011228     A*%%TS  SD  20011228  113158  EDPFG       REL-V4R4M0  5769-PW1
000200000000     A*------------------------------------------------------------------------*
000300011228     A*%%EC
000400011228     A                                      DSPSIZ(24 80 *DS3)
000500011228     A                                      CHGINPDFT(HI CS)
000600011228     A                                      PRINT
000700011228     A                                      CF01
000800011228     A                                      CF02
000900011228     A                                      CF03
001000011228     A                                      CF04
001100011228     A                                      CF05
001200011228     A                                      CF06
001300011228     A                                      CF07
001400011228     A                                      CF08
001500011228     A                                      CF09
001600011228     A                                      CF10
001700011228     A                                      CF11
001800011228     A                                      CF12
001900011228     A                                      CF13
002000011228     A                                      CF14
002100011228     A                                      CF15
002200011228     A                                      CF16
002300011228     A                                      CF17
002400011228     A                                      CF18
002500011228     A                                      CF19
002600011228     A                                      CF20
002700011228     A                                      CF21
002800011228     A                                      CF22
002900011228     A                                      CF23
003000011228     A                                      CF24
003100011228     A                                      HELP
003200000000     A*------------------------------------------------------------------------*
003300000000     A* TESTATA
003400000000     A*------------------------------------------------------------------------*
003500000119     A          R SS35D01
003600000119     A*%%TS  SD  20000119  161251  EDPFG       REL-V4R2M0  5769-PW1
003700000119     A            RSUT          20A  O  1  2
003800000119     A                                  1 25'*** STATISTICA SERVIZI INTERNET **-
003900000119     A                                      *'
004000000119     A                                      DSPATR(RI)
004100000119     A                                      DSPATR(UL)
004200000119     A                                  1 62'TIST21R'
004300000119     A                                  1 71DATE
004400000119     A                                      EDTCDE(Y)
004500000119     A                                  2 71TIME
004600000000     A*------------------------------------------------------------------------*
004700000000     A* FUNZIONI
004800000000     A*------------------------------------------------------------------------*
004900000000     A          R SS35D02
005000000000     A                                      OVERLAY
005100000000     A            FUN001        19A  O 22  2
005200000000     A            FUN002        19A  O 22 22
005300000000     A            FUN003        19A  O 22 42
005400000000     A            FUN004        19A  O 22 62
005500000000     A            FUN005        19A  O 23  2
005600000000     A            FUN006        19A  O 23 22
005700000000     A            FUN007        19A  O 23 42
005800000000     A            FUN008        19A  O 23 62
005900000000     A*------------------------------------------------------------------------*
006000000000     A* PARAMETRI
006100000000     A*------------------------------------------------------------------------*
006200011228     A          R SS35D03
006300011228     A*%%TS  SD  20011228  113158  EDPFG       REL-V4R4M0  5769-PW1
006400011228     A                                      OVERLAY
006500011228     A                                  3  2'LANCIO'
006600011228     A                                      DSPATR(HI)
006700011228     A                                  4  2'Dal  ........(gg/mm/aaaa):'
006800011228     A            VIHDAI         8Y 0H
006900011228     A            VIDDAI        10A  B  4 30
007000011228     A  70                                  DSPATR(RI)
007100011228     A  70                                  DSPATR(PC)
007200011228     A                                  5  2'Al   ........(gg/mm/aaaa):'
007300011228     A            VIHDAF         8Y 0H
007400011228     A            VIDDAF        10A  B  5 30
007500011228     A  71                                  DSPATR(RI)
007600011228     A  71                                  DSPATR(PC)
007700011228     A                                  6  2'File da rigenerare .(S/N):'
007800011228     A            VIDSNR         1A  B  6 30VALUES('S' 'N')
007900011228     A  76                                  DSPATR(RI)
008000011228     A  76                                  DSPATR(PC)
008100011228     A                                  7  2'Sint./Dett./Tot. .(S/D/T):'
008200011228     A            VIDDET         1A  B  7 30VALUES('S' 'D' 'T')
008300011228     A  77                                  DSPATR(RI)
008400011228     A  77                                  DSPATR(PC)
008500011228     A                                  8  2'Giorni lavorativi .......:'
008600011228     A            VIDGIO         3Y 0B  8 30
008700011228     A N69                                  DSPATR(HI)
008800011228     A  69                                  DSPATR(RI)
008900011228     A  69                                  DSPATR(PC)
009000011228     A                                 10  2'PARZIALIZZAZIONI'
009100011228     A                                      DSPATR(HI)
009200011228     A                                 11  2'Solo divisione ........ ?:'
009300011228     A            VIDDIV         1A  B 11 30
009400011228     A  78                                  DSPATR(RI)
009500011228     A  78                                  DSPATR(PC)
009600011228     A            VDDDIV        30A  O 11 40
009700011228     A                                 12  2'Solo area ............. ?:'
009800011228     A            VIDARE         3A  B 12 30
009900011228     A  79                                  DSPATR(RI)
010000011228     A  79                                  DSPATR(PC)
010100011228     A            VDDARE        30A  O 12 40
010200011228     A                                 13  2'Solo punto operativo .. ?:'
010300011228     A            VIDFLP         3A  B 13 30
010400011228     A  80                                  DSPATR(RI)
010500011228     A  80                                  DSPATR(PC)
010600011228     A            VDDFLP        30A  O 13 40
010700011228     A                                 14  2'Solo cliente .......... ?:'
010800011228     A            VIDKSC         7A  B 14 30
010900011228     A  81                                  DSPATR(RI)
011000011228     A  81                                  DSPATR(PC)
011100011228     A            VDDKSC        30A  O 14 40
011200000000     A*------------------------------------------------------------------------*
011300000000     A* SUBFILE MESSAGGI
011400000000     A*------------------------------------------------------------------------*
011500000000     A          R SS35DMS                   SFL
011600000000     A                                      SFLMSGRCD(24)
011700000000     A            MSGKEY                    SFLMSGKEY
011800000000     A            MSGQUE                    SFLPGMQ
011900000000     A*------------------------------------------------------------------------*
012000000000     A* SUBFILE CONTROL MESSAGGI
012100000000     A*------------------------------------------------------------------------*
012200000000     A          R SS35DMC                   SFLCTL(SS35DMS)
012300000000     A                                      OVERLAY
012400000000     A                                      SFLDSP
012500000000     A  40                                  SFLCLR
012600000000     A                                      SFLSIZ(0002)
012700000000     A                                      SFLPAG(0001)
