000100000000     H*------------------------------------------------------------------------*
000200060901     H* CONTROLLO ASSORBIMENTO X LNA
000300000000     H*------------------------------------------------------------------------*
000400000000     H DECEDIT('0,') DATEDIT(*DMY.)
000500000914     H*------------------------------------------------------------------------*
000600000000     FAZORG01L  IF   E           K DISK
000700070118     FTIALA00F  UF   E             DISK
000800000000     C*------------------------------------------------------------------------*
000900000000     C* MAIN LINE
001000000000     C*------------------------------------------------------------------------*
001100000000     C*
001200070118     C* Leggo tutto il file fisico e aggiorno i dati relativi alla riclassificazione
001300070118     C* gerarchica della struttura commerciale
001400070118     C                   exsr      aggiorna
001500000914     C*
001600000914     C                   SETON                                        LR
001700001106     C*------------------------------------------------------------------------*
001800070118     C* AGGIORNA - Routine di aggiornamento DIV/ARE
001900001106     C*------------------------------------------------------------------------*
002000070118     C     AGGIORNA      BEGSR
002100001207     C*
002200070118     C     *start        setll     tiala00f
002300070118     C                   read      tiala00f
002400070118     C                   dow       not %eof(tiala00f)
002500070118     C     alalna        chain     azorg01l
002600070118     C                   if        %found(azorg01l)
002700070118     C                   eval      alaare = orgCAR
002800070118     C                   eval      aladiv = orgFL3
002900070118     C                   update    tiala000
003000070118     C                   endif
003100070118     C                   read      tiala00f
003200070118     C                   enddo
003300001106     C*
003400001106     C                   ENDSR
003500000000     C*------------------------------------------------------------------------*
003600000000     C* *INZSR - ROUTINE INIZIALE
003700000000     C*------------------------------------------------------------------------*
003800000000     C     *INZSR        BEGSR
003900070118     C*
004000000000     C*
004100000000     C                   ENDSR
