000001061027     A*%%***********************************************************************
000002061027     A*%%TS  RD  20061027  140204  EDPFG       REL-V5R3M0  5722-WDS
000003061027     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004061027     A*%%FI       0000000000000000000000000000000000000000000000000
000005061027     A*%%***********************************************************************
000006061027     A*------------------------------------------------------------------------*
000007061027     A* TESTATA
000008061027     A*------------------------------------------------------------------------*
000009061027     A          R ST48TE
000010061027     A*%%***********************************************************************
000011061027     A*%%RI 00000
000012061027     A*%%FS 001
000013061027     A*%%***********************************************************************
000014061027     A                                      SKIPB(001)
000015061027     A                                      SPACEB(001)
000016061027     A            DSFIRS        20A  O     1
000017061027     A                                    30
000018061027     A                                      'TIST48R'
000019061027     A                                   +38
000020061027     A                                      '***  VERIFICA ASSORBIMENTO PER LIN-
000021061027     A                                      EA DI ARRIVO  ***'
000022061027     A            STPPT          7A  O    +6
000023061027     A                                   151
000024061027     A                                      'DATA:'
000025061027     A                                   157
000026061027     A                                      DATE(*YY)
000027061027     A                                      EDTCDE(Y)
000028061027     A                                   172
000029061027     A                                      'ORA:'
000030061027     A                                   177
000031061027     A                                      TIME
000032061027     A                                   190
000033061027     A                                      'PAG.'
000034061027     A                                   195
000035061027     A                                      PAGNBR
000036061027     A                                      EDTCDE(Z)
000037061027     A            STPTIT        40A  O    81
000038061027     A                                      SPACEB(001)
000039061027     A                                     1
000040061027     A                                      'PARAMETRI ==> '
000041061027     A                                      SPACEB(001)
000042061027     A                                    16
000043061027     A                                      'Pediodo da:'
000044061027     A            STPPDAI        8S 0O    28
000045061027     A                                      EDTCDE(Y)
000046061027     A                                    39
000047061027     A                                      'a:'
000048061027     A            STPPDAF        8S 0O    42
000049061027     A                                      EDTCDE(Y)
000050061027     A                                    +2
000051061027     A                                      '-'
000052061027     A                                    56
000053061027     A                                      'CAP dal:'
000054061027     A            STPPCAD        2A  O    65
000055061027     A                                    68
000056061027     A                                      'al:'
000057061027     A            STPPCAA        2A  O    72
000058061027     A                                    16
000059061027     A                                      'Distretto:'
000060061027     A                                      SPACEB(001)
000061061027     A            STPPDIS        1A  O    +1
000062061027     A            STPPDISD      25A  O    +1
000063061027     A                                    58
000064061027     A                                      'Area:'
000065061027     A            STPPARE        3S 0O    +1
000066061027     A            STPPARED      25A  O    +1
000067061027     A                                    97
000068070410     A                                      'Fil.:'
000069061027     A            STPPFIL        3S 0O    +1
000070061027     A            STPPFILD      25A  O    +1
000071061027     A                                     1
000072061027     A                                      'Dati espressi in media giornaliera-
000073061027     A                                       considerando '
000074061027     A                                      SPACEB(001)
000075061027     A            STPPGIO        3S 0O    +0
000076061027     A                                      EDTCDE(4)
000077061027     A                                    53
000078061027     A                                      'giorni lavorativi.'
000079061027     A                                     1
000080061027     A                                      '-----------------------------------
000081061027     A                                      ------------------------------------
000082061027     A                                      ------------------------------------
000083061027     A                                      ------------------------------------
000084061027     A                                      ------------------------------------
000085061027     A                                      ------------------------'
000086061027     A                                      SPACEB(001)
000087061027     A                                     1
000088061027     A                                      '!'
000089061027     A                                      SPACEB(001)
000090061027     A            STPDIV        35A  O    +0
000091061027     A                                    48
000092061027     A                                      '!'
000093061027     A                                    61
000094061027     A                                      'TOTALI'
000095061027     A                                    78
000096061027     A                                      '!'
000097061027     A                                    91
000098061027     A                                      'Kg:'
000099061027     A                                   108
000100061027     A                                      '!'
000101061027     A                                   121
000102061027     A                                      'Kg:'
000103061027     A                                   138
000104061027     A                                      '!'
000105061027     A                                   151
000106061027     A                                      'Kg:'
000107061027     A                                   168
000108061027     A                                      '!'
000109061027     A                                   181
000110061027     A                                      'Kg:'
000111061027     A                                   198
000112061027     A                                      '!'
000113061027     A                                     1
000114061027     A                                      '!'
000115061027     A                                      SPACEB(001)
000116061027     A            STPARE        35A  O    +0
000117061027     A                                   +11
000118061027     A                                      '!'
000119061027     A                                   +29
000120061027     A                                      '!'
000121061027     A                                    81
000122061027     A                                      '>'
000123061027     A            STPPP1D        7S 1O    83
000124061027     A                                      EDTCDE(4)
000125061027     A                                    93
000126061027     A                                      'e <='
000127061027     A            STPPP1A        7S 1O    98
000128061027     A                                      EDTCDE(4)
000129061027     A                                   108
000130061027     A                                      '!'
000131061027     A                                   111
000132061027     A                                      '>'
000133061027     A            STPPP2D        7S 1O   113
000134061027     A                                      EDTCDE(4)
000135061027     A                                   123
000136061027     A                                      'e <='
000137061027     A            STPPP2A        7S 1O   128
000138061027     A                                      EDTCDE(4)
000139061027     A                                   138
000140061027     A                                      '!'
000141061027     A                                   141
000142061027     A                                      '>'
000143061027     A            STPPP3D        7S 1O   143
000144061027     A                                      EDTCDE(4)
000145061027     A                                   153
000146061027     A                                      'e <='
000147061027     A            STPPP3A        7S 1O   158
000148061027     A                                      EDTCDE(4)
000149061027     A                                   168
000150061027     A                                      '!'
000151061027     A                                   171
000152061027     A                                      '>'
000153061027     A            STPPP4D        7S 1O   173
000154061027     A                                      EDTCDE(4)
000155061027     A                                   183
000156061027     A                                      'e <='
000157061027     A            STPPP4A        7S 1O   188
000158061027     A                                      EDTCDE(4)
000159061027     A                                   198
000160061027     A                                      '!'
000161061027     A                                     1
000162061027     A                                      '-----------------------------------
000163061027     A                                      ------------------------------------
000164061027     A                                      ------------------------------------
000165061027     A                                      ------------------------------------
000166061027     A                                      ------------------------------------
000167061027     A                                      ------------------------'
000168061027     A                                      SPACEB(001)
000169061027     A                                     1
000170061027     A                                      '!'
000171061027     A                                      SPACEB(001)
000172061027     A            STPTES        35A  O    +0
000173061027     A N10                                44
000174061027     A                                      'ZONA'
000175061027     A                                    48
000176061027     A                                      '!'
000177061027     A                                    50
000178061027     A                                      'SPED.'
000179061027     A                                    60
000180061027     A                                      'QLI'
000181061027     A                                    69
000182061027     A                                      'M³'
000183061027     A                                    73
000184061027     A                                      'COLLI'
000185061027     A                                    78
000186061027     A                                      '!'
000187061027     A                                    80
000188061027     A                                      'SPED.'
000189061027     A                                    89
000190061027     A                                      'QLI'
000191061027     A                                    98
000192061027     A                                      'M³'
000193061027     A                                   103
000194061027     A                                      'COLLI'
000195061027     A                                   108
000196061027     A                                      '!'
000197061027     A                                   110
000198061027     A                                      'SPED.'
000199061027     A                                   119
000200061027     A                                      'QLI'
000201061027     A                                   128
000202061027     A                                      'M³'
000203061027     A                                   133
000204061027     A                                      'COLLI'
000205061027     A                                   138
000206061027     A                                      '!'
000207061027     A                                   140
000208061027     A                                      'SPED.'
000209061027     A                                   149
000210061027     A                                      'QLI'
000211061027     A                                   158
000212061027     A                                      'M³'
000213061027     A                                   163
000214061027     A                                      'COLLI'
000215061027     A                                   168
000216061027     A                                      '!'
000217061027     A                                   170
000218061027     A                                      'SPED.'
000219061027     A                                   179
000220061027     A                                      'QLI'
000221061027     A                                   188
000222061027     A                                      'M³'
000223061027     A                                   193
000224061027     A                                      'COLLI'
000225061027     A                                   198
000226061027     A                                      '!'
000227061027     A                                     1
000228061027     A                                      '-----------------------------------
000229061027     A                                      ------------------------------------
000230061027     A                                      ------------------------------------
000231061027     A                                      ------------------------------------
000232061027     A                                      ------------------------------------
000233061027     A                                      ------------------------'
000234061027     A                                      SPACEB(001)
000235061027     A*%%***********************************************************************
000236061027     A*%%SS
000237061027     A*%%CL 001
000238061027     A*%%CL 001
000239061027     A*%%CL 001
000240061027     A*%%CL 001
000241061027     A*%%CL 001
000242061027     A*%%CL 001
000243061027     A*%%CL 001
000244061027     A*%%CL 001
000245061027     A*%%CL 001
000246061027     A*%%CL 001
000247061027     A*%%***********************************************************************
000248061027     A          R ST48DE
000249061027     A*%%***********************************************************************
000250061027     A*%%RI 00000
000251061027     A*%%***********************************************************************
000252061027     A                                      SPACEB(001)
000253061027     A                                     1
000254061027     A                                      '!'
000255061027     A            STPDES        46A  O    +0
000256061027     A                                    48
000257061027     A                                      '!'
000258061027     A            STPTOS         6S 0O    49
000259061027     A                                      EDTCDE(4)
000260061027     A            STPTOP         8S 0O    55
000261061027     A                                      EDTCDE(4)
000262061027     A            STPTOV         8S 0O    63
000263061027     A                                      EDTCDE(4)
000264061027     A            STPTOC         7S 0O    71
000265061027     A                                      EDTCDE(4)
000266061027     A                                    78
000267061027     A                                      '!'
000268061027     A            STPFS1         6S 0O    79
000269061027     A                                      EDTCDE(4)
000270061027     A            STPFP1         8S 0O    85
000271061027     A                                      EDTCDE(4)
000272061027     A            STPFV1         8S 0O    93
000273061027     A                                      EDTCDE(4)
000274061027     A            STPFC1         7S 0O   101
000275061027     A                                      EDTCDE(4)
000276061027     A                                   108
000277061027     A                                      '!'
000278061027     A            STPFS2         6S 0O   109
000279061027     A                                      EDTCDE(4)
000280061027     A            STPFP2         8S 0O   115
000281061027     A                                      EDTCDE(4)
000282061027     A            STPFV2         8S 0O   123
000283061027     A                                      EDTCDE(4)
000284061027     A            STPFC2         7S 0O   131
000285061027     A                                      EDTCDE(4)
000286061027     A                                   138
000287061027     A                                      '!'
000288061027     A            STPFS3         6S 0O   139
000289061027     A                                      EDTCDE(4)
000290061027     A            STPFP3         8S 0O   145
000291061027     A                                      EDTCDE(4)
000292061027     A            STPFV3         8S 0O   153
000293061027     A                                      EDTCDE(4)
000294061027     A            STPFC3         7S 0O   161
000295061027     A                                      EDTCDE(4)
000296061027     A                                   168
000297061027     A                                      '!'
000298061027     A            STPFS4         6S 0O   169
000299061027     A                                      EDTCDE(4)
000300061027     A            STPFP4         8S 0O   175
000301061027     A                                      EDTCDE(4)
000302061027     A            STPFV4         8S 0O   183
000303061027     A                                      EDTCDE(4)
000304061027     A            STPFC4         7S 0O   191
000305061027     A                                      EDTCDE(4)
000306061027     A                                   198
000307061027     A                                      '!'
000308061027     A*%%***********************************************************************
000309061027     A*%%SS
000310061027     A*%%***********************************************************************
000311061027     A          R ST48RI
000312061027     A*%%***********************************************************************
000313061027     A*%%RI 00000
000314061027     A*%%***********************************************************************
000315061027     A                                      SPACEB(001)
000316061027     A                                     1
000317061027     A                                      '-----------------------------------
000318061027     A                                      ------------------------------------
000319061027     A                                      ------------------------------------
000320061027     A                                      ------------------------------------
000321061027     A                                      ------------------------------------
000322061027     A                                      ------------------------'
000323061027     A*%%***********************************************************************
000324061027     A*%%SS
000325061027     A*%%***********************************************************************
000326061027     A*------------------------------------------------------------------------*
000327061027     A* FINE PROSPETTO
000328061027     A*------------------------------------------------------------------------*
000329061027     A          R ST48FI
000330061027     A*%%***********************************************************************
000331061027     A*%%RI 00000
000332061027     A*%%***********************************************************************
000333061027     A                                      SPACEB(001)
000334061027     A                                    81
000335061027     A                                      '***    F I N E    P R O S P E T T -
000336061027     A                                      O    ***'
000337061027     A*%%***********************************************************************
000338061027     A*%%SS
000339061027     A*%%CP+999CRTPRTF
000340061027     A*%%CP+    FILE(GAITRASRC/TIST48P)
000341061027     A*%%CP+    DEVTYPE(*SCS)
000342061027     A*%%CP     PAGESIZE(*N       198      *N     )
000343061027     A*%%***********************************************************************
000344061027     A*------------------------------------------------------------------------*
