000100000000     A*----------------------------------------------------------------
000200100215     A* W.F. X STATISTICA CLIENTE CON PARTICOLARITÀ DI ATTESA
000300000000     A*----------------------------------------------------------------
000400100215     A          R WFTIST75
000500000000      *
000600100215     A            ST75FGS        3  0       TEXT('FILIALE GESTIONE')
000601100215     A            ST75NDC        7  0       TEXT('DISTINTA')
000602100215     A            ST75DCM        8  0       TEXT('DATA CONSEGNA')
000700100215     A            ST75RSD       35          TEXT('DESTINATARIO')
000701100215     A            ST75IND       35          TEXT('INDIRIZZO DESTINARIO')
000800100215     A            ST75STP        5  0       TEXT('NR. STOP')
000801100215     A            ST75NSF        5  0       TEXT('NR.SPEDIZ.CON PART.X FERMATA')
