000100031009     A                                      FIFO
000200000000     A          R KPLOG000                  PFILE(KPLOG00F)
000300031009      *
000400100324      *
000500100324     A            LOGATT
000600100324     A            LOGNRA
000700100324     A            LOGNME
000800100324     A            LOGCBI
000900100324     A            LOGCBE
001000100324     A            LOGDAC
001100100324     A            LOGORC
001200100324     A            LOGDAI
001300100324     A            LOGORI
001400100324     A            LOGDAF
001500100324     A            LOGORF
001600100324     A            LOGDEA
001700100324     A            LOGKPJ
001800100324     A            LOGSTP
001900100324     A            LOGNMU             I      SST(LOGKPJ 1 10)
002000100324     A            LOGPTY             I      SST(LOGKPJ 155 1)
002100100324     A            LOGCDA             I      SST(LOGKPJ 60 4)
002200031009      *
002300100324     A          K LOGCDA
002400000000     A          K LOGCBE
002500000000     A          K LOGDAF
002600000000     A          K LOGORF
