000100131219     d prmRqsOpCode...
000200131219     d                 s             10I 0
000300131219     d prmRpyOpCode...
000400131219     d                 s             10I 0
000500131219     d prmRpyIdMsg...
000600131219     d                 s             10I 0
000700131219     d prmRqsFormato...
000800131219     d                 s             10A
000900131219     d prmRqsData...
001000131219     d                 s          32767A   VARYING
001100160216     d prmRqsSize...
001200131219     d                 s             10I 0
001300131219     d prmRpyFormato...
001400131219     d                 s             10A
001500131219     d prmRpyData...
001600131219     d                 s          32767A   VARYING
001700160216     d prmRpySize...
001800131219     d                 s             10I 0
001900160216     d prmRpyMsgFormato...
002000160216     d                 s             10A
002100160216     d prmRpyMsgData...
002200160216     d                 s          32767A   VARYING
002300160216     d prmRpyMsgSize...
002400160216     d                 s             10I 0
