000100100217       // -?Parametri per pgm. TIBS69R (decodifica cliente)?
000200100217     d TIBS69ds      e ds                  inz
000300100217     d   I69tla      e                     inz('C')
000400100217     d ds_CNACO      e ds                  extname(CNACO00F) inz
000500100217     d ds_CNIND      e ds                  extname(CNIND00F) inz
000600100217     d ds_CNCLP      e ds                  extname(CNCLP00F) inz
000700100217     d ds_FNCLS      e ds                  extname(FNCLS00F) inz
