000100170418     D TNTBEDS       e ds                  extname(tntbe00f)
000200170412     D  IS713TBECOD    s                   like(tbeCOD)
000300170412     D  IS713TBEKE1    s                   like(tbeKE1)
000400170412     D  IS713TBEKE2    s                   like(tbeKE2)
000500170412     D  IS713TBELIN    s                   like(tbeLIN)
000600170412     D  IS713TBESIF    s                   like(tbeSIF)
000700170412     D  OS713TBEUNI    s                   like(tbeUNI)
000800170412     D  OS713ESITO     s              1A
