000100170912     D DPCVE10F      e ds
000200170912     D ISID1DRI        s                   like(CVEDDE)
000300170912     D OSID1VER        s                   like(CVEVER)                         VERSIONE
000400170912     D OSID1VERD       s                   like(CVEVERD)                        VERSIONE DPD
000500170912     D OSID1DDE        s                   like(CVEDDE)                         DATA DECORRENZA
000600170912     D OSID1DSC        s                   like(CVEDSC)                         DATA SCADENZA
000700170912     D OSID1BCID       s                   like(CVEBCID)                        BARCODE ID START
