000100100205       // -?Parametri x TNSD24R = Interrogazione organigramma?
000200100205     d p_FIL           s              3    inz(*zero)
000300100205     d p_FAG           s              1    inz
000400100205     d p_DES           s             25    inz
000500100205     d p_DIT           s              3    inz
