000100130701       // -?Parametri per Immissione/Manutenzione singolo Agente Commerciale?
000200130708     d AZCMM_ds      e ds                  extname(AZCMM00F)
000300130701     d                                     inz  qualified
000400130701     d TRMK41ds      e ds                  inz
