000100081118     D*------------------
000200161018     D* PASSAGGIO PARAMETRI A PROCEDURE UBBASE64R
000300081118     D*------------------
000400161102     DiBASE64src_wrk   S          65535A
000500161019     DiBASE64src_dta   S          65535A   VARYING
000600161019     DiBASE64src_ptr   S               *
000700161020     DiBASE64src_len   S             10I 0
000800161019     DoBASE64enc_dta   S          65535A   VARYING
000900161020     DoBASE64enc_len   S             10I 0
001000170516     DoBASE64dec_ptr   S               *
001100170516     DoBASE64dec_dta   S          65535A
001200161020     DoBASE64dec_len   S             10I 0
001300170517     D*
001400170517     DiBASE64bin_ptr   S               *
001500170517     DiBASE64bin_len   S             10U 0
001600170517     DoBASE64b64_ptr   S               *
001700170517     DoBASE64b64_siz   S             10U 0
001800170517     DiBASE64b64_ptr   S               *
001900170517     DiBASE64b64_len   S             10U 0
002000170517     DoBASE64bin_ptr   S               *
002100170517     DoBASE64bin_siz   S             10U 0
