000100100114     d   pInCCM        s              7p 0
000200100114     d   pInRMN        s             15p 0
000300100114     d   pOutFIVAB     s               n
000400100114     d   pOutFNBLP     s               n
000500100114     d   pOutTITAS     s               n
