000100081118     D*------------------
000200100621     D* PASSAGGIO PARAMETRI A PROCEDURE UBDNSLKP
000300081118     D*------------------
000400100922     D pInInetHost     S            256A
000500100922     D pOutInetFound   S            256A
000600100922     D pOutInetType    S              3A
