000100081210     D*------------------
000200081210     D* PASSAGGIO PARAMETRI A PROCEDURE UBISNUM
000300081210     D*------------------
000400081210     D pInPathIFS      S           2048A   INZ
000500081210     D pInFileIFS      S            255A   INZ
000600081210     D pInFullIFS      S           3072A   INZ
000700081210     D pOutResult      S             10A   INZ
