000100161110     d UBMASTO1R...
000200161107     d                 pi
000300161110     d iMASTOOpz                      1a   const
000400161107       // Periodo DA
000500161110     d iMASTOTSDa                      z   const
000600161107       // Periodo AL
000700161110     d iMASTOTSAl                      z   const
000800161107       // esito: 1=OK  I=Err parametri input  2=KO SQL  3=non trovato periodo
000900161110     d oMASTOEsito                    1a
