000100161107     d UBMACHK1R...
000200161107     d                 pi
000300161111       // opzione: blank=solo aggiornamento  D=pulizia TIMAC nel periodo e aggiornamento
000400161107     d iMACHKOpz                      1a   const
000500161107       // Periodo DA
000600161107     d iMACHKTSDa                      z   const
000700161107       // Periodo AL
000800161107     d iMACHKTSAl                      z   const
000900161107       // esito: 1=OK  I=Err parametri input  2=KO SQL  3=non trovato periodo
001000161107     d oMACHKEsito                    1a
