000100081118     D*------------------
000200100922     D* PASSAGGIO PARAMETRI A PROCEDURE UBCVTIDA
000300081118     D*------------------
000400151012     D pInInetAdrVal   S             10U 0
000500151012     D pOutInetDotAdr  S             15A
