000100170906     D oUBS718DAT01    S               A   LEN(32000)
000200170906     D oUBS718DAT02    S               A   LEN(32000)
000300170906     D oUBS718DAT03    S               A   LEN(32000)
000400170906     D oUBS718DAT04    S               A   LEN(32000)
000500170906     D oUBS718DAT05    S               A   LEN(32000)
000600170906     D oUBS718DAT06    S               A   LEN(32000)
000700170906     D oUBS718DAT07    S               A   LEN(32000)
000800170906     D oUBS718DAT08    S               A   LEN(32000)
000900170906     D oUBS718DAT09    S               A   LEN(32000)
001000170906     D oUBS718DAT10    S               A   LEN(32000)
