000100170803     D oUBS717DAT01    S               A   LEN(32000)
000200170803     D oUBS717DAT02    S               A   LEN(32000)
000300170803     D oUBS717DAT03    S               A   LEN(32000)
000400170803     D oUBS717DAT04    S               A   LEN(32000)
000500170803     D oUBS717DAT05    S               A   LEN(32000)
000600170803     D oUBS717DAT06    S               A   LEN(32000)
000700170803     D oUBS717DAT07    S               A   LEN(32000)
000800170803     D oUBS717DAT08    S               A   LEN(32000)
000900170803     D oUBS717DAT09    S               A   LEN(32000)
001000170803     D oUBS717DAT10    S               A   LEN(32000)
001100170803     D oUBS717DAT11    S               A   LEN(32000)
001200170803     D oUBS717DAT12    S               A   LEN(32000)
001300170803     D oUBS717DAT13    S               A   LEN(32000)
001400170803     D oUBS717DAT14    S               A   LEN(32000)
001500170803     D oUBS717DAT15    S               A   LEN(32000)
001600170803     D oUBS717DAT16    S               A   LEN(32000)
001700171003     D oUBS717DAT17    S               A   LEN(32000)
001800171003     D oUBS717DAT18    S               A   LEN(32000)
001900171003     D oUBS717DAT19    S               A   LEN(32000)
002000171003     D oUBS717DAT20    S               A   LEN(32000)
002100171003     D oUBS717DAT21    S               A   LEN(32000)
002200171003     D oUBS717DAT22    S               A   LEN(32000)
002300171003     D oUBS717DAT23    S               A   LEN(32000)
002400171003     D oUBS717DAT24    S               A   LEN(32000)
002500171003     D oUBS717DAT25    S               A   LEN(32000)
002600170818     D*oUBS717DAT26    S               A   LEN(32000)
002700170818     D*oUBS717DAT27    S               A   LEN(32000)
002800170818     D*oUBS717DAT28    S               A   LEN(32000)
002900170818     D*oUBS717DAT29    S               A   LEN(32000)
003000170818     D*oUBS717DAT30    S               A   LEN(32000)
003100170818     D*oUBS717DAT31    S               A   LEN(32000)
003200170818     D*oUBS717DAT32    S               A   LEN(32000)
