000100170522     D UBSI95DS      e ds
000200170522     D EDIVABDS      e ds                  extname(edivab0f)
000300170508     D RTNesito        s             10I 0
000400170508     D RTNopcode       s             10A
000500170508     D RTNstatus       s             10I 0
