000100090120     D*------------------
000200090120     D* PASSAGGIO PARAMETRI A PROCEDURE UBUTISQL
000300090120     D*------------------
000400090120     D  piInAlias      S             22A   INZ
000500090120     D  piInAliasLib   S             10A   INZ
000600090120     D  piInFile       S             10A   INZ
000700090120     D  piInLib        S             10A   INZ
000800090120     D  piInMbr        S             10A   INZ
000900090120     D  piOutEsito     S             10I 0 INZ
