000100160108     A          R FICNH1I
000200160108     A            CNHSOC         3A
000300160108     A                                      TEXT('SOCIETA')
000301160108     A            CNHFOR         8A
000302160108     A                                      TEXT('CODICE FORNITORE')
000400160111     A            CNHDAT1        8S 0
000500160108     A                                      TEXT('DATA COMPETENZA DAL')
000600160111     A            CNHDAT2        8S 0
000700160108     A                                      TEXT('DATA COMPETENZA AL')
001701160108     A            CNHCAU         3A
001702160108     A                                      TEXT('CAUSALE DI RETTIFICA')
001800160111     A            CNHCONT        1A
001900160111     A                                      TEXT('CONTABILIZZATE N=ESCLUDE')
002000160114     A            CNHTSR         1A
002100160114     A                                      TEXT('TIPO SERVIZI X-P-T/C/A/L')
