000001160503     A*%%***********************************************************************
000002160503     A*%%TS  RD  20160503  165730  EDPAB       REL-V7R1M0  5770-WDS
000003160503     A*%%FI+10661100000000000000000000000000000000000000000000000000
000004160503     A*%%FI       0000000000000000000000000000000000000000000000000
000005160503     A*%%***********************************************************************
000006160503      *PARMS DEVTYPE(*SCS) PAGESIZE(66 198) CPI(15) OVRFLW(66)
000007160503      *-------------------------------------------------------------------------
000008160503      *    S T A M P A    C O N T E G G I :
000009160503      *------------------------------------------------------------------------
000010160503     A          R TES00
000011160503     A*%%***********************************************************************
000012160503     A*%%RI 00000
000013160503     A*%%***********************************************************************
000014160503      * Intestazione Testata Generale
000015160503     A            KNSIF         10      1  1
000016160503     A            KNMUS         10      1 12
000017160503     A                                  1156
000018160503     A                                      'Pgm :'
000019160503     A            NOMPGM        10      1162
000020160503     A                                  1173
000021160503     A                                      'Data :'
000022160503     A                                  1180
000023160503     A                                      DATE
000024160503     A                                      EDTWRD('  /  /  ')
000025160503     A                                  1190
000026160503     A                                      'Pag:'
000027160503     A            PAGE           4  0   1195
000028160503     A                                      EDTCDE(4)
000029160503     A                                  1 63
000030160503     A                                      '***--------------------------------
000031160503     A                                      ------------------------------------
000032160503     A                                      ***'
000033160503     A            STPDDC         8  0   2125
000034160503     A                                      EDTWRD('  /  /    ')
000035160503     A                                  2 63
000036160503     A                                      'V A L O R I Z Z A Z I O N E   G I -
000037160503     A                                      O R N A L I E R A   D E L'
000038160503     A                                  2173
000039160503     A                                      ' Ora :'
000040160503     A                                  2180
000041160503     A                                      TIME
000042160503     A                                      EDTWRD('  :  :  ')
000043160503     A                                  3 63
000044160503     A                                      '***--------------------------------
000045160503     A                                      ------------------------------------
000046160503     A                                      *** '
000047160503     A  02                              3171
000048160503     A                                      'S I M U L A Z I O N E !!!!!!'
000049160503     A                                  4  1
000050160503     A                                      'SOCIETA'
000051160503     A            SOCP           3A  O    +1
000052160503     A            DESSOC        30A  O    +1
000053160503     A                                  5  1
000054160503     A                                      'FORNITORE DI FATTURAZIONE'
000055160503     A            FORP           8A  O    +1
000056160503     A            DESFOR        30A  O    +1
000057160503     A                                    +8
000058160503     A                                      'AUTOTRASPORTATORE:'
000059160503     A            CODCPC         7  0     +2
000060160503     A                                      EDTCDE(4)
000061160503     A                                    +0
000062160503     A                                      '-'
000063160503     A            DESPAD        35        +0
000064160503      *----
000065160503     A  20                              6  1
000066160503     A                                      'N.FATTURA'
000067160503     A  20        NRFATP         8  0O    +1
000068160503     A                                      EDTCDE(4)
000069160503     A  20                                +1
000070160503     A                                      'DEL'
000071160503     A  20        DTFATP         8  0O    +1
000072160503     A                                      EDTWRD('  /  /    ')
000073160503     A*                                 6141
000074160503     A*                                     'Importi NON comprensivi dell''ade'
000075160503     A*                                   +0
000076160503     A*                                     'guamento Costo Carburante'
000077160503      *----
000078160503     A  04                              8  1
000079160503     A                                      'R I T I R I   '
000080160503     A  03                              8  1
000081160503     A                                      'C O N S E G N E'
000082160503     A                                  8167
000083160503     A                                      '(T) Spedizione del Mittente TTL'
000084160503     A                                  9  1
000085160503     A                                      ' '
000086160503     A*%%***********************************************************************
000087160503     A*%%SS
000088160503     A*%%CL 001
000089160503     A*%%CL 001
000090160503     A*%%CL 001
000091160503     A*%%CL 001
000092160503     A*%%CL 003
000093160503     A*%%CL 001
000094160503     A*%%***********************************************************************
000095160503     A          R TES01
000096160503     A*%%***********************************************************************
000097160503     A*%%RI 00000
000098160503     A*%%***********************************************************************
000099160503     A                                      SPACEA(001)
000100160503      *  Intestazione distinta di consegna
000101160503     A            CM1          198         1
000102160503     A                                      SPACEB(002)
000103160503     A                                     1
000104160503     A                                      'LNP'
000105160503     A                                      SPACEB(001)
000106160503     A                                     8
000107160503     A                                      'SPEDIZIONE'
000108160503     A                                    25
000109160503     A                                      'COD. MANCATA CONSEGNA'
000110160503     A                                    54
000111160503     A                                      'DESTINATARIO'
000112160503     A                                    81
000113160503     A                                      'C.A.P'
000114160503     A                                    95
000115160503     A                                      'INCASSATO'
000116160503     A                                   112
000117160503     A                                      'COLLI'
000118160503     A                                   121
000119160503     A                                      'PESO'
000120160503     A                                   127
000121160503     A                                      'VOLUME'
000122160503     A                                   135
000123160503     A                                      'PZ'
000124160503     A                                   138
000125160503     A                                      'R'
000126160503     A                                   140
000127160503     A                                      '  DATA  CONS. '
000128160503     A                                   155
000129160503     A                                      'PART'
000130160503     A                                   160
000131160503     A                                      'TAR'
000132160503     A                                   167
000133160503     A                                      '(T)'
000134160503     A                                   170
000135160503     A                                      'BASE IMP.'
000136160503     A                                   186
000137160503     A                                      'ACC. IMP.'
000138160503     A            CMP          198         1
000139160503     A                                      SPACEB(001)
000140160503     A*%%***********************************************************************
000141160503     A*%%SS
000142160503     A*%%CL 002
000143160503     A*%%CL 001
000144160503     A*%%CL 001
000145160503     A*%%CL 001
000146160503     A*%%***********************************************************************
000147160503     A          R TES03
000148160503     A*%%***********************************************************************
000149160503     A*%%RI 00000
000150160503     A*%%***********************************************************************
000151160503     A                                      SPACEA(001)
000152160503      *  Intestazione x nuova distinta di consegna
000153160503     A                                     1
000154160503     A                                      'DISTINTA:'
000155160503     A            NUMDOC         7  0     +1
000156160503     A                                      EDTCDE(4)
000157160503     A                                    +1
000158160503     A                                      'DEL'
000159160503     A            STPDDC         8  0     +1
000160160503     A                                      EDTCDE(8)
000161160503     A                                   161
000162160503     A                                      'OPERATORE:'
000163160503     A            CODUTE         3  0    172
000164160503     A                                      EDTCDE(4)
000165160503     A*%%***********************************************************************
000166160503     A*%%SS
000167160503     A*%%CL 001
000168160503     A*%%***********************************************************************
000169160503     A          R SALTO
000170160503     A*%%***********************************************************************
000171160503     A*%%RI 00000
000172160503     A*%%***********************************************************************
000173160503     A                                      SPACEA(001)
000174160503      *  Riga di salto per stampa nuova intestazione distinta
000175160503     A                                     1
000176160503     A                                      '   '
000177160503     A*%%***********************************************************************
000178160503     A*%%SS
000179160503     A*%%CL 001
000180160503     A*%%***********************************************************************
000181160503     A          R SALT2
000182160503     A*%%***********************************************************************
000183160503     A*%%RI 00000
000184160503     A*%%***********************************************************************
000185160503     A                                      SPACEA(001)
000186160503      *  Intestazione RITIRI
000187160503     A                                     1
000188160503     A                                      'R I T I R I   '
000189160503     A                                      SPACEB(002)
000190160503     A            CM1          198         1
000191160503     A                                      SPACEB(002)
000192160503     A                                     4
000193160503     A                                      'DATA E NUM. RIT.'
000194160503     A                                      SPACEB(001)
000195160503     A                                    22
000196160503     A                                      'CLIENTE'
000197160503     A                                    58
000198160503     A                                      'STOP'
000199160503     A                                    67
000200160503     A                                      'SPEDIZIONI'
000201160503     A                                    80
000202160503     A                                      'COLLI'
000203160503     A                                    87
000204160503     A                                      'CHILOGRAMMI'
000205160503     A                                   102
000206160503     A                                      'VOLUME'
000207160503     A                                   111
000208160503     A                                      'COD.TAR.'
000209160503     A                                   123
000210160503     A                                      'COD.DIV.'
000211160503     A                                   136
000212160503     A                                      'BASE IMP.'
000213160503     A                                   158
000214160503     A                                      'ACC. IMP.'
000215160503     A            CMP          198         1
000216160503     A                                      SPACEB(001)
000217160503     A*%%***********************************************************************
000218160503     A*%%SS
000219160503     A*%%CL 002
000220160503     A*%%CL 002
000221160503     A*%%CL 001
000222160503     A*%%CL 001
000223160503     A*%%CL 001
000224160503     A*%%***********************************************************************
000225160503     A          R DET01
000226160503     A*%%***********************************************************************
000227160503     A*%%RI 00000
000228160503     A*%%***********************************************************************
000229160503     A                                      SPACEA(001)
000230160503      *  Dettaglio: stampa dati di consegna
000231160503     A            LNP            3  0      1
000232160503     A                                      EDTCDE(4)
000233160503     A            NRS            2  0      5
000234160503     A                                      EDTCDE(4)
000235160503     A            NSP            7  0      8
000236160503     A                                      EDTCDE(4)
000237160503     A            STPGMS         4  0     16
000238160503     A                                      EDTWRD('  /  /')
000239160503     A            AAS            2  0     22
000240160503     A            CMC            3        25
000241160503     A            TMC            1        29
000242160503     A            DESCON        19        31
000243160503     A            RSD           28        51
000244160503     A            CAP            9        81
000245160503     A            NCL            5  0    111
000246160503     A                                      EDTCDE(4)
000247160503     A            PKG            7  1    117
000248160503     A                                      EDTCDE(3)
000249160503     A            VOL            8  3    126
000250160503     A                                      EDTCDE(3)
000251160503     A            CPZ            1       136
000252160503     A            RISER          1       138
000253160503     A            DATCO6         6  0    143
000254160503     A                                      EDTWRD('  /  /  ')
000255160503     A            CONCP1         1       156
000256160503     A            CONCP2         1       158
000257160503     A            CODTAR         3       160
000258160503     A            CODDIV         3       164
000259160503     A****                                  TEXT('CLIENTE TTL ='*')
000260160503     A            CLITTL         1       168
000261160503     A            TASTAR        10  3    169
000262160503     A                                      EDTCDE(4)
000263160503     A            FLGTAR         3       180
000264160503     A            TASACC        10  3    184
000265160503     A                                      EDTCDE(4)
000266160503     A            FLGACC         3       196
000267160503     A*%%***********************************************************************
000268160503     A*%%SS
000269160503     A*%%CL 001
000270160503     A*%%***********************************************************************
000271160503      *
000272160503     A          R DETRIC
000273160503     A*%%***********************************************************************
000274160503     A*%%RI 00000
000275160503     A*%%***********************************************************************
000276160503      *  Dettaglio: stampa dati consegna richiesta
000277160503     A                                   113
000278160503     A                                      'Cons.Richiesta'
000279160503     A            TIPRIC        11       128
000280160503     A            DATRIC         6  0    143
000281160503     A                                      EDTWRD('  /  /  ')
000282160503     A            ORARIC         4  0    152
000283160503     A                                      EDTWRD('  :  ')
000284160503     A*%%***********************************************************************
000285160503     A*%%SS
000286160503     A*%%***********************************************************************
000287160503     A          R SALRIG
000288160503     A*%%***********************************************************************
000289160503     A*%%RI 00000
000290160503     A*%%***********************************************************************
000291160503     A                                      SPACEA(001)
000292160503      *  Dettaglio: stampa dati consegna richiesta
000293160503     A                                   198
000294160503     A                                      ' '
000295160503     A*%%***********************************************************************
000296160503     A*%%SS
000297160503     A*%%CL 001
000298160503     A*%%***********************************************************************
000299160503     A          R DETIMP
000300160503     A*%%***********************************************************************
000301160503     A*%%RI 00000
000302160503     A*%%***********************************************************************
000303160503     A                                      SPACEA(001)
000304160503      *  Dettaglio: stampa importi Contrassegno/Assegnato/Entrambi
000305160503     A            DESTIT        20        27
000306160503     A  01                                51
000307160503     A                                      'Nr.Assegno:'
000308160503     A            NUMASS         4        62
000309160503     A  01                                69
000310160503     A                                      'ABI/CAB:'
000311160503     A            ABI            5  0     78
000312160503     A                                      EDTCDE(4)
000313160503     A  01                                83
000314160503     A                                      '/'
000315160503     A            CAB            5  0     84
000316160503     A                                      EDTCDE(4)
000317160503     A N06        IMPOR1        13  3     91
000318160503     A                                      EDTCDE(2)
000319160503     A  06        IMPOR2        10  0     91
000320160503     A                                      EDTCDE(2)
000321160503     A            VALUTA         3       109
000322160503     A*%%***********************************************************************
000323160503     A*%%SS
000324160503     A*%%CL 001
000325160503     A*%%***********************************************************************
000326160503     A          R TOT01
000327160503     A*%%***********************************************************************
000328160503     A*%%RI 00000
000329160503     A*%%***********************************************************************
000330160503     A                                      SPACEA(001)
000331160503      *  Totali conteggi distinta consegna
000332160503     A            CMP          198         1
000333160503     A            TASDIV         3       164
000334160503     A                                      SPACEB(001)
000335160503     A            TASTAD        10  3    168
000336160503     A                                      EDTCDE(4)
000337160503     A            FLGTAD         3       180
000338160503     A            TASACD        10  3    184
000339160503     A                                      EDTCDE(4)
000340160503     A            FLGACD         3       196
000341160503     A*%%***********************************************************************
000342160503     A*%%SS
000343160503     A*%%CL 001
000344160503     A*%%CL 001
000345160503     A*%%***********************************************************************
000346160503     A          R TOTAL
000347160503     A*%%***********************************************************************
000348160503     A*%%RI 00000
000349160503     A*%%***********************************************************************
000350160503      *  Riga di totale: dati spedizioni
000351160503     A                                     1
000352160503     A                                      'P R O S P E T T O    R I E P I L O-
000353160503     A                                       G A T I V O     C O N S E G N E'
000354160503     A                                      SPACEB(001)
000355160503     A                                     1
000356160503     A                                      'CONSEGNATE....:'
000357160503     A                                      SPACEB(002)
000358160503     A                                    18
000359160503     A                                      'NR.SPEDIZIONI:'
000360160503     A            SPECON         3  0     41
000361160503     A                                      EDTCDE(4)
000362160503     A                                    51
000363160503     A                                      'DI CUI PARZIALI.:'
000364160503     A            TOTP           3  0     77
000365160503     A                                      EDTCDE(4)
000366160503     A                                    87
000367160503     A                                      'NR. COLLI.:'
000368160503     A            TOTCOL         6  0    104
000369160503     A                                      EDTCDE(4)
000370160503     A                                   117
000371160503     A                                      'PESO IN KG.:'
000372160503     A            TOTPKG         8  1    132
000373160503     A                                      EDTCDE(2)
000374160503     A                                   148
000375160503     A                                      'VOLUME IN MC:'
000376160503     A            TOTVOL         7  3    170
000377160503     A                                      EDTCDE(3)
000378160503     A                                   183
000379160503     A                                      'PER N.STOP:'
000380160503     A            NUMSTP         5  0    194
000381160503     A                                      EDTCDE(4)
000382160503     A  11                                51
000383160503     A                                      'DI CUI POSTE....:'
000384160503     A                                      SPACEB(001)
000385160503     A  11        TOTCP          3  0     77
000386160503     A                                      EDTCDE(4)
000387160503     A                                     1
000388160503     A                                      'NON CONSEGNATE:'
000389160503     A                                      SPACEB(001)
000390160503     A                                    18
000391160503     A                                      'NR.SPEDIZIONI:'
000392160503     A            SPENCO         3  0     41
000393160503     A                                      EDTCDE(4)
000394160503     A                                    51
000395160503     A                                      'DI CUI NON FATTE:'
000396160503     A            TOTNF          3  0     77
000397160503     A                                      EDTCDE(4)
000398160503     A                                    87
000399160503     A                                      'GIACENTI..:'
000400160503     A            TOTGC          3  0    107
000401160503     A                                      EDTCDE(4)
000402160503     A                                   117
000403160503     A                                      'LASC.AVVISO:'
000404160503     A            TOTAV          3  0    138
000405160503     A                                      EDTCDE(4)
000406160503     A  12                                51
000407160503     A                                      'DI CUI POSTE....:'
000408160503     A                                      SPACEB(001)
000409160503     A  12        TOTNCP         3  0     77
000410160503     A                                      EDTCDE(4)
000411160503     A*%%***********************************************************************
000412160503     A*%%SS
000413160503     A*%%CL 001
000414160503     A*%%CL 002
000415160503     A*%%CL 001
000416160503     A*%%***********************************************************************
000417160503     A          R TOTESL
000418160503     A*%%***********************************************************************
000419160503     A*%%RI 00000
000420160503     A*%%***********************************************************************
000421160503      *  Riga di totale: totale da esigere in lire
000422160503     A                                     1
000423160503     A                                      'TOTALE DA ESIGERE IN LIRE.....:'
000424160503     A                                      SPACEB(001)
000425160503     A            TOTESG         9  0     33
000426160503     A                                      EDTCDE(K)
000427160503     A                                    51
000428160503     A                                      'DI CUI CONTANTE.:'
000429160503     A            INCCNT         9  0     69
000430160503     A                                      EDTCDE(K)
000431160503     A                                    87
000432160503     A                                      'ASS.NOSTRI:'
000433160503     A            NSASS          9  0     99
000434160503     A                                      EDTCDE(K)
000435160503     A                                   117
000436160503     A                                      'ASS.DIRETTI:'
000437160503     A            DIRASS         9  0    130
000438160503     A                                      EDTCDE(K)
000439160503     A*%%***********************************************************************
000440160503     A*%%SS
000441160503     A*%%CL 001
000442160503     A*%%***********************************************************************
000443160503     A          R TOTESV
000444160503     A*%%***********************************************************************
000445160503     A*%%RI 00000
000446160503     A*%%***********************************************************************
000447160503      *  Riga di totale: totale da esigere in valuta
000448160503     A                                     1
000449160503     A                                      'TOTALE DA ESIGERE IN EURO.....:'
000450160503     A                                      SPACEB(001)
000451160503     A            TOTEV         13  3     32
000452160503     A                                      EDTWRD('    .   .   ,  0')
000453160503     A                                    51
000454160503     A                                      'DI CUI CONTANTE.:'
000455160503     A            INCCNV        13  3     68
000456160503     A                                      EDTWRD('    .   .   ,  0')
000457160503     A                                    87
000458160503     A                                      'ASS.NOSTRI:'
000459160503     A            NSASSV        13  3     98
000460160503     A                                      EDTWRD('    .   .   ,  0')
000461160503     A                                   117
000462160503     A                                      'ASS.DIRETTI ALTRE DIV.:'
000463160503     A            DIRASV        13  3    140
000464160503     A                                      EDTWRD('    .   .   ,  0')
000465160503     A*%%***********************************************************************
000466160503     A*%%SS
000467160503     A*%%CL 001
000468160503     A*%%***********************************************************************
000469160503     A          R TOTSMP
000470160503     A*%%***********************************************************************
000471160503     A*%%RI 00000
000472160503     A*%%***********************************************************************
000473160503     A                                      SPACEA(001)
000474160503      *  Riga di totale: totale sommapesi a giornata
000475160503     A                                    27
000476160503     A                                      'STOP:'
000477160503     A                                      SPACEB(001)
000478160503     A            TOTSNA         7  0     35
000479160503     A                                      EDTCDE(2)
000480160503     A                                    51
000481160503     A                                      'COLLI...........:'
000482160503     A            TOTCLA         7  0     71
000483160503     A                                      EDTCDE(2)
000484160503     A                                    87
000485160503     A                                      'PESO......:'
000486160503     A            TOTKFA         8  1    101
000487160503     A                                      EDTCDE(2)
000488160503     A                                   117
000489160503     A                                      'VOLUME.....:'
000490160503     A            TOTTVL         9  3    134
000491160503     A                                      EDTCDE(3)
000492160503     A            CM3          198         1
000493160503     A                                      SPACEB(001)
000494160503     A*%%***********************************************************************
000495160503     A*%%SS
000496160503     A*%%CL 001
000497160503     A*%%CL 001
000498160503     A*%%CL 001
000499160503     A*%%***********************************************************************
000500160503     A          R TES02
000501160503     A*%%***********************************************************************
000502160503     A*%%RI 00000
000503160503     A*%%***********************************************************************
000504160503     A                                      SPACEA(001)
000505160503      *  Intestazione x prospetto riepolgativo spedizioni ritirate
000506160503     A            CM1          198         1
000507160503     A                                     4
000508160503     A                                      'DATA E NUM. RIT.'
000509160503     A                                      SPACEB(002)
000510160503     A                                    22
000511160503     A                                      'CLIENTE'
000512160503     A                                    58
000513160503     A                                      'STOP'
000514160503     A                                    67
000515160503     A                                      'SPEDIZIONI'
000516160503     A                                    80
000517160503     A                                      'COLLI'
000518160503     A                                    87
000519160503     A                                      'CHILOGRAMMI'
000520160503     A                                   102
000521160503     A                                      'VOLUME'
000522160503     A                                   111
000523160503     A                                      'COD.TAR.'
000524160503     A                                   123
000525160503     A                                      'COD.DIV.'
000526160503     A                                   134
000527160503     A                                      'BASE IMP.'
000528160503     A                                   156
000529160503     A                                      'ACC. IMP.'
000530160503     A            CMP          198         1
000531160503     A                                      SPACEB(001)
000532160503     A*%%***********************************************************************
000533160503     A*%%SS
000534160503     A*%%CL 002
000535160503     A*%%CL 001
000536160503     A*%%CL 001
000537160503     A*%%***********************************************************************
000538160503     A          R DET02
000539160503     A*%%***********************************************************************
000540160503     A*%%RI 00000
000541160503     A*%%***********************************************************************
000542160503     A                                      SPACEA(001)
000543160503      *  Dettaglio: stampa dati rititri
000544160503     A            DRT            8  0      1
000545160503     A                                      EDTWRD('  /  /    ')
000546160503     A            NRT            7  0     12
000547160503     A                                      EDTCDE(4)
000548160503     A            RSM           33        22
000549160503     A            STOP           5  0     57
000550160503     A                                      EDTCDE(4)
000551160503     A            SPE            7  0     68
000552160503     A                                      EDTCDE(2)
000553160503     A            NCL            5  0     80
000554160503     A                                      EDTCDE(3)
000555160503     A            PKG            7  1     88
000556160503     A                                      EDTCDE(2)
000557160503     A            VOL            8  3     99
000558160503     A                                      EDTCDE(3)
000559160503     A            CODTAR         3       113
000560160503     A            CODDIV         3       124
000561160503     A            TASTAR        10  3    130
000562160503     A                                      EDTCDE(2)
000563160503     A            FLGTAR         3       144
000564160503     A            TASACC        10  3    151
000565160503     A                                      EDTCDE(2)
000566160503     A            FLGACC         3       165
000567160503     A*%%***********************************************************************
000568160503     A*%%SS
000569160503     A*%%CL 001
000570160503     A*%%***********************************************************************
000571160503      *
000572160503     A          R TOTPD
000573160503     A*%%***********************************************************************
000574160503     A*%%RI 00000
000575160503     A*%%***********************************************************************
000576160503     A                                      SPACEA(001)
000577160503      *  Prospetto riepilogativo singoli ritiri
000578160503     A            CM1          198         1
000579160503     A            TOPSPE         7  0     68
000580160503     A                                      EDTCDE(2)
000581160503     A                                      SPACEB(002)
000582160503     A            TOPNCL         5  0     80
000583160503     A                                      EDTCDE(3)
000584160503     A            TOPPKG         7  1     88
000585160503     A                                      EDTCDE(2)
000586160503     A            TOPVOL         9  3     98
000587160503     A                                      EDTCDE(3)
000588160503     A            TOPDIV         3       124
000589160503     A            TOPTAR        10  3    130
000590160503     A                                      EDTCDE(2)
000591160503     A            TOPTAF         3       144
000592160503     A            TOPACC        10  3    151
000593160503     A                                      EDTCDE(2)
000594160503     A            TOPACF         3       165
000595160503     A                                    22
000596160503     A                                      'Numero clienti      '
000597160503     A            TOPCLI         7  0     +1
000598160503     A                                      EDTCDE(2)
000599160503     A*%%***********************************************************************
000600160503     A*%%SS
000601160503     A*%%CL 002
000602160503     A*%%CL 001
000603160503     A*%%***********************************************************************
000604160503     A**77****                            22'NR. Ritiri Annullati'
000605160503     A********                              SPACEB(001)
000606160503     A**77****    TOPTBS         7  0     +1
000607160503     A********                              EDTCDE(2)
000608160503     A          R TOTSPG
000609160503     A*%%***********************************************************************
000610160503     A*%%RI 00000
000611160503     A*%%***********************************************************************
000612160503     A                                      SPACEA(001)
000613160503      *  Prospetto ripeilogativo generale ritiri
000614160503     A                                     1
000615160503     A                                      'P R O S P E T T O    R I E P I L O-
000616160503     A                                       G A T I V O     R I T I R I'
000617160503     A                                      SPACEB(001)
000618160503     A                                     1
000619160503     A                                      'RITIRATE....:'
000620160503     A                                      SPACEB(002)
000621160503     A                                    18
000622160503     A                                      'NR. SPEDIZIONI:'
000623160503     A            TOGSPE         7  0     35
000624160503     A                                      EDTCDE(2)
000625160503     A                                    51
000626160503     A                                      'NR. COLLI.......:'
000627160503     A            TOGNCL         6  0     72
000628160503     A                                      EDTCDE(2)
000629160503     A                                    87
000630160503     A                                      'PESO IN KG.:'
000631160503     A            TOGPKG         8  1    102
000632160503     A                                      EDTCDE(2)
000633160503     A                                   117
000634160503     A                                      'VOLUME IN MC.:'
000635160503     A            TOGVOL         8  3    136
000636160503     A                                      EDTCDE(3)
000637160503     A                                   150
000638160503     A                                      'PER UN NUMERO DI STOP.:'
000639160503     A            TOGCLI         7  0    174
000640160503     A                                      EDTCDE(2)
000641160503     A                                    27
000642160503     A                                      'STOP:'
000643160503     A                                      SPACEB(001)
000644160503     A            TOGSNA         7  0     35
000645160503     A                                      EDTCDE(2)
000646160503     A                                    51
000647160503     A                                      'COLLI...........:'
000648160503     A            TOGCLA         7  0     70
000649160503     A                                      EDTCDE(2)
000650160503     A                                    87
000651160503     A                                      'PESO.......:'
000652160503     A            TOGKFA         8  1    102
000653160503     A                                      EDTCDE(2)
000654160503     A                                   117
000655160503     A                                      'VOLUME.......:'
000656160503     A            TOGTVL         9  3    134
000657160503     A                                      EDTCDE(2)
000658160503     A            CM3          198         1
000659160503     A                                      SPACEB(001)
000660160503     A*%%***********************************************************************
000661160503     A*%%SS
000662160503     A*%%CL 001
000663160503     A*%%CL 002
000664160503     A*%%CL 001
000665160503     A*%%CL 001
000666160503     A*%%CL 001
000667160503     A*%%***********************************************************************
000668160503     A          R TOTGEN
000669160503     A*%%***********************************************************************
000670160503     A*%%RI 00000
000671160503     A*%%***********************************************************************
000672160503     A                                      SPACEA(001)
000673160503      *  Totale Generali
000674160503     A                                     1
000675160503     A                                      'R I E P I L O G O    G E N E R A L-
000676160503     A                                       E'
000677160503     A                                      SPACEB(001)
000678160503     A                                    51
000679160503     A                                      'AUTOTRASPORTATORE:'
000680160503     A            CODCPC         7  0     +1
000681160503     A                                      EDTCDE(4)
000682160503     A            DESPAD        35        +1
000683160503     A                                    51
000684160503     A                                      'VALORIZZAZIONE DISTINTE DEL:'
000685160503     A                                      SPACEB(001)
000686160503     A            STPDDC         8  0     +1
000687160503     A                                      EDTWRD('  /  /    ')
000688160503     A                                     1
000689160503     A                                      'BASE................:'
000690160503     A                                      SPACEB(001)
000691160503     A            GENTAR        10  3     23
000692160503     A                                      EDTCDE(2)
000693160503     A                                    40
000694160503     A                                      'ACCESSORI...........:'
000695160503     A            GENACC        10  3     63
000696160503     A                                      EDTCDE(2)
000697160503     A  76                                81
000698160503     A                                      'PICKING FORFETTARIO.:'
000699160503     A  76        GENPCK        10  3    103
000700160503     A                                      EDTCDE(2)
000701160503     A  77                                 1
000702160503     A                                      'RITIRI ANNULLATI....:'
000703160503     A                                      SPACEB(001)
000704160503     A  77        GENRAN        10  3     23
000705160503     A                                      EDTCDE(2)
000706160503     A  77                                40
000707160503     A                                      '(NR.Tot. Ritiri Annullati:'
000708160503     A  77        GENTBS         5  0     +1
000709160503     A                                      EDTCDE(Z)
000710160503     A  77                                +1
000711160503     A                                      ')'
000712160503      *
000713160503     A                                     1
000714160503     A                                      'TOTALE..............:'
000715160503     A                                      SPACEB(001)
000716160503     A            GENTO1        10  3     23
000717160503     A                                      EDTCDE(2)
000718160503     A  07                                40
000719160503     A                                      'MINIMO A GIORNATA...:'
000720160503     A            GENMIN        10  3     63
000721160503     A                                      EDTCDE(2)
000722160503     A  08                                81
000723160503     A                                      'BONUS...............:'
000724160503     A            GENBON        10  3    103
000725160503     A                                      EDTCDE(2)
000726160503     A*%%***********************************************************************
000727160503     A*%%SS
000728160503     A*%%CL 001
000729160503     A*%%CL 001
000730160503     A*%%CL 001
000731160503     A*%%CL 001
000732160503     A*%%CL 001
000733160503     A*%%***********************************************************************
000734160503     A          R DETRET
000735160503     A*%%***********************************************************************
000736160503     A*%%RI 00000
000737160503     A*%%***********************************************************************
000738160503     A                                      SPACEA(001)
000739160503      *  RETTIFICHE AI CONTEGGI
000740160503     A  51                                 1
000741160503     A                                      'VARIAZIONE AL PROGETTO OPERATIVO:'
000742160503     A            DETCRE         3        35
000743160503     A            DETDES        30        39
000744160503     A            DETNOT        35        +1
000745160503     A            DETTIM        10S 3    103
000746160503     A                                      EDTCDE(K)
000747160503     A*%%***********************************************************************
000748160503     A*%%SS
000749160503     A*%%CL 001
000750160503     A*%%***********************************************************************
000751160503     A          R ENDRET
000752160503     A*%%***********************************************************************
000753160503     A*%%RI 00000
000754160503     A*%%***********************************************************************
000755160503     A  09                                81
000756160503     A                                      'IMP.AGG E RETTIFICHE:'
000757160503     A            GENIAM        10  3     +1
000758160503     A                                      EDTCDE(K)
000759160503     A*%%***********************************************************************
000760160503     A*%%SS
000761160503     A*%%***********************************************************************
000762160503     A          R TOTGE1
000763160503     A*%%***********************************************************************
000764160503     A*%%RI 00000
000765160503     A*%%***********************************************************************
000766160503     A                                   157
000767160503     A                                      '**********************************-
000768160503     A                                      ******'
000769160503      * TOTALE FINALE
000770160503     A                                   157
000771160503     A                                      '*  TOTALE :'
000772160503     A                                      SPACEB(001)
000773160503     A            GENTO2        10  3    180
000774160503     A                                      EDTCDE(K)
000775160503     A                                   196
000776160503     A                                      '*'
000777160503     A                                     1
000778160503     A                                      'Il vettore, a pena di decadenza, p-
000779160503     A                                      otrà formulare le eventuali riserve-
000780160503     A                                      , eccezioni o osservazioni sul cont-
000781160503     A                                      enuto della presente valorizzazione-
000782160503     A                                       entro e non oltre 10 giorni dalla -
000783160503     A                                      data di emissione.'
000784160503     A                                      SPACEB(003)
000785160503     A            CM3          198         1
000786160503     A                                      SPACEB(001)
000787160503     A*%%***********************************************************************
000788160503     A*%%SS
000789160503     A*%%CL 001
000790160503     A*%%CL 003
000791160503     A*%%CL 001
000792160503     A*%%***********************************************************************
000793160503     A          R ERRORE
000794160503     A*%%***********************************************************************
000795160503     A*%%RI 00000
000796160503     A*%%***********************************************************************
000797160503      *  Riga messaggio di errore
000798160503     A                                    50
000799160503     A                                      'ATTENZIONE !!!  RISCONTRATI ERRORI'
000800160503     A                                      SPACEB(003)
000801160503     A                                    85
000802160503     A                                      'IN FASE DI CONFERMA VALORIZ. DI QU'
000803160503     A                                   119
000804160503     A                                      'ESTO AUTOTRASP. '
000805160503     A                                    50
000806160503     A                                      'LA PRESENTE STAMPA NON E'' PERTANT'
000807160503     A                                      SPACEB(001)
000808160503     A                                    83
000809160503     A                                      'O CORRETTA.'
000810160503     A                                    50
000811160503     A                                      'ATTENDERE UN MESSAGGIO DI CONFERMA'
000812160503     A                                      SPACEB(001)
000813160503     A                                    85
000814160503     A                                      'DA PARTE DELLA SEDE PER POTER RIST'
000815160503     A                                   119
000816160503     A                                      'AMPARE QUESTE VALORIZ. CON I DATI '
000817160503     A                                   153
000818160503     A                                      'GIUSTI'
000819160503     A*%%***********************************************************************
000820160503     A*%%SS
000821160503     A*%%CL 003
000822160503     A*%%CL 001
000823160503     A*%%CL 001
000824160503     A*%%CP+999CRTPRTF
000825160503     A*%%CP+    CPI(15)
000826160503     A*%%CP+    OVRFLW(66)
000827160503     A*%%CP+    FILE(GAITRAFIL/FICNB6P)
000828160503     A*%%CP+    DEVTYPE(*SCS)
000829160503     A*%%CP     PAGESIZE(*N       198      *N     )
000830160503     A*%%CS+999CRTPRTF
000831160503     A*%%CS+    FILE(QTEMP/QPRDRPT)
000832160503     A*%%CS+    DEVTYPE(*SCS)
000833160503     A*%%CS     PAGESIZE(*N 198)
000834160503     A*%%***********************************************************************
