000010100513     A*%%TS  SD  20100513  160200  EDPAB       REL-V5R4M0  5722-WDS
000020911205     A*  91/12/05  10:20:58    EDPES       REL-R03M00  5728-PW1
000030011114     A*** FILE : FICND3D *--------------------------------------------*
000040931123     A*          CREAZIONE FILE DI SIMULAZIONE PADRONCINI              *
000050000000     A***-------------------------------------------------------------**
000060100513     A*%%EC
000070100513     A                                      DSPSIZ(24 80 *DS3)
000080100513     A                                      CHGINPDFT(HI UL)
000090100513     A                                      PRINT
000100950125     A*
000110950125     A**-------------------------------------------------------------**
000120100513     A          R FNB0D01
000130100513     A*%%TS  SD  20100513  160200  EDPAB       REL-V5R4M0  5722-WDS
000140100513     A                                      OVERLAY
000150100513     A            RSUT          20A  O  1  2
000160100513     A                                  1 29'* Messaggio di Avviso *'
000170100513     A                                      DSPATR(RI)
000180100513     A                                      DSPATR(UL)
000190100513     A                                  1 61'FICNB1R0'
000200100513     A                                  1 71DATE
000210100513     A                                      EDTCDE(Y)
000220100513     A            KNSIF         10A  O  2  2
000230100513     A            KNMUS         10A  O  2 13
000240100513     A                                  2 71TIME
000250100513     A                                  8 23'*                                 -
000260100513     A                                          *'
000270100513     A                                      DSPATR(RI)
000280100513     A                                      DSPATR(HI)
000290100513     A                                  9 23'*   N O N    E''   P O S S I B I L-
000300100513     A                                       E   *'
000310100513     A                                      DSPATR(RI)
000320100513     A                                 10 23'*   ACCEDERE   ALLE  VALORIZZAZION-
000330100513     A                                      I   *'
000340100513     A                                      DSPATR(RI)
000350100513     A                                 11 23'*                                 -
000360100513     A                                          *'
000370100513     A                                      DSPATR(RI)
000380100513     A                                      DSPATR(HI)
000390100513     A                                 12 23'*                                 -
000400100513     A                                          *'
000410100513     A                                      DSPATR(RI)
000420100513     A                                 13 23'*   L''UTENTE:'
000430100513     A                                      DSPATR(RI)
000440100513     A            VUSER         10   O 13 37
000450100513     A                                 13 48'             *'
000460100513     A                                      DSPATR(RI)
000470100513     A                                 14 23'*         STA  già  VALORIZZANDO  -
000480100513     A                                          *'
000490100513     A                                      DSPATR(RI)
000500100513     A                                 15 23'*                                 -
000510100513     A                                          *'
000520100513     A                                      DSPATR(RI)
000530100513     A                                      DSPATR(HI)
000540100513     A                                 18 40'dalle'
000550100513     A            DAORE          6Y 0O 18 46EDTWRD('  :  :  ')
000560100513     A                                 18 57'del'
000570100513     A            INDATA         8Y 0O 18 62EDTWRD('  /  /   0')
000580100513     A            MSGVID        80A  O 20  1
000590100513     A            MSGVD2        79A  O 21  2
000600100513     A                                 23  4'Enter per Continuare'
