000100950929     A*------------------------------------------------------------------------*
000200020529     A*  DS ESTERNA PROCEDURA VALORIZZ. CONTEGGI
000300950929     A*------------------------------------------------------------------------*
000400020529     A          R FICN58                    TEXT('DS PROCEDURA VALORIZZ.-
000500020419     A                                       CONTEGGI')
000600020529     A            F58SOC         3A         TEXT('CODICE SOCIETA')
000700020529     A            F58DTI         8S 0       TEXT('DATA PROTOC. DAL')
000800020529     A            F58DTF         8S 0       TEXT('DATA PROTOC. AL')
