000100080208     A*%%***********************************************************************
000200080208     A*%%TS  RD  20080208  173040  EDPAB       REL-V5R4M0  5722-WDS
000300080208     A*%%FI+10660100000000000000000000000000000000000000000000000000
000400080208     A*%%FI       0000000000000000000000000000000000000000000000000
000500080208     A*%%***********************************************************************
000600080208     A*------------------------------------------------------------------------*
000700080208      *PARMS SAVE(*YES)
000800080208      *PARMS PAGESIZE(66 124) CPI(15) OVERFLOW(66)
000900080208     A*------------------------------------------------------------------------*
001000080208     A          R TESTA
001100080208     A*%%***********************************************************************
001200080208     A*%%RI 00000
001300080208     A*%%FS 002
001400080208     A*%%***********************************************************************
001500080208     A                                      TEXT('ALLEGATO TARIFFARIO')
001600080208     A                                      SKIPB(003)
001700080208     A                                    50
001800080208     A                                      'pag.'
001900080208     A            PAGE           3  0     +1
002000080208     A                                      EDTCDE(Z)
002100080208     A                                      SKIPA(010)
002200080208     A                                      CPI(15)
002300080208     A            MODO           8A       50
002400080208     A                                      SPACEA(002)
002500080208     A                                     6
002600080208     A                                      'ALLEGATO "A"'
002700080208     A                                      HIGHLIGHT
002800080208     A                                      CPI(10)
002900080208     A                                    24
003000080208     A                                      '  AL   CONTRATTO   DI   APPALTO   -
003100080208     A                                      STIPULATO   TRA  : '
003200080208     A                                      SPACEA(001)
003300080208     A                                      CPI(10)
003400080208     A            COPD50        50A        5
003500080208     A                                      SPACEB(001)
003600080208     A                                    57
003700080208     A                                      'E'
003800080208     A            SOCD50        50A       60
003900080208     A                                     5
004000080208     A                                      'in data'
004100080208     A                                      SPACEB(001)
004200080208     A            DATA08         8S 0     14
004300080208     A                                      EDTWRD('  /  /    ')
004400080208     A                                    26
004500080208     A                                      'per il magazzino sito in'
004600080208     A            INDD01        60A  O    52
004700080208     A                                      SPACEA(001)
004800080208     A                                     5
004900080208     A                                      'Le parti, così come convenuto al p-
005000080208     A                                      unto 6.1 del contratto suddetto, co-
005100080208     A                                      ncordano i seguenti corrispettivi'
005200080208     A                                      SPACEA(001)
005300080208     A                                     5
005400080208     A                                      'per tutti i servizi appaltati di s-
005500080208     A                                      eguito indicati:'
005600080208     A                                      SPACEA(001)
005700080208     A*%%***********************************************************************
005800080208     A*%%SS
005900080208     A*%%CL 007
006000080208     A*%%CL 002
006100080208     A*%%CL 002
006200080208     A*%%CL 001
006300080208     A*%%CL 001
006400080208     A*%%CL 001
006500080208     A*%%CL 001
006600080208     A*%%***********************************************************************
006700080208     A*------------------------------------------------------------------------*
006800080208     A          R TESTA1
006900080208     A*%%***********************************************************************
007000080208     A*%%RI 00000
007100080208     A*%%***********************************************************************
007200080208     A                                      TEXT('MOVIMENTAZIONE')
007300080208     A                                      SPACEA(001)
007400080208     A                                      CPI(15)
007500080208     A            TS1ORD        75A        5
007600080208     A                                      HIGHLIGHT
007700080208     A*%%***********************************************************************
007800080208     A*%%SS
007900080208     A*%%CL 001
008000080208     A*%%***********************************************************************
008100080208     A*------------------------------------------------------------------------*
008200080208     A          R TESDET
008300080208     A*%%***********************************************************************
008400080208     A*%%RI 00000
008500080208     A*%%***********************************************************************
008600080208     A                                      TEXT('MOVIMENTAZIONE')
008700080208     A                                      SPACEA(001)
008800080208     A                                      CPI(15)
008900080208     A            TESTIT        75A        5
009000080208     A                                      HIGHLIGHT
009100080208     A                                    81
009200080208     A                                      'Euro'
009300100108     A            TESVAL        10S 5O    +2
009400080208     A                                      EDTCDE(3)
009500080208     A            TESUMA         8A  O   100
009600080208     A*%%***********************************************************************
009700080208     A*%%SS
009800080208     A*%%CL 001
009900080208     A*%%***********************************************************************
010000080208     A*------------------------------------------------------------------------*
010100080208     A          R RIGDET
010200080208     A*%%***********************************************************************
010300080208     A*%%RI 00000
010400080208     A*%%***********************************************************************
010500080208     A                                      TEXT('MOVIMENTAZIONE')
010600080208     A                                      SPACEA(001)
010700080208     A                                      CPI(15)
010800080208     A            DETDES        75A        5
010900080208     A                                    81
011000080208     A                                      'Euro'
011100100108     A            DETVAL        10S 5O    +2
011200080208     A                                      EDTCDE(3)
011300080208     A            DETUMA         8A  O   100
011400080208     A*%%***********************************************************************
011500080208     A*%%SS
011600080208     A*%%CL 001
011700080208     A*%%***********************************************************************
011800080208     A*------------------------------------------------------------------------*
011900080208     A          R COST01
012000080208     A*%%***********************************************************************
012100080208     A*%%RI 00000
012200080208     A*%%***********************************************************************
012300080208     A                                      TEXT('MOVIMENTAZIONE')
012400080208     A                                      SPACEA(001)
012500080208     A                                      CPI(15)
012600080208     A                                     5
012700080208     A                                      'I corrispettivi a peso sono riferi-
012800080208     A                                      ti esclusivamente alla movimentazio-
012900080208     A                                      ne del collettame vario, con esclus-
013000080208     A                                      ione'
013100080208     A                                      SPACEA(001)
013200080208     A                                     5
013300080208     A                                      'dei pacchi del "Servizio Pacchi Po-
013400080208     A                                      sta".'
013500080208     A*%%***********************************************************************
013600080208     A*%%SS
013700080208     A*%%CL 001
013800080208     A*%%CL 001
013900080208     A*%%***********************************************************************
014000080208     A*------------------------------------------------------------------------*
014100080208     A          R COST02
014200080208     A*%%***********************************************************************
014300080208     A*%%RI 00000
014400080208     A*%%***********************************************************************
014500080208     A                                      TEXT('MOVIMENTAZIONE')
014600080208     A                                      SPACEA(001)
014700080208     A                                      CPI(15)
014800080208     A                                     5
014900080208     A                                      'Le parti, con esclusivo riferiment-
015000080208     A                                      o al "Servizio Pacchi Posta", così -
015100080208     A                                      come definito tra le parti, concord-
015200080208     A                                      ano'
015300080208     A                                      SPACEA(001)
015400080208     A                                     5
015500080208     A                                      'inoltre i seguenti corrispettivi p-
015600080208     A                                      er i servizi appaltati:'
015700080208     A*%%***********************************************************************
015800080208     A*%%SS
015900080208     A*%%CL 001
016000080208     A*%%CL 001
016100080208     A*%%***********************************************************************
016200080208     A*------------------------------------------------------------------------*
016300080208     A          R NEWPAG
016400080208     A*%%***********************************************************************
016500080208     A*%%RI 00000
016600080208     A*%%FS 002
016700080208     A*%%***********************************************************************
016800080208     A                                      TEXT('ALLEGATO TARIFFARIO')
016900080208     A                                      CPI(15)
017000080208     A                                      SKIPB(003)
017100080208     A                                    50
017200080208     A                                      'pag.'
017300080208     A            PAGE           3  0     +1
017400080208     A                                      EDTCDE(Z)
017500080208     A                                      SKIPA(011)
017600080208     A*%%***********************************************************************
017700080208     A*%%SS
017800080208     A*%%CL 008
017900080208     A*%%***********************************************************************
018000080208     A*------------------------------------------------------------------------*
018100080208     A          R FINE01
018200080208     A*%%***********************************************************************
018300080208     A*%%RI 00000
018400080208     A*%%***********************************************************************
018500080208     A                                      TEXT('MOVIMENTAZIONE')
018600080208     A                                      SPACEA(001)
018700080208     A                                      CPI(15)
018800090908     A                                     5
018900090908     A                                      'Le parti espressamente dichiarano -
019000090908     A                                      che i corrispettivi sopra indicati -
019100090908     A                                      relativi alle merci affidate dalla '
019200090908     A                                      SPACEA(001)
019300090908     A                                     5
019400090908     A                                      'mittente TTL srl si intendono sost-
019500090908     A                                      itutivi delle corrispondenti voci -
019600090908     A                                      standard.'
019700090908     A                                      SPACEA(001)
019800080208     A                                     5
019900080208     A                                      'Le parti convengono che i suddetti-
020000080208     A                                       corrispettivi potranno essere modi-
020100080208     A                                      ficati solo per effetto di successi-
020200080208     A                                      vi'
020300080208     A                                      SPACEA(001)
020400080208     A                                     5
020500080208     A                                      'patti scritti.'
020600080208     A*%%***********************************************************************
020700080208     A*%%SS
020800080208     A*%%CL 001
020900080208     A*%%CL 001
021000080208     A*%%***********************************************************************
021100080208     A*------------------------------------------------------------------------*
021200080208     A          R FINE02
021300080208     A*%%***********************************************************************
021400080208     A*%%RI 00000
021500080208     A*%%***********************************************************************
021600080208     A                                      TEXT('MOVIMENTAZIONE')
021700080208     A                                      SPACEA(001)
021800080208     A                                      CPI(15)
021900080208     A                                     5
022000080208     A                                      'Il presente allegato "A", a decorr-
022100080208     A                                      ere dalla data odierna, annulla e s-
022200080208     A                                      ostituisce qualsiasi precedente pat-
022300080208     A                                      to'
022400080208     A                                      SPACEA(001)
022500080208     A                                     5
022600080208     A                                      'verbale o scritto relativo al corr-
022700080208     A                                      ispettivo dell''appalto e costituis-
022800080208     A                                      ce parte integrante del relativo   -
022900080208     A                                         '
023000080208     A                                      SPACEA(001)
023100080208     A                                     5
023200080208     A                                      'contratto.'
023300080208     A*%%***********************************************************************
023400080208     A*%%SS
023500080208     A*%%CL 001
023600080208     A*%%CL 001
023700080208     A*%%CL 001
023800080208     A*%%***********************************************************************
023900080208     A*------------------------------------------------------------------------*
024000080208     A          R FINE03
024100080208     A*%%***********************************************************************
024200080208     A*%%RI 00000
024300080208     A*%%***********************************************************************
024400080208     A                                      TEXT('MOVIMENTAZIONE')
024500080208     A                                      SPACEA(001)
024600080208     A                                      CPI(15)
024700080208     A                                     5
024800080208     A                                      'L''APPALTATORE autorizza il COMMIT-
024900080208     A                                      TENTE o società da questi appositam-
025000080208     A                                      ente delegata, ad emettere alla fin-
025100080208     A                                      e  '
025200080208     A                                      SPACEA(001)
025300080208     A                                     5
025400080208     A                                      'di ogni mese in nome e per conto d-
025500080208     A                                      ell''appaltatore stesso una fattura-
025600080208     A                                       relativa a tutti i servizi effettu-
025700080208     A                                      ati'
025800080208     A                                      SPACEA(001)
025900080208     A                                     5
026000080208     A                                      'in tale periodo.'
026100080208     A*%%***********************************************************************
026200080208     A*%%SS
026300080208     A*%%CL 001
026400080208     A*%%CL 001
026500080208     A*%%CL 001
026600080208     A*%%***********************************************************************
026700080208     A*------------------------------------------------------------------------*
026800080208     A          R FINE04
026900080208     A*%%***********************************************************************
027000080208     A*%%RI 00000
027100080208     A*%%***********************************************************************
027200080208     A                                      TEXT('MOVIMENTAZIONE')
027300080208     A                                      SPACEA(001)
027400080208     A                                      CPI(15)
027500080208     A                                     5
027600080208     A                                      'La fattura sarà emessa sulla base -
027700080208     A                                      di valorizzazioni che verranno mess-
027800080208     A                                      e a disposizione dell''appaltatore '
027900080208     A                                      SPACEA(001)
028000080208     A                                     5
028100080208     A                                      'mensilmente.'
028200080208     A*%%***********************************************************************
028300080208     A*%%SS+
028400080208     A*%%SS                                             tore
028500080208     A*%%CL 001
028600080208     A*%%CL 001
028700080208     A*%%***********************************************************************
028800080208     A*------------------------------------------------------------------------*
028900080208     A          R FINE05
029000080208     A*%%***********************************************************************
029100080208     A*%%RI 00000
029200080208     A*%%***********************************************************************
029300080208     A                                      TEXT('MOVIMENTAZIONE')
029400080208     A                                      SPACEA(001)
029500080208     A                                      CPI(15)
029600080208     A                                     5
029700080208     A                                      'L''intestazione dell''APPALTATORE -
029800080208     A                                      da riportare sulla fattura emessa è-
029900080208     A                                      :'
030000080208     A                                      SPACEA(001)
030100080208     A                                     5
030200080208     A                                      'Ragione Sociale'
030300080208     A            RAGSOC        80A  O    +2
030400080208     A                                     5
030500080208     A                                      'Indirizzo'
030600080208     A                                      SPACEB(001)
030700080208     A            VIA           80A  O    +8
030800080208     A                                     5
030900080208     A                                      'CAP'
031000080208     A                                      SPACEB(001)
031100080208     A            CAP            9A  O    +2
031200080208     A                                    22
031300080208     A                                      'Città'
031400080208     A            CITTA         73A  O    29
031500080208     A                                      SPACEA(001)
031600080208     A                                     5
031700080208     A                                      'Recapito'
031800080208     A            RECAPI        87A  O    +2
031900080208     A                                     5
032000080208     A                                      'Partita IVA'
032100080208     A                                      SPACEB(001)
032200080208     A            PARIVA        83A  O    +3
032300080208     A                                      SPACEA(001)
032400080208     A                                     5
032500080208     A                                      'L''APPALTATORE in caso di variazio-
032600080208     A                                      ne dell''intestazione ne darà immed-
032700080208     A                                      iata comunicazione al COMMITTENTE.'
032800080208     A*%%***********************************************************************
032900080208     A*%%SS
033000080208     A*%%CL 001
033100080208     A*%%CL 001
033200080208     A*%%CL 001
033300080208     A*%%CL 001
033400080208     A*%%CL 001
033500080208     A*%%CL 001
033600080208     A*%%CL 001
033700080208     A*%%***********************************************************************
033800080208     A*------------------------------------------------------------------------*
033900080208     A          R FINE06
034000080208     A*%%***********************************************************************
034100080208     A*%%RI 00000
034200080208     A*%%***********************************************************************
034300080208     A                                      TEXT('MOVIMENTAZIONE')
034400080208     A                                      CPI(15)
034500080208     A                                      SPACEA(001)
034600080208     A                                     5
034700080208     A                                      'Le parti concordano altresì che il-
034800080208     A                                       pagamento dei corrispettivi fattur-
034900080208     A                                      ati verrà effettuato dal  '
035000080208     A                                     5
035100080208     A                                      'COMMITTENTE a'
035200080208     A                                      SPACEB(001)
035300080208     A            FLD012        20A  O    +1
035400080208     A                                    40
035500080208     A                                      '('
035600080208     A            GIORNI         7S 0O    43
035700080208     A                                      EDTCDE(Z)
035800080208     A                                    52
035900080208     A                                      ')'
036000080208     A                                    55
036100080208     A                                      'Giorni mediante bonifico bancario -
036200080208     A                                      disposto su:'
036300080208     A                                     5
036400080208     A                                      'IBAN:'
036500080208     A                                      SPACEB(001)
036600080208     A            CCIBAN       103A  O     5
036700080208     A                                      SPACEB(001)
036800080208     A                                      CPI(15)
036900080208     A*****       CCBANC        74A  O    +2
037000080208     A*****                                 SPACEA(001)
037100080208     A*****                                5
037200080208     A*****                                 'presso banca'
037300080208     A*****       BANCA         83A  O    +2
037400080208     A*****                                 SPACEA(001)
037500080208     A*****                                5
037600080208     A*****                                 'codice ABI'
037700080208     A*****       CODABI        35A  O    +1
037800080208     A*****                               53
037900080208     A*****                                 'codice CAB'
038000080208     A*****       CODCAB        38A  O    64
038100080208     A                                     5
038200080208     A                                      'L''APPALTATORE in caso di variazio-
038300080208     A                                      ne delle coordinate bancarie ne dar-
038400080208     A                                      à immediata comunicazione'
038500080208     A                                      SPACEB(002)
038600080208     A                                     5
038700080208     A                                      'al COMMITTENTE. '
038800080208     A                                      SPACEB(001)
038900080208     A*%%***********************************************************************
039000080208     A*%%SS
039100080208     A*%%CL 001
039200080208     A*%%CL 001
039300080208     A*%%CL 001
039400080208     A*%%CL 002
039500080208     A*%%CL 001
039600080208     A*%%CL 001
039700080208     A*%%***********************************************************************
039800080208     A*------------------------------------------------------------------------*
039900080208     A          R FINE07
040000080208     A*%%***********************************************************************
040100080208     A*%%RI 00000
040200080208     A*%%***********************************************************************
040300080208     A                                      TEXT('MOVIMENTAZIONE')
040400080208     A                                      CPI(15)
040500080208     A                                      SPACEA(001)
040600080208     A            FLD025        25A  O     5
040700080208     A                                    31
040800080208     A                                      ', lì'
040900080208     A            DATA10        10A       37
041000080208     A            APPALT        45A  O     5
041100080208     A                                      SPACEB(002)
041200080208     A            COMMIT        45A  O    52
041300080208     A*%%***********************************************************************
041400080208     A*%%SS
041500080208     A*%%CL 002
041600080208     A*%%CL 001
041700080208     A*%%***********************************************************************
041800080208     A*------------------------------------------------------------------------*
041900080208     A          R FINPAG
042000080208     A*%%***********************************************************************
042100080208     A*%%RI 00000
042200080208     A*%%FS 018
042300080208     A*%%***********************************************************************
042400080208     A                                      TEXT('MOVIMENTAZIONE')
042500080208     A                                      SKIPB(064)
042600080208     A                                      CPI(15)
042700080208     A                                    55
042800080208     A                                      'Pag.'
042900080208     A            PAGE           4S 0O    60
043000080208     A                                      EDTCDE(Z)
043100080208     A*%%***********************************************************************
043200080208     A*%%SS
043300080208     A*%%***********************************************************************
043400080208     A*------------------------------------------------------------------------*
043500080208     A          R SALPAG
043600080208     A*%%***********************************************************************
043700080208     A*%%RI 00000
043800080208     A*%%FS 002
043900080208     A*%%***********************************************************************
044000080208     A                                      TEXT('ALLEGATO TARIFFARIO')
044100080208     A                                      CPI(15)
044200080208     A                                      SKIPB(003)
044300080208     A                                    50
044400080208     A                                      'pag.'
044500080208     A            PAGE           3  0     +1
044600080208     A                                      EDTCDE(Z)
044700080208     A                                      SKIPA(011)
044800080208     A            MODO           8A       50
044900080208     A                                      SPACEA(001)
045000080208     A*%%***********************************************************************
045100080208     A*%%SS
045200080208     A*%%CL 008
045300080208     A*%%CL 001
045400080208     A*%%***********************************************************************
045500080208     A*------------------------------------------------------------------------*
045600080208     A          R TESTRA
045700080208     A*%%***********************************************************************
045800080208     A*%%RI 00000
045900080208     A*%%FS 002
046000080208     A*%%***********************************************************************
046100080208     A                                      TEXT('ALLEGATO TRATTORISTI')
046200080208     A                                      SKIPB(003)
046300080208     A                                      CPI(15)
046400080208     A                                      SPACEA(001)
046500080208     A                                    50
046600080208     A                                      'pag.'
046700080208     A            PAGE1          3  0     +1
046800080208     A                                      EDTCDE(Z)
046900080208     A                                      SKIPA(010)
047000080208     A            MODO           8A       50
047100080208     A                                      SPACEA(002)
047200080208     A                                     6
047300080208     A                                      'ALLEGATO "A-1"'
047400080208     A                                      HIGHLIGHT
047500080208     A                                      CPI(10)
047600080208     A                                      SPACEB(002)
047700080208     A                                    30
047800080208     A                                      'ALLA SCRITTURA PRIVATA INTEGRATIVA-
047900080208     A                                       AL CONTRATTO DI'
048000080208     A                                      CPI(10)
048100080208     A                                      SPACEA(001)
048200080208     A                                     5
048300080208     A                                      ' APPALTO   STIPULATA  TRA '
048400080208     A                                      CPI(10)
048500080208     A            COPD50        50A       53
048600080208     A                                   106
048700080208     A                                      'E'
048800080208     A                                      SPACEA(001)
048900080208     A            SOCD50        50A        5
049000080208     A                                    59
049100080208     A                                      'in data'
049200080208     A            DATA08         8S 0     70
049300080208     A                                      EDTWRD('  /  /    ')
049400080208     A                                      SPACEA(001)
049500080208     A                                     5
049600080208     A                                      'per   il   magazzino   sito  in'
049700080208     A            INDD01        60A  O    40
049800080208     A                                      SPACEA(001)
049900080208     A                                     5
050000080208     A                                      'Le parti, così come convenuto all'-
050100080208     A                                      'art.3 della scrittura privata inte-
050200080208     A                                      grativa suddetta, concordano, quale'
050300080208     A                                      SPACEA(001)
050400080208     A                                     5
050500080208     A                                      'corrispettivo per l''esecuzione  d-
050600080208     A                                      ei servizi accessori  quali  l''agg-
050700080208     A                                      anciamento,  il posizionamento sull-
050800080208     A                                      e'
050900080208     A                                      SPACEA(001)
051000080208     A                                     5
051100080208     A                                      'ribalte, lo sganciamento,  e la mo-
051200080208     A                                      vimentazione all''interno  del cort-
051300080208     A                                      ile di pertinenza  di casse mobili,'
051400080208     A*%%***********************************************************************
051500080208     A*%%SS
051600080208     A*%%CL 007
051700080208     A*%%CL 004
051800080208     A*%%CL 001
051900080208     A*%%CL 001
052000080208     A*%%CL 001
052100080208     A*%%CL 001
052200080208     A*%%CL 001
052300080208     A*%%CL 001
052400080208     A*%%CL 001
052500080208     A*%%***********************************************************************
052600080208     A*------------------------------------------------------------------------*
052700080208     A          R TESPUL
052800080208     A*%%***********************************************************************
052900080208     A*%%RI 00000
053000080208     A*%%FS 002
053100080208     A*%%***********************************************************************
053200080208     A                                      TEXT('ALLEGATO PULIZIE')
053300080208     A                                      SKIPB(003)
053400080208     A                                      CPI(15)
053500080208     A                                      SPACEA(001)
053600080208     A                                    50
053700080208     A                                      'pag.'
053800080208     A            PAGE1          3  0     +1
053900080208     A                                      EDTCDE(Z)
054000080208     A                                      SKIPA(010)
054100080208     A            MODO           8A       50
054200080208     A                                      SPACEA(004)
054300080208     A                                     6
054400080208     A                                      'ALLEGATO "B"'
054500080208     A                                      HIGHLIGHT
054600080208     A                                      CPI(10)
054700080208     A*******                             31
054800080208     A*******                               'AL CONTRATTO DI APPALTO DI SERVIZI-
054900080208     A*******                                STIPULATO TRA'
055000080208     A                                    31
055100080208     A                                      'AL   CONTRATTO   STIPULATO   TRA'
055200080208     A                                      CPI(10)
055300080208     A                                      SPACEA(001)
055400080208     A            COPD50        50A        5
055500080208     A                                    57
055600080208     A                                      'E'
055700080208     A            SOCD50        50A       60
055800080208     A                                      SPACEA(001)
055900080208     A                                     5
056000080208     A                                      'in data'
056100080208     A            DATA08         8S 0     13
056200080208     A                                      EDTWRD('  /  /    ')
056300080208     A                                    25
056400080208     A                                      'per il magazzino sito in'
056500080208     A            INDD01        60A  O    50
056600080208     A                                      SPACEA(001)
056700080208     A                                     5
056800080208     A                                      'Le  parti ,   così   come   conven-
056900080208     A                                      uto  all'' art. 4   del  suddetto  -
057000080208     A                                      contratto ,  concordano ,  quale'
057100080208     A                                      SPACEA(001)
057200080208     A                                     5
057300080208     A                                      'corrispettivo   per   l'' esecuzio-
057400080208     A                                      ne   di  tutte   le   attività  meg-
057500080208     A                                      lio   indicate   nell'' apposito'
057600080208     A*%%***********************************************************************
057700080208     A*%%SS
057800080208     A*%%CL 007
057900080208     A*%%CL 004
058000080208     A*%%CL 001
058100080208     A*%%CL 001
058200080208     A*%%CL 001
058300080208     A*%%CL 001
058400080208     A*%%CL 001
058500080208     A*%%***********************************************************************
058600080208     A*------------------------------------------------------------------------*
058700080208     A          R IMPTAR
058800080208     A*%%***********************************************************************
058900080208     A*%%RI 00000
059000080208     A*%%***********************************************************************
059100080208     A                                      TEXT('DELEGA FATTURAZIONE')
059200080208     A                                      CPI(15)
059300080208     A                                      SPACEA(001)
059400080208     A            RIGIMP       105A  O     5
059500080208     A                                      SPACEA(001)
059600080208     A            IMPLET       105A  O     5
059700080208     A*%%***********************************************************************
059800080208     A*%%SS
059900080208     A*%%CL 001
060000080208     A*%%CL 001
060100080208     A*%%***********************************************************************
060200080208     A*------------------------------------------------------------------------*
060300080208     A          R IMPMES
060400080208     A*%%***********************************************************************
060500080208     A*%%RI 00000
060600080208     A*%%***********************************************************************
060700080208     A                                      TEXT('VALORE MENSILE')
060800080208     A                                      CPI(15)
060900080208     A            RIGMES       105A  O     5
061000080208     A                                      SPACEA(001)
061100080208     A*%%***********************************************************************
061200080208     A*%%SS
061300080208     A*%%CL 001
061400080208     A*%%***********************************************************************
061500080208     A*****                                 SPACEA(001)
061600080208     A*****       TARMES        10S 3O     5
061700080208     A*****                                 EDTCDE(3)
061800080208     A*****                               17
061900080208     A*****                                 '('
062000080208     A*****       MESLET       105A  O     5
062100080208     A*------------------------------------------------------------------------*
062200080208     A          R CNTMES
062300080208     A*%%***********************************************************************
062400080208     A*%%RI 00000
062500080208     A*%%***********************************************************************
062600080208     A                                      TEXT('VALORE CONTINUAZIONE')
062700080208     A                                      CPI(15)
062800080208     A            RIGCNT       105A  O     5
062900080208     A                                      SPACEA(001)
063000080208     A*%%***********************************************************************
063100080208     A*%%SS
063200080208     A*%%CL 001
063300080208     A*%%***********************************************************************
063400080208     A*------------------------------------------------------------------------*
063500080208     A          R DELFAT
063600080208     A*%%***********************************************************************
063700080208     A*%%RI 00000
063800080208     A*%%***********************************************************************
063900080208     A                                      TEXT('DELEGA FATTURAZIONE')
064000080208     A                                      CPI(15)
064100080208     A                                      SPACEA(001)
064200080208     A                                     5
064300080208     A                                      'L''APPALTATORE autorizza il COMMIT-
064400080208     A                                      TENTE o società da questi appositam-
064500080208     A                                      ente delegata, ad emettere alla    '
064600080208     A                                      SPACEA(001)
064700080208     A                                     5
064800080208     A                                      'fine di ogni mese in nome e per co-
064900080208     A                                      nto dell''APPALTATORE stesso una fa-
065000080208     A                                      ttura relativa a tutti i servizi   '
065100080208     A                                      SPACEA(001)
065200080208     A                                     5
065300080208     A                                      'effettuati in tale periodo.       -
065400080208     A                                                                         -
065500080208     A                                                                        '
065600080208     A*%%***********************************************************************
065700080208     A*%%SS
065800080208     A*%%CL 001
065900080208     A*%%CL 001
066000080208     A*%%CL 001
066100080208     A*%%***********************************************************************
066200080208     A*------------------------------------------------------------------------*
066300080208     A          R FINTRA
066400080208     A*%%***********************************************************************
066500080208     A*%%RI 00000
066600080208     A*%%***********************************************************************
066700080208     A                                      TEXT('TRATTORISTI')
066800080208     A                                      CPI(15)
066900080208     A                                      SPACEA(001)
067000080208     A                                     5
067100080208     A                                      'Il presente allegato "A-1" costitu-
067200080208     A                                      isce parte integrante della scrittu-
067300080208     A                                      ra privata integrativa suddetta,  '
067400080208     A                                      SPACEA(001)
067500080208     A                                     5
067600080208     A                                      'nonchè del contratto d''appalto so-
067700080208     A                                      ttoscritto in data ................-
067800080208     A                                      .. e delle successive integrazioni.'
067900080208     A                                      SPACEA(001)
068000080208     A                                     5
068100080208     A                                      'Le parti convengono che il sopra i-
068200080208     A                                      ndicato corrispettivo potrà essere -
068300080208     A                                      modificato solo per effetto di    '
068400080208     A                                      SPACEA(001)
068500080208     A                                     5
068600080208     A                                      'successivi patti scritti.         -
068700080208     A                                                                         -
068800080208     A                                                              '
068900080208     A*%%***********************************************************************
069000080208     A*%%SS
069100080208     A*%%CL 001
069200080208     A*%%CL 001
069300080208     A*%%CL 001
069400080208     A*%%CL 001
069500080208     A*%%***********************************************************************
069600080208     A*------------------------------------------------------------------------*
069700080208     A          R FINPUL
069800080208     A*%%***********************************************************************
069900080208     A*%%RI 00000
070000080208     A*%%***********************************************************************
070100080208     A                                      TEXT('PULIZIE')
070200080208     A                                      CPI(15)
070300080208     A                                      SPACEA(001)
070400080208     A                                     5
070500080208     A                                      'Il  presente  allegato  "B"  costi-
070600080208     A                                      tuisce  parte  integrante  del  con-
070700080208     A                                      tratto  sottoscritto  in  data    '
070800080208     A                                      SPACEA(001)
070900080208     A                                     5
071000080208     A                                      '..................... . Le parti c-
071100080208     A                                      onvengono espressamente che il sopr-
071200080208     A                                      a indicato corrispettivo potrà    '
071300080208     A                                      SPACEA(001)
071400080208     A                                     5
071500080208     A                                      'essere modificato solo per effetto-
071600080208     A                                       di successivi patti scritti.      -
071700080208     A                                                              '
071800080208     A*%%***********************************************************************
071900080208     A*%%SS
072000080208     A*%%CL 001
072100080208     A*%%CL 001
072200080208     A*%%CL 001
072300080208     A*%%CP+999CRTPRTF
072400080208     A*%%CP+    CPI(15)
072500080208     A*%%CP+    OVRFLW(66)
072600080208     A*%%CP+    FILE(GAITRAFIL/FICN26P)
072700080208     A*%%CP+    DEVTYPE(*SCS)
072800080208     A*%%CP     PAGESIZE(70       120      *N     )
072900080208     A*%%CS+999CRTPRTF
073000080208     A*%%CS+    FILE(QTEMP/QPRDRPT   )
073100080208     A*%%CS+    DEVTYPE(*SCS)
073200080208     A*%%CS     PAGESIZE(*N       132      *N     )
073300080208     A*%%***********************************************************************
073400080208     A*------------------------------------------------------------------------*
