000100020322             PGM        PARM(&KPJBA)
000200000000
000300020329             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
000400020118
000500020322             STRCMTCTL  LCKLVL(*CHG) CMTSCOPE(*JOB)
000600020116
000700020322/* richiamo programma di stampa                    */
000800020702             CALL       PGM(FICN63R) PARM(&KPJBA)
000900020116
001000020322             ENDCMTCTL
001100020116
001200000000             ENDPGM
