000100890918     A*--------------------------------------------------------------*
000200120907     A*  DS PER PASSAGGIO PARAMENTRI GESTIONE FIRMA VALORIZZAZIONI
000300890918     A*--------------------------------------------------------------*
000400931007     A                                      REF(CNDIZION)
000500120911     A          R FICNG1
000501120911     A            §G1SOC         3A         TEXT('CODICE SOCIETA')
000502120911     A            §G1FGS         3A         TEXT('FILIALE')
000503120911     A            §G1PD1         8A         TEXT('CODICE AUTOTRASPOR.')
000504120911     A            §G1DP1        35A         TEXT('DECODIFICA AUTOTRASPORTATORE')
000505120911     A            §G1PD2         8A         TEXT('CODICE AUTOTRASPOR.')
000506120911     A            §G1DP2        35A         TEXT('DECODIFICA AUTOTRASPORTATORE')
000507120911     A            §G1DTI         8S 0       TEXT('DATA DAL')
000508120911     A            §G1DTF         8S 0       TEXT('DATA AL')
000513120911     A            §G1TIP         1A         TEXT('A=AUTOT./C=COOP/D=AFF.DEF')
000514120911     A            §G1TSR         1A         TEXT('X COOP.SERVIZI ACCORPATI S/N')
000515120912     A            §G1FIR         1A         TEXT('SOLO DA FIRMARE S/N')
000600120911     A            §G1CMD         2A         TEXT('TIPO CMD: 12=RITORNO 03=FINE')
