000001161121     A*%%***********************************************************************
000002161121     A*%%TS  RD  20161121  172228  EDPAB       REL-V7R1M0  5770-WDS
000003161121     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004161121     A*%%FI       0000000000000000000000000000000000000000000000000
000005161121     A*%%***********************************************************************
000006161121      *PARMS PAGESIZE(70 120) CPI(15) PAGRTT(0)
000007161121      *PARMS USRDTA(AUTOCOP) FORMTYPE(FATCOP) SAVE(*YES)
000008161121     A*** FILE : FICN56P *--------------------------------------------*
000009161121     A***            STAMPA  AUTOFATTURA CONTEGGI COOPERATIVE         **
000010161121     A***-------------------------------------------------------------**
000011161121     A          R TESTA
000012161121     A*%%***********************************************************************
000013161121     A*%%RI 00000
000014161121     A*%%FS 002
000015161121     A*%%***********************************************************************
000016161121     A                                      SPACEB(002)
000017161121     A                                      SKIPB(001)
000018161121     A                                      SPACEA(001)
000019161121     A            DESEMI        44   O     5
000020161121     A                                      SPACEB(001)
000021161121     A                                   +34
000022161121     A                                      'Pag.'
000023161121     A            PAGE           3S 0O    +1
000024161121     A            INDEMI        35   O     5
000025161121     A                                      SPACEB(001)
000026161121     A            CAPEMI         9   O     5
000027161121     A                                      SPACEB(001)
000028161121     A            LOCEMI        40   O    +1
000029161121     A            PICFEMI       70A  O     5
000030161121     A                                      SPACEB(001)
000031161121     A            PECEML        70A  O     5
000032161121     A                                      SPACEB(001)
000033161121     A            CSEMI         20   O     5
000034161121     A                                      SPACEB(001)
000035161121     A            DESRIC        35   O    44
000036161121     A            INDRIC        35   O    44
000037161121     A                                      SPACEB(001)
000038161121     A            CAPRIC         9   O    44
000039161121     A                                      SPACEB(001)
000040161121     A            LOCRIC        40   O    +1
000041161121     A                                    44
000042161121     A                                      'P.IVA:'
000043161121     A                                      SPACEB(001)
000044161121     A            PIRIC         20   O    +1
000045161121     A  89                                72
000046161121     A                                      'C.F.:'
000047161121     A            CFRIC         20   O    78
000048161121     A                                     5
000049161121     A                                      'Rif:'
000050161121     A                                      SPACEB(002)
000051161121     A            F54SOC         3A  O    +1
000052161121     A                                    +0
000053161121     A                                      '/'
000054161121     A            SALFOR         8A  O    +0
000055161121     A                                    44
000056161121     A                                      'Condizioni di pagamento:'
000057161121     A            DESCON        20A  O    69
000058161121     A N11                                44
000059161121     A                                      'Banca d''appoggio IBAN:'
000060161121     A                                      SPACEB(001)
000061161121     A N11        IBAN          34A  O    +1
000062161121     A  11                                 5
000063161121     A                                      '.'
000064161121     A                                      SPACEB(001)
000065161121     A                                     5
000066161121     A                                      '______________________'
000067161121     A N80                                  HIGHLIGHT
000068161121     A                                      SPACEB(001)
000069161121     A N11        DESIST        30A  O    44
000070161121     A N11        DESAGE        30A  O    75
000071161121     A                                     5
000072161121     A                                      '| FATTURA            |'
000073161121     A                                      SPACEB(001)
000074161121     A N80                                  HIGHLIGHT
000075161121     A  11                                44
000076161121     A                                      'Il credito di cui alla presente fa-
000077161121     A                                      ttura è stato ceduto a:'
000078161121     A                                     5
000079161121     A                                      '| Numero'
000080161121     A                                      SPACEB(001)
000081161121     A N80                                  HIGHLIGHT
000082161121     A            NRFAT          8S 0O    +1
000083161121     A                                      EDTCDE(4)
000084161121     A N80                                  HIGHLIGHT
000085161121     A                                    +4
000086161121     A                                      '|'
000087161121     A N80                                  HIGHLIGHT
000088161121     A  11        DESFAC        35   O    44
000089161121     A                                     5
000090161121     A                                      '| Del'
000091161121     A                                      SPACEB(001)
000092161121     A N80                                  HIGHLIGHT
000093161121     A            DTFAT          8S 0O    +4
000094161121     A                                      EDTCDE(Y)
000095161121     A N80                                  HIGHLIGHT
000096161121     A                                    +2
000097161121     A                                      '|'
000098161121     A N80                                  HIGHLIGHT
000099161121     A  11                                44
000100161121     A                                      'cessionario del relativo credito. -
000101161121     A                                      Pertanto il pagamento ha effetto'
000102161121     A                                     5
000103161121     A                                      '______________________'
000104161121     A                                      SPACEB(001)
000105161121     A N80                                  HIGHLIGHT
000106161121     A  11                                44
000107161121     A                                      'valido e liberatorio unicamente se-
000108161121     A                                       effettuato alla predetta società.'
000109161121     A N23                                 5
000110161121     A                                      'Corrispettivi per l''esecuzione di-
000111161121     A                                       servizi effettuati presso il Vostr-
000112161121     A                                      o impianto di'
000113161121     A                                      SPACEB(002)
000114161121     A N23        DESPO         65A  O     5
000115161121     A                                      SPACEB(001)
000116161121     A N23                                 5
000117161121     A                                      'per il mese di'
000118161121     A                                      SPACEB(001)
000119161121     A            PMESE         10A  O    +1
000120161121     A            PANNO          4A  O    +1
000121161121     A*%%***********************************************************************
000122161121     A*%%SS
000123161121     A*%%CL 001
000124161121     A*%%CL 001
000125161121     A*%%CL 001
000126161121     A*%%CL 001
000127161121     A*%%CL 001
000128161121     A*%%CL 001
000129161121     A*%%CL 001
000130161121     A*%%CL 001
000131161121     A*%%CL 001
000132161121     A*%%CL 002
000133161121     A*%%CL 001
000134161121     A*%%CL 001
000135161121     A*%%CL 001
000136161121     A*%%CL 001
000137161121     A*%%CL 001
000138161121     A*%%CL 001
000139161121     A*%%CL 001
000140161121     A*%%CL 002
000141161121     A*%%CL 001
000142161121     A*%%CL 001
000143161121     A*%%CL 001
000144161121     A*%%***********************************************************************
000145161121     A          R RIGA
000146161121     A*%%***********************************************************************
000147161121     A*%%RI 00000
000148161121     A*%%***********************************************************************
000149161121     A            DESTSR        35A  O     5
000150161121     A                                      SPACEB(001)
000151161121     A            DESAGG        35A  O    41
000152161121     A            IMPTG         10S 3O    84
000153161121     A                                      EDTCDE(K)
000154161121     A*%%***********************************************************************
000155161121     A*%%SS
000156161121     A*%%CL 001
000157161121     A*%%***********************************************************************
000158161121     A          R RIGARET
000159161121     A*%%***********************************************************************
000160161121     A*%%RI 00000
000161161121     A*%%***********************************************************************
000162161121     A            DESRET        30A  O     5
000163161121     A                                      SPACEB(001)
000164161121     A            DESDOC        35A  O    41
000165161121     A            IMPRET        10S 3O    84
000166161121     A                                      EDTCDE(K)
000167161121     A*%%***********************************************************************
000168161121     A*%%SS
000169161121     A*%%CL 001
000170161121     A*%%***********************************************************************
000171161121     A          R TOTGEN
000172161121     A*%%***********************************************************************
000173161121     A*%%RI 00000
000174161121     A*%%***********************************************************************
000175161121     A                                    83
000176161121     A                                      SPACEB(001)
000177161121     A                                      '_______________'
000178161121     A                                    56
000179161121     A                                      'Totale imponibile'
000180161121     A                                      SPACEB(001)
000181161121     A            IMPON         11S 2O    83
000182161121     A                                      EDTCDE(K)
000183161121     A            DESIVA        20A  O    53
000184161121     A                                      SPACEB(001)
000185161121     A            IMPIVA        11S 2O    83
000186161121     A                                      EDTCDE(K)
000187161121      *
000188161121     A                                     5
000189161121     A                                      'Nostro protocollo IVA'
000190161121     A                                      SPACEB(001)
000191161121     A            NRPRT          8S 0O    27
000192161121     A                                      EDTCDE(4)
000193161121     A                                    36
000194161121     A                                      'del'
000195161121     A            DTPRT          8S 0O    40
000196161121     A                                      EDTCDE(Y)
000197161121     A                                    51
000198161121     A                                      '('
000199161121     A            IVALIB         3A  O    52
000200161121     A                                    55
000201161121     A                                      ')'
000202161121     A                                    59
000203161121     A                                      'Totale fattura'
000204161121     A                                    78
000205161121     A                                      'Euro'
000206161121     A            IMPFAT        11S 2O    +1
000207161121     A                                      EDTCDE(K)
000208161121     A                                     5
000209161121     A                                      'Fattura emessa ai sensi dell''art.-
000210161121     A                                       21 comma 2 lettera n del DPR 633/7-
000211161121     A                                      2 dal committente'
000212161121     A                                      SPACEB(001)
000213161121     A*%%***********************************************************************
000214161121     A*%%SS
000215161121     A*%%CL 001
000216161121     A*%%CL 001
000217161121     A*%%CL 001
000218161121     A*%%CL 001
000219161121     A*%%CL 001
000220161121     A*%%***********************************************************************
000221161121     A*                                    5
000222161121     A*                                     'Fattura con IVA ad esigibilità imm-
000223161121     A*                                     ediata'
000224161121     A*                                     SPACEB(001)
000225161121     A          R TOTPUL
000226161121     A*%%***********************************************************************
000227161121     A*%%RI 00000
000228161121     A*%%***********************************************************************
000229161121      *
000230161121     A                                     5
000231161121     A                                      'Importo soggetto a inversione cont-
000232161121     A                                      abile art.17 co.6, lett.a-ter DPR 6-
000233161121     A                                      33/72 a cura del committente'
000234161121     A                                      SPACEB(002)
000235161121      *
000236161121     A                                    56
000237161121     A                                      'Totale fattura'
000238161121     A                                      SPACEB(002)
000239161121     A                                    78
000240161121     A                                      'Euro'
000241161121     A            IMPFAT        11S 2O    +1
000242161121     A                                      EDTCDE(K)
000243161121     A                                     5
000244161121     A                                      'Fattura emessa ai sensi dell''art.-
000245161121     A                                       21 comma 2 lettera n del DPR 633/7-
000246161121     A                                      2'
000247161121     A                                      SPACEB(002)
000248161121     A                                     5
000249161121     A                                      '__________________________________-
000250161121     A                                      ___________________________________-
000251161121     A                                      _____________________________'
000252161121     A                                      SPACEB(003)
000253161121     A                                     5
000254161121     A                                      'Sezione di pertinenza del committe-
000255161121     A                                      nte'
000256161121     A                                      SPACEB(001)
000257161121     A                                      UNDERLINE
000258161121     A                                     5
000259161121     A                                      'Protocollo IVA'
000260161121     A                                      SPACEB(002)
000261161121     A            NRPRT          8S 0O    20
000262161121     A                                      EDTCDE(4)
000263161121     A                                    29
000264161121     A                                      'del'
000265161121     A            DTPRT          8S 0O    33
000266161121     A                                      EDTCDE(Y)
000267161121     A                                    44
000268161121     A                                      '('
000269161121     A            IVALIB         3A  O    45
000270161121     A                                    48
000271161121     A                                      ')'
000272161121     A                                     5
000273161121     A                                      'Integrazione della fattura per inv-
000274161121     A                                      ersione contabile'
000275161121     A                                      SPACEB(002)
000276161121     A
000277161121     A                                     5
000278161121     A                                      'Imponibile'
000279161121     A                                      SPACEB(001)
000280161121     A            IMPPUL        11S 2O    +1
000281161121     A                                      EDTCDE(K)
000282161121     A            ALIIVA        20A  O    +1
000283161121     A            IVAPUL        11S 2O    +0
000284161121     A                                      EDTCDE(K)
000285161121     A                                    +1
000286161121     A                                      'Totale fattura'
000287161121     A            FATPUL        11S 2O    +1
000288161121     A                                      EDTCDE(K)
000289161121     A*%%***********************************************************************
000290161121     A*%%SS
000291161121     A*%%CL 002
000292161121     A*%%CL 002
000293161121     A*%%CL 002
000294161121     A*%%CL 003
000295161121     A*%%CL 001
000296161121     A*%%CL 002
000297161121     A*%%CL 002
000298161121     A*%%CL 001
000299161121     A*%%***********************************************************************
000300161121     A          R TESTAL
000301161121     A*%%***********************************************************************
000302161121     A*%%RI 00000
000303161121     A*%%FS 002
000304161121     A*%%***********************************************************************
000305161121     A                                      SPACEB(002)
000306161121     A                                      SKIPB(001)
000307161121     A                                      SPACEA(001)
000308161121     A            DESEMIN       44   O     5
000309161121     A                                      SPACEB(001)
000310161121     A            INDEMIN       35   O     5
000311161121     A                                      SPACEB(001)
000312161121     A            CAPEMIN        9   O     5
000313161121     A                                      SPACEB(001)
000314161121     A            LOCEMIN       40   O    +1
000315161121     A                                     5
000316161121     A                                      'P.IVA N.'
000317161121     A                                      SPACEB(001)
000318161121     A            PIEMIN        20   O    +1
000319161121     A                                    35
000320161121     A                                      'C.F.'
000321161121     A            CFEMIN        20   O    +1
000322161121     A                                    61
000323161121     A                                      'SPETT.LE'
000324161121     A                                      SPACEB(004)
000325161121     A            DESFOR        35   O    61
000326161121     A                                      SPACEB(001)
000327161121     A            INDFOR        35   O    61
000328161121     A                                      SPACEB(001)
000329161121     A            CAPFOR         9   O    61
000330161121     A                                      SPACEB(001)
000331161121     A            LOCFOR        40   O    71
000332161121     A                                     5
000333161121     A                                      'OGGETTO: FUSIONE DI'
000334161121     A                                      SPACEB(005)
000335161121     A            DESEMIO       44   O    25
000336161121     A                                    22
000337161121     A                                      'IN'
000338161121     A                                      SPACEB(001)
000339161121     A            DESEMIN1      44   O    25
000340161121     A                                     5
000341161121     A                                      'La presente per comunicare che con-
000342161121     A                                       atto del Notaio Vico del 22/10/200-
000343161121     A                                      7'
000344161121     A                                      SPACEB(004)
000345161121     A                                    +1
000346161121     A                                      'Repertorio N.'
000347161121     A            NRATTO         6S 0O    +1
000348161121     A                                    +1
000349161121     A                                      'Fascicolo N.'
000350161121     A            FASC02         5S 0O    +1
000351161121     A                                     5
000352161121     A                                      'con'
000353161121     A                                      SPACEB(001)
000354161121     A                                    +1
000355161121     A                                      'effetto dal 31/12/2007'
000356161121     A                                      HIGHLIGHT
000357161121     A                                    +1
000358161121     A                                      'la società'
000359161121     A            DESEMIO1      68   O    43
000360161121     A            DESEMIN2      44   O     5
000361161121     A                                      SPACEB(003)
000362161121     A            INDEMIN2      35   O     5
000363161121     A                                      SPACEB(001)
000364161121     A            CAPEMIN2       9   O     5
000365161121     A                                      SPACEB(001)
000366161121     A            LOCEMIN2      40   O    +1
000367161121     A                                     5
000368161121     A                                      'Partita IVA'
000369161121     A                                      SPACEB(001)
000370161121     A            PIEMIN2       20   O    +1
000371161121     A                                     5
000372161121     A                                      'Codice fiscale'
000373161121     A                                      SPACEB(001)
000374161121     A            CFEMIN2       20   O    +1
000375161121     A                                     5
000376161121     A                                      'Da tale data pertanto la'
000377161121     A                                      SPACEB(003)
000378161121     A            DESEMIN3      87   O    30
000379161121     A                                     5
000380161121     A                                      'società incorporata. In particolar-
000381161121     A                                       modo ci preme evidenziare che tutt-
000382161121     A                                      i i pagamenti dovuti dalla società'
000383161121     A                                      SPACEB(001)
000384161121     A                                     5
000385161121     A                                      'incorporata saranno regolarmente e-
000386161121     A                                      ffettuati alla scadenza da'
000387161121     A                                      SPACEB(001)
000388161121     A            DESEMIN4      45   O    +1
000389161121     A                                     5
000390161121     A                                      'Per qualsiasi informazione potete -
000391161121     A                                      rivolgervi ai Servizi Amministrativ-
000392161121     A                                      i e Fiscali di Sede al n. 051601549-
000393161121     A                                      7,'
000394161121     A                                      SPACEB(002)
000395161121     A                                     5
000396161121     A                                      'cordiali saluti.'
000397161121     A                                      SPACEB(001)
000398161121     A            DESEMIN5      44   O    61
000399161121     A                                      SPACEB(003)
000400161121     A*%%***********************************************************************
000401161121     A*%%SS
000402161121     A*%%CL 001
000403161121     A*%%CL 001
000404161121     A*%%CL 001
000405161121     A*%%CL 001
000406161121     A*%%CL 004
000407161121     A*%%CL 001
000408161121     A*%%CL 001
000409161121     A*%%CL 001
000410161121     A*%%CL 005
000411161121     A*%%CL 001
000412161121     A*%%CL 004
000413161121     A*%%CL 001
000414161121     A*%%CL 003
000415161121     A*%%CL 001
000416161121     A*%%CL 001
000417161121     A*%%CL 001
000418161121     A*%%CL 001
000419161121     A*%%CL 003
000420161121     A*%%CL 001
000421161121     A*%%CL 001
000422161121     A*%%CL 002
000423161121     A*%%CL 001
000424161121     A*%%CL 003
000425161121     A*%%CL 001
000426161121     A*%%CP+999CRTPRTF
000427161121     A*%%CP+    FILE(GAITRASRC/FICN55P)
000428161121     A*%%CP+    DEVTYPE(*SCS)
000429161121     A*%%CP     PAGESIZE(*N       132      *N     )
000430161121     A*%%***********************************************************************
