000100950929     A*------------------------------------------------------------------------*
000200071119     A*  DS STAMPA COMUNICAZIONE FUSIONE
000300950929     A*------------------------------------------------------------------------*
000400071119     A          R FICN99                    TEXT('STAMPA COMUNICAZIONE FUSIONE')
000401071120     A            F99TIP         1A         TEXT('TIPO ANAGRAFICO')
000600071120     A            F99SOCN        3A         TEXT('CODICE SOCIETA NEW')
000800071120     A            F99KSCN        8A         TEXT('CODICE FORNITORE NEW')
