000100931108      *-------------------------------------------------------------------------
000200090109      *    DUPLICA TARIFFE SUPERTESTA
000300931108      *------------------------------------------------------------------------
000400090109     A          R FICN06
000404090112     A            FILOLD         3S 0       TEXT('FILIALE OLD')
000405090112     A            PDROLD         4          TEXT('AUTOTRASP.OLD')
000406090112     A            SMLOLD         1          TEXT('SIMULAZIONE OLD')
000407090112     A            TSROLD         1          TEXT('T.SERVIZIO OLD')
000408090112     A            CTROLD         3S 0       TEXT('COD.TARIFFA OLD.')
000409090112     A            PRGOLD         3S 0       TEXT('PROGRESSIVO TAR.OLD')
000410090112     A            FILNEW         3S 0       TEXT('FILIALE NEW')
000411090112     A            PDRNEW         4          TEXT('AUTOTRASP. NEW')
000412090112     A            SMLNEW         1          TEXT('SIMULAZIONE NEW')
000413090112     A            PRGNEW         3S 0       TEXT('PROGRESSIVO TAR. NEW')
000500931108     A*
