000100170706     A*%%TS  SD  20170706  151048  EDPAB       REL-V7R2M0  5770-WDS
000200000000     A*---------------------------------------------------------------*
000300170706     A*%%EC
000400170706     A                                      DSPSIZ(24 80 *DS3)
000500170706     A                                      CHGINPDFT(HI CS)
000600170706     A                                      PRINT
000700170706     A                                      CA03
000800940926     A*
000900940926     A**-------------------------------------------------------------**
001000170706     A          R NN00D01
001100170706     A*%%TS  SD  20170706  151048  EDPAB       REL-V7R2M0  5770-WDS
001200170706     A                                      CF06
001300170706     A                                      CF02
001400170706     A            D1C0SN         1A  H
001500170706     A            RSUT          20A  O  1  2
001600170706     A                                  1 24'* Estrae dati Distinte Valorizzate-
001700170706     A                                       *'
001800170706     A                                      DSPATR(RI)
001900170706     A                                      DSPATR(UL)
002000170706     A                                  1 61'FICNN00R'
002100170706     A                                  1 71DATE
002200170706     A                                      EDTCDE(Y)
002300170706     A            KNSIF         10A  O  2  2
002400170706     A            KNMUS         10A  O  2 13
002500170706     A                                  2 71TIME
002600170706     A                                  7 27'Filiale'
002700170706     A                                      COLOR(WHT)
002800170706     A            D1FIL          3Y 0B  7 35DSPATR(HI)
002900170706     A                                      DSPATR(CS)
003000170706     A  41                                  ERRMSG('Inserire Filiale' 41)
003100170706     A                                      EDTCDE(Z)
003200170706     A                                  7 40'999 = Tutte'
003300170706     A                                  9 10'Periodo di selezione dal'
003400170706     A                                      COLOR(WHT)
003500170706     A            D1DDAL         8Y 0B  9 35
003600170706     A  45
003700170706     AO 44                                  DSPATR(PC)
003800170706     A  44                                  ERRMSG('Data non corretta' 44)
003900170706     A  45                                  ERRMSG('Data DAL.. MAGGIORE DI DATA-
004000170706     A                                      AL...' 45)
004100170706     A                                      EDTCDE(8)
004200170706     A                                      DSPATR(CS)
004300170706     A                                  9 46'al'
004400170706     A                                      COLOR(WHT)
004500170706     A            D1DAL          8Y 0B  9 49
004600170706     A  45
004700170706     AO 42                                  DSPATR(PC)
004800170706     A  42                                  ERRMSG('Data non corretta' 42)
004900170706     A  45                                  ERRMSG('Data DAL.. MAGGIORE DI DATA-
005000170706     A                                      AL...' 45)
005100170706     A                                      EDTCDE(8)
005200170706     A                                      DSPATR(CS)
005300170706     A                                 24  4'F3=Fine'
005400170706     A                                 24 32'F6=Conferma'
