000100150914     A          R YCOSTP4I
000200150914     A            STPTIPO        3A
000300090114     A                                      TEXT('Tipo elaborazione.')
000400150914     A            STPDAT1         L
000500151006     A                                      TEXT('DATA DAL PRESTAZIONE')
000600150914     A            STPDAT2         L
000700151006     A                                      TEXT('DATA AL PRESTAZIONE')
000701151006     A            STPDAT3         L
000702151006     A                                      TEXT('DATA DAL INSERIMENTO')
000703151006     A            STPDAT4         L
000704151006     A                                      TEXT('DATA AL INSERIMENTO')
000800150914     A            STPFILA        3S 0
000900150914     A                                      TEXT('FILIALE RICHIEDENTE')
001000150914     A            STPFILD        3S 0
001100150914     A                                      TEXT('FILIALE ADDEBITO')
001101150925     A            STPAREA        3S 0
001102150925     A                                      TEXT('AREA RICHIEDENTE')
001103150925     A            STPARED        3S 0
001104150925     A                                      TEXT('AREA ADDEBITO')
001200150914     A            STPFAS         3S 0
001300150914     A                                      TEXT('FASE AVANZAMENTO')
001400150914     A            STPKSC         7S 0
001500150914     A                                      TEXT('CODICE CLIENTE')
001600150914     A            STPTSR         1A
001700150914     A                                      TEXT('TIPO SERVIZIO')
001701150928     A            STPATB         1A
001702150928     A                                      TEXT('ANNULLATE')
001800150914     A            STPUTEN       10A
001900150914     A                                      TEXT('UTENTE DI INSERIMENTO')
