000010021015     A*%%TS  SD  20021015  154824  EDPAB       REL-V4R4M0  5769-PW1
000020021015     A*%%EC
000030021015     A                                      DSPSIZ(24 80 *DS3)
000040021015     A                                      PRINT
000050021015     A          R FICNC21
000060021015     A*%%TS  SD  20021015  154824  EDPAB       REL-V4R4M0  5769-PW1
000070021015     A                                      CF03(03)
000080021015     A                                      CF06(06)
000090021015     A                                      OVERLAY
000100021015     A            VIDRSU        20A  O  1  2
000110021015     A                                  1 26'**  SVALORIZZAZIONE CONTEGGI  **'
000120021015     A                                      DSPATR(RI)
000130021015     A                                  1 62'FICNC2R'
000140021015     A                                  1 72DATE
000150021015     A                                      EDTCDE(Y)
000160021015     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000170021015     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000180021015     A                                  2 26'**         PADRONCINI         **'
000190021015     A                                      DSPATR(RI)
000200021015     A                                      DSPATR(UL)
000210021015     A                                  2 72TIME
000220021015     A                                  4  7'ATTENZIONE:'
000230021015     A                                      DSPATR(RI)
000240021015     A                                  4 20'Svalorizza solo le valorizzazioni'
000250021015     A                                      DSPATR(UL)
000260021015     A                                  4 54'CONFERMATE'
000270021015     A                                      DSPATR(RI)
000280021015     A                                      DSPATR(UL)
000290021015     A                                  6  4'Simulazione ............:'
000300021015     A            VIDSIM         1A  B  6 30DSPATR(HI)
000310021015     A                                      VALUES(' ' 'S')
000320021015     A  66                                  DSPATR(PR)
000330021015     A                                  6 43'S=Simulazione'
000340021015     A                                 10  4'Codice Padroncino ..: Dal'
000350021015     A            VIDLID         3Y 0B 10 30CHECK(RZ)
000360021015     A                                      DSPATR(HI)
000370021015     A  22                                  ERRMSG('Linea Errata' 22)
000380021015     A                                 10 35'?'
000390021015     A            VIDPAD         4A  B 10 37DSPATR(HI)
000400021015     A                                      CHECK(RZ)
000410021015     A  24                                  ERRMSG('Codice Padroncino Inesisten-
000420021015     A                                      te o non Valido per l"Elaborazione'-
000430021015     A                                       24)
000440021015     A  25                                  ERRMSG('Codice Padroncino DAL Maggi-
000450021015     A                                      ore di AL' 25)
000460021015     A  27                                  ERRMSG('Codice Padroncino non Valid-
000470021015     A                                      o o non Numerico' 27)
000480021015     A  29                                  ERRMSG('Tra Codice DAL e Codice AL -
000490021015     A                                      non è Stato Trovato Alcun Padroncin-
000500021015     A                                      o Valido' 29)
000510021015     A            VIDDEP        30A  O 10 43
000520021015     A                                 11 26'Al'
000530021015     A            VIDLIA         3Y 0B 11 30CHECK(RZ)
000540021015     A  23                                  ERRMSG('Linea Errata' 23)
000550021015     A                                      DSPATR(PR)
000560021015     A                                 11 35'?'
000570021015     A            VIDPAA         4A  B 11 37DSPATR(HI)
000580021015     A                                      CHECK(RZ)
000590021015     A  28                                  ERRMSG('Codice Padroncino non Valid-
000600021015     A                                      o o non Numerico' 28)
000610021015     A                                 14  4'Data Distinte/Ritiri: Dal'
000620021015     A            VIDDTR         8Y 0B 14 30EDTWRD('  /  /    ')
000630021015     A                                      DSPATR(HI)
000640021015     A                                      CHECK(RB)
000650021015     A  26                                  ERRMSG('Data non Valida' 26)
000660021015     A                                 14 43'Al'
000670021015     A            VIDDTA         8Y 0B 14 46EDTWRD('  /  /    ')
000680021015     A                                      DSPATR(HI)
000690021015     A                                      CHECK(RB)
000700021015     A  20                                  ERRMSG('Data non Valida' 20)
000710021015     A                                 17 21'Non è possibile svalorizzare i con-
000720021015     A                                      teggi'
000730021015     A                                      DSPATR(HI)
000740021015     A N21                                  DSPATR(ND)
000750021015     A                                 18 25'con data distinta:'
000760021015     A                                      DSPATR(HI)
000770021015     A N21                                  DSPATR(ND)
000780021015     A            VIDDT2         8Y 0O 18 44EDTWRD('  /  /    ')
000790021015     A                                      DSPATR(HI)
000800021015     A                                      DSPATR(RI)
000810021015     A N21                                  DSPATR(ND)
000820021015     A                                 19 25'per il padroncino:'
000830021015     A                                      DSPATR(HI)
000840021015     A N21                                  DSPATR(ND)
000850021015     A            VIDPA2         7A  O 19 44DSPATR(HI)
000860021015     A                                      DSPATR(RI)
000870021015     A N21                                  DSPATR(ND)
000880021015     A                                 24  2'F6=Conferma Elaborazione'
000890021015     A                                 24 73'F3=Fine'
