000100110929     A*--------------------------------------------------------------*
000200110929     A*  DS PER PGM FICND0R
000300110929     A*--------------------------------------------------------------*
000400110929      *
000500110929     A          R FICND00                   TEXT('PGM FICND0R')
000600110929      *
000700110929     A            PARDD1         8S 0       TEXT('DATA DA')
000800110929     A            PARDD2         8S 0       TEXT('DATA  A')
000900110929     A            PARPDR         7S 0       TEXT('AUTISTA')
001000110929     A            PARCLR         1          TEXT('S/N PULIZIA WF')
001100110929     A*
