000010030418     A*%%TS  SD  20030418  163957  EDPAB       REL-V4R4M0  5769-PW1
000020911205     A*  91/12/05  10:20:58    EDPES       REL-R03M00  5728-PW1
000030011114     A*** FILE : FICND3D *--------------------------------------------*
000040931123     A*          CREAZIONE FILE DI SIMULAZIONE PADRONCINI              *
000050000000     A***-------------------------------------------------------------**
000060030418     A*%%EC
000070030418     A                                      DSPSIZ(24 80 *DS3)
000080030418     A                                      CHGINPDFT(HI UL)
000090030418     A                                      PRINT
000100950125     A*
000110950125     A**-------------------------------------------------------------**
000120030418     A          R LRD3D01
000130030418     A*%%TS  SD  20030418  163957  EDPAB       REL-V4R4M0  5769-PW1
000140030418     A                                      OVERLAY
000150030418     A            RSUT          20A  O  1  2
000160030418     A                                  1 26'* Conferma Conteggi Autotrasp. *'
000170030418     A                                      DSPATR(RI)
000180030418     A                                      DSPATR(UL)
000190030418     A                                  1 61'FICNB8R'
000200030418     A                                  1 71DATE
000210030418     A                                      EDTCDE(Y)
000220030418     A            KNSIF         10A  O  2  2
000230030418     A            KNMUS         10A  O  2 13
000240030418     A                                  2 71TIME
000250030418     A                                  8 23'*                                 -
000260030418     A                                          *'
000270030418     A                                      DSPATR(RI)
000280030418     A                                      DSPATR(HI)
000290030418     A                                  9 23'*   N O N    E''   P O S S I B I L-
000300030418     A                                       E   *'
000310030418     A                                      DSPATR(RI)
000320030418     A                                 10 23'*      ACCEDERE  ALLA  CONFERMA   -
000330030418     A                                          *'
000340030418     A                                      DSPATR(RI)
000350030418     A                                 11 23'*           C O N T E G G I       -
000360030418     A                                          *'
000370030418     A                                      DSPATR(RI)
000380030418     A                                 12 23'*                                 -
000390030418     A                                          *'
000400030418     A                                      DSPATR(RI)
000410030418     A                                      DSPATR(HI)
000420030418     A                                 13 23'*   TRASMISSIONE   DATI   A   SEDE-
000430030418     A                                          *'
000440030418     A                                      DSPATR(RI)
000450030418     A                                 14 23'*          I N     C O R S O      -
000460030418     A                                          *'
000470030418     A                                      DSPATR(RI)
000480030418     A                                 15 23'*                                 -
000490030418     A                                          *'
000500030418     A                                      DSPATR(RI)
000510030418     A                                      DSPATR(HI)
000520030418     A                                 18  9'La trasmissione è iniziata alle or-
000530030418     A                                      e'
000540030418     A            DAORE          6Y 0O 18 46EDTWRD('  :  :  ')
000550030418     A                                 19 41'del'
000560030418     A            INDATA         8Y 0O 19 46EDTWRD('    /  / 0')
000570030418     A                                 23  4'Enter per Continuare'
