000001090825     A*%%***********************************************************************
000002090825     A*%%TS  RD  20090825  095726  EDPBA       REL-V5R4M0  5722-WDS
000003090825     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004090825     A*%%FI       0000000000000000000000000000000000000000000000000
000005090825     A*%%***********************************************************************
000006090825      *PARMS PAGESIZE(66 198) CPI(15) OVRFLW(66)
000007090825      *PARMS USRDTA(AUTOCTR) SAVE(*YES)
000008090825     A          R TESTA
000009090825     A*%%***********************************************************************
000010090825     A*%%RI 00000
000011090825     A*%%***********************************************************************
000012090825     A                                      SKIPB(001)
000013090825     A            RSUT          20   O     1
000014090825     A                                    21
000015090825     A                                      '/'
000016090825     A            SIMFEL         3  0O    22
000017090825     A            NOMPGM        10A  O    27
000018090825     A                                    73
000019090825     A                                      'ANOMALIE STATO AVANZAMENTO CONTRAT-
000020090825     A                                      TI/ALLEGATI AUTOTRASPORTATORI'
000021090825     A            WOGGI          8  0O   161
000022090825     A                                      EDTWRD('  /  /    ')
000023090825     A            TIMES          6  0O   172
000024090825     A                                      EDTWRD('  :  :  ')
000025090825     A                                   190
000026090825     A                                      'PAG.'
000027090825     A            PAGE           4S 0O   195
000028090825     A                                      EDTCDE(Z)
000029090825     A            KNSIF         10   O     1
000030090825     A                                      SPACEB(001)
000031090825     A            KNMUS         10   O    12
000032090825     A  24                               +71
000033090825     A                                      'Filiale'
000034090825     A  24        COMPDR         3S 0O    +1
000035090825     A            CMP198       198   O     1
000036090825     A                                      SPACEB(001)
000037090825     A                                     1
000038090825     A                                      '                             C=Cit-
000039090825     A                                      tà/A=Affl.Defl.           |        -
000040090825     A                                                 ALLEGATO TARIFFARIO     -
000041090825     A                                                                  |      -
000042090825     A                                                      CONTRATTO          -
000043090825     A                                                       |Codici'
000044090825     A                                      SPACEB(001)
000045090825     A                                     1
000046090825     A                                      'Autista                           -
000047090825     A                                       C/A Accreditam Disaccred.|Decorren-
000048090825     A                                      za Convalida  Stampa     Ricezione -
000049090825     A                                       Fornitore                  | Numer-
000050090825     A                                      o  Stampa     Ricezione  Fornitore -
000051090825     A                                                       |Errore'
000052090825     A                                      SPACEB(001)
000053090825     A            CMP198A      198   O     1
000054090825     A                                      SPACEB(001)
000055090825     A*%%***********************************************************************
000056090825     A*%%SS
000057090825     A*%%CL 001
000058090825     A*%%CL 001
000059090825     A*%%CL 001
000060090825     A*%%CL 001
000061090825     A*%%CL 001
000062090825     A*%%***********************************************************************
000063090825     A          R RIGA1
000064090825     A*%%***********************************************************************
000065090825     A*%%RI 00000
000066090825     A*%%***********************************************************************
000067090825     A                                     1
000068090825     A                                      ' '
000074090825     A                                      SPACEB(001)
000075090825     A*%%***********************************************************************
000076090825     A*%%SS
000077090825     A*%%***********************************************************************
000078090825     A          R RIGA
000079090825     A*%%***********************************************************************
000080090825     A*%%RI 00000
000081090825     A*%%***********************************************************************
000082090825     A                                      SPACEB(001)
000083090825     A            APDPDR         7S 0O     1
000084090825     A  40                                  HIGHLIGHT
000085090825     A            APDRSFS       27A  O    +1
000086090825     A  40                                  HIGHLIGHT
000087090825     A            TIPO           1A  O    +1
000088090825     A  40                                  HIGHLIGHT
000089090825     A N34        TRADINS        8S 0O    +2
000090090825     A                                      EDTCDE(Y)
000091090825     A N38        TRADFIS        8S 0O    +1
000092090825     A                                      EDTCDE(Y)
000093090825     A                                    +0
000094090825     A                                      '|'
000095090825     A N32        TGTDDTS        8S 0O    +0
000096090825     A                                      EDTCDE(Y)
000097090825     A N31        TGTDTSS        8S 0O    +1
000098090825     A  40                                  HIGHLIGHT
000099090825     A                                      EDTCDE(Y)
000100090825     A N30        TGTDCNS        8S 0O    +1
000101090825     A                                      EDTCDE(Y)
000102090825     A N33        TGTDRCS        8S 0O    +1
000103090825     A                                      EDTCDE(Y)
000104090825     A            SOGDESS       27A  O    +1
000105090825     A  37                                  HIGHLIGHT
000106090825     A                                    +0
000107090825     A                                      '|'
000108090825     A            TRSNRCS        7S 0O    +1
000109090825     A                                      EDTCDE(Z)
000110090825     A N35        TRSDSCS        8S 0O    +1
000111090825     A                                      EDTCDE(Y)
000112090825     A N36        TRSDRCS        8S 0O    +1
000113090825     A                                      EDTCDE(Y)
000114090825     A            RAGSOCKSCS    27A  O    +1
000115090825     A  37                                  HIGHLIGHT
000116090825     A                                    +0
000117090825     A                                      '|'
000118090825     A            MSGA           1A  O    +0
000119090825     A  41                                  HIGHLIGHT
000120090825     A            MSGC           1A  O    +1
000121090825     A  42                                  HIGHLIGHT
000122090825     A            MSGS           1A  O    +1
000123090825     A*%%***********************************************************************
000124090825     A*%%SS
000125090825     A*%%***********************************************************************
000126090825     A          R RIGA_B
000127090825     A*%%***********************************************************************
000128090825     A*%%RI 00000
000129090825     A*%%***********************************************************************
000130090825     A                                      SPACEB(001)
000131090825     A            SOCTRA        24A  O    37
000132090825     A                                    61
000133090825     A                                      '|'
000134090825     A                                   133
000135090825     A                                      '|'
000136090825     A                                   192
000137090825     A                                      '|'
000138090825     A*%%***********************************************************************
000139090825     A*%%SS
000140090825     A*%%***********************************************************************
000141090825     A          R TESTATOT
000142090825     A*%%***********************************************************************
000143090825     A*%%RI 00000
000144090825     A*%%***********************************************************************
000145090825     A            CMP139       139   O     1
000146090825     A                                      SPACEB(002)
000147090825     A                                    21
000148090825     A                                      'T o t a l e'
000149090825     A                                      SPACEB(001)
000150090825     A                                    44
000151090825     A                                      'Senza'
000152090825     A                                    55
000153090825     A                                      '|'
000154090825     A                                    64
000155090825     A                                      'C i t t à'
000156090825     A                                    86
000157090825     A                                      'Senza'
000158090825     A                                    97
000159090825     A                                      '|'
000160090825     A                                   101
000161090825     A                                      'A f f l . / D e f l .'
000162090825     A                                   128
000163090825     A                                      'Senza'
000164090825     A                                   139
000165090825     A                                      '|'
000166090825     A                                     1
000167090825     A                                      'Codice ERRORE'
000168090825     A                                      SPACEB(001)
000169090825     A                                    18
000170090825     A                                      'Numero'
000171090825     A                                    28
000172090825     A                                      'A Rischio'
000173090825     A                                    42
000174090825     A                                      'Contratto'
000175090825      *-
000176090825     A                                    55
000177090825     A                                      '|'
000178090825     A                                    60
000179090825     A                                      'Numero'
000180090825     A                                    70
000181090825     A                                      'A Rischio'
000182090825     A                                    84
000183090825     A                                      'Contratto'
000184090825      *-
000185090825     A                                    97
000186090825     A                                      '|'
000187090825     A                                   102
000188090825     A                                      'Numero'
000189090825     A                                   112
000190090825     A                                      'A Rischio'
000191090825     A                                   126
000192090825     A                                      'Contratto'
000193090825      *-
000194090825     A                                   139
000195090825     A                                      '|'
000196090825     A            CMP139A      139   O     1
000197090825     A                                      SPACEB(001)
000198090825     A*%%***********************************************************************
000199090825     A*%%SS
000200090825     A*%%CL 002
000201090825     A*%%CL 001
000202090825     A*%%CL 001
000203090825     A*%%CL 001
000204090825     A*%%***********************************************************************
000205090825      *-
000206090825     A          R RIGATOT
000207090825     A*%%***********************************************************************
000208090825     A*%%RI 00000
000209090825     A*%%***********************************************************************
000210090825     A                                      SPACEB(001)
000211090825     A            TIPOERR        1A  O     8
000212090825     A            NUMERR         5S 0     18
000213090825     A                                      EDTCDE(Z)
000214090825     A            RSCERR         5S 0     30
000215090825     A                                      EDTCDE(Z)
000216090825     A            NOCONTRA       5S 0     44
000217090825     A                                      EDTCDE(Z)
000218090825      *-
000219090825     A                                    55
000220090825     A                                      '|'
000221090825     A            NUMERRC        5S 0     60
000222090825     A                                      EDTCDE(Z)
000223090825     A            RSCERRC        5S 0     72
000224090825     A                                      EDTCDE(Z)
000225090825     A            NOCONTRAC      5S 0     86
000226090825     A                                      EDTCDE(Z)
000227090825      *-
000228090825     A                                    97
000229090825     A                                      '|'
000230090825     A            NUMERRA        5S 0    102
000231090825     A                                      EDTCDE(Z)
000232090825     A            RSCERRA        5S 0    114
000233090825     A                                      EDTCDE(Z)
000234090825     A            NOCONTRAA      5S 0    128
000235090825     A                                      EDTCDE(Z)
000236090825      *-
000237090825     A                                   139
000238090825     A                                      '|'
000239090825     A*%%***********************************************************************
000240090825     A*%%SS
000241090825     A*%%***********************************************************************
000242090825     A          R SALTA
000243090825     A*%%***********************************************************************
000244090825     A*%%RI 00000
000245090825     A*%%FS 001
000246090825     A*%%***********************************************************************
000247090825     A                                      SPACEB(002)
000248090825     A*%%***********************************************************************
000249090825     A*%%SS
000250090825     A*%%***********************************************************************
000251090825     A          R LEGGENDA
000252090825     A*%%***********************************************************************
000253090825     A*%%RI 00000
000254090825     A*%%***********************************************************************
000255090825     A                                      SKIPB(001)
000256090825     A            RSUT          20   O     1
000257090825     A                                    21
000258090825     A                                      '/'
000259090825     A            SIMFEL         3  0O    22
000260090825     A            NOMPGM        10A  O    27
000261090825     A                                    73
000262090825     A                                      'ANOMALIE STATO AVANZAMENTO CONTRAT-
000263090825     A                                      TI/ALLEGATI AUTOTRASPORTATORI'
000264090825     A            WOGGI          8  0O   161
000265090825     A                                      EDTWRD('  /  /    ')
000266090825     A            TIMES          6  0O   172
000267090825     A                                      EDTWRD('  :  :  ')
000268090825     A                                   190
000269090825     A                                      'PAG.'
000270090825     A            PAGE           4S 0O   195
000271090825     A                                      EDTCDE(Z)
000272090825     A            KNSIF         10   O     1
000273090825     A                                      SPACEB(001)
000274090825     A            KNMUS         10   O    12
000275090825     A  24                               +71
000276090825     A                                      'Filiale'
000277090825     A  24        COMPDR         3S 0O    +1
000278090825     A                                     1
000279090825     A                                      'Codici ERRORI:'
000280090825     A                                      SPACEB(002)
000281090825     A                                     1
000282090825     A                                      '(A) AUT non è accreditato: se non -
000283090825     A                                      risulta accreditato, verificare se -
000284090825     A                                      sono stati inviati i documenti per -
000285090825     A                                      l''accreditamento e/o se sono stati-
000286090825     A                                       ricevuti da sede.'
000287090825     A                                      SPACEB(001)
000288090825     A                                     1
000289090825     A                                      '                                Se-
000290090825     A                                       è stato disaccreditato verificare -
000291090825     A                                      se l''AUT non lavora più e se la da-
000292090825     A                                      ta di disaccreditamento è corretta -
000293090825     A                                      oppure se ha cambiato società e non-
000294090825     A                                       sono stati'
000295090825     A                                      SPACEB(001)
000296090825     A                                     1
000297090825     A                                      '                                in-
000298090825     A                                      viati/ricevuti in sede i documenti -
000299090825     A                                      per il nuovo accreditamento.'
000300090825     A                                      SPACEB(001)
000301090825     A                                     1
000302090825     A                                      '                                Do-
000303090825     A                                      po 10 giorni dalla data di convalid-
000304090825     A                                      a della tariffa non si valorizzeran-
000305090825     A                                      no più le prestazioni dell''AUT se -
000306090825     A                                      l''AUT non viene accreditato!'
000307090825     A                                      SPACEB(001)
000308090825     A                                     1
000309090825     A                                      '(B) Non effettuata la stampa dell'-
000310090825     A                                      'allegato ma l''AUT è accreditato p-
000311090825     A                                      uò essere che:'
000312090825     A                                      SPACEB(002)
000313090825     A                                     1
000314090825     A                                      '                                L'-
000315090825     A                                      'AUT è stato associato in tariffa a-
000316090825     A                                      d un codice fornitore per il quale -
000317090825     A                                      non esiste nessun contratto con la -
000318090825     A                                      stessa P.IVA, oppure l''AUT risulta'
000319090825     A                                      SPACEB(001)
000320090825     A                                     1
000321090825     A                                      '                                ac-
000322090825     A                                      creditato con un Fornitore che ha P-
000323090825     A                                      .IVA diversa da quella del Fornitor-
000324090825     A                                      e inserito in Tariffa. Verificare c-
000325090825     A                                      he sia stata INVIATA/RICEVUTA la do-
000326090825     A                                      cumentazione.'
000327090825     A                                      SPACEB(001)
000328090825     A                                     1
000329090825     A                                      '                                Do-
000330090825     A                                      po 10 giorni dalla data di convalid-
000331090825     A                                      a della tariffa non si valorizzeran-
000332090825     A                                      no più le prestazioni dell''AUT.'
000333090825     A                                      SPACEB(001)
000334090825     A                                     1
000335090825     A                                      '(C) E'' stata effettuata la stampa-
000336090825     A                                       dell''allegato tariffario, ma la s-
000337090825     A                                      ede non ha ricevuto la copia firmat-
000338090825     A                                      a:'
000339090825     A                                      SPACEB(002)
000340090825     A                                     1
000341090825     A                                      '                                se-
000342090825     A                                       la filiale non ha ancora ricevuto -
000343090825     A                                      l''allegato tariffario o se l''ha g-
000344090825     A                                      ià inviato firmato segnalare il pro-
000345090825     A                                      blema alla sede, in entrambi i casi-
000346090825     A                                       potrebbe'
000347090825     A                                      SPACEB(001)
000348090825     A                                     1
000349090825     A                                      '                                es-
000350090825     A                                      sere stato smarrito.'
000351090825     A                                      SPACEB(001)
000352090825     A                                     1
000353090825     A                                      '                                Do-
000354090825     A                                      po 20 giorni dalla data di convalid-
000355090825     A                                      a della tariffa non si valorizzeran-
000356090825     A                                      no più le prestazioni dell''AUT se -
000357090825     A                                      non risulta che sia stato ricevuto -
000358090825     A                                      in sede.'
000359090825     A                                      SPACEB(001)
000360090825     A                                     1
000361090825     A                                      '(D) E'' stata effettuata la stampa-
000362090825     A                                       del contratto, ma la sede non ha r-
000363090825     A                                      icevuto la copia firmata:'
000364090825     A                                      SPACEB(002)
000365090825     A                                     1
000366090825     A                                      '                                se-
000367090825     A                                       la filiale non ha ancora ricevuto -
000368090825     A                                      il contratto o se l''ha già inviato-
000369090825     A                                       firmato segnalate il problema alla-
000370090825     A                                       sede, in entrambi i casi potrebbe'
000371090825     A                                      SPACEB(001)
000372090825     A                                     1
000373090825     A                                      '                                es-
000374090825     A                                      sere stato smarrito.               -
000375090825     A                                                                         -
000376090825     A                                                                         -
000377090825     A                                                                         -
000378090825     A                                                              '
000379090825     A                                      SPACEB(001)
000380090825     A                                     1
000381090825     A                                      '                                Do-
000382090825     A                                      po 20 giorni dalla data di convalid-
000383090825     A                                      a del contratto non si valorizzeran-
000384090825     A                                      no più le prestazioni dell''AUT se -
000385090825     A                                      non risulta che sia stato ricevuto -
000386090825     A                                      in sede.'
000387090825     A                                      SPACEB(001)
000388090825     A                                     1
000389090825     A                                      '(E) Autista accreditato ma la sede-
000390090825     A                                       non ha ancora effettuato le stampe-
000391090825     A                                      .'
000392090825     A                                      SPACEB(002)
000393090825     A                                     1
000394090825     A                                      '(9) Avvisare il CED'
000395090825     A                                      SPACEB(002)
000396090825     A            CMP198       198   O     1
000397090825     A                                      SPACEB(002)
000398090825     A                                     1
000399090825     A                                      '                             C=Cit-
000400090825     A                                      tà/A=Affl.Defl.           |        -
000401090825     A                                                 ALLEGATO TARIFFARIO     -
000402090825     A                                                                  |      -
000403090825     A                                                      CONTRATTO          -
000404090825     A                                                       |Codici'
000405090825     A                                      SPACEB(001)
000406090825     A                                     1
000407090825     A                                      'Autista                           -
000408090825     A                                       C/A Accreditam Disaccred.|Decorren-
000409090825     A                                      za Convalida  Stampa     Ricezione -
000410090825     A                                       Fornitore                  | Numer-
000411090825     A                                      o  Stampa     Ricezione  Fornitore -
000412090825     A                                                       |Errore'
000413090825     A                                      SPACEB(001)
000414090825     A            CMP198A      198   O     1
000415090825     A                                      SPACEB(001)
000416090825     A*%%***********************************************************************
000417090825     A*%%SS
000418090825     A*%%CL 001
000419090825     A*%%CL 002
000420090825     A*%%CL 001
000421090825     A*%%CL 001
000422090825     A*%%CL 001
000423090825     A*%%CL 001
000424090825     A*%%CL 002
000425090825     A*%%CL 001
000426090825     A*%%CL 001
000427090825     A*%%CL 001
000428090825     A*%%CL 002
000429090825     A*%%CL 001
000430090825     A*%%CL 001
000431090825     A*%%CL 001
000432090825     A*%%CL 002
000433090825     A*%%CL 001
000434090825     A*%%CL 001
000435090825     A*%%CL 001
000436090825     A*%%CL 002
000437090825     A*%%CL 002
000438090825     A*%%CL 002
000439090825     A*%%CL 001
000440090825     A*%%CL 001
000441090825     A*%%CL 001
000442090825     A*%%CP+999CRTPRTF
000443090825     A*%%CP+    CPI(15)
000444090825     A*%%CP+    OVRFLW(66)
000445090825     A*%%CP+    FILE(GAITRASRC/FICN28P)
000446090825     A*%%CP+    DEVTYPE(*SCS)
000447090825     A*%%CP     PAGESIZE(*N       198      *N     )
000448090825     A*%%CS+999CRTPRTF
000449090825     A*%%CS+    FILE(QTEMP/QPRDRPT)
000450090825     A*%%CS+    DEVTYPE(*SCS)
000451090825     A*%%CS+    PAGESIZE(*N 198)
000452090825     A*%%CS+    CPI(15)
000453090825     A*%%CS     OVRFLW(66)
000454090825     A*%%***********************************************************************
