000100010404             PGM        parm(&file &lib &newfile)
000200010404             dcl        (&file) type(*char) len(10)
000300010404             dcl        (&lib) type(*char) len(10)
000400010404             dcl        (&newfile) type(*char) len(10)
000500010404
000600010404             RNMOBJ     OBJ(&LIB/&FILE) OBJTYPE(*FILE) NEWOBJ(&NEWFILE)
000700010404
000800980317             ENDPGM
