000100971210     A*--------------------------------------------------------------*
000200971210     A*  DS CONTROLLO ESISTENZA INDICE E MODIFICABILITA' TABELLA
000300971210     A*--------------------------------------------------------------*
000400971210     A                                      REF(CNDIZION)
000500971210     A          R D12REC                    TEXT('DS CONTROLLO ESISTENZA INDICE-
000600971210     A                                       E MODIFICABILITA'' TABELLA')
000700971210     A            I12TLA         1A         TEXT('TIPO LANCIO PROGRAMMA')
000800971210     A*  CAMPI DI INPUT:
000900971210     A***
001000971210     A*  CODICE TABELLA DA MODIFICARE: OBBLIGATORIO
001100971210     A            I12COD         2A         TEXT('CODICE TABELLA')
001200971210     A*  SISTEMA INFORMATIVO: OBBLIGATORIO
001300971210     A            I12NSI        10A         TEXT('SISTEMA INFORMATIVO PARTENZA')
001400971210     A****
001500971210     A** CAMPI DI OUTPUT:
001600971210     A            O12ERR         1A         TEXT('ERRORE')
001700971210     A            O12MSG        78A         TEXT('MESSAGGIO DI ERRORE')
