000100011019      *--------------------------------------------------------------*
000200120614      *  DS PASSAGGIO PARAMETRI A PGM PER REPERIMENTO LINEA DI ARRIVO
000300120614      *     FORZATA PER CLIENTE (TABELLA "FLB")
000400011019      *--------------------------------------------------------------*
000500120614     A          R DFLBREC                   TEXT('DS REPERIMENTO LINEA FORZATA -
000600120614     A                                      PER CLIENTE')
000700011019      *
000800011019      *  INPUT:
000900011029      ***
001000011019      ***  Tipo lancio: OBBLIGATORIO
001100011019      *                 ' ' = esegue elaborazione senza chiudere i file
001200011019      *                 'C' = esegue solo la chiusura dei file
001300011019      *                 'L' = esegue elaborazione e chiusura file
001400120614     A            IFLBTLA        1A         TEXT('Tipo lancio programma')
001500060704      ***-------------------------------------------------------------
001600120614      ***  Linea di ARRIVO DA VERIFICARE
001700120614     A            IFLBLNA        3A         TEXT('Linea Arrivo')
001800060704      ***
001900120614      ***  Codcie cliente mittente
002000120614     A            IFLBCCM        7A         TEXT('codice cliente mittente')
003100060704      ***-------------------------------------------------------------
003200060704      * OUTPUT -
003300060704      ***-------------------------------------------------------------
003301120614     A            OFLBLFZ        3S 0       TEXT('Linea di arrivo forzata')
003400120614     A            OFLBERR        1A         TEXT('S=Errore')
003800120614     A            OFLBMSG       78A         TEXT('MSG DI ERRORE')
