000100020513      *PARMS MBR(*NONE)
000200020513      *------------------------------------------------------------------------*
000300020513      * CARICAMENTO P.O. GESTIBILI                                             *
000400020513      *------------------------------------------------------------------------*
000500020513     A                                      REF(AZORG00F)
000600020513      *
000700020513     A          R D31REC                    TEXT('Parametri per caricamento P.O-
000800020513     A                                      . gestiblii')
000900020513      *----------------------------------
001000020513      * Dati di input :
001100020513      *----------------------------------
001200020513      * Codice Abilitazione
001300020513     A            I31ABI    R               REFFLD(§UTEMBS DUTE01)
001400020513     A                                      TEXT('Codice Abilitazione')
001500020513      * Distretto Utente
001600020513     A            I31CDI    R               REFFLD(ORGFL3)
001700020513     A                                      TEXT('Codice Distretto Utente')
001800020513      * Area Utente
001900040203     A            I31CAR    R     S         REFFLD(ORGCAR)
002000040203     A                                      TEXT('Codice Area Utente')
002100020513      * Punto Operativo Utente
002200020513     A            I31CPO    R     S         REFFLD(ORGFIL)
002300020513     A                                      TEXT('Punto Operativo Utente')
002400020513      *----------------------------------
002500020513      * Dati di output :
002600020513      *----------------------------------
002700020513      * Schiera P.O. gestibili
002800020513     A            O31POG       750A         TEXT('Schiera P.O. gestibili - max -
002900020513     A                                      250')
