000100110623     H DFTACTGRP(*NO) ACTGRP(*NEW) BNDDIR('TRUL')
000200110623
000300110624     Fprtf198   O    F  198        PRINTER OFLIND(*INOA) USROPN
000400110624
000500110623      /COPY GAITRASRC/SRCCONST,TRULDIRINF
000600110623      /COPY GAITRASRC/SRCPROTOPR,TRULDIRINF
000700110624
000800110624     D this_idxDirObj...
000900110624     D                 DS                  LIKEDS(DIRINF_idxDirObj) INZ
001000110624     D esito           S             10I 0
001100110624     D logDta          S            198A   VARYING
001200110624
001300110623      /FREE
001400110623
001500110623       *INLR = *ON;
001600110623
001700110624       IF DIRINF_NewRichiamo('/home/edpdc') < DIRINF_ESITO_OK;
002000110624         RETURN;
002100110624       ENDIF;
002200110623
002201110624       DIRINF_SetWhereObjectName(' LIKE ''%.txt''');
002202110624
002203110624       IF DIRINF_RunRichiamo() < DIRINF_ESITO_OK;
002204110624         RETURN;
002205110624       ENDIF;
002206110624
002207110624       OPEN prtf198;
002208110624
002300110624       DOU esito < DIRINF_ESITO_OK OR esito = DIRINF_ESITO_ROW_NOT_FOUND;
002400110624         esito = DIRINF_GetNextObjectName(this_idxDirObj);
002500110624         IF esito = DIRINF_ESITO_ROW_NOT_FOUND OR esito < DIRINF_ESITO_OK;
002501110624           CLOSE prtf198;
002600110624           DIRINF_EndRichiamo();
002700110624           LEAVE;
002800110624         ENDIF;
002801110624         logDta = this_idxDirObj.dirNam + '/' + this_idxDirObj.objNam;
003000110624         EXCEPT log;
003100110624       ENDDO;
003200110624
003300110624       IF DIRINF_NewRichiamo('/home/edpdc') < DIRINF_ESITO_OK;
003600110624         RETURN;
003700110624       ENDIF;
003701110624
003702110624       DIRINF_SetWhereObjectType(' = ''*DIR''');
003703110624
003704110624       IF DIRINF_RunRichiamo() < DIRINF_ESITO_OK;
003705110624         RETURN;
003706110624       ENDIF;
003707110624
003708110624       OPEN prtf198;
003800110624
003900110624       DOU esito < DIRINF_ESITO_OK OR esito = DIRINF_ESITO_ROW_NOT_FOUND;
004000110624         esito = DIRINF_GetNextObjectName(this_idxDirObj);
004100110624         IF esito = DIRINF_ESITO_ROW_NOT_FOUND OR esito < DIRINF_ESITO_OK;
004101110624           CLOSE prtf198;
004200110624           DIRINF_EndRichiamo();
004300110624           LEAVE;
004400110624         ENDIF;
004500110624         logDta = this_idxDirObj.dirNam + '/' + this_idxDirObj.objNam;
004600110624         EXCEPT log;
004700110624       ENDDO;
004800110624
004900110623      /END-FREE
005000110624
005100110624     Oprtf198   E            log
005200110624     O                       logDta
