000010161020     A*%%TS  SD  20161020  155446  EDPLC       REL-V7R1M0  5770-WDS
000020970526     A*-------------------------------------------------------------------------
000030161020     A*%%EC
000040161020     A                                      DSPSIZ(24 80 *DS3)
000050161020     A                                      CHGINPDFT(HI CS)
000060161020     A                                      PRINT
000070161020     A                                      CF01
000080161020     A                                      CF02
000090161020     A                                      CF03
000100161020     A                                      CF04
000110161020     A                                      CF05
000120161020     A                                      CF06
000130161020     A                                      CF07
000140161020     A                                      CF08
000150161020     A                                      CF09
000160161020     A                                      CF10
000170161020     A                                      CF11
000180161020     A                                      CF12
000190161020     A                                      CF13
000200161020     A                                      CF14
000210161020     A                                      CF15
000220161020     A                                      CF16
000230161020     A                                      CF17
000240161020     A                                      CF18
000250161020     A                                      CF19
000260161020     A                                      CF20
000270161020     A                                      CF21
000280161020     A                                      CF22
000290161020     A                                      CF23
000300161020     A                                      CF24
000310161020     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330161020     A          R REGEXD01
000340161014     A*%%TS  SD  20161014  123200  EDPLC       REL-V7R1M0  5770-WDS
000350161014     A                                      TEXT('Testata')
000360161014     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370161020     A                                  1 24'*          TEST TRULREGEX         -
000380161014     A                                      *'
000390161014     A                                      DSPATR(RI)
000400161014     A                                      DSPATR(UL)
000410161020     A                                  1 60'TRULREGEXR'
000420161014     A                                  1 71DATE
000430161014     A                                      EDTCDE(Y)
000440161014     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000450161014     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000460161020     A*                                 2 32'      LANCIO        '
000470161020     A*                                     DSPATR(HI)
000480161020     A*                                     DSPATR(RI)
000490161014     A                                  2 71TIME
000500970526     A*-------------------------------------------------------------------------
000510161020     A          R REGEXD02
000520970526     A                                      OVERLAY
000530970526     A            FUN001        19A  O 22  2
000540970526     A            FUN002        19A  O 22 22
000550970526     A            FUN003        19A  O 22 42
000560970526     A            FUN004        19A  O 22 62
000570970526     A            FUN005        19A  O 23  2
000580970526     A            FUN006        19A  O 23 22
000590970526     A            FUN007        19A  O 23 42
000600970526     A            FUN008        19A  O 23 62
000610970526     A*-------------------------------------------------------------------------
000620161020     A          R REGEXD03
000630161020     A*%%TS  SD  20161020  155446  EDPLC       REL-V7R1M0  5770-WDS
000640161020     A                                      OVERLAY
000650161020     A                                  4  2'INPUT                             -
000660161020     A                                                                         -
000670161020     A                                               '
000680161020     A                                      DSPATR(UL)
000690161020     A                                  5  2'Stringa da testare'
000700161020     A                                      DSPATR(HI)
000710161020     A            D03STRING    400A  B  6  2
000720161020     A N50                                  DSPATR(HI)
000730161020     A  50                                  DSPATR(RI)
000740161020     A  50                                  DSPATR(PC)
000750161020     A N50                                  DSPATR(CS)
000760161020     A                                      CHECK(LC)
000770161020     A                                 12  2'Pattern'
000780161020     A                                      DSPATR(HI)
000790161020     A            D03PATTERN   256A  B 13  2
000800161020     A N51                                  DSPATR(HI)
000810161020     A  51                                  DSPATR(RI)
000820161020     A  51                                  DSPATR(PC)
000830161020     A N51                                  DSPATR(CS)
000840161020     A                                      CHECK(LC)
000850161020     A                                 18  2'OUTPUT                            -
000860161020     A                                                                         -
000870161020     A                                               '
000880161020     A                                      DSPATR(UL)
000890161020     A                                 19  2'Esito'
000900161020     A            D03ESITO       1Y 0O 19 11EDTWRD('0 ')
000910161020     A                                 19 14'(0=OK)'
000920161020     A            VIDMSG        76A  O 21  3DSPATR(HI)
000930970526     A*-------------------------------------------------------------------------
000940161020     A          R REGEXDMS                  SFL
000950970526     A                                      SFLMSGRCD(24)
000960970526     A            MSGKEY                    SFLMSGKEY
000970970526     A            MSGQUE                    SFLPGMQ
000980970526     A*-------------------------------------------------------------------------
000990161020     A          R REGEXDMC                  SFLCTL(REGEXDMS)
001000970526     A                                      OVERLAY
001010970526     A                                      SFLDSP
001020970526     A  40                                  SFLCLR
001030970526     A                                      SFLSIZ(0002)
001040970526     A                                      SFLPAG(0001)
