000100011019      *--------------------------------------------------------------*
000200011019      *  DS PASSAGGIO PARAMETRI A PGM DI CALCOLO "J" PER BOLLE POSTE
000300011019      *--------------------------------------------------------------*
000400011019     A          R D20REC                    TEXT('DS CALCOLO J PER BOLLE POSTE')
000500011019      *
000600011019      *  INPUT:
000700011019      ***
000800011019      ***  Tipo lancio: OBBLIGATORIO
000900011019      *                 ' ' = esegue elaborazione senza chiudere i file
001000011019      *                 'C' = esegue solo la chiusura dei file
001100011019      *                 'L' = esegue elaborazione e chiusura file
001200011019     A            I20TLA         1A         TEXT('Tipo lancio programma')
001300011019      ***
001400011019      ***  Tipo calcolo: OBBLIGATORIO
001500011019      *                 'S' = calcolo eseguito con tabelle di sede
001600011019      *                 'P' = calcolo eseguito con tabelle di p.o.
001700011019     A            I20TPC         1A         TEXT('Tipo calcolo')
001800011019      ***
001900011019      ***  Tempo di non conformità in ore: OBBLIGATORIO
002000011019     A            I20ORE         3S 0       TEXT('Ore non conformità')
002100011019      ***
002200011019      * OUTPUT
002300011019      ***
002400011019     A            O20KE1        15          TEXT('Key tabella JPT')
