000100941119/*       REPERISCO PROFILO DEL LAVORO ATTUALE                       */
000200921021
000300941119 TRUL24C1:   PGM        PARM(&PRFUT)
000400941119             DCL        VAR(&PRFUT) TYPE(*CHAR) LEN(10)
000500941119             RTVUSRPRF  RTNUSRPRF(&PRFUT)
000600000000             ENDPGM
