000100110720             PGM        PARM(&KPJBA)
000200110720             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
000300110720             DCL        VAR(&KPJBU) TYPE(*CHAR) LEN(256)
000400110720             CHGVAR     VAR(&KPJBU) VALUE(%SUBSTRING(&KPJBA 247 256))
000500110720             CALL       PGM(QCMDEXC) PARM(&KPJBU 256)
000600150226             MONMSG     MSGID(CPF0000)
000700110720             ENDPGM
