000100130911      *--------------------------------------------------------------------*
000200131108      *  DS PASSAGGIO PARAMETRI A PGM DI VISUALIZZAZIONE ORARI DI FILIALE
000300130911      *--------------------------------------------------------------------*
000400131108     A          R DORFREC                   TEXT('DS VISUALIZZA ORARI FILIALE')
000500130911
000600130911      * C A M P I   I N   I N P U T
000700131112     A            IORFFIL        3S 0       TEXT('FILIALE')
000800131108     A            IORFRIG        3S 0       TEXT('Riga Pos. Window')
000900131108     A            IORFCOL        3S 0       TEXT('Colonna Pos. Window')
001000140926     A            IORFLIN        2A         TEXT('CODICE LINGUA')
001100130911
001200130911      * C A M P I   I N   O U T P U T:
001300131108     A            OORFERR        1          TEXT('1=ERRORE')
001400131108     A            OORFMSG       78          TEXT('MESSAGGIO DI ERRORE')
