000100070628      *--------------------------------------------------------------*
000200080708      * Parametri per REPERIMENTO DATI OVRPRTF PRINTER FILE           *
000300070628      *--------------------------------------------------------------*
000400070628      *
000500080708     A          R TRULPOVREC                TEXT('PARAMETRI PER "OVRDB-
000600080708     A                                      F PTINER FILE')
000700080709     A            助LPTIPMDA     2          TEXT('TIPO MODULO DA SOSTITUIRE')
000800080709     A            助LPTIPM_A     2          TEXT('TIPO MODULO CHE SOSTITUISCE')
000900080709     A            助LPOOUTQ     10          TEXT('CODA DI OUTPUT')
001000080708     A            助LPOFTYPE    10          TEXT('TIPO MODULO')
001100080708     A            助LPOUDTA     10          TEXT('DATI UTENTE')
001200080708     A            助LPOSHARE    10          TEXT('CONDIVISIONE DATI')
001300090605     A            助LPOSAVE      5          TEXT('SAVE')
001400080708     A            助LPOERR       1          TEXT('E=ERRORE')
001500080709     A            助LPOCMO     100          TEXT('COMANDO DI OVRPRTF')
