000100890918     A*--------------------------------------------------------------*
000200940928     A*  DS PER PGM DI RICHIESTA STAMPANTI
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500030610     A          R D90REC                    TEXT('RICHIESTA STAMPANTI')
000600030610      * CAMPI IN INPUT:
000700030612     A            D90RSE         1A         TEXT('"S"o"X"=STAMPANTE ETICHETTE --
000800030612     A                                       "X" NO VIDEO')
000900030612     A            D90RSB         1A         TEXT('"S"o"X"=STAMPANTE LDV - "X" N-
001000030612     A                                      O VIDEO')
001100030612     A            D90RST         1A         TEXT('"S"o"X"=STAMPANTE TABULATI - -
001200030612     A                                      "X" NO VIDEO')
001300030610
001400030610     A            D90NCP         1A         TEXT('NUMERO COPIE DELLA CARTA -
001500940928     A                                      DEL TABULATO')
001600030610      * CAMPI IN INPUT/OUTPUT:
001700030610      * SE I 3 SEGUENTI CAMPI VENGONO PASSATI VIENE SOLO IMPOSTATA
001800030610      * NELLE ULTIME 3 POSIZIONI IL P.O. ALTRIMENTI IL DEFAULT
001900030610     A            D90MDE        10A         TEXT('MODULO STAMPA ETICHETTE')
002000030610     A            D90MDB        10A         TEXT('MODULO STAMPA BOLLE/FATTURE')
002100030610     A            D90MDT        10A         TEXT('MODULO STAMPA TABULATI')
002200030610      * CAMPI DI OUTPUT:
002300030610     A            D90PSS        10A         TEXT('PGM PER STAMPA ETICHETTE -
002400940930                                            SEGNACOLLI')
002500030610     A            D90PSB        10A         TEXT('PGM PER STAMPA ETICHETTE -
002600940930                                            BORDERO''')
002700030610     A            D90PRE        10A         TEXT('STAMPANTE ETICHETTE')
002800030610     A            D90PRB        10A         TEXT('STAMPANTE BOLLE/FATTURE')
002900030610     A            D90PRT        10A         TEXT('STAMPANTE TABULATI')
003000030610     A            D90F3          1A         TEXT('1=PREMUTO F3')
003100030610     A            D90PSD        10A         TEXT('PGM PER STAMPA ETICHETTE -
003200950907                                            DISTINTA')
003300030610     A            D90PSF        10A         TEXT('PGM PER STAMPA ETICHETTE -
003400970430                                            FOGLI VIAGGIO')
003500010314      * O.R.M.
003600030610      * CAMPI IN INPUT:
003700030612     A            D90RSO         1A         TEXT('"S"o"X"=STAMPANTE ORM - "X" N-
003800030612     A                                      O VIDEO')
003900030610      * CAMPI IN INPUT/OUTPUT:
004000030610     A            D90MDO        10A         TEXT('MODULO STAMPA O.R.M.')
004100030610      * CAMPI DI OUTPUT:
004200030610     A            D90PRO        10A         TEXT('STAMPANTE O.R.M.')
004300030606
004400030609      * BOLLE SU STAMPANTE LASER
004500030609      *  CAMPI IN INPUT/OUTPUT:
004600030610     A            D90MDB4       10A         TEXT('MODULO STAMPA LDV SU A4')
004700030610     A            D90MDB5       10A         TEXT('MODULO STAMPA LDV SU A5')
004800030609      *  CAMPI DI OUTPUT:
004900030610     A            D90BSL         1A         TEXT('"S"=STAMPA LDV SU LASER')
005000030610     A            D90PSL        10A         TEXT('PGM PER STAMPA LDV')
005100030610     A            D90PRB4       10A         TEXT('STAMPANTE PER LDV SU A4')
005200030610     A            D90PRB5       10A         TEXT('STAMPANTE PER LDV SU A5')
