000010100622     A*%%TS  SD  20100622  104833  EDPMB       REL-V6R1M0  5761-WDS
000020090128     A*PARMS RSTDSP(*YES) DFRWRT(*YES) DECFMT(*JOB)
000030090128     A*---------------------------------------------------------------*
000040100622     A*%%EC
000050100622     A                                      DSPSIZ(24 80 *DS3)
000060100622     A                                      REF(*LIBL/TRUL31DS)
000070100622     A                                      CHGINPDFT(HI UL)
000080100622     A                                      INDARA
000090100622     A                                      PRINT
000100100622     A                                      ERRSFL
000110090128     A*---------------------------------------------------------------*
000120100622     A          R UL31T1
000130100622     A*%%TS  SD  20100622  095830  EDPMB       REL-V6R1M0  5761-WDS
000140100622     A                                      TEXT('TESTATA')
000150100622     A                                  1  2SYSNAME
000160100622     A                                  1 11USER
000170100622     A                                  1 25'       Richiamo TRUL31R       '
000180100622     A                                      DSPATR(RI)
000190100622     A                                  1 61DATE(*JOB *YY)
000200100622     A                                      EDTCDE(Y)
000210100622     A                                  1 72TIME
000220090128     A*---------------------------------------------------------------*
000230100622     A          R UL31D1
000240100622     A*%%TS  SD  20100622  100534  EDPMB       REL-V6R1M0  5761-WDS
000250100622     A                                      TEXT('FILTRO DI LANCIO')
000260100622     A                                      CA03
000270100622     A                                      CF04
000280100622     A                                      CF06
000290100622     A                                      CSRLOC(H1RIGA     H1COLO)
000300100622     A                                      OVERLAY
000310100622     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
000320100622     A                                      ore')
000330100622     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
000340100622     A                                      ursore')
000350100622     A  28        V1DMSG        78   M
000360100622     A                                  3  2'Codice abilitazione .........:'
000370100622     A            I31ABI    R        B  3 33
000380100622     A                                  4  2'Codice Direzione comm.le ....:'
000390100622     A            I31CDI    R        B  4 33
000400100622     A                                  5  2'Codice Area .................:'
000410100622     A            I31CAR    R     Y  B  5 33CHECK(RZ)
000420100622     A                                  6  2'Filiale .....................:'
000430100622     A            I31CPO    R     Y  B  6 33CHECK(RZ)
000440090128     A*---------------------------------------------------------------*
000450100622     A          R UL31D2
000460100622     A*%%TS  SD  20100622  104833  EDPMB       REL-V6R1M0  5761-WDS
000470100622     A                                      TEXT('EMISSIONE RISULTATO')
000480100622     A                                      CA03
000490100622     A                                      CF04
000500100622     A                                      CA12
000510100622     A                                      CSRLOC(H1RIGA     H1COLO)
000520100622     A                                      OVERLAY
000530090128     A*
000540100622     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
000550100622     A                                      ore')
000560100622     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
000570100622     A                                      ursore')
000580090128     A*
000590100622     A  28        V1DMSG        78   M
000600090128     A*
000610100622     A                                  8  2'Filiali abilitate:'
000620100622     A                                      COLOR(BLU)
000630100622     A            POG001         3A  O  9  2
000640100622     A            POG002         3A  O  9  6
000650100622     A            POG003         3A  O  9 10
000660100622     A            POG004         3A  O  9 14
000670100622     A            POG005         3A  O  9 18
000680100622     A            POG006         3A  O  9 22
000690100622     A            POG007         3A  O  9 26
000700100622     A            POG008         3A  O  9 30
000710100622     A            POG009         3A  O  9 34
000720100622     A            POG010         3A  O  9 38
000730100622     A            POG011         3A  O  9 42
000740100622     A            POG012         3A  O  9 46
000750100622     A            POG013         3A  O  9 50
000760100622     A            POG014         3A  O  9 54
000770100622     A            POG015         3A  O  9 58
000780100622     A            POG016         3A  O  9 62
000790100622     A            POG017         3A  O  9 66
000800100622     A            POG018         3A  O  9 70
000810100622     A            POG019         3A  O  9 74
000820100622     A            POG020         3A  O  9 78
000830100622     A            POG021         3A  O 10  2
000840100622     A            POG022         3A  O 10  6
000850100622     A            POG023         3A  O 10 10
000860100622     A            POG024         3A  O 10 14
000870100622     A            POG025         3A  O 10 18
000880100622     A            POG026         3A  O 10 22
000890100622     A            POG027         3A  O 10 26
000900100622     A            POG028         3A  O 10 30
000910100622     A            POG029         3A  O 10 34
000920100622     A            POG030         3A  O 10 38
000930100622     A            POG031         3A  O 10 42
000940100622     A            POG032         3A  O 10 46
000950100622     A            POG033         3A  O 10 50
000960100622     A            POG034         3A  O 10 54
000970100622     A            POG035         3A  O 10 58
000980100622     A            POG036         3A  O 10 62
000990100622     A            POG037         3A  O 10 66
001000100622     A            POG038         3A  O 10 70
001010100622     A            POG039         3A  O 10 74
001020100622     A            POG040         3A  O 10 78
001030100622     A            POG041         3A  O 11  2
001040100622     A            POG042         3A  O 11  6
001050100622     A            POG043         3A  O 11 10
001060100622     A            POG044         3A  O 11 14
001070100622     A            POG045         3A  O 11 18
001080100622     A            POG046         3A  O 11 22
001090100622     A            POG047         3A  O 11 26
001100100622     A            POG048         3A  O 11 30
001110100622     A            POG049         3A  O 11 34
001120100622     A            POG050         3A  O 11 38
001130100622     A            POG051         3A  O 11 42
001140100622     A            POG052         3A  O 11 46
001150100622     A            POG053         3A  O 11 50
001160100622     A            POG054         3A  O 11 54
001170100622     A            POG055         3A  O 11 58
001180100622     A            POG056         3A  O 11 62
001190100622     A            POG057         3A  O 11 66
001200100622     A            POG058         3A  O 11 70
001210100622     A            POG059         3A  O 11 74
001220100622     A            POG060         3A  O 11 78
001230100622     A            POG061         3A  O 12  2
001240100622     A            POG062         3A  O 12  6
001250100622     A            POG063         3A  O 12 10
001260100622     A            POG064         3A  O 12 14
001270100622     A            POG065         3A  O 12 18
001280100622     A            POG066         3A  O 12 22
001290100622     A            POG067         3A  O 12 26
001300100622     A            POG068         3A  O 12 30
001310100622     A            POG069         3A  O 12 34
001320100622     A            POG070         3A  O 12 38
001330100622     A            POG071         3A  O 12 42
001340100622     A            POG072         3A  O 12 46
001350100622     A            POG073         3A  O 12 50
001360100622     A            POG074         3A  O 12 54
001370100622     A            POG075         3A  O 12 58
001380100622     A            POG076         3A  O 12 62
001390100622     A            POG077         3A  O 12 66
001400100622     A            POG078         3A  O 12 70
001410100622     A            POG079         3A  O 12 74
001420100622     A            POG080         3A  O 12 78
001430100622     A            POG081         3A  O 13  2
001440100622     A            POG082         3A  O 13  6
001450100622     A            POG083         3A  O 13 10
001460100622     A            POG084         3A  O 13 14
001470100622     A            POG085         3A  O 13 18
001480100622     A            POG086         3A  O 13 22
001490100622     A            POG087         3A  O 13 26
001500100622     A            POG088         3A  O 13 30
001510100622     A            POG089         3A  O 13 34
001520100622     A            POG090         3A  O 13 38
001530100622     A            POG091         3A  O 13 42
001540100622     A            POG092         3A  O 13 46
001550100622     A            POG093         3A  O 13 50
001560100622     A            POG094         3A  O 13 54
001570100622     A            POG095         3A  O 13 58
001580100622     A            POG096         3A  O 13 62
001590100622     A            POG097         3A  O 13 66
001600100622     A            POG098         3A  O 13 70
001610100622     A            POG099         3A  O 13 74
001620100622     A            POG100         3A  O 13 78
001630100622     A            POG101         3A  O 14  2
001640100622     A            POG102         3A  O 14  6
001650100622     A            POG103         3A  O 14 10
001660100622     A            POG104         3A  O 14 14
001670100622     A            POG105         3A  O 14 18
001680100622     A            POG106         3A  O 14 22
001690100622     A            POG107         3A  O 14 26
001700100622     A            POG108         3A  O 14 30
001710100622     A            POG109         3A  O 14 34
001720100622     A            POG110         3A  O 14 38
001730100622     A            POG111         3A  O 14 42
001740100622     A            POG112         3A  O 14 46
001750100622     A            POG113         3A  O 14 50
001760100622     A            POG114         3A  O 14 54
001770100622     A            POG115         3A  O 14 58
001780100622     A            POG116         3A  O 14 62
001790100622     A            POG117         3A  O 14 66
001800100622     A            POG118         3A  O 14 70
001810100622     A            POG119         3A  O 14 74
001820100622     A            POG120         3A  O 14 78
001830100622     A            POG121         3A  O 15  2
001840100622     A            POG122         3A  O 15  6
001850100622     A            POG123         3A  O 15 10
001860100622     A            POG124         3A  O 15 14
001870100622     A            POG125         3A  O 15 18
001880100622     A            POG126         3A  O 15 22
001890100622     A            POG127         3A  O 15 26
001900100622     A            POG128         3A  O 15 30
001910100622     A            POG129         3A  O 15 34
001920100622     A            POG130         3A  O 15 38
001930100622     A            POG131         3A  O 15 42
001940100622     A            POG132         3A  O 15 46
001950100622     A            POG133         3A  O 15 50
001960100622     A            POG134         3A  O 15 54
001970100622     A            POG135         3A  O 15 58
001980100622     A            POG136         3A  O 15 62
001990100622     A            POG137         3A  O 15 66
002000100622     A            POG138         3A  O 15 70
002010100622     A            POG139         3A  O 15 74
002020100622     A            POG140         3A  O 15 78
002030100622     A            POG141         3A  O 16  2
002040100622     A            POG142         3A  O 16  6
002050100622     A            POG143         3A  O 16 10
002060100622     A            POG144         3A  O 16 14
002070100622     A            POG145         3A  O 16 18
002080100622     A            POG146         3A  O 16 22
002090100622     A            POG147         3A  O 16 26
002100100622     A            POG148         3A  O 16 30
002110100622     A            POG149         3A  O 16 34
002120100622     A            POG150         3A  O 16 38
002130100622     A            POG151         3A  O 16 42
002140100622     A            POG152         3A  O 16 46
002150100622     A            POG153         3A  O 16 50
002160100622     A            POG154         3A  O 16 54
002170100622     A            POG155         3A  O 16 58
002180100622     A            POG156         3A  O 16 62
002190100622     A            POG157         3A  O 16 66
002200100622     A            POG158         3A  O 16 70
002210100622     A            POG159         3A  O 16 74
002220100622     A            POG160         3A  O 16 78
002230100622     A            POG161         3A  O 17  2
002240100622     A            POG162         3A  O 17  6
002250100622     A            POG163         3A  O 17 10
002260100622     A            POG164         3A  O 17 14
002270100622     A            POG165         3A  O 17 18
002280100622     A            POG166         3A  O 17 22
002290100622     A            POG167         3A  O 17 26
002300100622     A            POG168         3A  O 17 30
002310100622     A            POG169         3A  O 17 34
002320100622     A            POG170         3A  O 17 38
002330100622     A            POG171         3A  O 17 42
002340100622     A            POG172         3A  O 17 46
002350100622     A            POG173         3A  O 17 50
002360100622     A            POG174         3A  O 17 54
002370100622     A            POG175         3A  O 17 58
002380100622     A            POG176         3A  O 17 62
002390100622     A            POG177         3A  O 17 66
002400100622     A            POG178         3A  O 17 70
002410100622     A            POG179         3A  O 17 74
002420100622     A            POG180         3A  O 17 78
002430100622     A            POG181         3A  O 18  2
002440100622     A            POG182         3A  O 18  6
002450100622     A            POG183         3A  O 18 10
002460100622     A            POG184         3A  O 18 14
002470100622     A            POG185         3A  O 18 18
002480100622     A            POG186         3A  O 18 22
002490100622     A            POG187         3A  O 18 26
002500100622     A            POG188         3A  O 18 30
002510100622     A            POG189         3A  O 18 34
002520100622     A            POG190         3A  O 18 38
002530100622     A            POG191         3A  O 18 42
002540100622     A            POG192         3A  O 18 46
002550100622     A            POG193         3A  O 18 50
002560100622     A            POG194         3A  O 18 54
002570100622     A            POG195         3A  O 18 58
002580100622     A            POG196         3A  O 18 62
002590100622     A            POG197         3A  O 18 66
002600100622     A            POG198         3A  O 18 70
002610100622     A            POG199         3A  O 18 74
002620100622     A            POG200         3A  O 18 78
002630100622     A            POG201         3A  O 19  2
002640100622     A            POG202         3A  O 19  6
002650100622     A            POG203         3A  O 19 10
002660100622     A            POG204         3A  O 19 14
002670100622     A            POG205         3A  O 19 18
002680100622     A            POG206         3A  O 19 22
002690100622     A            POG207         3A  O 19 26
002700100622     A            POG208         3A  O 19 30
002710100622     A            POG209         3A  O 19 34
002720100622     A            POG210         3A  O 19 38
002730100622     A            POG211         3A  O 19 42
002740100622     A            POG212         3A  O 19 46
002750100622     A            POG213         3A  O 19 50
002760100622     A            POG214         3A  O 19 54
002770100622     A            POG215         3A  O 19 58
002780100622     A            POG216         3A  O 19 62
002790100622     A            POG217         3A  O 19 66
002800100622     A            POG218         3A  O 19 70
002810100622     A            POG219         3A  O 19 74
002820100622     A            POG220         3A  O 19 78
002830100622     A            POG221         3A  O 20  2
002840100622     A            POG222         3A  O 20  6
002850100622     A            POG223         3A  O 20 10
002860100622     A            POG224         3A  O 20 14
002870100622     A            POG225         3A  O 20 18
002880100622     A            POG226         3A  O 20 22
002890100622     A            POG227         3A  O 20 26
002900100622     A            POG228         3A  O 20 30
002910100622     A            POG229         3A  O 20 34
002920100622     A            POG230         3A  O 20 38
002930100622     A            POG231         3A  O 20 42
002940100622     A            POG232         3A  O 20 46
002950100622     A            POG233         3A  O 20 50
002960100622     A            POG234         3A  O 20 54
002970100622     A            POG235         3A  O 20 58
002980100622     A            POG236         3A  O 20 62
002990100622     A            POG237         3A  O 20 66
003000100622     A            POG238         3A  O 20 70
003010100622     A            POG239         3A  O 20 74
003020100622     A            POG240         3A  O 20 78
003030100622     A            POG241         3A  O 21  2
003040100622     A            POG242         3A  O 21  6
003050100622     A            POG243         3A  O 21 10
003060100622     A            POG244         3A  O 21 14
003070100622     A            POG245         3A  O 21 18
003080100622     A            POG246         3A  O 21 22
003090100622     A            POG247         3A  O 21 26
003100100622     A            POG248         3A  O 21 30
003110100622     A            POG249         3A  O 21 34
003120100622     A            POG250         3A  O 21 38
003130090128     A*---------------------------------------------------------------*
003140100622     A          R UL31Z1
003150100622     A*%%TS  SD  20100622  095830  EDPMB       REL-V6R1M0  5761-WDS
003160100622     A                                      TEXT('PIEDE')
003170100622     A                                      OVERLAY
003180100622     A                                 24  2'F3=Fine'
003190100622     A                                      COLOR(BLU)
003200100622     A                                 24 12'F6=Conferma'
003210100622     A                                      COLOR(BLU)
003220100622     A                                 24 26'F12=Ritorno'
003230100622     A                                      COLOR(BLU)
003240090128      *---------------------------------------------------------------*
003250090128     A          R PROTECT
003260090128     A                                      TEXT('Serve x inibire tutt-
003270090128     A                                      o il video')
003280090128     A                                      CA03
003290090128     A                                      CA12
003300090128     A                                      OVERLAY
003310090128     A                                      PROTECT
003320090128     A                                      CLRL(*NO)
003330090128      *---------------------------------------------------------------*
003340090128     A          R ASSUME
003350090128     A                                      TEXT('Serve x preservare i-
003360090128     A                                      l video precedente')
003370090128     A                                      ASSUME
003380090128     A                                  1  2' '
