000100910408             PGM        PARM(&SYF)
000200020905
000300910408             DCL        VAR(&SYF) TYPE(*CHAR) LEN(10)
000400020924             DCL        VAR(&NEWMODULO) TYPE(*CHAR) LEN(1) +
000500020924                          VALUE('S')
000600020924                      /* "S" = NUOVO MODULO BASE (V2) */
000700020905
000800020924             CHKOBJ     OBJ(PROBAS/PKINFO) OBJTYPE(*DTAARA)
000900020924             MONMSG     MSGID(CPF9801) EXEC(CHGVAR VAR(&NEWMODULO) +
001000020924                          VALUE(' '))
001100020905
001200020905ENDF:
001300020924             OVRDBF     FILE(KFSIF01L) TOFILE(PROBAS/KFSIF01L)
001400020905             OVRDBF     FILE(KPLIN01L) TOFILE(PROBAS/KPLIN01L)
001500020905
001600020905             CALL       PGM(GAITRAOBJ/TRUL07R) PARM(&SYF &NEWMODULO)
001700020905
001800020905             DLTOVR     FILE(KFSIF01L KPLIN01L)
001900020905
002000910314             ENDPGM
