000100100728     A          R TRULIBANI0                TEXT('Coordinate bancarie -
000200100728     A                                      pagamenti: parametri -
000300100728     A                                      input clienti.')
000400100728     A            FLCOMIT        1A         TEXT('1=APRE FILE SOTTO COMMIT, -
000500100728     A                                      0=NON APRE FILE SOTTO COMMIT')
000600100728     A            KSC            7S 0       TEXT('CODICE CLIENTE')
000700100728     A            PAG            2A         TEXT('TIPO PAGAMENTO')
000800100728     A            CCB           18A         TEXT('C/C BANCARIO')
000900100728     A            ABI            5S 0       TEXT('CODICE ABI')
001000100728     A            CAB            5S 0       TEXT('CODICE CAB')
001100100728     A            IBAN          34A         TEXT('CODICE IBAN')
001200100728     A            BIC           11A         TEXT('CODICE SWIFT/BIC')
001300100805     A            CODPO          1A         TEXT('COD. PAGAMENTO OLD')
001400100805     A            CODPN          1A         TEXT('COD. PAGAMENTO NEW')
001500100805     A            PGM           10A         TEXT('PGM CHIAMANTE')
