000100011019      *--------------------------------------------------------------*
000200120109      *  DS RECUPERO DATA INSERIMENTO ULTIMO BLOCCO CLIENTE
000300011019      *--------------------------------------------------------------*
000400120109     A          R DBLCREC                   TEXT('DS RECUPERO DATA BLOCCO KSC')
000500011019      *
000600011019      *  INPUT:
000700011019      ***
000800011019      ***  Tipo lancio: OBBLIGATORIO
000900011019      *                 ' ' = esegue elaborazione senza chiudere i file
001000011019      *                 'C' = esegue solo la chiusura dei file
001100011019      *                 'L' = esegue elaborazione e chiusura file
001200120109     A            IBLCTLA        1A         TEXT('Tipo lancio programma')
001300011019      ***
001400120109      ***  Capo conto clienti
001500120109     A            IBLCKCC        4S 0       TEXT('Capo conto clienti')
001600011019      ***
001700120109      ***  Sotto conto clienti
001800120109     A            IBLCKSC        7S 0       TEXT('Sotto conto Clienti')
001900011019      ***
002000011019      * OUTPUT
002100011019      ***
002200120109     A            OBLCDAV        8S 0       TEXT('Data inserimento blocco')
