000100100728     A          R TRULIBANO1                TEXT('Coordinate bancarie -
000200100728     A                                      pagamenti: parametri -
000300100728     A                                      output trattative.')
000400100728     A            CCB           18A         TEXT('C/C BANCARIO')
000500100728     A            ABI            5S 0       TEXT('CODICE ABI')
000600100728     A            CAB            5S 0       TEXT('CODICE CAB')
000700100728     A            IBAN          34A         TEXT('CODICE IBAN')
000800100728     A            BIC           11A         TEXT('CODICE SWIFT/BIC')
