000100140325     A*%%TS  SD  20140325  115150  EDPES       REL-V7R1M0  5770-WDS
000200140325     A*%%EC
000300140325     A                                      DSPSIZ(24 80 *DS3)
000400140325     A                                      CHGINPDFT(HI UL)
000500140325     A                                      PRINT
000600131016     A          R ULOREW01C
000700131016     A*%%TS  SD  20131016  125344  EDPMB       REL-V7R1M0  5770-WDS
000800131016     A                                      WINDOW(&W1RIG &W1COL 10 41 *NOMSGLI-
000900131016     A                                      N)
001000131016     A                                      OVERLAY
001100131016     A            W1RIG          3S 0P
001200131016     A            W1COL          3S 0P
001300131016     A                                  1  1'Servizio CONSEGNA'
001400131016     A                                      DSPATR(HI)
001500131016     A                                  2  1'di norma dalle'
001600131016     A                                      DSPATR(HI)
001700131016     A            ORESTISW       4Y 0O  2 16EDTWRD('0 :  ')
001800131016     A                                      DSPATR(HI)
001900131016     A                                  2 22'alle'
002000131016     A                                      DSPATR(HI)
002100131016     A            ORESTFSW       4Y 0O  2 27EDTWRD('0 :  ')
002200131016     A                                      DSPATR(HI)
002300131016     A                                  4  1'Accordi per CONSEGNA IN GIORNI SUC-
002400131016     A                                      CESSIVI'
002500131016     A                                      COLOR(BLU)
002600131016     A                                  5  1'possibili dalle'
002700131016     A                                      COLOR(BLU)
002800131016     A            OREMIISW       4Y 0O  5 17EDTWRD('0 :  ')
002900131016     A                                      COLOR(BLU)
003000131016     A                                  5 23'alle'
003100131016     A                                      COLOR(BLU)
003200131016     A            OREMXFSW       4Y 0O  5 28EDTWRD('0 :  ')
003300131016     A                                      COLOR(BLU)
003400131016     A  40N41                           7  1'RICONSEGNA IN GIORNATA secondo ten-
003500131016     A                                      tativo'
003600131016     A                                      COLOR(BLU)
003700131016     A  40 41                           7  1'RICONSEGNA in giornata NON POSSIBI-
003800131016     A                                      LE'
003900131016     A                                      COLOR(BLU)
004000131016     A  40N41                           8  1'possibile dalle'
004100131016     A                                      COLOR(BLU)
004200131016     A  40N41     OREDA          4Y 0O  8 17EDTWRD('  :  ')
004300131016     A                                      COLOR(BLU)
004400131016     A  40N41                           8 23'alle'
004500131016     A                                      COLOR(BLU)
004600131016     A  40N41     OREA           4Y 0O  8 28EDTWRD('  :  ')
004700131016     A                                      COLOR(BLU)
004800131016     A            OREDRIFW      16A  O 10  1
004900131016     A                                 10 28'INVIO=Prosegui'
005000131016     A                                      COLOR(BLU)
005100140307     A          R ULOREW01R
005200140307     A*%%TS  SD  20140307  122644  EDPES       REL-V7R1M0  5770-WDS
005300140307     A                                      WINDOW(&W1RIG &W1COL 10 55 *NOMSGLI-
005400140307     A                                      N)
005500140307     A                                      OVERLAY
005600140307     A            W1RIG          3S 0P
005700140307     A            W1COL          3S 0P
005800140307     A                                  2  3'Servizio RITIRI di norma dalle'
005900140307     A                                      DSPATR(HI)
006000140307     A            ORESTISW       4Y 0O  2 34EDTWRD('0 :  ')
006100140307     A                                      DSPATR(HI)
006200140307     A                                  2 40'alle'
006300140307     A                                      DSPATR(HI)
006400140307     A            ORESTFSW       4Y 0O  2 45EDTWRD('0 :  ')
006500140307     A                                      DSPATR(HI)
006600140307     A                                  6  3'Accettazione RITIRI IN GIORNATA:'
006700140307     A                                      COLOR(BLU)
006800140307     A                                  7  3'Commissionati fino alle'
006900140307     A                                      COLOR(BLU)
007000140307     A            ORELRSC        4Y 0O  7 27EDTWRD('  :  ')
007100140307     A                                      COLOR(BLU)
007200140307     A                                  8  3'Non Commissionati fino alle'
007300140307     A                                      COLOR(BLU)
007400140307     A            ORELRNC        4Y 0O  8 31EDTWRD('  :  ')
007500140307     A                                      COLOR(BLU)
007600140307     A            OREDRIFW      16A  O 10  1
007700140307     A                                 10 42'INVIO=Prosegui'
007800140307     A                                      COLOR(BLU)
007900140307     A  50                              4  3'La merce parte SEMPRE il giorno su-
008000140307     A                                      ccessivo al ritiro'
008100140307     A                                      DSPATR(HI)
008200140314     A          R ULOREW01E
008300140314     A*%%TS  SD  20140314  113835  EDPES       REL-V7R1M0  5770-WDS
008400140314     A                                      OVERLAY
008500140314     A                                      WINDOW(&W1RIG &W1COL 14 36 *NOMSGLI-
008600140314     A                                      N)
008700140314     A            W1RIG          3S 0P
008800140314     A            W1COL          3S 0P
008900140314     A                                  1  5'Orario Servizio CONSEGNA'
009000140314     A                                      DSPATR(RI)
009100140314     A                                  2  2'di norma dalle'
009200140314     A                                      DSPATR(HI)
009300140314     A            ORESTISW       4Y 0O  2 17EDTWRD('0 :  ')
009400140314     A                                      DSPATR(HI)
009500140314     A                                  2 23'alle'
009600140314     A                                      DSPATR(HI)
009700140314     A            ORESTFSW       4Y 0O  2 28EDTWRD('0 :  ')
009800140314     A                                      DSPATR(HI)
009900140314     A                                  4  2'Accordi per GIORNI SUCCESSIVI'
010000140314     A                                  5  2'possibili dalle'
010100140314     A            OREMIISW       4  0O  5 18EDTWRD('0 :  ')
010200140314     A                                  5 24'alle'
010300140314     A            OREMXFSW       4  0O  5 29EDTWRD('0 :  ')
010400140314     A                                  7  6'Orario Servizio RITIRO'
010500140314     A                                      DSPATR(RI)
010600140314     A                                  8  2'di norma dalle'
010700140314     A                                      DSPATR(HI)
010800140314     A            ORESTISWR      4Y 0O  8 17EDTWRD('0 :  ')
010900140314     A                                      DSPATR(HI)
011000140314     A                                  8 23'alle'
011100140314     A                                      DSPATR(HI)
011200140314     A            ORESTFSWR      4Y 0O  8 28EDTWRD('0 :  ')
011300140314     A                                      DSPATR(HI)
011400140314     A                                 10  2'Accettazione RITIRI IN GIORNATA'
011500140314     A                                      COLOR(BLU)
011600140314     A                                      DSPATR(UL)
011700140314     A                                 11  2'Commissionati fino alle....'
011800140314     A                                      COLOR(BLU)
011900140314     A            ORELRSC        4Y 0O 11 30EDTWRD('  :  ')
012000140314     A                                      COLOR(BLU)
012100140314     A                                 12  2'NON Commissionati fino alle'
012200140314     A                                      COLOR(BLU)
012300140314     A            ORELRNC        4Y 0O 12 30EDTWRD('  :  ')
012400140314     A                                      COLOR(BLU)
012500140314     A            OREDRIFW      16A  O 14  1
012600140314     A                                 14 23'INVIO=Prosegui'
012700140314     A                                      COLOR(BLU)
012800140325     A          R ULOREW02
012900140325     A*%%TS  SD  20140325  115150  EDPES       REL-V7R1M0  5770-WDS
013000140325     A                                      WINDOW(&W1RIG &W1COL 7 40 *NOMSGLIN)
013100140325     A                                      OVERLAY
013200140325     A            W1RIG          3S 0P
013300140325     A            W1COL          3S 0P
013400140325     A                                  1 11'Orari Servizio'
013500140325     A                                      DSPATR(RI)
013600140325     A            OREDTSERW      8A  O  1 26DSPATR(UL)
013700140325     A                                      DSPATR(RI)
013800140325     A            W02MSG1       40A  O  3  1
013900140325     A            W02MSG2       40A  O  4  1
014000140325     A                                  7 27'INVIO=Prosegui'
014100140325     A                                      COLOR(BLU)
014200140325     A          R ULOREW02E
014300140325     A*%%TS  SD  20140325  114548  EDPES       REL-V7R1M0  5770-WDS
014400140325     A                                      OVERLAY
014500140325     A                                      WINDOW(&W1RIG &W1COL 4 40 *NOMSGLIN)
014600140325     A            W1RIG          3S 0P
014700140325     A            W1COL          3S 0P
014800140325     A            W02MSG1       40A  O  2  1
014900140325     A                                  4 27'INVIO=Prosegui'
015000140325     A                                      COLOR(BLU)
015100140325     A          R ULOREW03C
015200140325     A*%%TS  SD  20140325  114548  EDPES       REL-V7R1M0  5770-WDS
015300140325     A                                      OVERLAY
015400140325     A                                      WINDOW(&W1RIG &W1COL 11 40 *NOMSGLI-
015500140325     A                                      N)
015600140325     A            W1RIG          3S 0P
015700140325     A            W1COL          3S 0P
015800140325     A                                  1  8'Orari servizio Consegna'
015900140325     A                                      DSPATR(RI)
016000140325     A  42                              3  1'STIMATO   dalle'
016100140325     A                                      COLOR(RED)
016200140325     A  42        OREPRESD       4Y 0O  3 17EDTWRD('0 :  ')
016300140325     A                                      COLOR(RED)
016400140325     A  42                              3 23'alle'
016500140325     A                                      COLOR(RED)
016600140325     A  42        OREPRESA       4Y 0O  3 28EDTWRD('0 :  ')
016700140325     A                                      COLOR(RED)
016800140325     A                                  5  1'STANDARD  dalle'
016900140325     A                                      DSPATR(HI)
017000140325     A            ORESTISW       4Y 0O  5 17EDTWRD('0 :  ')
017100140325     A                                      DSPATR(HI)
017200140325     A                                  5 23'alle'
017300140325     A                                      DSPATR(HI)
017400140325     A            ORESTFSW       4Y 0O  5 28EDTWRD('0 :  ')
017500140325     A                                      DSPATR(HI)
017600140325     A                                  7  1'MASSIMO   dalle'
017700140325     A            OREMIISW       4Y 0O  7 17EDTWRD('0 :  ')
017800140325     A                                  7 23'alle'
017900140325     A            OREMXFSW       4Y 0O  7 28EDTWRD('0 :  ')
018000140325     A  40N41                           9  1'RICONSEGNA IN GIORNATA secondo ten-
018100140325     A                                      tativo'
018200140325     A                                      COLOR(BLU)
018300140325     A  40 41                           9  1'RICONSEGNA in giornata NON POSSIBI-
018400140325     A                                      LE'
018500140325     A                                      COLOR(BLU)
018600140325     A  40N41                          10  1'possibile dalle'
018700140325     A                                      COLOR(BLU)
018800140325     A  40N41     OREDA          4Y 0O 10 17EDTWRD('  :  ')
018900140325     A                                      COLOR(BLU)
019000140325     A  40N41                          10 23'alle'
019100140325     A                                      COLOR(BLU)
019200140325     A  40N41     OREA           4Y 0O 10 28EDTWRD('  :  ')
019300140325     A                                      COLOR(BLU)
019400140325     A            OREDRIFW      16A  O 11  1
019500140325     A                                 11 27'INVIO=Prosegui'
019600140325     A                                      COLOR(BLU)
019700140325     A          R ULOREW03R
019800140325     A*%%TS  SD  20140325  112356  EDPES       REL-V7R1M0  5770-WDS
019900140325     A                                      WINDOW(&W1RIG &W1COL 13 39 *NOMSGLI-
020000140325     A                                      N)
020100140325     A                                      OVERLAY
020200140325     A            W1RIG          3S 0P
020300140325     A            W1COL          3S 0P
020400140325     A                                  1 10'Orario servizio Ritiro'
020500140325     A                                      DSPATR(RI)
020600140325     A  42                              3  2'STIMATO   dalle'
020700140325     A                                      COLOR(RED)
020800140325     A  42        OREPRESD       4Y 0O  3 18EDTWRD('0 :  ')
020900140325     A                                      COLOR(RED)
021000140325     A  42                              3 24'alle'
021100140325     A                                      COLOR(RED)
021200140325     A  42        OREPRESA       4Y 0O  3 29EDTWRD('0 :  ')
021300140325     A                                      COLOR(RED)
021400140325     A                                  5  2'STANDARD  dalle'
021500140325     A                                      DSPATR(HI)
021600140325     A            ORESTISW       4Y 0O  5 18EDTWRD('0 :  ')
021700140325     A                                      DSPATR(HI)
021800140325     A                                  5 24'alle'
021900140325     A                                      DSPATR(HI)
022000140325     A            ORESTFSW       4Y 0O  5 29EDTWRD('0 :  ')
022100140325     A                                      DSPATR(HI)
022200140325     A                                  7  3'Accettazione RITIRI IN GIORNATA'
022300140325     A                                      COLOR(BLU)
022400140325     A                                      DSPATR(RI)
022500140325     A                                  8  2'Commissionati fino alle'
022600140325     A                                      COLOR(BLU)
022700140325     A            ORELRSC        4Y 0O  8 31EDTWRD('  :  ')
022800140325     A                                      COLOR(BLU)
022900140325     A                                  9  2'NON Commissionati fino alle'
023000140325     A                                      COLOR(BLU)
023100140325     A            ORELRNC        4Y 0O  9 31EDTWRD('  :  ')
023200140325     A                                      COLOR(BLU)
023300140325     A  50                             11  2'La merce parte SEMPRE'
023400140325     A                                      COLOR(RED)
023500140325     A                                      DSPATR(HI)
023600140325     A                                      DSPATR(BL)
023700140325     A  50                             12  2'il giorno successivo al ritiro'
023800140325     A                                      DSPATR(HI)
023900140325     A                                      COLOR(RED)
024000140325     A                                      DSPATR(BL)
024100140325     A            OREDRIFW      16A  O 13  1
024200140325     A                                 13 25'INVIO=Prosegui'
024300140325     A                                      COLOR(BLU)
024400140307     A          R ULOREASS
024500140307     A*%%TS  SD  20040302  091503  EDPMB       REL-V4R4M0  5769-PW1
024600140307     A                                      ASSUME
024700140307     A                                  1  3' '
