000100080718     A          R TRULKPJDS                 TEXT('DS PROCEDURA TRULKPJR')
000200080718     A            OKPJKPJBU    256A         TEXT('PASSAGGIO PARAMETRI')
000300080718     A            OKPJOPZ        3A         TEXT('OPZIONE SCELTA UTENTE')
