000100141209      *PARMS RSTDSP(*YES) DFRWRT(*YES) DECFMT(*JOB)
000200141209      */*PRM rstdsp(*yes) dfrwrt(*yes) decfmt(*job)
000300141209      *------------------------------------*
000400141209     A                                      DSPSIZ(24  80 *DS3 +
000500141209     A                                             27 132 *DS4)
000600141209     A                                      REF(CNDIZION)
000700141209     A                                      CHGINPDFT(HI UL)
000800141209     A                                      INDARA
000900141209     A                                      PRINT
001000141209      *------------------------------------*
001100141209     A          R ULPINT1
001200141209     A                                      WINDOW(ULPINW1)
001300141210     A                                      OVERLAY
001400141209      *
001500141209     A            RSUT      R           1  1REFFLD(RSUT       DDATIUTE)
001600141209     A                                  1 24' Controllo PINcode '
001700141209     A                                      DSPATR(UL)
001800141209     A                                      DSPATR(RI)
001900141209     A            T1CPGM    R           1 45REFFLD($PGM)
002000141209     A                                   + 1DATE(*YY)
002100141209     A                                      EDTCDE(Y)
002200141210     A*//         KNSIF     R           2  1REFFLD(KNSIF      KPJBA)
002300141210     A*//                                + 1USER
002400141210     A                                  2  1USER
002500141210     A*//                               2 45SYSNAME
002600141210     A                                  2 56TIME
002700141209      *------------------------------------*
002800141209     A          R ULPIND1
002900141209     A                                      WINDOW(ULPINW1)
003000141209     A                                      OVERLAY
003100141209     A                                      CA03
003200141210     A*//                                   CF06
003300141209      *
003400141209     A  28        V1DMSG        78   M
003500141209      *
003600141209     A                                  4  1'BRTcode ...........:'
003700141209     A            D1CBRT        19A  B   + 1TEXT('BRTcode')
003800141209     A     51                               DSPATR(PC)
003900141209      *------------------------------------*
004000141209     A          R ULPIND2
004100141209     A                                      WINDOW(ULPINW1)
004200141209     A                                      OVERLAY
004300141209     A                                      CA03
004400141210     A                                      CF06
004500141209      *
004600141209     A  28        V1DMSG        78   M
004700141209      *
004800141209     A                                  4  1'BRTcode ...........:'
004900141210     A            D2CBRT        19A      + 1TEXT('BRTcode')
005000141209     A                                      DSPATR(HI)
005100141209     A                                  6  1'PINcode ...........:'
005200141210     A            D2CPIN        15A  B   + 1TEXT('PINcode')
005300141212     A                                      CHECK(LC)
005400141209     A     52                               DSPATR(PC)
005500141209      *------------------------------------*
005600141209     A          R ULPINW1
005700141209     A                                      WINDOW(&W1ROW &W1COL +
005800141209     A                                             8 65 *NOMSGLIN)
005900141209     A                                      USRRSTDSP
006000141209      *
006100141209     A            W1ROW          3  0P      TEXT('RIGA POSIZIONAM. WND')
006200141209     A            W1COL          3  0P      TEXT('COL. POSIZIONAM. WND')
006300141209      *
006400141209     A                                  8  1'F3=Fine'
006500141209     A                                      COLOR(BLU)
006600141210     A  06                               + 3'F6=Conferma'
006700141209     A                                      COLOR(BLU)
006800141210     A N06                               + 3'Invio=Prosegui'
006900141210     A                                      COLOR(BLU)
007000141209      *------------------------------------*
007100141209     A          R ASSUME
007200141209     A                                      TEXT('Serve x preservare i-
007300141209     A                                      l video precedente')
007400141209     A                                      ASSUME
007500141209     A                                  1  2' '
