000100121211             PGM
000200121211             DCL        VAR(&USER) TYPE(*CHAR) LEN(10) VALUE(' ')
000300121211             RTVJOBA    USER(&USER)
000400991021
000500121211             CALL       PGM(TRUL83R) PARM(&USER ' ' ' ' 'FNLRO2R' +
000600121211                          'USER_XX' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' ' +
000700121211                          ' ' ' ')
000800030401
000900030402 FINE:
001000030402
001100990907             ENDPGM
