000100030403     A*---------------------------------------------------------------------*
000200030403     A*  FILE WRK OUTPUT X "NORMALIZZAZIONE" FILE GENERATO DA CPYSPLF *FCFC
000300030403     A*---------------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500030403     A          R TRULFCO0                  TEXT('FILE WRK OUTPUT')
000600030403     A*
000700030403     A            FCODTA       256A         TEXT('CAMPO DATI')
