000100020513      *PARMS MBR(*NONE)
000200020513      *------------------------------------------------------------------------*
000300020513      * CARICAMENTO P.O. GESTIBILI                                             *
000400020513      *------------------------------------------------------------------------*
000500020513     A                                      REF(AZORG00F)
000600020513      *
000700050608     A          R D31REC2                   TEXT('Parametri per caricamento Dis-
000800050608     A                                      tretti/Aree. gestibILI 2°DS')
000900020513      *----------------------------------
001000020513      * Dati di output :
001100020513      *----------------------------------
001200050608      * Schiera DISTRETTI gestibili
001300050608     A            O31DIG        20A         TEXT('Schiera DISTRETTI gestibili  -
001400050608     A                                      -max 20-')
001500050613      * T=GESTIBILI TUTTI I DISTRETTI ESISTENTI, ESCLUSA SEDE -9-
001600050613     A            O31GTD         1A         TEXT('T=GESTIBILI TUTTI I DISTRETTI-
001700050613     A                                      - ESCLUSA SEDE')
001800050608      * Schiera AREE      gestibili
001900050608     A            O31ARG       150A         TEXT('Schiera AREE gestibili  -
002000050608     A                                      -max 50-')
