000100011011      *PARMS MBR(*NONE)
000200011011     A*------------------------------------------------------------------------*
000300011011     A* CONTROLLO DECIMALI AMMESSI                                             *
000400011011     A*------------------------------------------------------------------------*
000500011012     A          R XDEC                      TEXT('Parametri per editazione camp-
000600011011     A                                      o numerico')
000700011011     A* Dati di input
000800011012     A            ICDNUM         9S 9       TEXT('Numero decimale da controllar-
000900011011     A                                      e')
001000011011     A            ICDNRD         2S 0       TEXT('Numero di cifre decimali amme-
001100011011     A                                      sse')
001200011011     A* Dati di output
001300011011     A            OCDESI         1          TEXT('Flag errore')
001400011011     A            OCDMSG        80          TEXT('Testo del messaggio di errore-
001500011011     A                                      ')
