000100030604     H DEBUG DECEDIT('0,') DATEDIT(*DMY/)
000200141002
000300161207     c
000400161207     c                   call      'XRTVSTK2T'
000500141008      *
000600161207     c                   seton                                        lr
000700161207
