000100130207             CMD        PROMPT('Concatenate PDF')
000200000000
000300130211             PARM       KWD(INPDF) TYPE(*PNAME) LEN(63) MIN(2) +
000400130211                          MAX(300) EXPR(*YES) PROMPT('Input PDF')
000500000000
000600130211             PARM       KWD(OUTPDF) TYPE(*PNAME) LEN(63) MIN(1) +
000700130211                          EXPR(*YES) PROMPT('Output PDF')
000800130207
000900130207             PARM       KWD(CPYTYPE) TYPE(*CHAR) LEN(7) RSTD(*YES) +
001000130207                          DFT(*SIMPLE) VALUES(*SIMPLE *SMART +
001100130207                          *FIELDS) PROMPT('COPY TYPE')
001200000000
001300130207             PARM       KWD(JDEBUG) TYPE(*CHAR) LEN(4) RSTD(*YES) +
001400130207                          DFT(*NO) VALUES(*YES *NO) PROMPT('Debug +
001500130207                          Java')
001600000000
