000100000000/* COMPILARE CON ALLOW(*BPGM *IPGM) */
000200000000
000300000000CMD PROMPT('Print PCL')
000400000000
000500000000             PARM       KWD(PCL) TYPE(*CHAR) LEN(100) MIN(1) +
000600000000                          CHOICE('PCL Path') +
000700130219                          PROMPT('PCL file')
000800000000
000900000000             PARM       KWD(OUTQ) TYPE(QUAL1) MIN(0) PROMPT('Output +
001000000000                          Queue')
001100000000
001200000000             PARM       KWD(USRDTA) TYPE(*NAME) LEN(10) MIN(0) +
001300000000                          PROMPT('Dati utente')
001400000000
001500000000             PARM       KWD(SPLFORMTYP) TYPE(*CHAR) LEN(10) +
001600130219                          PROMPT('FormType')
001700000000
001800000000             PARM       KWD(SPLDRAWER) TYPE(*CHAR) LEN(3) +
001900000000                          PROMPT('Drawer')
002000000000
002100000000             PARM       KWD(WSCST) TYPE(*CHAR) LEN(10) +
002200000000                          PROMPT('Wscst')
002300000000
002400000000             PARM       KWD(HOLD) TYPE(*CHAR) LEN(4) RSTD(*YES) +
002500000000                          DFT(*NO) VALUES(*YES *NO) PROMPT('Hold +
002600000000                          Spool')
002700000000
002800000000/* INFORMAZIONI DI RITORNO SULLO SPLF CREATO */
002900000000
003000000000             PARM       KWD(SPLFNAME) TYPE(*CHAR) LEN(10) +
003100000000                          RTNVAL(*YES) PROMPT('Splf Name')
003200000000             PARM       KWD(JOBNUMBER) TYPE(*CHAR) LEN(6) +
003300000000                          RTNVAL(*YES) PROMPT('Job Number')
003400000000             PARM       KWD(USERNAME) TYPE(*CHAR) LEN(10) +
003500000000                          RTNVAL(*YES) PROMPT('UserName')
003600000000             PARM       KWD(JOBNAME) TYPE(*CHAR) LEN(10) +
003700000000                          RTNVAL(*YES) PROMPT('Job Name')
003800000000             PARM       KWD(SPLFNUMBER) TYPE(*CHAR) LEN(6) +
003900000000                          RTNVAL(*YES) PROMPT('Spl fNumber')
004000000000
004100000000QUAL1: QUAL           TYPE(*NAME) LEN(10) DFT(*ALL) SPCVAL((*ALL))
004200000000       QUAL           TYPE(*NAME) LEN(10) SPCVAL((*LIBL) (*CURLIB) +
004300000000                       (' ' *LIBL)) PROMPT('Library Name')
