000010141010     A*%%TS  SD  20141010  112434  EDPRM       REL-V7R1M0  5770-WDS
000020000000     A**************************************************************************
000030000000     A*                                                                        *
000040000000     A*          INTERROGAZIONE BOLLE ARRIVI                                   *
000050000000     A*                                                                        *
000060000000     A**************************************************************************
000070141010     A*%%EC
000080141010     A                                      DSPSIZ(24 80 *DS3)
000090141010     A                                      CHGINPDFT(HI UL)
000100141010     A                                      PRINT
000110000000     A**************************************************************************
000120131107     A          R LRI6T01
000130111010     A*%%TS  SD  20111010  124707  EDPRM       REL-V6R1M0  5761-WDS
000140111010     A            V1CDSA        20A  O  1  2
000150111010     A            V1CTES        31A  O  1 28DSPATR(RI)
000160111010     A                                      DSPATR(UL)
000170131107     A                                  1 62'FNLRI6R'
000180111010     A                                  1 72DATE
000190111010     A                                      EDTCDE(Y)
000200111010     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000210111010     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000220111010     A                                  2 72TIME
000230111010     A                                  2 36'PERFECT ORDER'
000240111010     A                                      DSPATR(HI)
000250111010     A N87                                  DSPATR(ND)
000260000000     A**************************************************************************
000270131202     A          R LRI6D01
000280131202     A*%%TS  SD  20131202  120758  EDPES       REL-V7R1M0  5770-WDS
000290131202     A                                      CA03
000300131202     A  39                                  CF07
000310131202     A  39                                  CF14
000320131202     A                                      CF05
000330131202     A                                      CF10
000340131202     A                                      CSRLOC(H1RIGA     H1COLO)
000350131202     A                                      OVERLAY
000360131202     A  28        V1CMSG        78   M
000370131202     A            H1RIGA         3S 0H
000380131202     A            H1COLO         3S 0H
000390131202     A                                  3  2'Visualizza spediz. .:'
000400131202     A            V1CSSP         1A  B  3 24TEXT('tipo archivio')
000410131202     A                                      VALUES(' ' '1' '2' '3')
000420131202     A  56                                  DSPATR(PC)
000430131202     A                                  3 31'1=Da cons.  2=In cons.  3=consegna-
000440131202     A                                      te  '' ''=Tutte'
000450131202     A                                  4  2'Linea di arrivo ....:'
000460131202     A            V1CLNA    R        B  4 24REFFLD(ARBLNA *LIBL/FNARB00F)
000470131202     A                                      EDTCDE(Z)
000480131202     A                                      CHECK(RZ)
000490131202     A  41                                  DSPATR(PC)
000500131202     A            V1CDEA    R        O  4 31REFFLD(ORGDES *LIBL/AZORG00F)
000510131202     A                                      DSPATR(HI)
000520131202     A                                  5  2'-----------------------------------
000530131202     A                                      ------------------------------------
000540131202     A                                      ---------'
000550131202     A  97                              6  2'Causale Variazione.?:'
000560131202     A  97        V1CCVB         2A  B  6 24
000570131202     A  47
000580131202     AON90 97                               DSPATR(PC)
000590131202     A  97        V1DCVB        25A  O  6 31
000600131202     A                                  7  2'Barcode LDV ........:'
000610131202     A            V1CBARCODE    15Y 0B  7 24CHECK(RB)
000620131202     A                                      EDTCDE(Z)
000630131202     A  60                                  DSPATR(PC)
000640131202     A                                  7 45'BOLLA :'
000650131202     A            V1CLP2    R        B  7 53REFFLD(ARBLNP *LIBL/FNARB00F)
000660131202     A                                      CHECK(RZ)
000670131202     A  45
000680131202     AON28N97                               DSPATR(PC)
000690131202     A                                      EDTCDE(Z)
000700131202     A            V1CNRS    R        B  7 57REFFLD(ARBNRS *LIBL/FNARB00F)
000710131202     A                                      DSPATR(HI)
000720131202     A                                      CHECK(RZ)
000730131202     A                                      EDTCDE(Z)
000740131202     A                                  7 60'-'
000750131202     A            V1CNSP    R        B  7 62REFFLD(ARBNSP *LIBL/FNARB00F)
000760131202     A                                      CHECK(RB)
000770131202     A                                      EDTCDE(Z)
000780131202     A  44                                  DSPATR(PC)
000790131202     A                                  7 71'anno'
000800131202     A            V1CAAS    R        B  7 76REFFLD(ARBAAS *LIBL/FNARB00F)
000810131202     A                                      CHECK(RB)
000820131202     A                                      EDTCDE(Z)
000830131202     A  55                                  DSPATR(PC)
000840131202     A                                  8  2'-----------------------------------
000850131202     A                                      ----------------------------------X-
000860131202     A                                       contenuto'
000870131202     A                                  9  2'Naz/Prov Dest:'
000880131202     A            V1CNZD         3A  B  9 17
000890131202     A  57                                  DSPATR(PC)
000900131202     A            V1CPRD         2A  B  9 21
000910131202     A  50                                  DSPATR(PC)
000920131202     A                                  9 25'Destinatario'
000930131202     A            V1CRSD        30A  B  9 38TEXT('RAGIONE SOCIALE DESTINATARIO')
000940131202     A                                  9 70'(X)'
000950131202     A            V1CXRSD        1A  B  9 74VALUES(' ' 'X')
000960131202     A                                 10 25'Indirizzo...'
000970131202     A            V1CIND        30A  B 10 38
000980131202     A                                 10 70'(X)'
000990131202     A            V1CXIND        1A  B 10 74VALUES(' ' 'X')
001000131202     A                                 11 25'Località....'
001010131202     A            V1CLOD        30A  B 11 38
001020131202     A                                 11 70'(X)'
001030131202     A            V1CXLOD        1A  B 11 74VALUES(' ' 'X')
001040131202     A                                 12 25'Mittente ...'
001050131202     A            V1CRSM    R   30   B 12 38REFFLD(ARBRSM *LIBL/FNARB00F)
001060131202     A                                 12 70'(X)'
001070131202     A            V1CXRSM        1A  B 12 74VALUES(' ' 'X')
001080131202     A                                 13  2'Linea di partenza ..:'
001090131202     A            V1CLP1    R        B 13 24REFFLD(ARBLNP *LIBL/FNARB00F)
001100131202     A                                      CHECK(RB)
001110131202     A                                      EDTCDE(Z)
001120131202     A  42                                  DSPATR(PC)
001130131202     A            V1CDEP    R    9   O 13 31REFFLD(ORGDES *LIBL/AZORG00F)
001140131202     A                                 13 53'Spediz. '
001150131202     A                                 13 62'->se da consegn.(1)'
001160131202     A                                 14  2'Data ..........:  dal'
001170131202     A            V1CDTD         8Y 0B 14 24CHECK(RB)
001180131202     A  51                                  DSPATR(PC)
001190131202     A                                      EDTWRD('  /  /    ')
001200131202     A                                 14 36'al'
001210131202     A            V1CDTA         8Y 0B 14 39CHECK(RB)
001220131202     A  52                                  DSPATR(PC)
001230131202     A                                      EDTWRD('  /  /    ')
001240131202     A                                 14 53'Distinta'
001250131202     A                                 14 62'->se in consegna(2)'
001260131202     A                                 15 53'Consegna'
001270131202     A                                 15 62'->se consegnate (3)'
001280131202     A                                 16  2'-----------------------------------
001290131202     A                                      ------------------------------------
001300131202     A                                      ---------'
001310131202     A                                 17  2'"CHI SONO"..........:'
001320131202     A            V1CNOT        35A  B 17 24
001330131202     A  62                                  DSPATR(PC)
001340131202     A                                 18  2'Rifer.Partner estero:'
001350131202     A            V1CRPE        15A  B 18 24
001360131202     A  58                                  DSPATR(PC)
001370131202     A                                 18 45'O.R.M.:'
001380131202     A            V1CPOE    R        B 18 54REFFLD(ORMPOE *LIBL/FNORM00F)
001390131202     A                                      CHECK(RZ)
001400131202     A  53                                  DSPATR(PC)
001410131202     A                                      EDTCDE(Z)
001420131202     A                                 18 58'-'
001430131202     A            V1CNSR    R        B 18 60REFFLD(ORMNSR *LIBL/FNORM00F)
001440131202     A                                      DSPATR(HI)
001450131202     A                                      CHECK(RZ)
001460131202     A                                      EDTCDE(Z)
001470131202     A                                 18 63'-'
001480131202     A            V1CNOR    R        B 18 65REFFLD(ORMNOR *LIBL/FNORM00F)
001490131202     A                                      CHECK(RB)
001500131202     A                                      EDTCDE(Z)
001510131202     A  54                                  DSPATR(PC)
001520131202     A            V1CNRV    R        B 18 73REFFLD(ORMNRV *LIBL/FNORM00F)
001530131202     A                                      DSPATR(HI)
001540131202     A                                      CHECK(RZ)
001550131202     A                                      EDTCDE(Z)
001560131202     A                                 19  2'Rif.Mittente Numerico'
001570131202     A            V1CRMN        15Y 0B 19 24CHECK(RB)
001580131202     A                                      EDTCDE(Z)
001590131202     A  68                                  DSPATR(PC)
001600131202     A                                 19 45'Alfanumerico'
001610131202     A            V1CRMA        15A  B 19 60
001620131202     A                                 20  2'-----------------------------------
001630131202     A                                      ------------------------------------
001640131202     A                                      ---------'
001650131202     A                                 21  2'Serie ..........: dal'
001660131202     A            V1CPSD    R        B 21 24REFFLD(ARBNRS *LIBL/FNARB00F)
001670131202     A                                      TEXT('numero serie parzial. dal')
001680131202     A                                      CHECK(RZ)
001690131202     A  48                                  DSPATR(PC)
001700131202     A                                      EDTCDE(Z)
001710131202     A                                 21 32'al'
001720131202     A            V1CPSA    R        B 21 35REFFLD(ARBNRS *LIBL/FNARB00F)
001730131202     A                                      TEXT('numero serie parz. al')
001740131202     A                                      CHECK(RZ)
001750131202     A                                      EDTCDE(Z)
001760131202     A                                 21 45'Bolle in Fermo Deposito'
001770131202     A            V1CSFD         1A  B 21 69VALUES(' ' 'S')
001780131202     A                                 21 71'(S)'
001790131202     A                                 22  2'Segnacolli .....: dal'
001800131202     A            V1CSCD    R        B 22 24REFFLD(ARTNSC *LIBL/FNART00F)
001810131202     A                                      TEXT('numero segnacollo parz. dal')
001820131202     A                                      CHECK(RB)
001830131202     A                                      EDTCDE(Z)
001840131202     A  49                                  DSPATR(PC)
001850131202     A                                 22 32'al'
001860131202     A            V1CSCA    R        B 22 35REFFLD(ARTNSC *LIBL/FNART00F)
001870131202     A                                      TEXT('numero segnacollo parz. al')
001880131202     A                                      CHECK(RB)
001890131202     A                                      EDTCDE(Z)
001900131202     A                                 22 45'Fil.'
001910131202     A            V1CFLS    R    3 00B 22 50REFFLD(ARBFLS *LIBL/FNARB00F)
001920131202     A                                      EDTCDE(Z)
001930131202     A                                      CHECK(RB)
001940131202     A  46                                  DSPATR(PC)
001950131202     A                                 22 55'0=FilPartenza'
001960131202     A                                 23  2'Tipo Servizio.....? :'
001970131202     A            V1CTSP    R        B 23 24REFFLD(ARBTSP *LIBL/FNARB00F)
001980131202     A  43                                  DSPATR(PC)
001990131202     A            V01DTSP       10A  O 23 32
002000131202     A                                 24  2'F3=Fine'
002010131202     A  39                             24 12'F7=Bolle Partenza'
002020131202     A  39                             24 32'F14=Bolle Transito'
002030131202     A                                 24 53'F5=AltreParz'
002040131202     A  09                                  DSPATR(RI)
002050131202     A                                 24 68'F10=Pulizia'
002060000000     A**************************************************************************
002070131125     A          R LRI6S02                   SFL
002080131125     A*%%TS  SD  20131125  105308  EDPES       REL-V7R1M0  5770-WDS
002090131125     A  36                                  SFLNXTCHG
002100131125     A            V2CAAS    R        H      REFFLD(ARBAAS *LIBL/FNARB00F)
002110131121     A**          V2CLNP    R        H      REFFLD(ARBLNP *LIBL/FNARB00F)
002120131121     A**          V2CLNA         3S 0H
002130131125     A            V2CKSC         7S 0H
002140131125     A            V2CSCE         1A  B  5  2VALUES(' ' '1' '5')
002150131125     A  59                                  DSPATR(PC)
002160131125     A            V2CLNP    R        O  6  3REFFLD(ARBLNA *LIBL/FNARB00F)
002170131125     A            V2CLNA         3S 0O  5  4DSPATR(HI)
002180131125     A            V2CDSP    R        O  5  9REFFLD(ARBMGS *LIBL/FNARB00F)
002190131125     A                                      EDTWRD('  /  ')
002200131125     A                                      DSPATR(HI)
002210131125     A            V2CCBO         2A  O  5 15
002220131125     A            V2CRSM    R   10   O  5 18REFFLD(ARBRSM *LIBL/FNARB00F)
002230131125     A  11                                  DSPATR(HI)
002240131125     A            V2CRSD    R   20   O  5 29REFFLD(ARBRSD *LIBL/FNARB00F)
002250131125     A  14                                  DSPATR(HI)
002260131125     A            V2CDEST       17A  O  5 50
002270131125     A  14                                  DSPATR(HI)
002280131125     A            V2CFLA         3A  O  5 68TEXT('espresso/giacente')
002290131125     A            V2CTMC    R        O  5 72REFFLD(ARBTMC *LIBL/FNARB00F)
002300131125     A            V2CCOB         7A  O  5 74
002310131125     A  13                                  DSPATR(UL)
002320131125     A  62                                  DSPATR(HI)
002330131125     A            V2CNRS    R        O  6  7REFFLD(ARBNRS *LIBL/FNARB00F)
002340131125     A                                      EDTCDE(Z)
002350131125     A            V2CNSP    R        O  6 10REFFLD(ARBNSP *LIBL/FNARB00F)
002360131125     A                                      EDTCDE(Z)
002370131125     A                                  6 18'Segn.'
002380131125     A            V2CFLS    R     Y  O  6 24REFFLD(ARBFLS *LIBL/FNARB00F)
002390131125     A            V2CSEG        15   O  6 28
002400131125     A                                  6 44'RifMit'
002410131125     A            V2CRIFM       30A  O  6 51
002420000000     A**************************************************************************
002430131121     A          R LRI6C02                   SFLCTL(LRI6S02)
002440131121     A*%%TS  SD  20131121  092758  EDPES       REL-V7R1M0  5770-WDS
002450131121     A                                      SFLSIZ(0010)
002460131121     A                                      SFLPAG(0009)
002470131121     A                                      ROLLUP(37)
002480131121     A                                      CA03
002490131121     A                                      CF12
002500131121     A                                      OVERLAY
002510131121     A N35                                  SFLDSP
002520131121     A N35                                  SFLDSPCTL
002530131121     A  35                                  SFLCLR
002540131121     A                                      SFLDROP(CA09)
002550131121     A            REC2           4S 0H      SFLRCDNBR
002560131121     A  28        V1CMSG        78   M
002570131121     A  97
002580131121     AO 61                              3  2'1'
002590131121     A                                      DSPATR(HI)
002600131121     A**  87
002610131121     A**O 02                              4  2'5 LNA D.Sp. Nr.Spediz. Mittente
002620131121     A**                                      Destinatar. ---- Segnacolli ---  G
002630131121     A**                                       C Consegn'
002640131121     A**                                      DSPATR(UL)
002650131121     A**                                      DSPATR(HI)
002660131121     A                                  3  4'LNA'
002670131121     A                                      DSPATR(HI)
002680131121     A**  87
002690131121     A**O 02                              3 14'Linea Partenza'
002700131121     A** N02N87                           3 16'Linea Arrivo'
002710131121     A** N02N87     V1CLNA    R        O  3 29REFFLD(ARBLNA *LIBL/FNARB00F)
002720131121     A**                                      DSPATR(HI)
002730131121     A**  87
002740131121     A**O 02        V1CLP1    R        O  3 29REFFLD(ARBLNP *LIBL/FNARB00F)
002750131121     A**                                      DSPATR(HI)
002760131121     A**                                  3 33'-'
002770131121     A** N02N87     V2DLNA    R        O  3 35REFFLD(ORGDES *LIBL/AZORG00F)
002780131121     A**                                      DSPATR(HI)
002790131121     A**  87
002800131121     A**O 02        V2DLNP    R        O  3 35REFFLD(ORGDES *LIBL/AZORG00F)
002810131121     A**                                      DSPATR(HI)
002820131121     A  97                              3 56'CausaleV'
002830131121     A  97        V1CCVB         2A  O  3 65DSPATR(HI)
002840131121     A                                  3 71'Ult'
002850131121     A                                      DSPATR(HI)
002860131121     A** N02N87                           4  2'5 Spediz. Data  Mittente   D E S
002870131121     A                                  4  2'5 Sped  Data    Mittente   D E S T-
002880131121     A                                       I N A T A R I O                 GD-
002890131121     A                                       C Consegn'
002900131121     A                                      DSPATR(UL)
002910131121     A                                      DSPATR(HI)
002920000000     A**************************************************************************
002930131107     A          R LRI6Z02
002940941031     A                                      OVERLAY
002950941031     A                                 24  2'F3=Fine'
002960941031     A                                 24 16'F9=Altri Dati'
002970941031     A                                 24 36'F12=Ritorno'
002980000000     A**************************************************************************
002990131202     A          R LRI6D03
003000131202     A*%%TS  SD  20131202  202412  EDPES       REL-V7R1M0  5770-WDS
003010131202     A  63
003020131202     AO 61                                  CF01
003030131202     A                                      CA03
003040131202     A  95                                  CF05
003050131202     A  17                                  CF06
003060131202     A  67                                  CF07
003070131202     A  74 16                               CF08
003080131202     A                                      CA09
003090131202     A  98                                  CF10
003100131202     A  77                                  CF11
003110131202     A                                      CF12
003120131202     A  24                                  CF13
003130131202     A  03                                  CF14
003140131202     A  64                                  CF16
003150131202     A  17                                  CF17
003160131202     A  94                                  CF18
003170131202     A                                      CF19
003180131202     A                                      CF20
003190131202     A                                      CF21
003200131202     A  86                                  CF22
003210131202     A                                      CF24
003220131202     A  04                                  CF02
003230131202     A  22                                  CF04
003240131202     A                                      OVERLAY
003250131202     A            VHCAAC         4S 0H
003260131202     A            VHCFIL         3S 0H
003270131202     A            VHCNCA         7S 0H
003280131202     A  28        V1CMSG        78   M
003290131202     A            V3CAAS    R        H      REFFLD(ARBAAS *LIBL/FNARB00F)
003300131202     A            V3CFLS    R        H      REFFLD(ARBFLS *LIBL/FNARB00F)
003310131202     A            ATRTSP         1A  P
003320131202     A                                  3  3'SPEDIZIONE:'
003330131202     A                                      DSPATR(UL)
003340131202     A            V3CLPA         3S 0O  3 15DSPATR(HI)
003350131202     A                                      DSPATR(UL)
003360131202     A            V3CNRS    R        O  3 19REFFLD(ARBNRS *LIBL/FNARB00F)
003370131202     A                                      DSPATR(HI)
003380131202     A                                      DSPATR(UL)
003390131202     A                                      EDTCDE(Z)
003400131202     A                                  3 22'-'
003410131202     A            V3CNSP    R        O  3 24REFFLD(ARBNSP *LIBL/FNARB00F)
003420131202     A                                      TEXT('numero spedizione')
003430131202     A                                      DSPATR(HI)
003440131202     A                                      EDTCDE(2)
003450131202     A                                      DSPATR(UL)
003460131202     A                                  3 35'del'
003470131202     A            V3CDSP         8Y 0O  3 39TEXT('data spedizione (visualizzazi-
003480131202     A                                      one)')
003490131202     A                                      DSPATR(HI)
003500131202     A                                      EDTWRD('  /  /    ')
003510131202     A                                      DSPATR(UL)
003520131202     A                                  3 50'LnArrivo'
003530131202     A            V3CLNA    R        O  3 59REFFLD(ARBLNA *LIBL/FNARB00F)
003540131202     A                                      DSPATR(HI)
003550131202     A                                      DSPATR(UL)
003560131202     A            V3DLNA        18A  O  3 63TEXT('DESCRIZIONE FILIALE')
003570131202     A                                      DSPATR(HI)
003580131202     A            V1DAR8L       16A  O  4 31DSPATR(HI)
003590131202     A                                  4 50'Stampa LDV'
003600131202     A            V1DFST         3A  O  4 61
003610131202     A            V1DBAM         6A  O  4 66
003620131202     A  76                                  DSPATR(HI)
003630131202     A            V1DTSP         8A  O  4 73DSPATR(&ATRTSP)
003640131202     A                                  5  2'RITIRO Merce'
003650131202     A            V06DRT         6Y 0O  5 15TEXT('DATA BORDERO'' (PART.DOCUM.)')
003660131202     A                                      EDTWRD('  /  /  ')
003670131202     A                                  5 26'Num.'
003680131202     A            V7CNRT         1A  O  5 31
003690131202     A            V7DFPPR        3A  O  5 33
003700131202     A                                  5 37'Autotrasp.'
003710131202     A            V7CPDR         7A  O  5 48DSPATR(UL)
003720131202     A            V7DPDR        14A  O  5 56
003730131202     A  27        V1DFBC        10A  O  5 71DSPATR(RI)
003740131202     A                                  6  2'NUMERO  ORM.'
003750131202     A            V3CPOE         3Y 0O  6 15DSPATR(UL)
003760131202     A                                      EDTCDE(Z)
003770131202     A                                  6 19'-'
003780131202     A            V3CNSR    R        O  6 21REFFLD(ARBNRS *LIBL/FNARB00F)
003790131202     A                                      DSPATR(UL)
003800131202     A                                      EDTCDE(Z)
003810131202     A                                  6 24'-'
003820131202     A            V3CNOR         7Y 0O  6 26DSPATR(UL)
003830131202     A                                      EDTCDE(Z)
003840131202     A            V3CNRV         2Y 0O  6 34DSPATR(UL)
003850131202     A                                      EDTCDE(Z)
003860131202     A                                  6 37'FV.Partenza'
003870131202     A            V3CNFV    R        O  6 49REFFLD(ARBNFV *LIBL/FNARB00F)
003880131202     A                                      EDTCDE(2)
003890131202     A                                      DSPATR(UL)
003900131202     A                                  6 65'Borderò'
003910131202     A            V06DBR         6Y 0O  6 73TEXT('DATA BORDERO'' (PART.DOCUM.)')
003920131202     A                                      EDTWRD('  /  /  ')
003930131202     A                                  7  2'PARTENZA colli:'
003940131202     A                                  7 18'Primo'
003950131202     A            V06DPC         6Y 0O  7 26TEXT('DATA PARTENZA PRIMO COLLO')
003960131202     A                                      EDTWRD('  /  /  ')
003970131202     A                                  7 37'Arrivo   TRANSITO'
003980131202     A            V06DET         6Y 0O  7 55TEXT('DATA ENTRATA AL TRANSITO')
003990131202     A                                      EDTWRD('  /  /  ')
004000131202     A  16                              7 67'Invio'
004010131202     A  16        V06DT3         6Y 0O  7 73TEXT('DATA STAMPA MANIFEST')
004020131202     A                                      EDTWRD('  /  /  ')
004030131202     A                                  8 18'Ultimo'
004040131202     A            V06DUC         6Y 0O  8 26TEXT('DATA PARTENZA ULTIMO COLLO')
004050131202     A                                      EDTWRD('  /  /  ')
004060131202     A                                  8 37'Partenza TRANSITO'
004070131202     A            V06DUT         6Y 0O  8 55TEXT('DATA USCITA DAL TRANSITO')
004080131202     A                                      EDTWRD('  /  /  ')
004090131202     A                                  8 66'ARRIVO'
004100131202     A            V06DAM         6Y 0O  8 73TEXT('DATA ARRIVO MERCE A FILIALE A-
004110131202     A                                      RRIVO')
004120131202     A                                      EDTWRD('  /  /  ')
004130131202     A                                  9  2'CONSEGNA MERCE:'
004140131202     A                                      DSPATR(HI)
004150131202     A                                      DSPATR(UL)
004160131202     A                                  9 18'TEORICA'
004170131202     A            V06DCE         6Y 0O  9 26DSPATR(HI)
004180131202     A                                      TEXT('DATA CONSEGNA PREVISTA CLIENT-
004190131202     A                                      E')
004200131202     A                                      EDTWRD('  /  /  ')
004210131202     A  69                              9 37'REALE'
004220131202     A            V06DCM         6  0O  9 46TEXT('DATA USCITA DAL TRANSITO')
004230131202     A                                      EDTWRD('  /  /  ')
004240131202     A  69                                  DSPATR(RI)
004250131202     A            VIDHMC         5   O  9 56
004260131202     A  69                                  DSPATR(RI)
004270131202     A N69                                  DSPATR(HI)
004280131202     A                                  9 65'Ore Ritardo'
004290131202     A            VIDNRC         3Y 0O  9 77EDTCDE(Q)
004300131202     A                                      DSPATR(HI)
004310131202     A                                 10  2'-----------------------------------
004320131202     A                                      ------------------------------------
004330131202     A                                      ----------'
004340131202     A                                 11  2'Linea Partenza'
004350131202     A            V3CLNP    R        O 11 19REFFLD(ARBLNP *LIBL/FNARB00F)
004360131202     A                                      DSPATR(HI)
004370131202     A                                      DSPATR(UL)
004380131202     A            V3DLNP    R        O 11 24REFFLD(ORGDES *LIBL/AZORG00F)
004390131202     A                                 11 61'Sigla Operatore'
004400131202     A            V3CSOP         1A  O 11 79DSPATR(HI)
004410131202     A                                      DSPATR(UL)
004420131202     A                                 12  2'Codice   Bolla'
004430131202     A            V3CCBO    R        O 12 19REFFLD(ARBCBO *LIBL/FNARB00F)
004440131202     A                                      DSPATR(HI)
004450131202     A                                      DSPATR(UL)
004460131202     A            V3DCBO    R        O 12 24REFFLD(§3ADES *LIBL/DS3A)
004470131202     A                                 12 61'CodTrattam.Merce'
004480131202     A            V3CCTM         2A  O 12 78DSPATR(HI)
004490131202     A                                      DSPATR(UL)
004500131202     A                                 13  2'----------------- M     I     T   -
004510131202     A                                        T     E     N     T     E --------
004520131202     A                                      ---------'
004530131202     A            V3CKSC    R        O 14  2REFFLD(ARBKSC *LIBL/FNARB00F)
004540131202     A                                      DSPATR(HI)
004550131202     A                                      EDTCDE(Z)
004560131202     A                                      DSPATR(UL)
004570131202     A            V3CRSM    R        O 14 10REFFLD(ARBRSM *LIBL/FNARB00F)
004580131202     A                                      DSPATR(HI)
004590131202     A                                      DSPATR(UL)
004600131202     A  85                             14 49'Riferim.Partner:'
004610131202     A  85        V3CRPP        15A  O 14 66DSPATR(UL)
004620131202     A                                      DSPATR(HI)
004630131202     A            V3CINM    R        O 15 10REFFLD(ARBINM *LIBL/FNARB00F)
004640131202     A                                      DSPATR(HI)
004650131202     A                                      DSPATR(UL)
004660131202     A  08                             15 49'Lin.Arrivo e zona DPD:'
004670131202     A N08 85     V3CEST        28A  O 15 53
004680131202     A  08        V3CRTN         4A  O 15 72DSPATR(HI)
004690131202     A  08        V3CZON         2A  O 15 78DSPATR(HI)
004700131202     A            VIDXCO         1A  O 16  2DSPATR(HI)
004710131202     A            V3CCAM    R        O 16 10REFFLD(ARBCAM *LIBL/FNARB00F)
004720131202     A                                      DSPATR(HI)
004730131202     A                                      DSPATR(UL)
004740131202     A            V3CLOM    R        O 16 21REFFLD(ARBLOM *LIBL/FNARB00F)
004750131202     A                                      DSPATR(HI)
004760131202     A                                      DSPATR(UL)
004770131202     A            V3CPRM    R        O 16 58REFFLD(ARBPRM *LIBL/FNARB00F)
004780131202     A                                      DSPATR(HI)
004790131202     A                                      DSPATR(UL)
004800131202     A                                 16 62'Naz'
004810131202     A            V3CNZM    R        O 16 66REFFLD(ARBNZM *LIBL/FNARB00F)
004820131202     A                                      DSPATR(HI)
004830131202     A                                      DSPATR(UL)
004840131202     A                                 16 72'Antep'
004850131202     A            V3CFAP    R        O 16 78REFFLD(ARBFAP *LIBL/FNARB00F)
004860131202     A                                      DSPATR(HI)
004870131202     A                                      DSPATR(UL)
004880131202     A                                 17  2'PartIVA'
004890131202     A            V3CPIM    R        O 17 10REFFLD(ARBCPI *LIBL/FNARB00F)
004900131202     A                                      TEXT('partita iva mittente')
004910131202     A                                      DSPATR(UL)
004920131202     A                                 17 27'Codice Fiscale'
004930131202     A            V3CDFM        16A  O 17 42DSPATR(UL)
004940131202     A                                 17 60'Tel.'
004950131202     A            V3CTELM       16A  O 17 65DSPATR(UL)
004960131202     A            V3DFTM        28A  O 18  2
004970131202     A                                 18 58'Consegna a magazzino'
004980131202     A            V3CFDN    R    2   O 18 79REFFLD(ARBFDN FNARB00F)
004990131202     A                                      DSPATR(HI)
005000131202     A                                      DSPATR(UL)
005010131202     A                                 19  2'COLLI'
005020131202     A                                 19 10'----------'
005030131202     A                                 19 21'P   E   S   O'
005040131202     A                                 19 35'-----------'
005050131202     A                                 19 49'----- V   O   L   U   M   E ----'
005060131202     A                                 20 10'Bollett.'
005070131202     A                                 20 21'Da VDL'
005080131202     A                                 20 29'Colli'
005090131202     A                                 20 35'Boll/Variat'
005100131202     A                                 20 49'Bollett.'
005110131202     A                                 20 59'Da VDL Colli'
005120131202     A                                 20 72'Fatturare'
005130131202     A            VIDNCL    R        O 21  2REFFLD(ARBNCL *LIBL/FNARB00F)
005140131202     A                                      DSPATR(HI)
005150131202     A                                      EDTCDE(Z)
005160131202     A                                      DSPATR(UL)
005170131202     A            VIDPKB    R        O 21 10REFFLD(ARBPKB *LIBL/FNARB00F)
005180131202     A                                      DSPATR(HI)
005190131202     A                                      EDTCDE(4)
005200131202     A                                      DSPATR(UL)
005210131202     A            VIDPKC    R        O 21 20REFFLD(ARBPKC *LIBL/FNARB00F)
005220131202     A                                      DSPATR(HI)
005230131202     A                                      EDTCDE(4)
005240131202     A                                      DSPATR(UL)
005250131202     A            VIDNCP    R        O 21 29REFFLD(ARBNCP *LIBL/FNARB00F)
005260131202     A                                      DSPATR(HI)
005270131202     A                                      DSPATR(UL)
005280131202     A                                      EDTCDE(Z)
005290131202     A            VIDPKF    R        O 21 37REFFLD(ARBPKB *LIBL/FNARB00F)
005300131202     A                                      DSPATR(HI)
005310131202     A                                      EDTCDE(4)
005320131202     A                                      DSPATR(UL)
005330131202     A            VIDFVB         1A  O 21 49DSPATR(HI)
005340131202     A            VIDVLB    R        O 21 51REFFLD(ARBVLF *LIBL/FNARB00F)
005350131202     A                                      DSPATR(HI)
005360131202     A                                      DSPATR(UL)
005370131202     A                                      EDTCDE(4)
005380131202     A            VIDVLC    R        O 21 59REFFLD(ARBVLC *LIBL/FNARB00F)
005390131202     A                                      DSPATR(HI)
005400131202     A                                      DSPATR(UL)
005410131202     A                                      EDTCDE(4)
005420131202     A            VIDNCR    R        O 21 66REFFLD(ARBNCR *LIBL/FNARB00F)
005430131202     A                                      DSPATR(HI)
005440131202     A                                      DSPATR(UL)
005450131202     A                                      EDTCDE(Z)
005460131202     A            VIDFVF    R        O 21 73REFFLD(ARBFVF *LIBL/FNARB00F)
005470131202     A                                      DSPATR(HI)
005480131202     A                                      DSPATR(UL)
005490131202     A            VIDVLF    R        O 21 75REFFLD(ARBVLF *LIBL/FNARB00F)
005500131202     A                                      DSPATR(HI)
005510131202     A                                      DSPATR(UL)
005520131202     A                                      EDTCDE(4)
005530131202     A                                 22  2'BANCALI'
005540131202     A            VIDNBA         2Y 0O 22 10DSPATR(UL)
005550131202     A                                      DSPATR(HI)
005560131202     A                                      EDTCDE(Z)
005570131202     A            VIDTBA        10A  O 22 13DSPATR(UL)
005580131202     A                                      DSPATR(HI)
005590131202     A                                 22 24'/'
005600131202     A            VIDNB2         2Y 0O 22 26DSPATR(UL)
005610131202     A                                      DSPATR(HI)
005620131202     A                                      EDTCDE(Z)
005630131202     A            VIDTB2        10A  O 22 29DSPATR(UL)
005640131202     A                                      DSPATR(HI)
005650131202     A                                 22 41'Segn.'
005660131202     A            VIDFLS         3A  O 22 49DSPATR(HI)
005670131202     A                                      DSPATR(UL)
005680131202     A            VIDNCD         7Y 0O 22 54DSPATR(HI)
005690131202     A                                      DSPATR(UL)
005700131202     A                                      EDTCDE(Z)
005710131202     A                                 22 62'/'
005720131202     A            VIDNCA         7Y 0O 22 64DSPATR(HI)
005730131202     A                                      DSPATR(UL)
005740131202     A                                      EDTCDE(Z)
005750131202     A  92        LEGAME        58A  O 23  2DSPATR(RI)
005760131202     A                                 23 73'F3=Fine'
005770131202     A            FD03          62A  O 24  2
005780131202     A            F24D03        16A  O 24 65
005790941027     A**************************************************************************
005800131202     A          R LRI6D04
005810131202     A*%%TS  SD  20131202  121555  EDPES       REL-V7R1M0  5770-WDS
005820131202     A  63
005830131202     AO 61                                  CF01
005840131202     A  95                                  CF05
005850131202     A  17                                  CF06
005860131202     A  67                                  CF07
005870131202     A  74 16                               CF08
005880131202     A                                      CA09
005890131202     A  98                                  CF10
005900131202     A  77                                  CF11
005910131202     A                                      CF12
005920131202     A  24                                  CF13
005930131202     A  03                                  CF14
005940131202     A  64                                  CF16
005950131202     A  17                                  CF17
005960131202     A  94                                  CF18
005970131202     A                                      CF19
005980131202     A                                      CF20
005990131202     A                                      CF21
006000131202     A  86                                  CF22
006010131202     A                                      CF24
006020131202     A  04                                  CF02
006030131202     A  22                                  CF04
006040131202     A                                      OVERLAY
006050131202     A            ATRTSP         1A  P
006060131202     A  28        V1CMSG        78   M
006070131202     A                                  3  3'SPEDIZIONE:'
006080131202     A                                      DSPATR(UL)
006090131202     A            V3CLPA         3S 0O  3 15DSPATR(UL)
006100131202     A                                      DSPATR(HI)
006110131202     A            V3CNRS         2Y 0O  3 19DSPATR(UL)
006120131202     A                                      DSPATR(HI)
006130131202     A                                      EDTCDE(Z)
006140131202     A                                  3 22'-'
006150131202     A            V3CNSP         7Y 0O  3 24EDTCDE(2)
006160131202     A                                      DSPATR(UL)
006170131202     A                                      DSPATR(HI)
006180131202     A                                  3 35'del'
006190131202     A            V3CDSP         8Y 0O  3 39EDTWRD('  /  /    ')
006200131202     A                                      DSPATR(HI)
006210131202     A                                      DSPATR(UL)
006220131202     A                                  3 50'LnArrivo'
006230131202     A            V3CLNA    R        O  3 59REFFLD(ARBLNA *LIBL/FNARB00F)
006240131202     A                                      DSPATR(HI)
006250131202     A                                      DSPATR(UL)
006260131202     A            V3DLNA        18A  O  3 63DSPATR(HI)
006270131202     A                                      TEXT('DESCRIZIONE FILIALE')
006280131202     A                                  4  2'Mittente'
006290131202     A            V4CRSM        35A  O  4 11TEXT('RAG.SOCIALE MITTENTE 1')
006300131202     A                                  4 50'Tel'
006310131202     A            V3CTELM       16A  O  4 54
006320131202     A            V1DTSP         8A  O  4 73DSPATR(&ATRTSP)
006330131202     A            V3CKSC         7S 0O  5  3
006340131202     A            V3CLOM    R        O  5 11REFFLD(ARBLOM *LIBL/FNARB00F)
006350131202     A            V3CPRM    R        O  5 50REFFLD(ARBPRM *LIBL/FNARB00F)
006360131202     A            V3CNZM    R        O  5 53REFFLD(ARBNZM *LIBL/FNARB00F)
006370131202     A  27        V1DFBC        10A  O  5 71DSPATR(RI)
006380131202     A                                  6  2'Destinat'
006390131202     A            V4CNOM        70A  O  6 11DSPATR(HI)
006400131202     A                                      DSPATR(UL)
006410131202     A N33        VIDKSC    R        O  7  3REFFLD(ARBKSC *LIBL/FNARB00F)
006420131202     A                                      DSPATR(HI)
006430131202     A                                      EDTCDE(Z)
006440131202     A            V4CIND    R        O  7 11REFFLD(ARBIND *LIBL/FNARB00F)
006450131202     A                                      DSPATR(HI)
006460131202     A                                      DSPATR(UL)
006470131202     A                                  7 62'Inl'
006480131202     A                                  7 67'P.Iva/Cd.Fisc'
006490131202     A            V4CCAD    R        O  8 10REFFLD(ARBCAD *LIBL/FNARB00F)
006500131202     A                                      DSPATR(HI)
006510131202     A                                      DSPATR(UL)
006520131202     A            V4CLOD    R        O  8 20REFFLD(ARBLOD *LIBL/FNARB00F)
006530131202     A                                      DSPATR(HI)
006540131202     A                                      DSPATR(UL)
006550131202     A            V4CPRD    R        O  8 56REFFLD(ARBPRD *LIBL/FNARB00F)
006560131202     A                                      DSPATR(HI)
006570131202     A                                      DSPATR(UL)
006580131202     A            V4CNZD    R        O  8 59REFFLD(ARBNZD *LIBL/FNARB00F)
006590131202     A                                      DSPATR(HI)
006600131202     A                                      DSPATR(UL)
006610131202     A            V4CFIN    R        O  8 63REFFLD(ARBFIN *LIBL/FNARB00F)
006620131202     A                                      DSPATR(HI)
006630131202     A                                      DSPATR(UL)
006640131202     A            V4CPID    R        O  8 65REFFLD(ARBCPI *LIBL/FNARB00F)
006650131202     A                                      DSPATR(HI)
006660131202     A                                      DSPATR(UL)
006670131202     A                                  9  2'Refer.Consegna'
006680131202     A            V4CREF        35A  O  9 20DSPATR(HI)
006690131202     A                                      DSPATR(UL)
006700131202     A            V4CDFD        16A  O  9 65DSPATR(HI)
006710131202     A                                      DSPATR(UL)
006720131202     A                                 10  2'Telefono'
006730131202     A            V4CTELD       16A  O 10 20DSPATR(HI)
006740131202     A                                      DSPATR(UL)
006750131202     A  60                             10 37'Alert Destinatario'
006760131202     A  60        V4CEMD         2A  O 10 56DSPATR(HI)
006770131202     A  60        V4CEMW         1A  B 10 59VALUES(' ' '?')
006780131202     A  60                             10 61'?'
006790131202     A            DESFNS        15A  O 10 63DSPATR(BL)
006800131202     A                                 11  7'Riferimenti Mittente'
006810131202     A                                 11 36'Natura Merce'
006820131202     A                                 11 52'-LNP Ser Numero SEGNACOLLI-'
006830131202     A            VIDRMN    R        O 12  2REFFLD(ARBRMN *LIBL/FNARB00F)
006840131202     A                                      DSPATR(HI)
006850131202     A                                      EDTCDE(Z)
006860131202     A                                      DSPATR(UL)
006870131202     A            VIDRMA    R        O 12 19REFFLD(ARBRMA *LIBL/FNARB00F)
006880131202     A                                      DSPATR(HI)
006890131202     A                                      DSPATR(UL)
006900131202     A            VIDNAS    R        O 12 36REFFLD(ARBNAS *LIBL/FNARB00F)
006910131202     A                                      DSPATR(HI)
006920131202     A                                      DSPATR(UL)
006930131202     A            VIDFLS    R     A  O 12 53REFFLD(ARBFLS *LIBL/FNARB00F)
006940131202     A                                      DSPATR(HI)
006950131202     A                                      DSPATR(UL)
006960131202     A            V4CNRS    R        O 12 57REFFLD(ARBNRS *LIBL/FNARB00F)
006970131202     A                                      DSPATR(HI)
006980131202     A                                      DSPATR(UL)
006990131202     A                                      EDTCDE(Z)
007000131202     A            VIDNCD    R        O 12 61REFFLD(ARBNCD *LIBL/FNARB00F)
007010131202     A                                      DSPATR(HI)
007020131202     A                                      EDTCDE(Z)
007030131202     A                                      DSPATR(UL)
007040131202     A                                 12 69'/'
007050131202     A            VIDNCA    R        O 12 71REFFLD(ARBNCD *LIBL/FNARB00F)
007060131202     A                                      EDTCDE(Z)
007070131202     A                                      DSPATR(HI)
007080131202     A                                      DSPATR(UL)
007090131202     A                                 13  2'Importo da Assicurare'
007100131202     A                                 13 31'Q.tà da Fatturare'
007110131202     A                                 13 56'Valore Merce Dichiarato'
007120131202     A            VIDIAS    R        O 14  2REFFLD(ARBIAS *LIBL/FNARB00F)
007130131202     A                                      DSPATR(HI)
007140131202     A                                      EDTCDE(2)
007150131202     A            VIDVAS    R        O 14 20REFFLD(ARBVAS *LIBL/FNARB00F)
007160131202     A                                      DSPATR(HI)
007170131202     A            VIDQFT    R     Y  O 14 31REFFLD(ARBQFT *LIBL/FNARB00F)
007180131202     A                                      EDTCDE(2)
007190131202     A                                      DSPATR(HI)
007200131202     A            VIDVMD    R        O 14 56REFFLD(ARBVMD *LIBL/FNARB00F)
007210131202     A                                      DSPATR(HI)
007220131202     A                                      EDTCDE(2)
007230131202     A            VIDVAD    R        O 14 75REFFLD(ARBVAD *LIBL/FNARB00F)
007240131202     A                                      DSPATR(HI)
007250131202     A                                 15  2'------C/Assegno-------Ben-'
007260131202     A                                 15 32'------Tariffa-------'
007270131202     A                                 15 56'----Mittente Originale---'
007280131202     A            VIDTIC    R        O 16  2REFFLD(AR9TIC *LIBL/FIAR900F)
007290131202     A                                      DSPATR(HI)
007300131202     A            VIDCAS    R        O 16  5REFFLD(AR9CAS *LIBL/FIAR900F)
007310131202     A                                      DSPATR(HI)
007320131202     A                                      EDTCDE(4)
007330131202     A            VIDVCA    R        O 16 20REFFLD(AR9VCA *LIBL/FIAR900F)
007340131202     A                                      DSPATR(HI)
007350131202     A  65                             16 24'?'
007360131202     A  65        VIDBEN         1A  B 16 26VALUES(' ' '?')
007370131202     A            VIDCTR    R        O 16 32REFFLD(ARBCTR *LIBL/FNARB00F)
007380131202     A                                      DSPATR(HI)
007390131202     A            DEFCTR        15A  O 16 37TEXT('DESCRIZIONE')
007400131202     A            VIDRMO    R        O 16 56REFFLD(ARBRMO *LIBL/FNARB00F)
007410131202     A                                      DSPATR(HI)
007420131202     A                                 17  2'-------CONSEGNA RICHIESTA--------'
007430131202     A                                 17 37'GG.Chiusura'
007440131202     A                                 17 51'FermoDep'
007450131202     A                                 17 61'BolRientro'
007460131202     A  10                                  DSPATR(HI)
007470131202     A            VIDFBR    R    2   O 17 73REFFLD(ARBFBR *LIBL/FNARB00F)
007480131202     A                                      DSPATR(HI)
007490131202     A                                      DSPATR(UL)
007500131202     A                                 17 77'Zona'
007510131202     A            VIDTCR    R   11   O 18  3REFFLD(ARBTCR *LIBL/FNARB00F)
007520131202     A                                      DSPATR(HI)
007530131202     A            VIDDCR    R        O 18 15REFFLD(ARBDCR *LIBL/FNARB00F)
007540131202     A                                      DSPATR(HI)
007550131202     A                                      EDTWRD('  /  /    ')
007560131202     A                                 18 26'Ore'
007570131202     A            VIDHCR    R        O 18 30REFFLD(ARBHCR *LIBL/FNARB00F)
007580131202     A                                      DSPATR(HI)
007590131202     A                                      EDTWRD('  :  ')
007600131202     A            VIDGC1    R        O 18 39REFFLD(ARBGC1 *LIBL/FNARB00F)
007610131202     A                                      DSPATR(HI)
007620131202     A            VIDGC2    R        O 18 44REFFLD(ARBGC2 *LIBL/FNARB00F)
007630131202     A                                      DSPATR(HI)
007640131202     A            VIDFFD         3A  O 18 51DSPATR(HI)
007650131202     A                                      TEXT('FLAG FERMO DEPOSITO: S=SI')
007660131202     A                                 18 55'?'
007670131202     A            VIDDEC_F       1A  B 18 57VALUES(' ' '?')
007680131202     A                                 18 61'FrFrontiera'
007690131202     A  73                                  DSPATR(HI)
007700131202     A            VIDFFR    R    2   O 18 73REFFLD(ARBFBR *LIBL/FNARB00F)
007710131202     A                                      DSPATR(HI)
007720131202     A                                      DSPATR(UL)
007730131202     A            VIDZNC    R        O 18 77REFFLD(ARBZNC *LIBL/FNARB00F)
007740131202     A                                      EDTCDE(Z)
007750131202     A                                      DSPATR(HI)
007760131202     A            VIDBVA         1A  O 18 80TEXT('FLAG "COLLI DI VALORE"')
007770131202     A  26                             19  2'Proposta:'
007780131202     A                                      DSPATR(UL)
007790131202     A  26        V4CTCRPR       2A  O 19 12DSPATR(HI)
007800131202     A  26        V08DCRPR       8Y 0O 19 15DSPATR(HI)
007810131202     A                                      TEXT('DATA CONSEGNA RICHIESTA')
007820131202     A                                      EDTWRD('  /  /    ')
007830131202     A  26                             19 26'Ore'
007840131202     A  26        V4CHCRPR  R        O 19 30REFFLD(ARBHCR *LIBL/FNARB00F)
007850131202     A                                      EDTWRD('  :  ')
007860131202     A                                 19 39'Partico'
007870131202     A                                      DSPATR(UL)
007880131202     A                                 19 47'-C/ASS-'
007890131202     A                                 19 56'Giacenza'
007900131202     A                                 19 65'Consegna'
007910131202     A                                 19 74'-Varie-'
007920131202     A  26                             20  5'ricevente'
007930131202     A  26        V4CPRUPR      10A  O 20 15
007940131202     A  26        V4CDIMPR       4Y 0O 20 26EDTWRD('  /  ')
007950131202     A  26        V4COIMPR       4Y 0O 20 32EDTWRD('  :  ')
007960131202     A                                 20 39'larità:'
007970131202     A                                      DSPATR(UL)
007980131202     A  41                             20 47'?'
007990131202     A  41        V4IGCA         1A  B 20 49VALUES(' ' '?')
008000131202     A            V4CGCA    R        O 20 52REFFLD(AR9GCA *LIBL/FIAR900F)
008010131202     A                                      DSPATR(HI)
008020131202     A  42                             20 56'?'
008030131202     A  42        V4IGGA         1A  B 20 58VALUES(' ' '?')
008040131202     A            V4CGGA    R        O 20 61REFFLD(ARBGGA *LIBL/FNARB00F)
008050131202     A                                      DSPATR(HI)
008060131202     A  43                             20 65'?'
008070131202     A  43        V4IGMA         1A  B 20 67VALUES(' ' '?')
008080131202     A            V4CGMA    R        O 20 70REFFLD(ARBGMA *LIBL/FNARB00F)
008090131202     A                                      DSPATR(HI)
008100131202     A  44                             20 74'?'
008110131202     A  44        V4IGVA         1A  B 20 76VALUES(' ' '?')
008120131202     A            V4CGVA    R        O 20 79REFFLD(ARBGVA *LIBL/FNARB00F)
008130131202     A                                      DSPATR(HI)
008140131202     A                                 21  2'------------------------- N o t e -
008150131202     A                                        P a r t e n z a ------------------
008160131202     A                                      ----'
008170131202     A            V4CNO1    R        O 22  2REFFLD(AR4NOT *LIBL/FIAR400F)
008180131202     A                                      DSPATR(HI)
008190131202     A            V4CNO2    R        O 22 40REFFLD(AR4NOT *LIBL/FIAR400F)
008200131202     A                                      DSPATR(HI)
008210131202     A  92        LEGAME        58A  O 23  2DSPATR(RI)
008220131202     A            FD04          62A  O 24  2
008230131202     A            F24D04        16A  O 24 65
008240951220     A**************************************************************************
008250131107     A          R LRI6S05                   SFL
008260070406     A*%%TS  SD  20070406  111213  EDPES       REL-V5R3M0  5722-WDS
008270070406     A            VS5DES    R        O 20  2REFFLD(§7KDES DS7K)
008280070406     A            VS5NOT    R        O 20 31REFFLD(AR4NOT *LIBL/FIAR400F)
008290070406     A                                      DSPATR(HI)
008300000000     A**************************************************************************
008310131202     A          R LRI6C05                   SFLCTL(LRI6S05)
008320131202     A*%%TS  SD  20131202  202412  EDPES       REL-V7R1M0  5770-WDS
008330131202     A                                      SFLSIZ(0005)
008340131202     A                                      SFLPAG(0004)
008350131202     A  63
008360131202     AO 61                                  CF01
008370131202     A  95                                  CF05
008380131202     A  17                                  CF06
008390131202     A  67                                  CF07
008400131202     A  74 16                               CF08
008410131202     A                                      CA09
008420131202     A  98                                  CF10
008430131202     A  77                                  CF11
008440131202     A                                      CF12
008450131202     A  24                                  CF13
008460131202     A  03                                  CF14
008470131202     A  64                                  CF16
008480131202     A  17                                  CF17
008490131202     A                                      CF19
008500131202     A                                      CF20
008510131202     A                                      CF21
008520131202     A  86                                  CF22
008530131202     A                                      CF24
008540131202     A  04                                  CF02
008550131202     A                                      CF04
008560131202     A                                      OVERLAY
008570131202     A  71                                  SFLDSP
008580131202     A  72                                  SFLDSPCTL
008590131202     A N72                                  SFLCLR
008600131202     A  71                                  SFLEND
008610131202     A            REC5           4S 0H      SFLRCDNBR
008620131202     A  28        V1CMSG        78   M
008630131202     A            ATRPDA         1A  P
008640131202     A            ATRTSP         1A  P
008650131202     A                                  3  3'SPEDIZIONE:'
008660131202     A                                      DSPATR(UL)
008670131202     A            V3CLPA         3S 0O  3 15DSPATR(HI)
008680131202     A                                      DSPATR(UL)
008690131202     A            V3CNRS    R        O  3 19REFFLD(ARBNRS *LIBL/FNARB00F)
008700131202     A                                      DSPATR(HI)
008710131202     A                                      DSPATR(UL)
008720131202     A                                      EDTCDE(Z)
008730131202     A                                  3 22'-'
008740131202     A            V3CNSP    R        O  3 24REFFLD(ARBNSP *LIBL/FNARB00F)
008750131202     A                                      TEXT('numero spedizione')
008760131202     A                                      DSPATR(HI)
008770131202     A                                      EDTCDE(2)
008780131202     A                                      DSPATR(UL)
008790131202     A                                  3 35'del'
008800131202     A            V3CDSP         8Y 0O  3 39TEXT('data spedizione (visualizzazi-
008810131202     A                                      one)')
008820131202     A                                      DSPATR(HI)
008830131202     A                                      EDTWRD('  /  /    ')
008840131202     A                                      DSPATR(UL)
008850131202     A                                  3 50'LnArrivo'
008860131202     A            V3CLNA    R        O  3 59REFFLD(ARBLNA *LIBL/FNARB00F)
008870131202     A                                      DSPATR(HI)
008880131202     A                                      DSPATR(UL)
008890131202     A            V3DLNA        18A  O  3 63TEXT('DESCRIZIONE FILIALE')
008900131202     A                                      DSPATR(HI)
008910131202     A            V1DTSP         8A  O  4 73DSPATR(&ATRTSP)
008920131202     A                                  5  2'ABILITAZIONI'
008930131202     A                                      DSPATR(UL)
008940131202     A                                      DSPATR(HI)
008950140109     A            V3CGES        58A  O  5 15DSPATR(HI)
008960140109     A                                  5 74'dett?'
008970140109     A            V3CGESD        1A  B  5 80
008980131202     A                                  6  2'Codice Autotrasportatore '
008990131202     A            VIDPDC    R        O  6 31REFFLD(ARBPDC *LIBL/FNARB00F)
009000131202     A                                      DSPATR(HI)
009010131202     A                                      EDTCDE(Z)
009020131202     A            DESPDC        28A  O  6 39DSPATR(HI)
009030131202     A  27        V1DFBC        10A  O  6 71DSPATR(RI)
009040131202     A                                  7  2'DISTINTA : Del...........'
009050131202     A            VIDDDC    R        O  7 28REFFLD(ARBDDC *LIBL/FNARB00F)
009060131202     A                                      EDTWRD('  /  /    ')
009070131202     A                                      DSPATR(HI)
009080131202     A                                  7 39'Num'
009090131202     A            ARBNDC    R        O  7 43REFFLD(ARBNDC *LIBL/FNARB00F)
009100131202     A                                      DSPATR(HI)
009110131202     A                                      EDTCDE(2)
009120131202     A            V7DFPP         3A  O  7 53DSPATR(HI)
009130131202     A            VIDPDA         6A  O  7 57DSPATR(&ATRPDA)
009140131202     A  88                              7 64'Assegnaz.'
009150131202     A  88        V5DNGD         7A  O  7 74DSPATR(HI)
009160131202     A                                  8  2'Tipo Mancata Consegna....'
009170131202     A            VIDTMC    R        O  8 28REFFLD(ARBTMC *LIBL/FNARB00F)
009180131202     A                                      DSPATR(HI)
009190131202     A            V5DTMC    R   44   O  8 30REFFLD(§2ADES *LIBL/DS2A)
009200131202     A                                  9  2'C O N S E G N A:'
009210131202     A                                      DSPATR(UL)
009220131202     A                                      DSPATR(HI)
009230131202     A                                  9 47'Numero tentativi'
009240131202     A            VIDNTC    R        O  9 75REFFLD(ARBNTC *LIBL/FNARB00F)
009250131202     A                                      DSPATR(HI)
009260131202     A                                      EDTCDE(Z)
009270131202     A                                 10  2'TEORICA'
009280131202     A            V08DCE    R        O 10 10REFFLD(ARBDCE *LIBL/FNARB00F)
009290131202     A                                      EDTWRD('  /  /    ')
009300131202     A                                      DSPATR(HI)
009310131202     A  69                             10 22'REALE'
009320131202     A            V08DCM    R        O 10 28REFFLD(ARBDCM *LIBL/FNARB00F)
009330131202     A                                      EDTWRD('  /  /    ')
009340131202     A  69                                  DSPATR(RI)
009350131202     A            VIDHMC         5   O 10 41
009360131202     A  69                                  DSPATR(RI)
009370131202     A N69                                  DSPATR(HI)
009380131202     A                                 10 47'Ore ritardo.....'
009390131202     A            VIDNRC    R        O 10 72REFFLD(ARBNRC *LIBL/FNARB00F)
009400131202     A                                      DSPATR(HI)
009410131202     A                                      EDTCDE(Q)
009420131202     A                                 11  2'Consegne  Particolari ...'
009430131202     A            ARBTC1    R        O 11 28REFFLD(ARBTC1 *LIBL/FNARB00F)
009440131202     A                                      DSPATR(HI)
009450131202     A            V5DTC1    R   16   O 11 30REFFLD(§1PDES *LIBL/DS1P)
009460131202     A                                      DSPATR(HI)
009470131202     A            ARBTC2    R        O 11 64REFFLD(ARBTC2 *LIBL/FNARB00F)
009480131202     A                                      DSPATR(HI)
009490131202     A            V5DTC2    R   14   O 11 66REFFLD(§1PDES *LIBL/DS1P)
009500131202     A                                      DSPATR(HI)
009510131202     A                                 12  2'Prima  Consegna  Parziale'
009520131202     A            VIDDCP    R        O 12 28REFFLD(ARBDCP *LIBL/FNARB00F)
009530131202     A                                      EDTWRD('  /  /    ')
009540131202     A                                      DSPATR(HI)
009550131202     A                                 12 47'Consegna Anomala'
009560131202     A            ARBCCA    R        O 12 64REFFLD(ARBCCA *LIBL/FNARB00F)
009570131202     A                                      DSPATR(HI)
009580131202     A            DESCCA        14A  O 12 66DSPATR(HI)
009590131202     A  29
009600131202     AON33
009610131202     AO 33 38                          13  2'INCASSI -->'
009620131202     A                                      DSPATR(UL)
009630131202     A                                      DSPATR(HI)
009640131202     A  29                             13 14'Contrassegno:'
009650131202     A                                      DSPATR(UL)
009660131202     A  29        VIDICC    R    2   O 13 28REFFLD(ARBICC *LIBL/FNARB00F)
009670131202     A                                      DSPATR(HI)
009680131202     A N33
009690131202     AO 33 38                          13 47'Fattura........:'
009700131202     A                                      DSPATR(UL)
009710131202     A N33
009720131202     AO 33 38     VIDICA    R    2   O 13 64REFFLD(ARBICA *LIBL/FNARB00F)
009730131202     A                                      DSPATR(HI)
009740131202     A  70                             13 69'Tipo'
009750131202     A  70        VIDMIF    R        O 13 74REFFLD(ARBMIF *LIBL/FNARB00F)
009760131202     A                                      DSPATR(HI)
009770131202     A  70                             14  2'Incasso Parziale:'
009780131202     A  70                             14 20'Causale'
009790131202     A  70        VIDFIP    R        O 14 28REFFLD(ARBFIP *LIBL/FNARB00F)
009800131202     A                                      DSPATR(HI)
009810131202     A  70                             14 47'Importo'
009820131202     A  70        VIDIMP        13A  O 14 63DSPATR(HI)
009830131202     A  70        V5CDIV         3A  O 14 78DSPATR(HI)
009840131202     A  70                             15 47'Totale Parziale'
009850131202     A  70        VIDIPP        13A  O 15 63DSPATR(HI)
009860131202     A                                 16  2'MANDATO INTROITO:'
009870131202     A                                      DSPATR(UL)
009880131202     A                                 16 23'Data'
009890131202     A            VIDDMI    R        O 16 28REFFLD(ARBDMI *LIBL/FNARB00F)
009900131202     A                                      EDTWRD('  /  /    ')
009910131202     A                                      DSPATR(HI)
009920131202     A                                 16 47'Numero..........'
009930131202     A            VIDNMI    R        O 16 67REFFLD(ARBNMI *LIBL/FNARB00F)
009940131202     A                                      DSPATR(HI)
009950131202     A                                      EDTCDE(2)
009960131202     A  88                             17  2'GIRO DI CONSEGNA:'
009970131202     A                                      DSPATR(HI)
009980131202     A                                      DSPATR(UL)
009990131202     A  88                             17 21'Codice'
010000131202     A  88        V5CCGI        10A  O 17 28DSPATR(HI)
010010131202     A  88                             17 39'-'
010020131202     A  88        V5DCGI        29A  O 17 41DSPATR(HI)
010030131202     A  88        V5DTGI        10A  O 17 71DSPATR(HI)
010040131202     A  88                             18  4'Elaborazione G E O.....'
010050131202     A  88        V5DTTL        12A  O 18 28DSPATR(HI)
010060131202     A  88                             18 41'Esito'
010070131202     A  88        V5CARGERR      2A  O 18 47DSPATR(HI)
010080131202     A  88                             18 50'-'
010090131202     A  88        V5DARGERR     29A  O 18 52DSPATR(HI)
010100131202     A  88                             19  4'Livello normalizzazione'
010110131202     A  88        V5CLNO         2A  O 19 28DSPATR(HI)
010120131202     A  88        V5DLNO        30A  O 19 41DSPATR(HI)
010130951220     A**************************************************************************
010140131107     A          R LRI6Z05
010150021217     A                                      OVERLAY
010160021217     A            FD05          62A  O 24  2
010170021217     A            F24D05        16A  O 24 65
010180000000     A**************************************************************************
010190131107     A          R LRI6D06
010200110705     A*%%TS  SD  20110705  102409  EDPES       REL-V6R1M0  5761-WDS
010210110705     A                                      OVERLAY
010220110705     A            ATRBL4A        1   P
010230110705     A            V1DTSP         8A  O  3 72DSPATR(RI)
010240110705     A                                  4  2'SPEDIZIONE:'
010250110705     A                                      DSPATR(UL)
010260110705     A            V3CLNP    R        O  4 15REFFLD(ARBLNP *LIBL/FNARB00F)
010270110705     A                                      DSPATR(HI)
010280110705     A                                      DSPATR(UL)
010290110705     A            V3CNRS    R        O  4 20REFFLD(ARBNRS *LIBL/FNARB00F)
010300110705     A                                      DSPATR(HI)
010310110705     A                                      EDTCDE(Z)
010320110705     A                                      DSPATR(UL)
010330110705     A            V3CNSP    R        O  4 24REFFLD(ARBNSP *LIBL/FNARB00F)
010340110705     A                                      DSPATR(HI)
010350110705     A                                      EDTCDE(Z)
010360110705     A                                      DSPATR(UL)
010370110705     A                                  4 33'del'
010380110705     A            V3CDSP         8Y 0O  4 38DSPATR(HI)
010390110705     A                                      EDTWRD('  /  /    ')
010400110705     A                                      DSPATR(UL)
010410110705     A                                  4 53'Rifer.Mitt.'
010420110705     A            VIDRMN    R        O  4 65REFFLD(ARBRMN *LIBL/FNARB00F)
010430110705     A                                      DSPATR(HI)
010440110705     A                                      EDTCDE(Z)
010450110705     A                                  5  2'Linea Arrivo'
010460110705     A            V3CLNA    R        O  5 15REFFLD(ARBLNA *LIBL/FNARB00F)
010470110705     A                                      DSPATR(HI)
010480110705     A                                  5 19'-'
010490110705     A            D15LNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
010500110705     A                                      DSPATR(HI)
010510110705     A                                  5 38'Destinat.'
010520110705     A            V32RSD    R   32   O  5 48REFFLD(ARBRSD *LIBL/FNARB00F)
010530110705     A                                      DSPATR(HI)
010540110705     A                                  6  2'Cli.Fatturaz'
010550110705     A            V6CKSC         7S 0O  6 15DSPATR(HI)
010560110705     A            V6DKSC        25A  O  6 23DSPATR(HI)
010570110705     A                                  6 53'Tariffa'
010580110705     A            V6CCTR         3S 0O  6 61DSPATR(HI)
010590110705     A            V6DCTR        10A  O  6 65
010600110705     A                                  7  7'--------  Proposta Tassazione da B-
010610110705     A                                      ollettazione  ---------'
010620110705     A                                      DSPATR(&ATRBL4A)
010630110705     A                                  8  7'Cliente'
010640110705     A                                      DSPATR(&ATRBL4A)
010650110705     A            V6CAR4KSC      7  0O  8 15DSPATR(HI)
010660110705     A                                      DSPATR(&ATRBL4A)
010670110705     A            V6DAR4KSC     25   O  8 23DSPATR(&ATRBL4A)
010680110705     A                                  8 53'Tariffa'
010690110705     A                                      DSPATR(&ATRBL4A)
010700110705     A            V6CAR4CTR      3   O  8 61DSPATR(HI)
010710110705     A                                      DSPATR(&ATRBL4A)
010720110705     A                                  9  3'Colli'
010730110705     A                                  9 12'Peso Fatt.'
010740110705     A                                  9 27'Volume Fatt.'
010750110705     A                                  9 43'Qta'' Fatturabile'
010760110705     A                                  9 62'Codice Tassazione'
010770110705     A            VIDNCL    R        O 10  2REFFLD(ARBNCL *LIBL/FNARB00F)
010780110705     A                                      DSPATR(HI)
010790110705     A                                      EDTCDE(2)
010800110705     A            VIDPKF    R        O 10 12REFFLD(ARBPKB *LIBL/FNARB00F)
010810110705     A                                      DSPATR(HI)
010820110705     A                                      EDTCDE(2)
010830110705     A                                 10 22'Kg.'
010840110705     A            VIDFVF    R        O 10 28REFFLD(ARBFVF *LIBL/FNARB00F)
010850110705     A                                      DSPATR(HI)
010860110705     A            VIDVLF    R        O 10 32REFFLD(ARBVLF *LIBL/FNARB00F)
010870110705     A                                      DSPATR(HI)
010880110705     A                                      EDTCDE(4)
010890110705     A            VIDQFT    R     Y  O 10 42REFFLD(ARBQFT *LIBL/FNARB00F)
010900110705     A                                      EDTCDE(2)
010910110705     A                                      DSPATR(HI)
010920110705     A            V6CCTS    R        O 10 62REFFLD(ARBCTS *LIBL/FNARB00F)
010930110705     A                                      DSPATR(HI)
010940110705     A            V6DCTS        15A  O 10 65TEXT('DESCRIZIONE')
010950110705     A                                 12 10'Divisa'
010960110705     A                                 12 28'Importo / L.IVA / Numero / Data FA-
010970110705     A                                      TTURA'
010980110705     A            VIDDIV         3A  O 13 12DSPATR(HI)
010990110705     A            VIDIFT        13A  O 13 22DSPATR(HI)
011000110705     A            VIDFIV    R        O 13 39REFFLD(AR6FIV *LIBL/FIAR600F)
011010110705     A                                      DSPATR(HI)
011020110705     A                                      EDTCDE(Z)
011030110705     A            VIDNFT    R        O 13 45REFFLD(AR6NFT *LIBL/FIAR600F)
011040110705     A                                      DSPATR(HI)
011050110705     A                                      EDTCDE(2)
011060110705     A            VIDDFT        10A  O 13 56DSPATR(HI)
011070110705     A                                 15  7'Trasporto'
011080110705     A                                 15 21'Tot.Imponibile'
011090110705     A                                 15 47'I.V.A.'
011100110705     A                                 15 58'Esenzione IVA'
011110110705     A            VIDPOR        13A  O 16  3DSPATR(HI)
011120110705     A            VIDIMV        13A  O 16 22DSPATR(HI)
011130110705     A            VIDIVA        13A  O 16 40DSPATR(HI)
011140110705     A            VIDCEI    R        O 16 58REFFLD(AR6CEI *LIBL/FIAR600F)
011150110705     A                                      DSPATR(HI)
011160110705     A            DESCEI    R        O 16 60REFFLD(§EIDES *LIBL/DSEI)
011170110705     A            VIDFIM         8A  O 17 27
011180110705     A                                 18  2'--------- Varie ---------'
011190110705     A                                 18 29'--------- Varie ---------'
011200110705     A                                 18 56'--------- Varie ---------'
011210000000     A**************************************************************************
011220131107     A          R LRI6S06                   SFL
011230110705     A*%%TS  SD  20110705  102409  EDPES       REL-V6R1M0  5761-WDS
011240110705     A            V6CSV1    R        O 19  2REFFLD(AR6SV1 *LIBL/FIAR600F)
011250110705     A                                      DSPATR(HI)
011260110705     A            V6CVA1        13A  O 19  4DSPATR(HI)
011270110705     A            V6CDE1         9A  O 19 18TEXT('DESCRIZIONE')
011280000000     A**************************************************************************
011290131107     A          R LRI6C06                   SFLCTL(LRI6S06)
011300110705     A*%%TS  SD  20110705  102409  EDPES       REL-V6R1M0  5761-WDS
011310110705     A                                      CF12
011320110705     A                                      OVERLAY
011330110705     A N35                                  SFLDSP
011340110705     A N35                                  SFLDSPCTL
011350110705     A  35                                  SFLCLR
011360110705     A                                      SFLSIZ(0016)
011370110705     A                                      SFLPAG(0015)
011380110705     A                                      SFLLIN(0002)
011390110705     A  28        V1CMSG        78   M
011400110705     A                                 24  2'F12=Ritorno'
011410000000     A**************************************************************************
011420000000     A*  FR3F VIDCPC  FORMATO RIEPILOGATIVO DELLA BOLLA IN ARRIVO
011430000000     A**************************************************************************
011440131202     A          R LRI6D07
011450131202     A*%%TS  SD  20131202  202412  EDPES       REL-V7R1M0  5770-WDS
011460131202     A  63
011470131202     AO 61                                  CF01
011480131202     A                                      CA03
011490131202     A  95                                  CF05
011500131202     A  17                                  CF06
011510131202     A  67                                  CF07
011520131202     A  74 16                               CF08
011530131202     A  98                                  CF10
011540131202     A  77                                  CF11
011550131202     A                                      CF12
011560131202     A  24                                  CF13
011570131202     A  03                                  CF14
011580131202     A                                      CA15
011590131202     A  64                                  CF16
011600131202     A  17                                  CF17
011610131202     A  94                                  CF18
011620131202     A                                      CF19
011630131202     A                                      CF20
011640131202     A                                      CF21
011650131202     A  86                                  CF22
011660131202     A                                      CF24
011670131202     A  04                                  CF02
011680131202     A  22                                  CF04
011690131202     A                                      CA09
011700131202     A                                      OVERLAY
011710131202     A  28        V1CMSG        78   M
011720131202     A            ATRPDA         1A  P
011730131202     A            ATRTSP         1A  P
011740131202     A                                  3  3'SPEDIZIONE:'
011750131202     A                                      DSPATR(UL)
011760131202     A            V3CLNP    R        O  3 15REFFLD(ARBLNP *LIBL/FNARB00F)
011770131202     A                                      DSPATR(HI)
011780131202     A                                      DSPATR(UL)
011790131202     A            V3CNRS    R        O  3 19REFFLD(ARBNRS *LIBL/FNARB00F)
011800131202     A                                      DSPATR(HI)
011810131202     A                                      DSPATR(UL)
011820131202     A                                      EDTCDE(Z)
011830131202     A                                  3 22'-'
011840131202     A            V3CNSP    R        O  3 24REFFLD(ARBNSP *LIBL/FNARB00F)
011850131202     A                                      DSPATR(HI)
011860131202     A                                      EDTCDE(2)
011870131202     A                                      DSPATR(UL)
011880131202     A                                  3 35'del'
011890131202     A            V3CDSP         8Y 0O  3 39TEXT('data spedizione (visualizzazi-
011900131202     A                                      one)')
011910131202     A                                      DSPATR(HI)
011920131202     A                                      EDTWRD('  /  /    ')
011930131202     A                                      DSPATR(UL)
011940131202     A                                  3 50'LnArrivo'
011950131202     A            V3CLNA    R        O  3 59REFFLD(ARBLNA *LIBL/FNARB00F)
011960131202     A                                      DSPATR(HI)
011970131202     A            V7DLNA        18A  O  3 63DSPATR(HI)
011980131202     A                                      TEXT('DESCRIZIONE FILIALE')
011990131202     A                                  4  3'ARRIVO'
012000131202     A            V06DAM         6Y 0O  4 10TEXT('DATA ARRIVO MERCE A FILIALE A-
012010131202     A                                      RRIVO')
012020131202     A                                      EDTWRD('  /  /  ')
012030131202     A                                      DSPATR(HI)
012040131202     A            V1DAR8        12A  O  4 37DSPATR(HI)
012050131202     A            V1DBAM         6A  O  4 51
012060131202     A            V3CCBO    R        O  4 60REFFLD(ARBCBO *LIBL/FNARB00F)
012070131202     A                                      DSPATR(HI)
012080131202     A            V5DCBO        18A  O  4 63DSPATR(HI)
012090131202     A                                      TEXT('DESCRIZIONE')
012100131202     A                                  5  2'-----------------------------------
012110131202     A                                      -----------------------------------'
012120131202     A            V1DTSP         8A  O  5 73DSPATR(&ATRTSP)
012130131202     A                                  6  2'ABILITAZIONI'
012140131202     A                                      DSPATR(UL)
012150140109     A            V3CGES        58A  O  6 15DSPATR(HI)
012160140109     A                                  6 74'dett?'
012170140109     A            V3CGESD        1A  B  6 80VALUES(' ' '?')
012180131202     A                                  7  2'DISTINTA'
012190131202     A            ARBNDC    R        O  7 11REFFLD(ARBNDC *LIBL/FNARB00F)
012200131202     A                                      DSPATR(HI)
012210131202     A                                      EDTCDE(Z)
012220131202     A            V7DFPP         3A  O  7 20DSPATR(HI)
012230131202     A                                  7 24'del'
012240131202     A            VIDDDC    R        O  7 28REFFLD(ARBDDC *LIBL/FNARB00F)
012250131202     A                                      EDTWRD('  /  /    ')
012260131202     A                                      DSPATR(HI)
012270131202     A                                  7 39'Autotr'
012280131202     A            VIDPDC    R        O  7 46REFFLD(ARBPDC *LIBL/FNARB00F)
012290131202     A                                      DSPATR(HI)
012300131202     A                                      EDTCDE(Z)
012310131202     A            DESPD1        27A  O  7 54DSPATR(HI)
012320131202     A            VIDPDA         6A  O  8  4DSPATR(&ATRPDA)
012330131202     A            V7DNCL_DE     18A  O  8 24
012340131202     A            V7DNCL_CO     15A  O  8 43DSPATR(HI)
012350131202     A  27        V1DFBC        10A  O  8 71DSPATR(RI)
012360131202     A                                  9  2'Ultimo evento'
012370131202     A            V7DUEVB       65A  O  9 16DSPATR(HI)
012380131202     A                                 10  2'Mancata Cons:'
012390131202     A            VIDTMC    R        O 10 16REFFLD(ARBTMC *LIBL/FNARB00F)
012400131202     A                                      DSPATR(HI)
012410131202     A                                 10 20'Prima Cons.Parziale'
012420131202     A            VIDDCP    R        O 10 41REFFLD(ARBDCP *LIBL/FNARB00F)
012430131202     A                                      EDTWRD('  /  /    ')
012440131202     A                                      DSPATR(HI)
012450131202     A                                 10 53'Co.Anomala'
012460131202     A            ARBCCA    R        O 10 65REFFLD(ARBCCA *LIBL/FNARB00F)
012470131202     A                                      DSPATR(HI)
012480131202     A            DESCCA        14A  O 10 67DSPATR(HI)
012490131202     A                                 11  2'CONSEGNA:'
012500131202     A                                      DSPATR(HI)
012510131202     A                                      DSPATR(UL)
012520131202     A                                 11 12'TEORICA'
012530131202     A            V08DCE    R        O 11 21REFFLD(ARBDCE *LIBL/FNARB00F)
012540131202     A                                      EDTWRD('  /  /    ')
012550131202     A                                      DSPATR(HI)
012560131202     A  69                             11 34'REALE'
012570131202     A            V08DCM    R        O 11 41REFFLD(ARBDCM *LIBL/FNARB00F)
012580131202     A                                      EDTWRD('  /  /    ')
012590131202     A  69                                  DSPATR(RI)
012600131202     A            VIDHMC         5A  O 11 53
012610131202     A  69                                  DSPATR(RI)
012620131202     A N69                                  DSPATR(HI)
012630131202     A                                 11 63'Ore Ritardo'
012640131202     A            VIDNRC    R        O 11 76REFFLD(ARBNRC *LIBL/FNARB00F)
012650131202     A                                      DSPATR(HI)
012660131202     A                                      EDTCDE(Q)
012670131202     A                                 12  2'-----------------------------------
012680131202     A                                      ------------------------------------
012690131202     A                                      ----------'
012700131202     A                                 13  2'Destinat'
012710131202     A            V4CNOM        70A  O 13 11DSPATR(HI)
012720131202     A                                      DSPATR(UL)
012730131202     A                                      TEXT('RAGIONE SOCIALE DESTINATARIO')
012740131202     A            VIDKSC    R        O 14  2REFFLD(ARBKSC *LIBL/FNARB00F)
012750131202     A                                      DSPATR(HI)
012760131202     A                                      EDTCDE(Z)
012770131202     A            V33IND        33A  O 14 11DSPATR(HI)
012780131202     A                                      DSPATR(UL)
012790131202     A                                      TEXT('INDIRIZZO DESTINATARIO')
012800131202     A            V4CLOD        35A  O 14 46DSPATR(HI)
012810131202     A                                      DSPATR(UL)
012820131202     A                                      TEXT('LOCALITA'' DESTINATARIO')
012830131202     A                                 15  2'Mittente'
012840131202     A                                 15 36'Riferimenti '
012850131202     A            V4CCAD    R        O 15 65REFFLD(ARBCAD *LIBL/FNARB00F)
012860131202     A                                      DSPATR(HI)
012870131202     A                                      DSPATR(UL)
012880131202     A            V7CPRD         3A  O 15 76DSPATR(HI)
012890131202     A                                      DSPATR(UL)
012900131202     A                                      TEXT('PROVINCIA DESTINATARIO')
012910131202     A            V4CFIN    R        O 15 80REFFLD(ARBFIN *LIBL/FNARB00F)
012920131202     A                                      DSPATR(HI)
012930131202     A                                      DSPATR(UL)
012940131202     A            V3CKSC    R        O 16  2REFFLD(ARBKSC *LIBL/FNARB00F)
012950131202     A                                      DSPATR(HI)
012960131202     A                                      EDTCDE(Z)
012970131202     A            V28RSM        24A  O 16 10DSPATR(HI)
012980131202     A                                      DSPATR(UL)
012990131202     A                                      TEXT('RAG.SOCIALE MITTENTE 1')
013000131202     A            VIDRMN    R        O 16 35REFFLD(ARBRMN *LIBL/FNARB00F)
013010131202     A                                      DSPATR(HI)
013020131202     A                                      EDTCDE(Z)
013030131202     A                                      DSPATR(UL)
013040131202     A                                 16 52'-----Contrassegno-----Ben-Inc'
013050131202     A            V25LOM    R   25   O 17  2REFFLD(ARBLOM *LIBL/FNARB00F)
013060131202     A                                      DSPATR(HI)
013070131202     A                                      DSPATR(UL)
013080131202     A            V7CPRM         3A  O 17 28DSPATR(HI)
013090131202     A                                      DSPATR(UL)
013100131202     A                                      TEXT('PROVINCIA MITTENTE')
013110131202     A            VIDRMA    R        O 17 35REFFLD(ARBRMA *LIBL/FNARB00F)
013120131202     A                                      DSPATR(HI)
013130131202     A                                      DSPATR(UL)
013140131202     A            VIDTIC    R        O 17 52REFFLD(AR9TIC *LIBL/FIAR900F)
013150131202     A                                      DSPATR(HI)
013160131202     A            VIDCAS    R        O 17 55REFFLD(AR9CAS *LIBL/FIAR900F)
013170131202     A                                      DSPATR(HI)
013180131202     A                                      EDTCDE(4)
013190131202     A            VIDVCA    R        O 17 70REFFLD(AR9VCA *LIBL/FIAR900F)
013200131202     A                                      DSPATR(HI)
013210131202     A  65                             17 74'?'
013220131202     A  65        VIDBEN         1A  B 17 76VALUES(' ' '?')
013230131202     A  29        VIDICC    R    2   O 17 79REFFLD(ARBICC *LIBL/FNARB00F)
013240131202     A                                      DSPATR(HI)
013250131202     A                                 18  2'Colli'
013260131202     A                                 18 10'Peso'
013270131202     A                                 18 19'Volume'
013280131202     A                                 18 28'------Consegna richiesta--------'
013290131202     A                                 18 61'GG.Chiusura'
013300131202     A                                 18 73'Ferm.Dep'
013310131202     A            VIDNCL    R        O 19  2REFFLD(ARBNCL *LIBL/FNARB00F)
013320131202     A                                      DSPATR(HI)
013330131202     A                                      EDTCDE(Z)
013340131202     A                                      DSPATR(UL)
013350131202     A            VIDPKF    R        O 19  8REFFLD(ARBPKB *LIBL/FNARB00F)
013360131202     A                                      DSPATR(HI)
013370131202     A                                      EDTCDE(4)
013380131202     A                                      DSPATR(UL)
013390131202     A            VIDFVF    R        O 19 18REFFLD(ARBFVB *LIBL/FNARB00F)
013400131202     A                                      DSPATR(HI)
013410131202     A                                      DSPATR(UL)
013420131202     A            VIDVLF    R        O 19 20REFFLD(ARBVLB *LIBL/FNARB00F)
013430131202     A                                      EDTCDE(4)
013440131202     A                                      DSPATR(HI)
013450131202     A                                      DSPATR(UL)
013460131202     A            VIDTCR    R   11   O 19 28REFFLD(ARBTCR *LIBL/FNARB00F)
013470131202     A                                      DSPATR(HI)
013480131202     A            VIDDCR    R        O 19 40REFFLD(ARBDCR *LIBL/FNARB00F)
013490131202     A                                      DSPATR(HI)
013500131202     A                                      EDTWRD('  /  /    ')
013510131202     A                                 19 51'Ore'
013520131202     A            VIDHCR    R        O 19 55REFFLD(ARBHCR *LIBL/FNARB00F)
013530131202     A                                      DSPATR(HI)
013540131202     A                                      EDTWRD('  :  ')
013550131202     A            VIDGC1    R        O 19 64REFFLD(ARBGC1 *LIBL/FNARB00F)
013560131202     A                                      DSPATR(HI)
013570131202     A            VIDGC2    R        O 19 68REFFLD(ARBGC2 *LIBL/FNARB00F)
013580131202     A                                      DSPATR(HI)
013590131202     A            VIDFFD         3A  O 19 73DSPATR(HI)
013600131202     A                                      TEXT('FLAG FERMO DEPOSITO: S=SI')
013610131202     A                                 19 77'?'
013620131202     A            VIDDEC_F       1A  B 19 79VALUES(' ' '?')
013630131202     A                                 20  2'Consegne Particolari:'
013640131202     A            ARBTC1    R        O 20 24REFFLD(ARBTC1 *LIBL/FNARB00F)
013650131202     A                                      DSPATR(HI)
013660131202     A            V5DTC1    R   16   O 20 26REFFLD(§1PDES *LIBL/DS1P)
013670131202     A                                      DSPATR(HI)
013680131202     A            ARBTC2    R        O 20 43REFFLD(ARBTC2 *LIBL/FNARB00F)
013690131202     A                                      DSPATR(HI)
013700131202     A            V7DTC2    R        O 20 45REFFLD(§1PDES *LIBL/DS1P)
013710131202     A                                      DSPATR(HI)
013720131202     A                                 20 72'Zona'
013730131202     A            VIDZNC    R        O 20 77REFFLD(ARBZNC *LIBL/FNARB00F)
013740131202     A                                      EDTCDE(Z)
013750131202     A                                      DSPATR(HI)
013760131202     A            VIDBVA         1A  O 20 80TEXT('FLAG "COLLI DI VALORE"')
013770131202     A                                 21  2'Particolarità:'
013780131202     A                                 21 17'Giacenza'
013790131202     A  42                             21 26'?'
013800131202     A  42        V4IGGA         1A  B 21 28
013810131202     A            V4CGGA         2A  O 21 30DSPATR(HI)
013820131202     A                                 21 34'Consegna'
013830131202     A  43                             21 43'?'
013840131202     A  43        V4IGMA         1A  B 21 45VALUES(' ' '?')
013850131202     A            V4CGMA         2A  O 21 47DSPATR(HI)
013860131202     A                                 21 51'Varie'
013870131202     A  44                             21 57'?'
013880131202     A  44        V4IGVA         1A  B 21 59VALUES(' ' '?')
013890131202     A            V4CGVA         2A  O 21 61DSPATR(HI)
013900131202     A                                 22  2'Note:'
013910131202     A            V4CNO1    R        O 22  8REFFLD(AR4NOT *LIBL/FIAR400F)
013920131202     A                                      DSPATR(HI)
013930131202     A            V4CNO2    R        O 22 45REFFLD(AR4NOT *LIBL/FIAR400F)
013940131202     A                                      DSPATR(HI)
013950131202     A  92        LEGAME        58A  O 23  2DSPATR(RI)
013960131202     A                                 23 62'F15=Bolla'
013970131202     A                                      DSPATR(HI)
013980131202     A                                 23 73'F3=Fine'
013990131202     A            FD07          62A  O 24  2
014000131202     A            F24D07        16A  O 24 65
014010000000     A**************************************************************************
014020131107     A          R LRI6S08                   SFL
014030950103     A            V8CI80         1A  H      TEXT('INDICATORE 80')
014040950103     A            V8CI81         1A  H      TEXT('INDICATORE 81')
014050950103     A            V8CI82         1A  H      TEXT('INDICATORE 82')
014060950103     A            V8CI83         1A  H      TEXT('INDICATORE 83')
014070950103     A            V8CAAP    R        O 11  2REFFLD(LBLAAP *LIBL/FNLBL00F)
014080950103     A  81                                  DSPATR(RI)
014090950103     A                                      EDTCDE(Z)
014100950103     A            V8CLPP    R        O 11  7REFFLD(LBLLPP *LIBL/FNLBL00F)
014110950103     A  81                                  DSPATR(RI)
014120950103     A                                      EDTCDE(Z)
014130950103     A            V8CNRP    R        O 11 11REFFLD(LBLNRP *LIBL/FNLBL00F)
014140950103     A  81                                  DSPATR(RI)
014150950103     A                                      EDTCDE(Z)
014160950103     A            V8CNSP    R        O 11 14REFFLD(LBLNSP *LIBL/FNLBL00F)
014170950103     A  81                                  DSPATR(RI)
014180950103     A                                      EDTCDE(Z)
014190950103     A            V8CLAP    R        O 11 22REFFLD(LBLLAP *LIBL/FNLBL00F)
014200950103     A  81                                  DSPATR(RI)
014210950103     A                                      EDTCDE(Z)
014220950103     A            V8CAAN    R        O 11 30REFFLD(LBLAAN *LIBL/FNLBL00F)
014230950103     A  83                                  DSPATR(ND)
014240950103     A  82                                  DSPATR(RI)
014250950103     A                                      EDTCDE(Z)
014260950103     A            V8CLPN    R        O 11 35REFFLD(LBLLPN *LIBL/FNLBL00F)
014270950103     A  83                                  DSPATR(ND)
014280950103     A  82                                  DSPATR(RI)
014290950103     A                                      EDTCDE(Z)
014300950103     A            V8CNRN    R        O 11 39REFFLD(LBLNRN *LIBL/FNLBL00F)
014310950103     A  83                                  DSPATR(ND)
014320950103     A  82                                  DSPATR(RI)
014330950103     A                                      EDTCDE(Z)
014340950103     A            V8CNSN    R        O 11 42REFFLD(LBLNSN *LIBL/FNLBL00F)
014350950103     A  83                                  DSPATR(ND)
014360950103     A  82                                  DSPATR(RI)
014370950103     A                                      EDTCDE(Z)
014380950103     A            V8CLAN    R        O 11 50REFFLD(LBLLAN *LIBL/FNLBL00F)
014390950103     A  83                                  DSPATR(ND)
014400950103     A  82                                  DSPATR(RI)
014410950103     A                                      EDTCDE(Z)
014420950103     A            V8CPRE        23A  O 11 57
014430950103     A            V8CSCE         1A  B 11 55DSPATR(UL)
014440950103     A                                      VALUES('5' ' ')
014450950103     A  80                                  DSPATR(ND)
014460950103     A  80                                  DSPATR(PR)
014470950103     A                                 12  1'  '
014480000000     A**************************************************************************
014490131107     A          R LRI6C08                   SFLCTL(LRI6S08)
014500991026     A                                      CF12
014510991026     A                                      OVERLAY
014520991026     A  78                                  SFLDSP
014530991026     A  79                                  SFLDSPCTL
014540991026     A N79                                  SFLCLR
014550991026     A  23                                  SFLEND
014560991026     A                                      SFLFOLD(CA09)
014570991026     A                                      SFLSIZ(0007)
014580991026     A                                      SFLPAG(0006)
014590991026     A            REC8           4S 0H      SFLRCDNBR
014600991026     A  28        V1CMSG        78   M
014610991026     A                                  4  2'SPEDIZIONE:'
014620991026     A                                      DSPATR(UL)
014630991026     A            V3CLNP    R        O  4 15REFFLD(ARBLNP *LIBL/FNARB00F)
014640991026     A                                      DSPATR(HI)
014650991026     A                                      DSPATR(UL)
014660991026     A            V3CNRS    R        O  4 20REFFLD(ARBNRS *LIBL/FNARB00F)
014670991026     A                                      DSPATR(HI)
014680991026     A                                      EDTCDE(Z)
014690991026     A                                      DSPATR(UL)
014700991026     A            V3CNSP    R        O  4 24REFFLD(ARBNSP *LIBL/FNARB00F)
014710991026     A                                      DSPATR(HI)
014720991026     A                                      EDTCDE(Z)
014730991026     A                                      DSPATR(UL)
014740991026     A                                  4 33'del'
014750991026     A            V3CDSP         8Y 0O  4 38DSPATR(HI)
014760991026     A                                      EDTWRD('  /  /    ')
014770991026     A                                      DSPATR(UL)
014780991026     A                                  4 53'Rifer.Mitt.'
014790991026     A            VIDRMN    R        O  4 65REFFLD(ARBRMN *LIBL/FNARB00F)
014800991026     A                                      DSPATR(HI)
014810991026     A                                      EDTCDE(Z)
014820991026     A                                  5  2'Linea Arrivo'
014830991026     A            V3CLNA    R        O  5 15REFFLD(ARBLNA *LIBL/FNARB00F)
014840991026     A                                      DSPATR(HI)
014850991026     A                                  5 19'-'
014860991026     A            D15LNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
014870991026     A                                      DSPATR(HI)
014880991026     A                                  5 38'Destinat.'
014890991026     A            V32RSD    R   32   O  5 48REFFLD(ARBRSD *LIBL/FNARB00F)
014900991026     A                                      DSPATR(HI)
014910991026     A                                  7  9'B O L L A'
014920991026     A                                  7 37'B O L L A'
014930991026     A                                  8  2'  P R E C E D E N T E  '
014940991026     A                                      DSPATR(UL)
014950991026     A                                  8 30'    S E G U E N T E    '
014960991026     A                                      DSPATR(UL)
014970991026     A                                  8 55'5'
014980991026     A                                      DSPATR(UL)
014990991026     A                                      DSPATR(HI)
015000991026     A                                  9  2'Anno'
015010991026     A                                  9  7'LNP'
015020991026     A                                  9 11'Sr'
015030991026     A                                  9 14'Nr.sped'
015040991026     A                                  9 22'LNA'
015050991026     A                                  9 30'Anno'
015060991026     A                                  9 35'LNP'
015070991026     A                                  9 39'Sr'
015080991026     A                                  9 42'Nr.sped'
015090991026     A                                  9 50'LNA'
015100000000     A**************************************************************************
015110131107     A          R LRI6Z08
015120941230     A                                      OVERLAY
015130941230     A                                 24  2'F12=Ritorno'
015140941230     A                                 24 38'INVIO=Prosegui'
015150040216     A**************************************************************************
015160131107     A          R LRI6D09
015170041130     A*%%TS  SD  20041130  105522  EDPMB       REL-V4R4M0  5769-PW1
015180041130     A                                      CF12
015190041130     A                                      OVERLAY
015200041130     A            V1DTSP         8A  O  3 72TEXT('TIPO SERVIZIO BOLLA')
015210041130     A                                      DSPATR(RI)
015220041130     A                                  4  2'SPEDIZIONE:'
015230041130     A                                      DSPATR(UL)
015240041130     A            V3CLNP         3S 0O  4 15DSPATR(HI)
015250041130     A                                      DSPATR(UL)
015260041130     A                                      TEXT('FILIALE PARTENZA')
015270041130     A            V3CNRS         2Y 0O  4 20DSPATR(HI)
015280041130     A                                      EDTCDE(Z)
015290041130     A                                      DSPATR(UL)
015300041130     A                                      TEXT('NUMERO SERIE')
015310041130     A            V3CNSP         7Y 0O  4 24DSPATR(HI)
015320041130     A                                      EDTCDE(Z)
015330041130     A                                      DSPATR(UL)
015340041130     A                                      TEXT('NUMERO SPEDIZIONE')
015350041130     A                                  4 33'del'
015360041130     A            V3CDSP         8Y 0O  4 38DSPATR(HI)
015370041130     A                                      EDTWRD('  /  /    ')
015380041130     A                                      DSPATR(UL)
015390041130     A                                  4 53'Rifer.Mitt.'
015400041130     A            VIDRMN        15Y 0O  4 65DSPATR(HI)
015410041130     A                                      EDTCDE(Z)
015420041130     A                                      TEXT('RIFERIMENTO MITTENTE NUM.')
015430041130     A                                  5  2'Linea Arrivo'
015440041130     A            V3CLNA         3S 0O  5 15DSPATR(HI)
015450041130     A                                      TEXT('FILIALE ARRIVO')
015460041130     A                                  5 19'-'
015470041130     A            D15LNA        15A  O  5 21DSPATR(HI)
015480041130     A                                      TEXT('DESCRIZIONE FILIALE')
015490041130     A                                  5 38'Destinat.'
015500041130     A            V32RSD        32A  O  5 48DSPATR(HI)
015510041130     A                                      TEXT('RAGIONE SOCIALE DESTINATARIO')
015520041130     A                                  7  1'----------------------  E S T E N -
015530041130     A                                      S I O N E    B O L L A  ------------
015540041130     A                                      -----------'
015550041130     A                                      DSPATR(HI)
015560041130     A                                  9  2'Cliente Fatturazione'
015570041130     A            V9CKSC         7S 0O  9 25DSPATR(HI)
015580041130     A            V9DKSC        35A  O  9 34DSPATR(HI)
015590041130     A                                 11 16'----- Tariffa ------'
015600041130     A                                 11 45'---- Contrassegno ----'
015610041130     A            V9CCTR         3Y 0O 12 16DSPATR(HI)
015620041130     A            V9DCTR        15A  O 12 21
015630041130     A            VIDCAS        13Y 3O 12 45DSPATR(HI)
015640041130     A                                      EDTCDE(2)
015650041130     A            VIDVCA         3A  O 12 64DSPATR(HI)
015660041130     A                                 15 14'Divisa'
015670041130     A                                 15 30'Importo / L.IVA / Numero / Data FA-
015680041130     A                                      TTURA'
015690041130     A            V9CDIV         3A  O 16 16DSPATR(HI)
015700041130     A            V9CIFT        13A  O 16 24DSPATR(HI)
015710041130     A            V9CFIV         3Y 0O 16 41DSPATR(HI)
015720041130     A                                      EDTCDE(Z)
015730041130     A                                      TEXT('COD.FILIALE IVA')
015740041130     A            V9CNFT         6Y 0O 16 47DSPATR(HI)
015750041130     A                                      EDTCDE(2)
015760041130     A                                      TEXT('NUMERO FATTURA')
015770041130     A            V9CDFT        10A  O 16 57DSPATR(HI)
015780041130     A                                 18  2'---- Varie ----'
015790041130     A                                 18 18'---- Varie ----'
015800041130     A            V9DFI2        10A  O 18 35
015810041130     A N06                             18 47'Importo I.V.A.'
015820041130     A  06                             18 47'Importo Bollo'
015830041130     A                                 18 62'Esenzione IVA'
015840041130     A            V9CSV1         1A  O 19  2DSPATR(HI)
015850041130     A            V9CVA1        13A  O 19  4DSPATR(HI)
015860041130     A            V9CSV5         1A  O 19 18DSPATR(HI)
015870041130     A            V9CVA5        13A  O 19 20DSPATR(HI)
015880041130     A            V9DFIM         8A  O 19 36DSPATR(HI)
015890041130     A            V9CIVA        13A  O 19 47DSPATR(HI)
015900041130     A            V9CCEI         1A  O 19 62DSPATR(HI)
015910041130     A                                      TEXT('CODICE ESENZIONE IVA')
015920041130     A            V9DCEI        15A  O 19 64TEXT('DESCRIZIONE')
015930041130     A            V9CSV2         1A  O 20  2DSPATR(HI)
015940041130     A            V9CVA2        13A  O 20  4DSPATR(HI)
015950041130     A            V9CSV6         1A  O 20 18DSPATR(HI)
015960041130     A            V9CVA6        13A  O 20 20DSPATR(HI)
015970041130     A            V9CSV3         1A  O 21  2DSPATR(HI)
015980041130     A            V9CVA3        13A  O 21  4DSPATR(HI)
015990041130     A            V9CSV4         1A  O 22  2DSPATR(HI)
016000041130     A            V9CVA4        13A  O 22  4DSPATR(HI)
016010041130     A                                 24  2'F12=Ritorno'
016020990119     A**************************************************************************
016030131107     A          R LRI6S11                   SFL
016040990119     A            V11AAC         4  0H
016050990119     A            V11SCE         1A  B  7  2DSPATR(HI)
016060990119     A                                      VALUES('5' ' ')
016070990119     A            V11FIL         3  0O  7  4DSPATR(HI)
016080990119     A            V11NCA         7Y 0O  7  8DSPATR(HI)
016090990119     A                                      EDTCDE(Z)
016100990119     A            V11DCA         8Y 0O  7 17EDTWRD('  /  /    ')
016110990119     A            V11FCA         3  0O  7 29
016120990119     A            V11DFA        48   O  7 33
016130990119     A**************************************************************************
016140131107     A          R LRI6C11                   SFLCTL(LRI6S11)
016150991026     A                                      CF12
016160991026     A                                      OVERLAY
016170991026     A  78                                  SFLDSP
016180991026     A  79                                  SFLDSPCTL
016190991026     A N79                                  SFLCLR
016200991026     A  23                                  SFLEND
016210991026     A                                      SFLSIZ(0017)
016220991026     A                                      SFLPAG(0016)
016230991026     A            V1DTSP         8A  O  3 72DSPATR(RI)
016240991026     A                                  4  2'SPEDIZIONE:'
016250991026     A                                      DSPATR(UL)
016260991026     A            V3CLNP    R        O  4 15REFFLD(BLPLNP *LIBL/FNBLP00F)
016270991026     A                                      DSPATR(HI)
016280991026     A                                      DSPATR(UL)
016290991026     A            V3CNRS    R        O  4 20REFFLD(BLPNRS *LIBL/FNBLP00F)
016300991026     A                                      DSPATR(HI)
016310991026     A                                      EDTCDE(Z)
016320991026     A                                      DSPATR(UL)
016330991026     A            V3CNSP    R        O  4 24REFFLD(BLPNSP *LIBL/FNBLP00F)
016340991026     A                                      DSPATR(HI)
016350991026     A                                      EDTCDE(Z)
016360991026     A                                      DSPATR(UL)
016370991026     A                                  4 33'del'
016380991026     A            V3CDSP         8Y 0O  4 38DSPATR(HI)
016390991026     A                                      EDTWRD('  /  /    ')
016400991026     A                                      DSPATR(UL)
016410991026     A                                  4 53'Rifer.Mitt.'
016420991026     A            VIDRMN    R        O  4 65REFFLD(BLPRMN *LIBL/FNBLP00F)
016430991026     A                                      DSPATR(HI)
016440991026     A                                      EDTCDE(Z)
016450991026     A                                  5  2'Linea Arrivo'
016460991026     A            V1CLNA    R        O  5 15REFFLD(BLPLNA *LIBL/FNBLP00F)
016470991026     A                                      DSPATR(HI)
016480991026     A                                  5 19'-'
016490991026     A            D15LNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
016500991026     A                                      DSPATR(HI)
016510991026     A                                  5 38'Destinat.'
016520991026     A            V32RSD    R   32   O  5 48REFFLD(BLPRSD *LIBL/FNBLP00F)
016530991026     A                                      DSPATR(HI)
016540991026     A                                  6  2'5|Comunicazione Anomalia |  F a s -
016550991026     A                                      e                                  -
016560991026     A                                               |'
016570991026     A                                      DSPATR(UL)
016580991026     A                                      DSPATR(HI)
016590040216     A**************************************************************************
016600131107     A          R LRI6Z11
016610990119     A                                      OVERLAY
016620990119     A                                 24  3'F12=Ritorno'
016630990119     A                                 24 36'INVIO=Prosegui'
016640091214     A**************************************************************************
016650131107     A          R LRI6WDAS
016660091214     A*%%TS  SD  20091214  120625  EDPES       REL-V5R4M0  5722-WDS
016670091214     A                                      OVERLAY
016680091214     A                                      WINDOW(17 2 6 45)
016690091214     A                                  1  1'Beneficiario C/Assegno:'
016700091214     A            WDABEN        20   O  1 25DSPATR(UL)
016710091214     A            WDASCDI        7A  O  3  1DSPATR(HI)
016720091214     A            WDASRSC       35A  O  3 10DSPATR(HI)
016730091214     A                                  5 30'INVIO=Prosegui'
016740131108     A**************************************************************************
016750131114     A          R LRI6W12
016760131114     A*%%TS  SD  20131114  102802  EDPES       REL-V7R1M0  5770-WDS
016770131114     A                                      CA03
016780131114     A  39                                  CF07
016790131114     A  39                                  CF14
016800131114     A                                      OVERLAY
016810131114     A                                      WINDOW(15 2 7 72)
016820131114     A                                      RMVWDW
016830131114     A                                      USRRSTDSP
016840131114     A  28        W12MSG        70   M
016850131114     A            H1RIGA         3S 0H
016860131114     A            H1COLO         3S 0H
016870131114     A                                  1  2'Bolle con Pratica Danno:'
016880131114     A            V1CDAN    R        B  1 27REFFLD(ARBTSP *LIBL/FNARB00F)
016890131114     A                                      VALUES('A' 'C' 'E' ' ')
016900131114     A                                  1 30'A=Aperte'
016910131114     A                                  1 42'C=Chiuse'
016920131114     A                                  1 55'E=Entrambe'
016930131114     A                                  2  2'Visualizza Affidabilità:'
016940131114     A            V1CAFF         1A  B  2 27VALUES('S' 'N')
016950131114     A                                  2 30'S/N'
016960131114     A                                  3  2'Reso/Franco Frontiera .:'
016970131114     A            V1CFBR    R     A  B  3 27REFFLD(ARBFBR *LIBL/FNARB00F)
016980131114     A                                      TEXT('RESO/FRANCO FRONTIERA')
016990131114     A                                      VALUES(' ' 'R' 'F')
017000131114     A                                  3 30'(R/F/ )'
017010131114     A                                  4  2'Codice Bolla .........?:'
017020131114     A            V1CCBO    R     A  B  4 27REFFLD(ARBCBO FNARB00F)
017030131114     A  40                                  DSPATR(PC)
017040131114     A                                  5  2'Giacenti ..............:'
017050131114     A            V1CGIA         1A  B  5 27TEXT('codice giacenza')
017060131114     A                                      VALUES(' ' 'G' 'N')
017070131114     A  56                                  DSPATR(PC)
017080131114     A                                  5 30'G=Giacenti  N=Non giacenti'
017090131114     A                                  6 55'Enter=Prosegui'
017100141010     A**************************************************************************
017110141010     A          R LRI6WDDC
017120141010     A*%%TS  SD  20141010  112434  EDPRM       REL-V7R1M0  5770-WDS
017121141010     A                                      CF19
017130141010     A                                      OVERLAY
017140141010     A                                      WINDOW(9 25 4 45)
017150141010     A                                  2  1'Presenti Disposizioni di consegna -
017160141010     A                                      in sospeso:'
017170141010     A                                  3  1'premere'
017180141010     A                                  3  9'F19 per verificarle'
017190141010     A                                      DSPATR(HI)
