000010130717     A*%%TS  SD  20130717  090108  EDPRM       REL-V7R1M0  5770-WDS
000020910903     A*  91/09/03  11:58:54    EDPES       REL-R03M00  5728-PW1
000030920421     A*** FILE : FLFR72D *--------------------------------------------*
000040910205     A*          RISTAMPA SEGNACOLLI                                   *
000050000000     A***-------------------------------------------------------------**
000060130717     A*%%EC
000070130717     A                                      DSPSIZ(24 80 *DS3)
000080130717     A                                      PRINT
000090910903     A*  91/09/03  11:58:54    EDPES       REL-R03M00  5728-PW1
000100130717     A          R LR72D01
000110130717     A*%%TS  SD  20130717  090108  EDPRM       REL-V7R1M0  5770-WDS
000120130717     A                                      CA03
000130130717     A                                      CF06
000140130717     A                                      CF08
000150130717     A                                      CF07
000160130717     A  99N99                               CF01
000170130717     A  28        VIDMSG        78   M
000180130717     A            RSUT          20A  O  1  2
000190130717     A                                  1 26'* RISTAMPA SEGNACOLLI IN ARRIVO *'
000200130717     A                                      DSPATR(RI)
000210130717     A                                      DSPATR(UL)
000220130717     A                                  1 62'FNLR72R'
000230130717     A                                  1 72DATE
000240130717     A                                      EDTCDE(Y)
000250130717     A            KNSIF         10A  O  2  2
000260130717     A            KMNUS         10A  O  2 14
000270130717     A                                  2 72TIME
000280130717     A                                  4  3'Anno  di Spedizione :'
000290130717     A            VIDAAS         4Y 0B  4 26CHECK(RB)
000300130717     A                                      DSPATR(HI)
000310130717     A                                  6  3'Linea di Partenza ..:'
000320130717     A            VIDLNP         3Y 0B  6 26TEXT('linea partenza')
000330130717     A                                      DSPATR(HI)
000340130717     A                                      CHECK(RB)
000350130717     A                                      EDTCDE(Z)
000360130717     A N31                                  DSPATR(PC)
000370130717     A  40                                  ERRMSG('Linea di Partenza Errata' 4-
000380130717     A                                      0)
000390130717     A  58 02                               ERRMSG('Nessuna Bolla da Visualizza-
000400130717     A                                      re' 58)
000410130717     A  47                                  ERRMSG('Immettere la linea di parte-
000420130717     A                                      nza' 47)
000430130717     A  64                                  ERRMSG('Tasto funzione F8 possibile-
000440130717     A                                       solo se richiesto il singolo segna-
000450130717     A                                      collo' 64)
000460130717     A                                  7  3'-----------------------------------
000470130717     A                                      ------------------------------------
000480130717     A                                      -------'
000490130717     A                                  8  3'NUMERO SPEDIZIONE ..:'
000500130717     A            VIDSED         2Y 0B  8 30TEXT('numero serie')
000510130717     A                                      DSPATR(HI)
000520130717     A                                      CHECK(RZ)
000530130717     A                                  8 33'-'
000540130717     A            VIDNSD         7Y 0B  8 35TEXT('numero spedizione dal')
000550130717     A                                      DSPATR(HI)
000560130717     A                                      CHECK(RB)
000570130717     A                                      EDTCDE(Z)
000580130717     A  45                                  ERRMSG('Num. Spedizione DAL  MAGGIO-
000590130717     A                                      RE  num. Spedizione AL' 45)
000600130717     A  46                                  ERRMSG('Se immesso numero AL immett-
000610130717     A                                      ere anche il DAL' 46)
000620130717     A  52                                  ERRMSG('Immettere o il numero o la -
000630130717     A                                      data spedizione' 52)
000640130717     A  53                                  ERRMSG('Se immessa serie immettere -
000650130717     A                                      anche numero spedizione' 53)
000660130717     A  51                                  ERRMSG('Numero Spedizione Inesisten-
000670130717     A                                      te' 51)
000680130717     A  55                                  ERRMSG('Non si puo'' effettuare la -
000690130717     A                                      ristampa di piu'' di 5000 bolle all-
000700130717     A                                      a volta' 55)
000710130717     A  44                                  ERRMSG('Numero Spedizione non rista-
000720130717     A                                      mpabile' 44)
000730130717     A  57                                  ERRMSG('La spedizione richiesta non-
000740130717     A                                       ha la linea di arrivo DPD' 57)
000750130717     A  58                                  ERRMSG('Il nr.spedizione richiesto -
000760130717     A                                      non ha il DDT come richiesto in par-
000770130717     A                                      zializzazione' 58)
000780130717     A  59                                  ERRMSG('Spedizione non ancora stamp-
000790130717     A                                      ata: utilizzare la STAMPA BOLLE IN -
000800130717     A                                      ARRIVO' 59)
000810130717     A  60                                  ERRMSG('Impossibile ristampare la b-
000820130717     A                                      olla per questo cliente' 60)
000830130717     A  72                                  ERRMSG('Spedizione non in arrivo al-
000840130717     A                                       P.O. utente' 72)
000850130717     A  73                                  ERRMSG('Assegnato non tassato: stam-
000860130717     A                                      pa LdV non effettuabile' 73)
000870130717     A                                  8 45'Al'
000880130717     A                                      DSPATR(ND)
000890130717     A            VIDSEA         2Y 0B  8 48TEXT('numero serie')
000900130717     A                                      DSPATR(HI)
000910130717     A                                      CHECK(RZ)
000920130717     A                                      DSPATR(ND)
000930130717     A                                      DSPATR(PR)
000940130717     A                                  8 51'-'
000950130717     A                                      DSPATR(ND)
000960130717     A            VIDNSA         7Y 0B  8 53TEXT('nemro spedizione al')
000970130717     A                                      DSPATR(HI)
000980130717     A                                      CHECK(RB)
000990130717     A                                      EDTCDE(Z)
001000130717     A  54                                  ERRMSG('Se immessa serie immettere -
001010130717     A                                      anche numero spedizione' 54)
001020130717     A                                      DSPATR(ND)
001030130717     A                                      DSPATR(PR)
001040130717     A                                  9 10'oppure'
001050130717     A                                 11  3'DATA   SPEDIZIONE ..:'
001060130717     A                                 11 26'Dal'
001070130717     A            VIDDSD         8Y 0B 11 30TEXT('data spedizione dal')
001080130717     A                                      DSPATR(HI)
001090130717     A                                      CHECK(RB)
001100130717     A                                      EDTCDE(8)
001110130717     A  41                                  ERRMSG('Data Formalmente Errata' 41)
001120130717     A  43                                  ERRMSG('Data Spedizione DAL MAGGIOR-
001130130717     A                                      E Data Spedizione AL' 43)
001140130717     A                                 11 45'Al'
001150130717     A            VIDDSA         8Y 0B 11 48TEXT('data spedizione al')
001160130717     A                                      DSPATR(HI)
001170130717     A                                      CHECK(RB)
001180130717     A                                      EDTCDE(8)
001190130717     A  42                                  ERRMSG('Data Formalmente Errata' 42)
001200130717     A  74                                  ERRMSG('Alla data AL term.Arrivo no-
001210130717     A                                      n è in gestione al PO.Utente:fare r-
001220130717     A                                      ichieste separate' 74)
001230130717     A                                 12  3'-----------------------------------
001240130717     A                                      ------------------------------------
001250130717     A                                      -------'
001260130717     A                                 13  3'Linea di Arrivo ....:'
001270130717     A            VIDLNA         3Y 0B 13 26DSPATR(HI)
001280130717     A                                      CHECK(RB)
001290130717     A                                      EDTCDE(Z)
001300130717     A  50                                  ERRMSG('Linea di Arrivo Errata o no-
001310130717     A                                      n gestibile dal P.O. utente' 50)
001320130717     A  56                                  ERRMSG('Linea di arrivo errata per -
001330130717     A                                      la ristampa di segnacolli export DP-
001340130717     A                                      D' 56)
001350130717     A  71                                  ERRMSG('Linea di arrivo obbligatori-
001360130717     A                                      a per ristampa bolle' 71)
001370130717     A  75                                  ERRMSG('La linea di arrivo impostat-
001380130717     A                                      a non è quella della bolla' 75)
001390130717     A                                 13 52'( 0 = Tutte )'
001400130717     A                                 14  3'Bolle con D.D.T. ...:'
001410130717     A            VIDDDT         1A  B 14 26DSPATR(HI)
001420130717     A                                      VALUES(' ' 'S' 'N')
001430130717     A                                 14 52'(S=Si DDT  N=No DDT  _=Tutte)'
001440130717     A                                 15  3'-----------------------------------
001450130717     A                                      ------------------------------------
001460130717     A                                      -------'
001470130717     A                                 16  3'NUMERO SEGNACOLLO ..:'
001480130717     A                                 16 26'p.o.'
001490130717     A            VIDFLS         3Y 0B 16 31DSPATR(HI)
001500130717     A                                      CHECK(RZ)
001510130717     A  48                                  ERRMSG('P.o. segnacollo errato' 48)
001520130717     A                                      EDTCDE(Z)
001530130717     A                                 16 35'serie'
001540130717     A            VIDNRS         2Y 0B 16 41DSPATR(HI)
001550130717     A                                      CHECK(RZ)
001560130717     A                                 16 44'numero'
001570130717     A            VIDNSC         7Y 0B 16 51DSPATR(HI)
001580130717     A                                      EDTCDE(Z)
001590130717     A                                      CHECK(RB)
001600130717     A  61                                  ERRMSG('Ristampa bolla non possibil-
001610130717     A                                      e se immesso numero segnacollo' 61)
001620130717     A  62                                  ERRMSG('Segnacollo inesistente' 62)
001630130717     A  69                                  ERRMSG('Immesso il numero segnacoll-
001640130717     A                                      o non immettere altre selezioni' 69)
001650130717     A  65                                  ERRMSG('P.o. utente non abilitato a-
001660130717     A                                      lla Ristampa Segnacollo BRT' 65)
001670130717     A                                 16 59'lna'
001680130717     A            VIDLNAS        3Y 0B 16 63DSPATR(HI)
001690130717     A                                      CHECK(RZ)
001700130717     A                                      EDTCDE(Z)
001710130717     A  49                                  ERRMSG('Linea arrivo segnacollo err-
001720130717     A                                      ata o non in gestione al P.O. utent-
001730130717     A                                      e' 49)
001740130717     A  63                                  ERRMSG('Linea arrivo segnacollo non-
001750130717     A                                       DPD. Impossibile la ristampa con F-
001760130717     A                                      6!' 63)
001770130717     A                                 19 29'PASSWORD:'
001780130717     A                                      DSPATR(HI)
001790130717     A                                      DSPATR(UL)
001800130717     A            VIDPWD        10A  B 19 39DSPATR(HI)
001810130717     A                                      DSPATR(ND)
001820130717     A                                      DSPATR(RI)
001830130717     A                                      DSPATR(UL)
001840130717     A  66                                  ERRMSG('Password errata' 66)
001850130717     A  67                                  ERRMSG('Password scaduta' 67)
001860130717     A  68                                  ERRMSG('Manca tabella di controllo -
001870130717     A                                      scadenza password. TEL.CED SEDE!!' -
001880130717     A                                      68)
001890130717     A  70                                  ERRMSG('Immettere la password' 70)
001900130717     A                                 23 20'F8=Ristampa segnacollo'
001910130717     A                                 23 58'F3=Fine'
001920130717     A  99N99                          24  1'F1=Ristampa Bolle'
001930130717     A                                 24 20'F6=Ristampa segnacolli export DPD'
001940130717     A                                 24 58'F7=Interr.bolle arrivi'
