000100000000     A*  STAMPA STATISTICA ARRIVI
000200000000     A*
000300000000     A*      COMPILARE CON:     PAGESIZE(66 198)
000400000000     A*                         CPI(15)
000500000000     A*
000600000000     A**************************************************************************
000700000000     A          R LRE7T1
000800000000     A                                      SKIPB(002)
000900000000     A            RSUT          20A  O     1
001000000000     A                                    21
001100000000     A                                      DFT('/')
001200000000     A            SIMFEL    R        O    22
001300000000     A                                      REFFLD(SIMFEL *LIBL/CNCR80)
001400000000     A N20        STRIP         16A  O    40
001500000000     A                                    78
001600000000     A                                      DFT('S T A T I S T I C A    A R R I-
001700000000     A                                       V I')
001800000000     A                                   149
001900000000     A                                      DFT('FNLRE7R')
002000960926     A            WDATE          8S 0    165
002100960926     A                                      EDTWRD('  /  /    ')
002200000000     A                                   182
002300000000     A                                      DFT('PAG.')
002400000000     A                                   186
002500000000     A                                      PAGNBR
002600000000     A                                      EDTCDE(Z)
002700000000     A                                      SPACEA(001)
002800000000     A            KNSIF     R        O     1REFFLD(KNSIF KPJBA)
002900000000     A            KNMUS     R        O    12REFFLD(KNMUS KPJBA)
003000000000     A N20        STRIP1         8A  O    40
003100000000     A                                   165
003200000000     A                                      TIME
003300000000     A                                      SPACEA(001)
003400000000     A  34                                 4'TERMINAL DI ARRIVO:'
003500000000     A  34        $TFAPR    R        O    25
003600000000     A                                      REFFLD(SARTFA *LIBL/FLSAR00F)
003700000000     A  34                                28'-'
003800000000     A  34        DETERP    R        O    29
003900000000     A                                      REFFLD(ORGDES *LIBL/AZORG00F)
004000000000     A                                    60
004100000000     A                                      DFT('SPEDIZIONI ARRIVATE DAL')
004200950215     A            DS1GDA         8S 0O    84
004300000000     A                                      EDTWRD('  /  /    ')
004400000000     A                                    95
004500000000     A                                      DFT('AL')
004600950215     A            DS1GAL         8S 0O    98
004700000000     A                                      EDTWRD('  /  /    ')
004800000000     A  21                               110'( PER TERMINAL DI ARRIVO )'
004900000000     A N21                               110'( PER LINEA DI ARRIVO )'
005000000000     A**************************************************************************
005100000000     A          R LRE7T2
005200000000     A                                      SPACEB(001)
005300970505     A                                    28
005400970505     A                                      DFT('-------------- C O L L I ------
005500970505     A                                      ----------')
005600000000     A                                    71
005700000000     A                                      DFT('--------------------- P E S O -
005800000000     A                                      -------------------')
005900000000     A                                   +16
006000000000     A                                      DFT('---------------- S P E D I Z I-
006100000000     A                                       O N I -----------------')
006200000000     A                                      SPACEA(001)
006300000000     A  41                                 1
006400000000     A                                      DFT('TERMINAL DI PARTENZA')
006500000000     A N41                                 1
006600000000     A                                      DFT('LINEA DI ARRIVO')
006700970505     A                                    28
006800970505     A                                      DFT('88/89/98/96')
006900000000     A                                    40
007000000000     A                                      DFT('DISGUIDI')
007100000000     A                                    50
007200000000     A                                      DFT('PART.NON')
007300000000     A                                    60
007400000000     A                                      DFT('ARRIVATI')
007500000000     A                                    71
007600000000     A                                      DFT('FINO 35 Q.')
007700000000     A                                    84
007800000000     A                                      DFT('OLTRE 35 Q.')
007900000000     A                                   101
008000000000     A                                      DFT('TOTALE')
008100000000     A                                   111
008200000000     A                                      DFT('TASSABILE')
008300000000     A                                   123
008400000000     A                                      DFT('V O L U M E')
008500000000     A                                   138
008600000000     A                                      DFT('CORR. + DISTR.')
008700000000     A                                    +5
008800000000     A                                      DFT('E S P R E S S I')
008900000000     A                                    +7
009000000000     A                                      DFT('T O T A L E')
009100970505     A                                    28
009200970505     A                                      DFT('NON ARRIVATI')
009300000000     A                                      SPACEB(001)
009400000000     A                                    50
009500000000     A                                      DFT('SPUN.ARR')
009600000000     A                                   138
009700000000     A                                      DFT('FRAN.')
009800000000     A                                    +5
009900000000     A                                      DFT('ASS.')
010000000000     A                                   157
010100000000     A                                      DFT('FRAN.')
010200000000     A                                    +5
010300000000     A                                      DFT('ASS.')
010400000000     A                                   176
010500000000     A                                      DFT('FRAN.')
010600000000     A                                    +5
010700000000     A                                      DFT('ASS.')
010800000000     A**************************************************************************
010900000000     A          R LRE7T3
011000000000     A                                      SPACEB(3)
011100000000     A                                     1'LINEA DI ARRIVO DI CUI'
011200970505     A                                    30'PIST.88/89/98/96'
011300000000     A                                    50'PART.NON'
011400000000     A                                    60'ARRIVATI'
011500000000     A                                    80'Dal totale colli arrivati delle li-
011600000000     A                                      nee di arrivo, di cui si e'' solo t-
011700000000     A                                      erminal di arrivo, sono'
011800000000     A                                     1'SOLO TERMINAL DI ARRIVO'
011900000000     A                                      SPACEB(1)
012000970505     A                                    30'NON ARRIVATI'
012100970505     A                                    50'SPUN.ARR'
012200000000     A                                    80'esclusi i colli relativi alle sped-
012300000000     A                                      izioni in partenza di tutta l''area-
012400950419     A                                       del terminal di arrivo,'
012500000000     A                                     1'-----------------------------------
012600000000     A                                      ---------------------------------'
012700000000     A                                      SPACEB(1)
012800950419     A                                    80'se spuntati soltanto in partenza.'
012900000000     A**************************************************************************
013000000000     A          R LRE7R1
013100000000     A                                      SPACEB(001)
013200000000     A                                     1
013300000000     A                                      DFT('-------------------------------
013400000000     A                                      ------------------------------------
013500000000     A                                      ------------------------------------
013600000000     A                                      ------------------------------------
013700000000     A                                      ------------------------------------
013800000000     A                                      -------------------')
013900000000     A**************************************************************************
014000000000     A          R LRE7D1
014100000000     A                                      SPACEB(001)
014200000000     A N42        FILIAP    R        O     1
014300000000     A                                      REFFLD(ORGFIL *LIBL/AZORG00F)
014400000000     A N42                                 4
014500000000     A                                      DFT('-')
014600000000     A N42        ORGDEP    R        O     5
014700000000     A                                      REFFLD(ORGDES *LIBL/AZORG00F)
014800000000     A  42        DICITP        30A  O     1
014900000000     A            P88P      R        O    31
015000000000     A                                      REFFLD(SARP88 *LIBL/FLSAR00F)
015100000000     A                                      EDTCDE(Z)
015200000000     A            DISP      R        O    41
015300000000     A                                      REFFLD(SARDIS *LIBL/FLSAR00F)
015400000000     A                                      EDTCDE(Z)
015500000000     A            PARP      R        O    51
015600000000     A                                      REFFLD(SARPAR *LIBL/FLSAR00F)
015700000000     A                                      EDTCDE(Z)
015800000000     A            CLLP      R        O    61
015900000000     A                                      REFFLD(SARCLL *LIBL/FLSAR00F)
016000000000     A                                      EDTCDE(Z)
016100000000     A            F35P      R        O    71
016200000000     A                                      REFFLD(SARF35 *LIBL/FLSAR00F)
016300000000     A                                      EDTCDE(4)
016400000000     A            O35P      R        O    84
016500000000     A                                      REFFLD(SARO35 *LIBL/FLSAR00F)
016600000000     A                                      EDTCDE(4)
016700000000     A            TOTPEP         9S 1O    97
016800000000     A                                      TEXT('Peso totale')
016900000000     A                                      EDTCDE(4)
017000000000     A            PTAP      R        O   110
017100000000     A                                      REFFLD(SARPTA *LIBL/FLSAR00F)
017200000000     A                                      EDTCDE(4)
017300000000     A            VOLP      R        O   123
017400000000     A                                      REFFLD(SARVOL *LIBL/FLSAR00F)
017500000000     A                                      EDTCDE(4)
017600000000     A            TOTNOP         9S 0O   +10
017700000000     A                                      EDTCDE(Z)
017800000000     A            TOTESP         9S 0O   +10
017900000000     A                                      EDTCDE(Z)
018000000000     A            TOTTOP         9S 0O   +10
018100000000     A                                      EDTCDE(Z)
018200000000     A            SNFP      R        O   136
018300000000     A                                      REFFLD(SARSNF *LIBL/FLSAR00F)
018400000000     A                                      EDTCDE(Z)
018500000000     A                                      SPACEB(001)
018600000000     A            SNAP      R        O   145
018700000000     A                                      REFFLD(SARSNA *LIBL/FLSAR00F)
018800000000     A                                      EDTCDE(Z)
018900000000     A            SEFP      R        O   155
019000000000     A                                      REFFLD(SARSEF *LIBL/FLSAR00F)
019100000000     A                                      EDTCDE(Z)
019200000000     A            SEAP      R        O   164
019300000000     A                                      REFFLD(SARSEA *LIBL/FLSAR00F)
019400000000     A                                      EDTCDE(Z)
019500000000     A            TOTFRP         7S 0O   174
019600000000     A                                      EDTCDE(Z)
019700000000     A            TOTASP         7S 0O   183
019800000000     A                                      EDTCDE(Z)
019900000000     A N44                                 1' ' SPACEB(1)
020000000000     A**************************************************************************
020100000000     A          R LRE7D2                    SPACEB(1) SPACEA(1)
020200000000     A            DICITP        30A  O     1
020300000000     A**************************************************************************
020400000000     A          R LRE7D3                    SPACEB(1)
020500000000     A            FILIAP    R        O     1
020600000000     A                                      REFFLD(ORGFIL *LIBL/AZORG00F)
020700000000     A                                     4
020800000000     A                                      DFT('-')
020900000000     A            ORGDEP    R        O     5
021000000000     A                                      REFFLD(ORGDES *LIBL/AZORG00F)
021100000000     A            P88P      R        O    31
021200000000     A                                      REFFLD(SARP88 *LIBL/FLSAR00F)
021300000000     A                                      EDTCDE(Z)
021400000000     A            PARP      R        O    51
021500000000     A                                      REFFLD(SARPAR *LIBL/FLSAR00F)
021600000000     A                                      EDTCDE(Z)
021700000000     A            CLLP      R        O    61
021800000000     A                                      REFFLD(SARCLL *LIBL/FLSAR00F)
021900000000     A                                      EDTCDE(Z)
022000000000     A**************************************************************************
022100000000     A          R LRE7E2
022200000000     A                                      SPACEB(003)
022300000000     A                                    78
022400000000     A                                      DFT('( NESSUNA SPEDIZIONE DA STAMPA-
022500000000     A                                      RE )')
022600000000     A**************************************************************************
022700000000     A          R LRE7E3
022800000000     A                                      SKIPB(063)
022900000000     A                                     1
023000000000     A                                      DFT('N.B.')
023100000000     A                                     1
023200000000     A                                      DFT('PESO TASSABILE:  E'' CALCOLATO-
023300000000     A                                       CON UN RAPPORTO PESO/VOLUME  1 MC -
023400000000     A                                      =')
023500000000     A                                      SPACEB(001)
023600000000     A            §QTKPM    R        O    67
023700000000     A                                      REFFLD(§QTKPM DSQT1)
023800000000     A                                      EDTCDE(3)
023900000000     A                                    +1
024000980505     A                                      DFT('KG ARROTONDATO AI')
024100000000     A            §3IARR    R        O    +1
024200000000     A                                      REFFLD(§3IARR *LIBL/DS3I)
024300000000     A                                      EDTCDE(Z)
024400000000     A                                    +1
024500000000     A                                      DFT('KG. SUPERIORI, PER LE SOLE SPE-
024600000000     A                                      DIZIONI CON PESO FINO A KG. 3500, E-
024700000000     A                                      SCLUSE BOLLE DI RECUPERO E C/SERV')
024800000000     A                                     1
024900000000     A                                      DFT('TOTALE SPEDIZIONI: DAL TOTALE -
025000000000     A                                      SONO ESCLUSE LE BOLLE DI RECUPERO')
025100000000     A                                      SPACEB(001)
025200000000     A**************************************************************************
025300000000     A          R LRE7E4
025400000000     A                                     1'-----------------------------------
025500000000     A                                      ---------------------------------'
025600000000     A                                      SPACEB(1)
025700000000     A                                     1'T O T A L I' SPACEB(1)
025800000000     A            P88TO     R        O    31
025900000000     A                                      REFFLD(SARP88 *LIBL/FLSAR00F)
026000000000     A                                      EDTCDE(Z)
026100000000     A            PARTO     R        O    51
026200000000     A                                      REFFLD(SARPAR *LIBL/FLSAR00F)
026300000000     A                                      EDTCDE(Z)
026400000000     A            CLLTO     R        O    61
026500000000     A                                      REFFLD(SARCLL *LIBL/FLSAR00F)
026600000000     A                                      EDTCDE(Z)
