000100941114     A*--------------------------------------------------------------*
000200080515     A* DS QUADRATURA ESITI PDA IN PREDISTINTA                       *
000300941114     A*--------------------------------------------------------------*
000400080515     A          R FNLR537
000500080423     A* OBBLIGATORI INPUT
000600080701     A            D537FGSI       3S 0       TEXT('P.O. DISTINTA')
000700080701     A            D537ND1I       7S 0       TEXT('NR. DISTINTA 1')
000701080701     A            D537ND2I       7S 0       TEXT('NR. DISTINTA 2')
000702080701     A            D537ND3I       7S 0       TEXT('NR. DISTINTA 3')
000703080701     A            D537ND4I       7S 0       TEXT('NR. DISTINTA 4')
000704080701     A            D537ND5I       7S 0       TEXT('NR. DISTINTA 5')
000705080701     A            D537CMTI       1          TEXT('COMMIT S=SI/N=NO')
000706080515     A* OUTPUT
000800080701     A            D537ERRO       1          TEXT('CODICE ERRORE')
000900080701     A            D537MSGO      70          TEXT('MSG ERRORE')
