000001110429     A*%%***********************************************************************
000002110429     A*%%TS  RD  20110429  134305  EDPBA       REL-V6R1M0  5761-WDS
000003110429     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004110429     A*%%FI       0000000000000000000000000000000000000000000000000
000005110429     A*%%***********************************************************************
000006110429      *PARMS CPI(15) PAGRTT(0) FORMTYPE(LETCAOMS)
000007110429     A          R TES01
000008110429     A*%%***********************************************************************
000009110429     A*%%RI 00000
000010110429     A*%%FS 009
000011110429     A*%%***********************************************************************
000012121029     A*           RSUT          20     10  7
000013121029     A*           BRTDES        35     11  7
000014121029     A*           BRTTEL        17     12  7
000015121029     A*           BRTFAX        17     13  7
000016121025     A                                 15  7
000017121025     A                                      'RACCOMANDATA'
000018121025     A                                      HIGHLIGHT
000019121029     A            RAGDO         35A    16 57
000020121029     A            INDDO         35A    17 57
000021121029     A            CADDO          9     18 57
000022121029     A            LODDO         35A       +1
000023121029     A            PRDDO          2A       +1
000026121025     A
000027121029     A                                 19  7'Ns. rif.: AMM/SFG/GP'
000028121025     A                                 20  7'Bologna'
000029121025     A            DATE           8S 0     +1
000030121025     A                                      EDTWRD('  /  /    ')
000031121025     A                                 22  7
000032110429     A                                      'Oggetto:'
000033110429     A                                      HIGHLIGHT
000034110429     A                                    +1
000035121031     A                                      'Contrassegno omesso per'
000036110429     A            SDIV           3        +1
000037110429     A            SASS          13S 3     +1
000038110429     A                                      EDTCDE(2)
000039121025     A                                 23 16
000040110429     A                                      'Spedizione n.'
000041110429     A            SLNP           3S 0     +1
000042110429     A                                      EDTCDE(Z)
000043110429     A            SNRS           2S 0     +1
000044110429     A                                      EDTCDE(Z)
000045110429     A            SNSP           7S 0     +1
000046110429     A                                      EDTCDE(Z)
000047110429     A                                    +1
000048110429     A                                      'del'
000049110429     A            SGMSP          4S 0     +1
000050110429     A                                      EDTWRD('  /  ')
000051110429     A                                    +0
000052110429     A                                      '/'
000053110429     A            SAAS           4S 0     +0
000054121026     A                                 24 16
000055110429     A                                      'mittente'
000056110429     A            RAGMO         35A       +1
000057121026     A                                 25 16
000058110429     A                                      'destinatario'
000059121025     A            RAGDO2        35A       +1
000060121026     A                                 28  7
000061121025     A                                      'Relativamente alla spedizione indi-
000062121025     A                                      cata in oggetto ed a Voi consegnata-
000063121025     A                                       è emerso come già comunicatoVi'
000064121025     A                                 29  7
000065121025     A                                      'dalla nostra filiale che l''import-
000066121025     A                                      o del contrassegno gravante sulla s-
000067121025     A                                      pedizione stessa non è stato '
000068121025     A                                 30  7
000069121025     A                                      'indicato sulla lettera di vettura.'
000070121025     A                                 32  7
000071121025     A                                      'Pertanto a causa di tale omissione-
000072121025     A                                       l''autotrasportatore incaricato de-
000073121025     A                                      lla consegna non ha potuto '
000074121025     A                                 33  7
000075121025     A                                      'incassare l''importo di '
000076121025     A            SDIV2          3        +1
000077121025     A            SASS2         13S 3     +1
000078121026     A                                      EDTCDE(2)
000079121025     A                                 35  7
000080121025     A                                      'Scusandoci per l''accaduto,Vi invi-
000081121025     A                                      tiamo ad effettuare il pagamento de-
000082121025     A                                      lla somma in oggetto entro 8 giorni'
000083121025     A                                 36  7
000084121025     A                                      'dal ricevimento della presente -
000085121025     A                                      mediante :'
000086121025     A                                 38  7
000087121026     A                                      '1. versamento sul c/c postale -
000088121026     A                                      10046407 intestato a BRT S.p.A.'
000089121025     A                                 39  7
000090121026     A                                      '2. bonifico bancario codice IBAN -
000091121026     A                                      IT85 O 05387 02411 000000070021 -
000092121026     A                                      intestato a BRT S.p.A.'
000093121025     A                                 40  7
000094121031     A                                      '3. assegno bancario/'
000095121025     A                                    +1'circolare intestato a BRT S.p.A.'
000096121025     A                                 42  7
000097121025     A                                      'Qualora ciò non avvenga nei tempi -
000098121025     A                                      e nei modi indicati, Vi preannuncia-
000099121025     A                                      mo che saremo costretti a procedere'
000100121025     A                                 43  7
000101121025     A                                      'al recupero della somma tramite vi-
000102121025     A                                      e legali.'
000103121025     A                                 45  7
000104121025     A                                      'Nel caso in cui abbiate già provve-
000105121025     A                                      duto al pagamento, Vi preghiamo di -
000106121025     A                                      fornirci i relativi estremi.'
000107121029     A                                 46  7
000108121029     A                                      '(fax: 051/535922 posta elettronica-
000109121029     A                                      :ufficio.pagamenti@brt.it)'
000111121029     A                                 48  7
000112121025     A                                      'Distinti saluti.'
000113121029     A                                 50 57
000114121025     A                                      'BRT S.p.A.'
000115110429     A*%%***********************************************************************
000116110429     A*%%SS
000117110429     A*%%CL 001
000118110429     A*%%CL 002
000119110429     A*%%CL 001
000120110429     A*%%CL 004
000121110429     A*%%CL 001
000122110429     A*%%CL 001
000123110429     A*%%CL 005
000124110429     A*%%CL 001
000125110429     A*%%CL 002
000126110429     A*%%CL 001
000127110429     A*%%CL 001
000128110429     A*%%CL 001
000129110429     A*%%CL 001
000130110429     A*%%CL 001
000131110429     A*%%CL 002
000132110429     A*%%CL 001
000133110429     A*%%CP+999CRTPRTF
000134110429     A*%%CP+    FILE(GAITRASRC/FNLRO2P)
000135110429     A*%%CP+    DEVTYPE(*SCS)
000136110429     A*%%CP     PAGESIZE(*N       132      *N     )
000137110429     A*%%***********************************************************************
