000100890918     A*--------------------------------------------------------------*
000200110923     A*  DS PER CONTROLLO PERFECT ORDER
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500110923     A          R ILR78REC                  TEXT('DS PER CONTROLLO PERFECT ORD-
000600110923     A                                      ER')
000700941012     A*
000800110923     A            ILR78TLA       1A         TEXT('TIPO LANCIO PROGRAMMA')
000900110923     A            ILR78AAS  R     S         REFFLD($AAS)
001000110923     A            ILR78LNP  R     S         REFFLD($LNP)
001100110923     A            ILR78NRS  R     S         REFFLD($NRS)
001200110923     A            ILR78NSP  R     S         REFFLD($NSP)
001300110926     A
001400110926     A            ILR78DTELA     8S 0       TEXT('DATA ELABORAZIONE')
001500111012     A            ILR78SPPAR     1A         TEXT('S=CONSIDERA ANCHE SPUNTE -
001600111012     A                                      PARTENZA')
001700941014     A*
001800941013     A* CAMPI SOLO DI  O U T P U T:
001900941216     A*
002000110923     A            OLR78CONSO     1A         TEXT('S=PERFECT ORDER CONSEGNABILE')
002100110923     A            OLR78ERR       1A         TEXT('CODICE DI ERRORE')
002200110923     A            OLR78MSG      78A         TEXT('MESSAGGIO DI ERRORE')
