000010941028     A*%%TS  SD  19941028  091947  EDPES       REL-V2R3M0  5738-PW1
000020911009     A*  91/10/09  11:55:26    EDPES       REL-R03M00  5728-PW1
000030940712     A*** FILE : FNLR07D *--------------------------------------------*
000040920807     A*         ELENCO FOGLI VARI                                      *
000050000000     A***-------------------------------------------------------------**
000060941028     A*%%EC
000070941028     A                                      DSPSIZ(24 80 *DS3)
000080941028     A                                      PRINT
000090941028     A                                      CA03
000100941028     A N05                                  CA18
000110911009     A*  91/10/09  11:55:26    EDPES       REL-R03M00  5728-PW1
000120941027     A          R LR07D01
000130941027     A*%%TS  SD  19941027  190336  EDPES       REL-V2R3M0  5738-PW1
000140941027     A  28        V1CMSG        78   M
000150941027     A            V1CDSA        20A  O  1  2
000160941027     A                                  1 26'***  ELENCO  FOGLI  VARI  ***'
000170941027     A                                      DSPATR(RI)
000180941027     A                                      DSPATR(UL)
000190941027     A                                  1 60'FNLR07R'
000200941027     A                                  1 71DATE
000210941027     A                                      EDTCDE(Y)
000220941027     A            KNSIF         10A  O  2  2
000230941027     A            KNMUS         10A  O  2 13
000240941027     A                                  4  5'Filiale in Gestione  :'
000250941027     A                                      DSPATR(UL)
000260941027     A            V1CFGS         3Y 0B  4 31CHECK(RZ)
000270941027     A  04                                  DSPATR(HI)
000280941027     A N04                                  DSPATR(PR)
000290941027     A  49                                  DSPATR(PC)
000300941027     A                                  6  5'CATEGORIA FOGLI VARI :'
000310941027     A                                  6 29'?'
000320941027     A            V1CNPG         1A  B  6 31DSPATR(HI)
000330941027     A  46                                  ERRMSG('Categoria Errata o Mancante-
000340941027     A                                      ' 46)
000350941027     A  56                                  ERRMSG('Categoria non utilizzabile'-
000360941027     A                                       56)
000370941027     A  57                                  ERRMSG('Categoria non utilizzabile -
000380941027     A                                      dalla filiale di 1 livello' 57)
000390941027     A  58                                  ERRMSG('Categoria non utilizzabile -
000400941027     A                                      da una filiale di 2 livello' 58)
000410941027     A                                      CHECK(ER)
000420941027     A            DESCA1        12A  O  6 37
000430941027     A            DESCA2        12A  O  6 52
000440941027     A            DESCA3        12A  O  6 67
000450941027     A            DESCA4        12A  O  7 37
000460941027     A            DESCA5        12A  O  7 52
000470941027     A            DESCA6        12A  O  7 67
000480941027     A                                 24  2'F3=Fine'
000490941027     A N05                             24 28'F18=Cambio Filiale'
000500941028     A          R LR07D02
000510941028     A*%%TS  SD  19941028  091947  EDPES       REL-V2R3M0  5738-PW1
000520941028     A                                      CF06
000530941028     A  28        V1CMSG        78   M
000540941028     A            V1CDSA        20A  O  1  2
000550941028     A                                  1 26'***  ELENCO  FOGLI  VARI  ***'
000560941028     A                                      DSPATR(RI)
000570941028     A                                      DSPATR(UL)
000580941028     A                                  1 60'FNLR07R'
000590941028     A                                  1 71DATE
000600941028     A                                      EDTCDE(Y)
000610941028     A            KNSIF         10A  O  2  2
000620941028     A            KNMUS         10A  O  2 13
000630941028     A                                  4  5'Filiale in Gestione  :'
000640941028     A                                      DSPATR(UL)
000650941028     A            V1CFGS         3Y 0B  4 31CHECK(RZ)
000660941028     A  04                                  DSPATR(HI)
000670941028     A N04                                  DSPATR(PR)
000680941028     A  49                                  DSPATR(PC)
000690941028     A                                  5  2'----------------------------- S E -
000700941028     A                                      L E Z I O N I ----------------------
000710941028     A                                      ---------'
000720941028     A                                  7  5'CATEGORIA FOGLI VARI :'
000730941028     A                                  7 29'?'
000740941028     A            V1CNPG         1A  B  7 31DSPATR(HI)
000750941028     A  46                                  ERRMSG('Categoria Errata o Mancante-
000760941028     A                                      ' 46)
000770941028     A  56                                  ERRMSG('Categoria non utilizzabile'-
000780941028     A                                       56)
000790941028     A  57                                  ERRMSG('Categoria non utilizzabile -
000800941028     A                                      dalla filiale di 1 livello' 57)
000810941028     A  58                                  ERRMSG('Categoria non utilizzabile -
000820941028     A                                      da una filiale di 2 livello' 58)
000830941028     A            DESCA1        12A  O  7 38
000840941028     A            DESCA2        12A  O  7 53
000850941028     A            DESCA3        12A  O  7 68
000860941028     A            DESCA4        12A  O  8 38
000870941028     A            DESCA5        12A  O  8 53
000880941028     A            DESCA6        12A  O  8 68
000890941028     A                                  9 11'Numero  Foglio .......:'
000900941028     A            V1CNFV         5Y 0B  9 35DSPATR(HI)
000910941028     A                                      CHECK(RB)
000920941028     A                                      EDTCDE(Z)
000930941028     A N04                                  DSPATR(PC)
000940941028     A  43                                  ERRMSG('Immettere il Numero Foglio -
000950941028     A                                      o la data' 43)
000960941028     A  45                                  ERRMSG('Numero Foglio Inesistente o-
000970941028     A                                       Annullato o non aperto dalla filia-
000980941028     A                                      le indicata' 45)
000990941028     A  48                                  ERRMSG('Il Foglio non appartiene al-
001000941028     A                                      la filiale in gestione' 48)
001010941028     A                                 11  5'Oppure:'
001020941028     A                                 13 11'Data  Foglio .....: Dal'
001030941028     A            V1CDFD         8Y 0B 13 35TEXT('data foglio DAL')
001040941028     A                                      DSPATR(HI)
001050941028     A                                      CHECK(RB)
001060941028     A                                      EDTCDE(8)
001070941028     A  40                                  ERRMSG('Data Foglio Errata' 40)
001080941028     A  42                                  ERRMSG('Data Foglio DAL Maggiore Da-
001090941028     A                                      ta  AL' 42)
001100941028     A                                 13 49'Al'
001110941028     A            V1CDFA         8Y 0B 13 52TEXT('data foglio AL')
001120941028     A                                      DSPATR(HI)
001130941028     A                                      CHECK(RB)
001140941028     A                                      EDTCDE(8)
001150941028     A  41                                  ERRMSG('Data Foglio Errata' 41)
001160941028     A                                 15 11'Tipo  Fogli ..........:'
001170941028     A            V1CTFV         1A  B 15 35TEXT('tipo fogli')
001180941028     A                                      DSPATR(HI)
001190941028     A                                      VALUES(' ' 'A' 'C')
001200941028     A                                 15 63''' ''- TUTTI   '
001210941028     A                                 16 63'''A''- APERTI'
001220941028     A                                 17 63'''C''- CHIUSI'
001230941028     A                                 18  2'------------------------- S C E L -
001240941028     A                                      T A    S T A M P E -----------------
001250941028     A                                      ---------'
001260941028     A                                 20  5'Verbali per Fogli Aperti ...:'
001270941028     A            V1CSTV         1A  B 20 35TEXT('tipo tabulato')
001280941028     A                                      DSPATR(HI)
001290941028     A                                      VALUES('S' 'N')
001300941028     A  47                                  ERRMSG('Effettuare almeno una scelt-
001310941028     A                                      a di stampa' 47)
001320941028     A                                 20 44'(S/N)'
001330941028     A                                 22  5'Elenco Fogli Vari ..........:'
001340941028     A            V1CSTE         1A  B 22 35VALUES('S' 'N')
001350941028     A                                      DSPATR(HI)
001360941028     A                                 22 44'(S/N)'
001370941028     A                                 24  2'F3-Fine'
001380941028     A N05                             24 28'F18-Cambio Filiale'
001390941028     A                                 24 64'F6-Conferma'
