000100991130      *PARMS MBR(*NONE)
000200960116     A*--------------------------------------------------------------*
000300960116     A* DS per impostazione parametri stp. elenco bolle con obbligo  *
000400960116     A*                               restituzione BAM/Lett.Vettura  *
000500960116     A*--------------------------------------------------------------*
000600960116     A          R FNLR80
000700960116     A*
000800960116     A            D80FGS         3S 0       TEXT('Filiale in gestione')
000900960116     A            D80DST         8S 0       TEXT('Data stampa bolle')
001000960116     A            D80RIS         1A         TEXT('Ristampa S=SI/N=NO')
001100991130     A            D80DPD         1          TEXT('Per DPD')
