000001090930     A*%%***********************************************************************
000002090930     A*%%TS  RD  20090930  135857  EDPMB       REL-V5R4M0  5722-WDS
000003090930     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004090930     A*%%FI       0000000000000000000000000000000000000000000000000
000005090930     A*%%***********************************************************************
000006090930     A          R LV46T01
000007090930     A*%%***********************************************************************
000008090930     A*%%RI 00000
000009090930     A*%%FS 007
000010090930     A*%%***********************************************************************
000011090930     A                                      SKIPB(008)
000012090930     A*%%***********************************************************************
000013090930     A*%%SS
000014090930     A*%%***********************************************************************
000015090930     A          R LV46T02
000016090930     A*%%***********************************************************************
000017090930     A*%%RI 00000
000018090930     A*%%***********************************************************************
000019090930     A                                      SPACEB(001)
000020090930     A            RSUT          20A  O     1
000021090930     A                                    49
000022090930     A                                      'ELENCO FILIALI ITALIA'
000023090930     A                                      HIGHLIGHT
000024090930     A                                      UNDERLINE
000025090930     A            I45GDS         8  0     97
000026090930     A                                      EDTCDE(Y)
000027090930     A                                      SPACEA(001)
000028090930     A*%%***********************************************************************
000029090930     A*%%SS
000030090930     A*%%CL 001
000031090930     A*%%***********************************************************************
000032090930     A          R LV46R01
000033090930     A*%%***********************************************************************
000034090930     A*%%RI 00000
000035090930     A*%%***********************************************************************
000036090930     A                                      SPACEB(001)
000037090930     A            PDESREG      120A  O     1
000038090930     A                                      HIGHLIGHT
000039090930     A                                      UNDERLINE
000040090930     A*%%***********************************************************************
000041090930     A*%%SS
000042090930     A*%%***********************************************************************
000043090930     A          R LV46D01
000044090930     A*%%***********************************************************************
000045090930     A*%%RI 00000
000046090930     A*%%***********************************************************************
000047090930     A                                      SPACEB(001)
000048090930     A            ORGDES        20A  O     3
000049090930     A                                    29
000050090930     A                                      ':'
000051090930     A            ORGIND        20A  O    31
000052090930     A            ORGCPF         5  0O    52
000053090930     A            ORGLOC        20A  O    58
000054090930     A            ORGPRO         2A  O    79
000055090930     A                                    83
000056090930     A                                      'TEL.'
000057090930     A            ORGTEL        13A  O    88
000058090930     A                                   102
000059090930     A                                      'FAX.'
000060090930     A            ORGFAX        13A  O   107
000061090930     A*%%***********************************************************************
000062090930     A*%%SS
000063090930     A*%%***********************************************************************
000064090930     A          R LV46F01
000065090930     A*%%***********************************************************************
000066090930     A*%%RI 00000
000067090930     A*%%FS 003
000068090930     A*%%***********************************************************************
000069090930     A                                      SPACEB(004)
000070090930     A                                     1
000071090930     A                                      'Per informazioni sulle nazioni e l-
000072090930     A                                      ocalità raggiunte dai servizi ester-
000073090930     A                                      o visitare il sito Internet www.bar-
000074090930     A                                      tolini.it o'
000075090930     A                                     1
000076090930     A                                      'contattare l''assistenza clienti.'
000077090930     A                                      SPACEB(001)
000078090930     A*%%***********************************************************************
000079090930     A*%%SS
000080090930     A*%%CL 001
000081090930     A*%%CP+999CRTPRTF
000082090930     A*%%CP+    FILE(GAITRAFIL/FNLV46P)
000083090930     A*%%CP+    DEVTYPE(*SCS)
000084090930     A*%%CP+    PAGESIZE(*N 124)
000085090930     A*%%CP+    CPI(16.7)
000086090930     A*%%CP     OVRFLW(63)
000087090930     A*%%***********************************************************************
