000100050804 fnlr14c1:   PGM        PARM(&file &membro)
000200050804             DCL        VAR(&file)    TYPE(*CHAR)  LEN(10)
000300050804             DCL        VAR(&membro)    TYPE(*CHAR)  LEN(10)
000400050804
000500050804             WRKOBJLCK  OBJ(&FILE) OBJTYPE(*FILE) OUTPUT(*PRINT)
000600050804
000700910305ENDF:        ENDPGM
