000100131128      *---------------------------------------------------------------*
000200140129      *?Parametri x Pulizia file TEL. AUT                             *
000300131128      *---------------------------------------------------------------*
000400131128      *
000500140129     A          R FNLRX4S                   TEXT('Parm x Pulizia file FICAU')
000600131128      *
000700131128      * -?Parametri di INPUT?
000800140129     A            IX4FGS         3S 0       TEXT('Filiale Gestione')
000900140129     A            IX4NFV         6S 0       TEXT('Numero Distinta')
001000131128      *
001100131128      * -?Parametri di OUTPUT?
001200140129     A            OX4ERR         1A         TEXT('*on = Errore')
001300140129     A            OX4MSG        78A         TEXT('Messaggio di errore')
