000100960220/*    PGM INTERROGAZIONE FOGLI VIAGGIO PARTENZA ALL'ARRIVO    */
000200960220FNLR26C:     PGM        PARM(&KPJBA)
000300960220
000400960220             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
000500960220             DCL        VAR(&FVA) TYPE(*CHAR) LEN(630)
000600960118
000700960220             CALL       PGM(FNLR26R) PARM(&KPJBA &FVA)
000800930308
000900000000             RCLRSC     LVL(*CALLER)
001000000000             ENDPGM
