000010180124     A*%%TS  SD  20180124  150414  EDPES       REL-V7R2M0  5770-WDS
000020000000     A**************************************************************************
000030000000     A*                                                                        *
000040160615     A*          INTERROGAZIONE BOLLE UNICA - BOLLA SINGOLA                    *
000050000000     A*                                                                        *
000060000000     A**************************************************************************
000070180124     A*%%EC
000080180124     A                                      DSPSIZ(24 80 *DS3)
000090180124     A                                      CHGINPDFT(HI UL)
000100180124     A                                      PRINT
000110000000     A**************************************************************************
000120150318     A          R LRI6T01
000130150318     A*%%TS  SD  20150318  090609  EDPRM       REL-V7R1M0  5770-WDS
000140150318     A            V1CDSA        20A  O  1  2
000150150318     A            V1CTES        32A  O  1 27DSPATR(RI)
000160150318     A                                      DSPATR(UL)
000170160503     A                                  1 62'FNLRU6R1'
000180150318     A                                  1 72DATE
000190150318     A                                      EDTCDE(Y)
000200150318     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000210150318     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000220150318     A                                  2 72TIME
000230150318     A                                  2 36'PERFECT ORDER'
000240150318     A                                      DSPATR(HI)
000250150318     A N87                                  DSPATR(ND)
000260000000     A**************************************************************************
000270180124     A          R LRI6D03
000280180124     A*%%TS  SD  20180124  145334  EDPES       REL-V7R2M0  5770-WDS
000290180124     A  63
000300180124     AO 61                                  CF01
000310180124     A                                      CA03
000320180124     A  95                                  CF05
000330180124     A  17                                  CF06
000340180124     A  67                                  CF07
000350180124     A  18                                  CF08
000360180124     A  74 16                               CF23
000370180124     A                                      CA09
000380180124     A  98                                  CF10
000390180124     A  77                                  CF11
000400180124     A                                      CF12
000410180124     A  24                                  CF13
000420180124     A  03                                  CF14
000430180124     A  64                                  CF16
000440180124     A  17                                  CF17
000450180124     A  94                                  CF18
000460180124     A                                      CF19
000470180124     A                                      CF20
000480180124     A                                      CF21
000490180124     A  86                                  CF22
000500180124     A                                      CF24
000510180124     A  04                                  CF02
000520180124     A  22                                  CF04
000530180124     A                                      OVERLAY
000540180124     A            VHCAAC         4S 0H
000550180124     A            VHCFIL         3S 0H
000560180124     A            VHCNCA         7S 0H
000570180124     A  28        V1CMSG        78   M
000580180124     A            V3CAAS    R        H      REFFLD(ARBAAS *LIBL/FNARB00F)
000590180124     A            V3CFLS    R        H      REFFLD(ARBFLS *LIBL/FNARB00F)
000600180124     A            ATRTSP         1A  P
000610180124     A            ATRINC         1A  P
000620180124     A                                  3  3'SPEDIZIONE:'
000630180124     A                                      DSPATR(UL)
000640180124     A            V3CLPA         3S 0O  3 15DSPATR(HI)
000650180124     A                                      DSPATR(UL)
000660180124     A            V3CNRS    R        O  3 19REFFLD(ARBNRS *LIBL/FNARB00F)
000670180124     A                                      DSPATR(HI)
000680180124     A                                      DSPATR(UL)
000690180124     A                                      EDTCDE(Z)
000700180124     A                                  3 22'-'
000710180124     A            V3CNSP    R        O  3 24REFFLD(ARBNSP *LIBL/FNARB00F)
000720180124     A                                      TEXT('numero spedizione')
000730180124     A                                      DSPATR(HI)
000740180124     A                                      EDTCDE(2)
000750180124     A                                      DSPATR(UL)
000760180124     A                                  3 35'del'
000770180124     A            V3CDSP         8Y 0O  3 39TEXT('data spedizione (visualizzazi-
000780180124     A                                      one)')
000790180124     A                                      DSPATR(HI)
000800180124     A                                      EDTWRD('  /  /    ')
000810180124     A                                      DSPATR(UL)
000820180124     A                                  3 50'LnArrivo'
000830180124     A            V3CLNA    R        O  3 59REFFLD(ARBLNA *LIBL/FNARB00F)
000840180124     A                                      DSPATR(HI)
000850180124     A                                      DSPATR(UL)
000860180124     A            V3DLNA        18A  O  3 63TEXT('DESCRIZIONE FILIALE')
000870180124     A                                      DSPATR(HI)
000880180124     A            V1DAR8L       16A  O  4 24DSPATR(HI)
000890180124     A            V7DBVA         6A  O  4 41COLOR(BLU)
000900180124     A  62
000910180124     AO 27        V1DFBC        10A  O  4 50
000920180124     A  66
000930180124     AO 27                                  DSPATR(RI)
000940180124     A  62                                  COLOR(BLU)
000950180124     A            V1DBAM         6A  O  4 63
000960180124     A  76                                  DSPATR(HI)
000970180124     A            V1DTSP         8A  O  4 73DSPATR(&ATRTSP)
000980180124     A                                  5  2'RITIRO'
000990180124     A                                      DSPATR(UL)
001000180124     A            V06DRT         6Y 0O  5  9TEXT('DATA BORDERO'' (PART.DOCUM.)')
001010180124     A                                      EDTWRD('  /  /  ')
001020180124     A                                      DSPATR(HI)
001030180124     A                                  5 18'Num'
001040180124     A            V7CNRT         1A  O  5 22DSPATR(HI)
001050180124     A            V7DFPPR        3A  O  5 24DSPATR(HI)
001060180124     A                                  5 29'Autotrasp'
001070180124     A            V7CPDR         7A  O  5 39DSPATR(UL)
001080180124     A                                      DSPATR(HI)
001090180124     A            V7DPDR        18A  O  5 47DSPATR(HI)
001100180124     A                                  5 67'A Magazzino'
001110180124     A            V3CFDN    R    2   O  5 79REFFLD(ARBFDN FNARB00F)
001120180124     A                                      DSPATR(HI)
001130180124     A                                      DSPATR(UL)
001140180124     A                                  6 18'Numero ORM'
001150180124     A            V3CPOE         3Y 0O  6 29DSPATR(UL)
001160180124     A                                      EDTCDE(Z)
001170180124     A                                      DSPATR(HI)
001180180124     A            V3CNSR    R        O  6 34REFFLD(ARBNRS *LIBL/FNARB00F)
001190180124     A                                      DSPATR(UL)
001200180124     A                                      EDTCDE(Z)
001210180124     A                                      DSPATR(HI)
001220180124     A                                  6 37'-'
001230180124     A            V3CNOR         7Y 0O  6 39DSPATR(UL)
001240180124     A                                      EDTCDE(Z)
001250180124     A                                      DSPATR(HI)
001260180124     A            V3CNRV         2Y 0O  6 47DSPATR(UL)
001270180124     A                                      EDTCDE(Z)
001280180124     A                                      DSPATR(HI)
001290180124     A                                  6 62'CodTrattam.Merce'
001300180124     A            V3CCTM         2A  O  6 79DSPATR(HI)
001310180124     A                                      DSPATR(UL)
001320180124     A                                  7  2'BOLLA:'
001330180124     A                                      DSPATR(UL)
001340180124     A                                  7  9'FV.Partenza'
001350180124     A            V3CNFV    R        O  7 21REFFLD(ARBNFV *LIBL/FNARB00F)
001360180124     A                                      EDTCDE(2)
001370180124     A                                      DSPATR(UL)
001380180124     A                                      DSPATR(HI)
001390180124     A                                  7 28'del'
001400180124     A            V06DBR         6Y 0O  7 32TEXT('DATA BORDERO'' (PART.DOCUM.)')
001410180124     A                                      EDTWRD('  /  /  ')
001420180124     A                                      DSPATR(HI)
001430180124     A  16                              7 57'InvioPartner'
001440180124     A  16        V06DT3         6Y 0O  7 70TEXT('DATA STAMPA MANIFEST')
001450180124     A                                      EDTWRD('  /  /  ')
001460180124     A                                      DSPATR(HI)
001470180124     A                                  8  2'COLLI:'
001480180124     A                                      DSPATR(UL)
001490180124     A                                  8  9'Partenza'
001500180124     A                                  8 18'Primo'
001510180124     A            V06DPC         6Y 0O  8 25TEXT('DATA PARTENZA PRIMO COLLO')
001520180124     A                                      EDTWRD('  /  /  ')
001530180124     A                                      DSPATR(HI)
001540180124     A                                  8 35'Transito'
001550180124     A                                  8 44'Arrivo'
001560180124     A            V06DET         6Y 0O  8 51TEXT('DATA ENTRATA AL TRANSITO')
001570180124     A                                      EDTWRD('  /  /  ')
001580180124     A                                      DSPATR(HI)
001590180124     A                                  8 61'Arrivo'
001600180124     A            V06DAM         6Y 0O  8 70TEXT('DATA ARRIVO MERCE A FILIALE A-
001610180124     A                                      RRIVO')
001620180124     A                                      EDTWRD('  /  /  ')
001630180124     A                                      DSPATR(HI)
001640180124     A                                  9 18'Ultimo'
001650180124     A            V06DUC         6Y 0O  9 25TEXT('DATA PARTENZA ULTIMO COLLO')
001660180124     A                                      EDTWRD('  /  /  ')
001670180124     A                                      DSPATR(HI)
001680180124     A                                  9 42'Partenza'
001690180124     A            V06DUT         6Y 0O  9 51TEXT('DATA USCITA DAL TRANSITO')
001700180124     A                                      EDTWRD('  /  /  ')
001710180124     A                                      DSPATR(HI)
001720180124     A            V6DDCM         8A  O  9 61
001730180124     A            V06DCM         6Y 0O  9 70TEXT('DATA USCITA DAL TRANSITO')
001740180124     A                                      EDTWRD('  /  /  ')
001750180124     A  69N19                               DSPATR(RI)
001760180124     A  69 19                               DSPATR(HI)
001770180124     A                                 10  2'-----------------------------------
001780180124     A                                      ------------------------------------
001790180124     A                                      ----------'
001800180124     A                                 11  2'Linea Partenza'
001810180124     A            V3CLNP    R        O 11 17REFFLD(ARBLNP *LIBL/FNARB00F)
001820180124     A                                      DSPATR(HI)
001830180124     A                                      DSPATR(UL)
001840180124     A            V3DLNP    R        O 11 21REFFLD(ORGDES *LIBL/AZORG00F)
001850180124     A                                 11 46'Immiss. Bolla'
001860180124     A            V03DAC         6Y 0O 11 60EDTWRD('  /  /  ')
001870180124     A                                      DSPATR(HI)
001880180124     A            V03ORC         4Y 0O 11 71EDTWRD('  :  ')
001890180124     A                                      DSPATR(HI)
001900180124     A                                 12  2'Codice   Bolla'
001910180124     A            V3CCBO    R        O 12 17REFFLD(ARBCBO *LIBL/FNARB00F)
001920180124     A                                      DSPATR(HI)
001930180124     A                                      DSPATR(UL)
001940180124     A            V3DCBO    R        O 12 21REFFLD(§3ADES *LIBL/DS3A)
001950180124     A                                 12 48'Operatore'
001960180124     A            V3CSOP         1A  O 12 58DSPATR(HI)
001970180124     A            V03PRU        10A  O 12 60DSPATR(HI)
001980180124     A            V03NMTD       10A  O 12 71DSPATR(HI)
001990180124     A                                 13  2'----------------- M     I     T   -
002000180124     A                                        T     E     N     T     E --------
002010180124     A                                      ---------'
002020180124     A            V3CKSC    R        O 14  2REFFLD(ARBKSC *LIBL/FNARB00F)
002030180124     A                                      DSPATR(HI)
002040180124     A                                      EDTCDE(Z)
002050180124     A                                      DSPATR(UL)
002060180124     A            V3CRSM    R        O 14 10REFFLD(ARBRSM *LIBL/FNARB00F)
002070180124     A                                      DSPATR(HI)
002080180124     A                                      DSPATR(UL)
002090180124     A  85                             14 48'Riferim. Partner:'
002100180124     A  85        V3CRPP        15A  O 14 66DSPATR(UL)
002110180124     A                                      DSPATR(HI)
002120180124     A            V3CINM    R        O 15 10REFFLD(ARBINM *LIBL/FNARB00F)
002130180124     A                                      DSPATR(HI)
002140180124     A                                      DSPATR(UL)
002150180124     A  08                             15 48'DPD:Depot arrivo:'
002160180124     A N08 85     V3CEST        28A  O 15 53
002170180124     A            V3CIDA7        7A  O 15 66DSPATR(HI)
002180180124     A            VIDXCO         1A  O 16  2DSPATR(HI)
002190180124     A            V3CCAM    R        O 16 10REFFLD(ARBCAM *LIBL/FNARB00F)
002200180124     A                                      DSPATR(HI)
002210180124     A                                      DSPATR(UL)
002220180124     A            V3CLOM    R        O 16 21REFFLD(ARBLOM *LIBL/FNARB00F)
002230180124     A                                      DSPATR(HI)
002240180124     A                                      DSPATR(UL)
002250180124     A            V3CPRM    R        O 16 58REFFLD(ARBPRM *LIBL/FNARB00F)
002260180124     A                                      DSPATR(HI)
002270180124     A                                      DSPATR(UL)
002280180124     A                                 16 62'Naz'
002290180124     A            V3CNZM    R        O 16 66REFFLD(ARBNZM *LIBL/FNARB00F)
002300180124     A                                      DSPATR(HI)
002310180124     A                                      DSPATR(UL)
002320180124     A                                 16 72'Antep'
002330180124     A            V3CFAP    R        O 16 78REFFLD(ARBFAP *LIBL/FNARB00F)
002340180124     A                                      DSPATR(HI)
002350180124     A                                      DSPATR(UL)
002360180124     A                                 17  2'PartIVA'
002370180124     A            V3CPIM    R        O 17 10REFFLD(ARBCPI *LIBL/FNARB00F)
002380180124     A                                      TEXT('partita iva mittente')
002390180124     A                                      DSPATR(UL)
002400180124     A                                 17 27'Codice Fiscale'
002410180124     A            V3CDFM        16A  O 17 42DSPATR(UL)
002420180124     A                                 17 60'Tel.'
002430180124     A            V3CTELM       16A  O 17 65DSPATR(UL)
002440180124     A                                 19  2'COLLI'
002450180124     A                                 19 10'----------'
002460180124     A                                 19 21'P   E   S   O'
002470180124     A                                 19 35'-----------'
002480180124     A                                 19 49'----- V   O   L   U   M   E ----'
002490180124     A                                 20 10'Bollett.'
002500180124     A                                 20 21'Da VDL'
002510180124     A                                 20 29'Colli'
002520180124     A                                 20 35'Boll/Variat'
002530180124     A                                 20 49'Bollett.'
002540180124     A                                 20 59'Da VDL Colli'
002550180124     A                                 20 72'Fatturare'
002560180124     A            VIDNCL    R        O 21  2REFFLD(ARBNCL *LIBL/FNARB00F)
002570180124     A                                      DSPATR(HI)
002580180124     A                                      EDTCDE(Z)
002590180124     A                                      DSPATR(UL)
002600180124     A            VIDPKB    R        O 21 10REFFLD(ARBPKB *LIBL/FNARB00F)
002610180124     A                                      DSPATR(HI)
002620180124     A                                      EDTCDE(4)
002630180124     A                                      DSPATR(UL)
002640180124     A            VIDPKC    R        O 21 20REFFLD(ARBPKC *LIBL/FNARB00F)
002650180124     A                                      DSPATR(HI)
002660180124     A                                      EDTCDE(4)
002670180124     A                                      DSPATR(UL)
002680180124     A            VIDNCP    R        O 21 29REFFLD(ARBNCP *LIBL/FNARB00F)
002690180124     A                                      DSPATR(HI)
002700180124     A                                      DSPATR(UL)
002710180124     A                                      EDTCDE(Z)
002720180124     A            VIDPKF    R        O 21 37REFFLD(ARBPKB *LIBL/FNARB00F)
002730180124     A                                      DSPATR(HI)
002740180124     A                                      EDTCDE(4)
002750180124     A                                      DSPATR(UL)
002760180124     A            VIDFVB         1A  O 21 49DSPATR(HI)
002770180124     A            VIDVLB    R        O 21 51REFFLD(ARBVLF *LIBL/FNARB00F)
002780180124     A                                      DSPATR(HI)
002790180124     A                                      DSPATR(UL)
002800180124     A                                      EDTCDE(4)
002810180124     A            VIDVLC    R        O 21 59REFFLD(ARBVLC *LIBL/FNARB00F)
002820180124     A                                      DSPATR(HI)
002830180124     A                                      DSPATR(UL)
002840180124     A                                      EDTCDE(4)
002850180124     A            VIDNCR    R        O 21 66REFFLD(ARBNCR *LIBL/FNARB00F)
002860180124     A                                      DSPATR(HI)
002870180124     A                                      DSPATR(UL)
002880180124     A                                      EDTCDE(Z)
002890180124     A            VIDFVF    R        O 21 73REFFLD(ARBFVF *LIBL/FNARB00F)
002900180124     A                                      DSPATR(HI)
002910180124     A                                      DSPATR(UL)
002920180124     A            VIDVLF    R        O 21 75REFFLD(ARBVLF *LIBL/FNARB00F)
002930180124     A                                      DSPATR(HI)
002940180124     A                                      DSPATR(UL)
002950180124     A                                      EDTCDE(4)
002960180124     A                                 22  2'BANCALI'
002970180124     A            VIDNBA         2Y 0O 22 10DSPATR(UL)
002980180124     A                                      DSPATR(HI)
002990180124     A                                      EDTCDE(Z)
003000180124     A            VIDTBA        10A  O 22 13DSPATR(UL)
003010180124     A                                      DSPATR(HI)
003020180124     A                                 22 24'/'
003030180124     A            VIDNB2         2Y 0O 22 26DSPATR(UL)
003040180124     A                                      DSPATR(HI)
003050180124     A                                      EDTCDE(Z)
003060180124     A            VIDTB2        10A  O 22 29DSPATR(UL)
003070180124     A                                      DSPATR(HI)
003080180124     A                                 22 41'Segn.'
003090180124     A            VIDFLS         3A  O 22 49DSPATR(HI)
003100180124     A                                      DSPATR(UL)
003110180124     A            VIDNCD         7Y 0O 22 54DSPATR(HI)
003120180124     A                                      DSPATR(UL)
003130180124     A                                      EDTCDE(Z)
003140180124     A                                 22 62'/'
003150180124     A            VIDNCA         7Y 0O 22 64DSPATR(HI)
003160180124     A                                      DSPATR(UL)
003170180124     A                                      EDTCDE(Z)
003180180124     A            V7DINC         3   O 22 73DSPATR(&ATRINC)
003190180124     A  92        LEGAME        58A  O 23  2DSPATR(RI)
003200180124     A                                 23 73'F3=Fine'
003210180124     A            FD03          62A  O 24  2
003220180124     A            F24D03        16A  O 24 65
003230941027     A**************************************************************************
003240160912     A          R LRI6D04
003250160912     A*%%TS  SD  20160912  112552  EDPRM       REL-V7R1M0  5770-WDS
003260160912     A  63
003270160912     AO 61                                  CF01
003280160912     A  95                                  CF05
003290160912     A  17                                  CF06
003300160912     A  67                                  CF07
003310160912     A  18                                  CF08
003320160912     A  74 16                               CF23
003330160912     A                                      CA09
003340160912     A  98                                  CF10
003350160912     A  77                                  CF11
003360160912     A                                      CF12
003370160912     A  24                                  CF13
003380160912     A  03                                  CF14
003390160912     A  64                                  CF16
003400161129     A  17                                  CF17
003410160912     A  94                                  CF18
003420160912     A                                      CF19
003430160912     A                                      CF20
003440160912     A                                      CF21
003450160912     A  86                                  CF22
003460160912     A                                      CF24
003470160912     A  04                                  CF02
003480160912     A  22                                  CF04
003490160912     A                                      OVERLAY
003500160912     A            ATRTSP         1A  P
003510160912     A  28        V1CMSG        78   M
003520160912     A                                  3  3'SPEDIZIONE:'
003530160912     A                                      DSPATR(UL)
003540160912     A            V3CLPA         3S 0O  3 15DSPATR(UL)
003550160912     A                                      DSPATR(HI)
003560160912     A            V3CNRS         2Y 0O  3 19DSPATR(UL)
003570160912     A                                      DSPATR(HI)
003580160912     A                                      EDTCDE(Z)
003590160912     A                                  3 22'-'
003600160912     A            V3CNSP         7Y 0O  3 24EDTCDE(2)
003610160912     A                                      DSPATR(UL)
003620160912     A                                      DSPATR(HI)
003630160912     A                                  3 35'del'
003640160912     A            V3CDSP         8Y 0O  3 39EDTWRD('  /  /    ')
003650160912     A                                      DSPATR(HI)
003660160912     A                                      DSPATR(UL)
003670160912     A                                  3 50'LnArrivo'
003680160912     A            V3CLNA    R        O  3 59REFFLD(ARBLNA *LIBL/FNARB00F)
003690160912     A                                      DSPATR(HI)
003700160912     A                                      DSPATR(UL)
003710160912     A            V3DLNA        18A  O  3 63DSPATR(HI)
003720160912     A                                      TEXT('DESCRIZIONE FILIALE')
003730160912     A                                  4  2'Mittente'
003740160912     A            V4CRSM        32A  O  5 11TEXT('RAG.SOCIALE MITTENTE 1')
003750160912     A                                  4 15'Tel'
003760160912     A            V3CTELM       16A  O  4 19
003770160912     A            V7DBVA         6A  O  4 41COLOR(BLU)
003780160912     A            V1DTSP         8A  O  4 73DSPATR(&ATRTSP)
003790160912     A            V3CKSC         7Y 0O  5  3EDTCDE(Z)
003800160912     A            V4CLOM        32A  O  5 45TEXT('LOCALITA'' MITTENTE')
003810160912     A            V7CPRM    R        O  5 78REFFLD(ARBNZM *LIBL/FNARB00F)
003820160912     A  62
003830160912     AO 27        V1DFBC        10A  O  4 50
003840160912     A  66
003850160912     AO 27                                  DSPATR(RI)
003860160912     A  62                                  COLOR(BLU)
003870160912     A                                  6  2'Destinat'
003880160912     A            V4CNOM        70A  O  6 11DSPATR(HI)
003890160912     A                                      DSPATR(UL)
003900160912     A N33        VIDKSC    R        O  7  3REFFLD(ARBKSC *LIBL/FNARB00F)
003910160912     A                                      DSPATR(HI)
003920160912     A                                      EDTCDE(Z)
003930160912     A            V4CIND    R        O  7 11REFFLD(ARBIND *LIBL/FNARB00F)
003940160912     A                                      DSPATR(HI)
003950160912     A                                      DSPATR(UL)
003960160912     A                                  7 62'Inl'
003970160912     A                                  7 67'P.Iva/Cd.Fisc'
003980160912     A            V4CCAD    R        O  8 10REFFLD(ARBCAD *LIBL/FNARB00F)
003990160912     A                                      DSPATR(HI)
004000160912     A                                      DSPATR(UL)
004010160912     A            V4CLOD    R        O  8 20REFFLD(ARBLOD *LIBL/FNARB00F)
004020160912     A                                      DSPATR(HI)
004030160912     A                                      DSPATR(UL)
004040160912     A            V4CPRD    R        O  8 56REFFLD(ARBPRD *LIBL/FNARB00F)
004050160912     A                                      DSPATR(HI)
004060160912     A                                      DSPATR(UL)
004070160912     A            V4CNZD    R        O  8 59REFFLD(ARBNZD *LIBL/FNARB00F)
004080160912     A                                      DSPATR(HI)
004090160912     A                                      DSPATR(UL)
004100160912     A            V4CFIN    R        O  8 63REFFLD(ARBFIN *LIBL/FNARB00F)
004110160912     A                                      DSPATR(HI)
004120160912     A                                      DSPATR(UL)
004130160912     A            V4CPID    R        O  8 65REFFLD(ARBCPI *LIBL/FNARB00F)
004140160912     A                                      DSPATR(HI)
004150160912     A                                      DSPATR(UL)
004160160912     A                                  9  2'Refer.Consegna'
004170160912     A            V4CREF        35A  O  9 20DSPATR(HI)
004180160912     A                                      DSPATR(UL)
004190160912     A            V4CDFD        16A  O  9 65DSPATR(HI)
004200160912     A                                      DSPATR(UL)
004210160912     A                                 10  2'Telefono'
004220160912     A            V4CTELD       16A  O 10 20DSPATR(HI)
004230160912     A                                      DSPATR(UL)
004240160912     A  60                             10 37'Alert Destinatario'
004250160912     A  60        V4CEMD         2A  O 10 56DSPATR(HI)
004260160912     A  60        V4CEMW         1A  B 10 59VALUES(' ' '?')
004270160912     A  60                             10 61'?'
004280160912     A            DESFNS        15A  O 10 63DSPATR(BL)
004290160912     A                                 11  7'Riferimenti Mittente'
004300160912     A                                 11 36'Natura Merce'
004310160912     A                                 11 52'-LNP Ser Numero SEGNACOLLI-'
004320160912     A            VIDRMN    R        O 12  2REFFLD(ARBRMN *LIBL/FNARB00F)
004330160912     A                                      DSPATR(HI)
004340160912     A                                      EDTCDE(Z)
004350160912     A                                      DSPATR(UL)
004360160912     A            VIDRMA    R        O 12 19REFFLD(ARBRMA *LIBL/FNARB00F)
004370160912     A                                      DSPATR(HI)
004380160912     A                                      DSPATR(UL)
004390160912     A            VIDNAS    R        O 12 36REFFLD(ARBNAS *LIBL/FNARB00F)
004400160912     A                                      DSPATR(HI)
004410160912     A                                      DSPATR(UL)
004420160912     A            VIDFLS    R     A  O 12 53REFFLD(ARBFLS *LIBL/FNARB00F)
004430160912     A                                      DSPATR(HI)
004440160912     A                                      DSPATR(UL)
004450160912     A            V4CNRS    R        O 12 57REFFLD(ARBNRS *LIBL/FNARB00F)
004460160912     A                                      DSPATR(HI)
004470160912     A                                      DSPATR(UL)
004480160912     A                                      EDTCDE(Z)
004490160912     A            VIDNCD    R        O 12 61REFFLD(ARBNCD *LIBL/FNARB00F)
004500160912     A                                      DSPATR(HI)
004510160912     A                                      EDTCDE(Z)
004520160912     A                                      DSPATR(UL)
004530160912     A                                 12 69'/'
004540160912     A            VIDNCA    R        O 12 71REFFLD(ARBNCD *LIBL/FNARB00F)
004550160912     A                                      EDTCDE(Z)
004560160912     A                                      DSPATR(HI)
004570160912     A                                      DSPATR(UL)
004580160912     A                                 13  2'Importo da Assicurare'
004590160912     A                                 13 31'Q.tà da Fatturare'
004600160912     A                                 13 56'Valore Merce Dichiarato'
004610160912     A            VIDIAS    R        O 14  2REFFLD(ARBIAS *LIBL/FNARB00F)
004620160912     A                                      DSPATR(HI)
004630160912     A                                      EDTCDE(2)
004640160912     A            VIDVAS    R        O 14 20REFFLD(ARBVAS *LIBL/FNARB00F)
004650160912     A                                      DSPATR(HI)
004660160912     A            VIDQFT    R     Y  O 14 31REFFLD(ARBQFT *LIBL/FNARB00F)
004670160912     A                                      EDTCDE(2)
004680160912     A                                      DSPATR(HI)
004690160912     A            VIDVMD    R        O 14 56REFFLD(ARBVMD *LIBL/FNARB00F)
004700160912     A                                      DSPATR(HI)
004710160912     A                                      EDTCDE(2)
004720160912     A            VIDVAD    R        O 14 75REFFLD(ARBVAD *LIBL/FNARB00F)
004730160912     A                                      DSPATR(HI)
004740160912     A                                 15  2'------C/Assegno-------Ben-'
004750160912     A                                 15 32'------Tariffa-------'
004760160912     A                                 15 56'----Mittente Originale---'
004770160912     A            VIDTIC    R        O 16  2REFFLD(AR9TIC *LIBL/FIAR900F)
004780160912     A                                      DSPATR(HI)
004790160912     A            VIDCAS    R        O 16  5REFFLD(AR9CAS *LIBL/FIAR900F)
004800160912     A                                      DSPATR(HI)
004810160912     A                                      EDTCDE(4)
004820160912     A            VIDVCA    R        O 16 20REFFLD(AR9VCA *LIBL/FIAR900F)
004830160912     A                                      DSPATR(HI)
004840160912     A  65                             16 24'?'
004850160912     A  65        VIDBEN         1A  B 16 26VALUES(' ' '?')
004860160912     A            VIDCTR    R        O 16 32REFFLD(ARBCTR *LIBL/FNARB00F)
004870160912     A                                      DSPATR(HI)
004880160912     A            DEFCTR        15A  O 16 37TEXT('DESCRIZIONE')
004890160912     A            VIDRMO    R        O 16 56REFFLD(ARBRMO *LIBL/FNARB00F)
004900160912     A                                      DSPATR(HI)
004910160912     A                                 17  2'-------CONSEGNA RICHIESTA--------'
004920160912     A                                 17 37'GG.Chiusura'
004930160912     A                                 17 51'FermoDep'
004940160912     A                                 17 61'BolRientro'
004950160912     A  10                                  DSPATR(HI)
004960160912     A            VIDFBR    R    2   O 17 73REFFLD(ARBFBR *LIBL/FNARB00F)
004970160912     A                                      DSPATR(HI)
004980160912     A                                      DSPATR(UL)
004990160912     A                                 17 77'Zona'
005000160912     A            VIDTCR    R   11   O 18  3REFFLD(ARBTCR *LIBL/FNARB00F)
005010160912     A                                      DSPATR(HI)
005020160912     A            VIDDCR    R        O 18 15REFFLD(ARBDCR *LIBL/FNARB00F)
005030160912     A                                      DSPATR(HI)
005040160912     A                                      EDTWRD('  /  /    ')
005050160912     A                                 18 26'Ore'
005060160912     A            VIDHCR    R        O 18 30REFFLD(ARBHCR *LIBL/FNARB00F)
005070160912     A                                      DSPATR(HI)
005080160912     A                                      EDTWRD('  :  ')
005090160912     A            VIDGC1    R        O 18 39REFFLD(ARBGC1 *LIBL/FNARB00F)
005100160912     A                                      DSPATR(HI)
005110160912     A            VIDGC2    R        O 18 44REFFLD(ARBGC2 *LIBL/FNARB00F)
005120160912     A                                      DSPATR(HI)
005130160912     A            VIDFFD         3A  O 18 51DSPATR(HI)
005140160912     A                                      TEXT('FLAG FERMO DEPOSITO: S=SI')
005150160912     A                                 18 55'?'
005160160912     A            VIDDEC_F       1A  B 18 57VALUES(' ' '?')
005170160912     A                                 18 61'FrFrontiera'
005180160912     A  73                                  DSPATR(HI)
005190160912     A            VIDFFR    R    2   O 18 73REFFLD(ARBFBR *LIBL/FNARB00F)
005200160912     A                                      DSPATR(HI)
005210160912     A                                      DSPATR(UL)
005220160912     A            VIDZNC    R        O 18 77REFFLD(ARBZNC *LIBL/FNARB00F)
005230160912     A                                      EDTCDE(Z)
005240160912     A                                      DSPATR(HI)
005250160912     A            VIDBVA         1A  O 18 80TEXT('FLAG "COLLI DI VALORE"')
005260160912     A  26                             19  2'Proposta:'
005270160912     A                                      DSPATR(UL)
005280160912     A  26        V4CTCRPR       2A  O 19 12DSPATR(HI)
005290160912     A  26        V08DCRPR       8Y 0O 19 15DSPATR(HI)
005300160912     A                                      TEXT('DATA CONSEGNA RICHIESTA')
005310160912     A                                      EDTWRD('  /  /    ')
005320160912     A  26                             19 26'Ore'
005330160912     A  26        V4CHCRPR  R        O 19 30REFFLD(ARBHCR *LIBL/FNARB00F)
005340160912     A                                      EDTWRD('  :  ')
005350160912     A                                 19 39'Partico'
005360160912     A                                      DSPATR(UL)
005370160912     A                                 19 47'-C/ASS-'
005380160912     A                                 19 56'Giacenza'
005390160912     A                                 19 65'Consegna'
005400160912     A                                 19 74'-Varie-'
005410160912     A  26                             20  5'ricevente'
005420160912     A  26        V4CPRUPR      10A  O 20 15
005430160912     A  26        V4CDIMPR       4Y 0O 20 26EDTWRD('  /  ')
005440160912     A  26        V4COIMPR       4Y 0O 20 32EDTWRD('  :  ')
005450160912     A                                 20 39'larità:'
005460160912     A                                      DSPATR(UL)
005470160912     A  41                             20 47'?'
005480160912     A  41        V4IGCA         1A  B 20 49VALUES(' ' '?')
005490160912     A            V4CGCA    R        O 20 52REFFLD(AR9GCA *LIBL/FIAR900F)
005500160912     A                                      DSPATR(HI)
005510160912     A  42                             20 56'?'
005520160912     A  42        V4IGGA         1A  B 20 58VALUES(' ' '?')
005530160912     A            V4CGGA    R        O 20 61REFFLD(ARBGGA *LIBL/FNARB00F)
005540160912     A                                      DSPATR(HI)
005550160912     A  43                             20 65'?'
005560160912     A  43        V4IGMA         1A  B 20 67VALUES(' ' '?')
005570160912     A            V4CGMA    R        O 20 70REFFLD(ARBGMA *LIBL/FNARB00F)
005580160912     A                                      DSPATR(HI)
005590160912     A  44                             20 74'?'
005600160912     A  44        V4IGVA         1A  B 20 76VALUES(' ' '?')
005610160912     A            V4CGVA    R        O 20 79REFFLD(ARBGVA *LIBL/FNARB00F)
005620160912     A                                      DSPATR(HI)
005630160912     A                                 21  2'------------------------- N o t e -
005640160912     A                                        P a r t e n z a ------------------
005650160912     A                                      ----'
005660160912     A            V4CNO1    R        O 22  2REFFLD(AR4NOT *LIBL/FIAR400F)
005670160912     A                                      DSPATR(HI)
005680160912     A            V4CNO2    R        O 22 40REFFLD(AR4NOT *LIBL/FIAR400F)
005690160912     A                                      DSPATR(HI)
005700160912     A  92        LEGAME        58A  O 23  2DSPATR(RI)
005710160912     A            FD04          62A  O 24  2
005720160912     A            F24D04        16A  O 24 65
005730951220     A**************************************************************************
005740160913     A          R LRI6S05                   SFL
005750160913     A*%%TS  SD  20160913  124240  EDPRM       REL-V7R1M0  5770-WDS
005760160913     A            VS5DES    R        O 20  2REFFLD(§7KDES DS7K)
005770160913     A            VS5NOT    R        O 20 31REFFLD(AR4NOT *LIBL/FIAR400F)
005780160913     A                                      DSPATR(HI)
005790000000     A**************************************************************************
005800161122     A          R LRI6C05                   SFLCTL(LRI6S05)
005810161122     A*%%TS  SD  20161122  114828  EDPRM       REL-V7R1M0  5770-WDS
005820161122     A                                      SFLSIZ(0005)
005830161122     A                                      SFLPAG(0004)
005840161122     A  63
005850161122     AO 61                                  CF01
005860161122     A  95                                  CF05
005870161122     A  17                                  CF06
005880161122     A  67                                  CF07
005890161122     A  18                                  CF08
005900161122     A  74 16                               CF23
005910161122     A                                      CA09
005920161122     A  98                                  CF10
005930161122     A  77                                  CF11
005940161122     A                                      CF12
005950161122     A  24                                  CF13
005960161122     A  03                                  CF14
005970161122     A  64                                  CF16
005980161129     A  17                                  CF17
005990161122     A                                      CF19
006000161122     A                                      CF20
006010161122     A                                      CF21
006020161122     A  86                                  CF22
006030161122     A                                      CF24
006040161122     A  04                                  CF02
006050161122     A                                      CF04
006060161122     A                                      OVERLAY
006070161122     A  71                                  SFLDSP
006080161122     A  72                                  SFLDSPCTL
006090161122     A N72                                  SFLCLR
006100161122     A  71                                  SFLEND
006110161122     A            REC5           4S 0H      SFLRCDNBR
006120161122     A  28        V1CMSG        78   M
006130161122     A            ATRPDA         1A  P
006140161122     A            ATRTSP         1A  P
006150161122     A                                  3  3'SPEDIZIONE:'
006160161122     A                                      DSPATR(UL)
006170161122     A            V3CLPA         3S 0O  3 15DSPATR(HI)
006180161122     A                                      DSPATR(UL)
006190161122     A            V3CNRS    R        O  3 19REFFLD(ARBNRS *LIBL/FNARB00F)
006200161122     A                                      DSPATR(HI)
006210161122     A                                      DSPATR(UL)
006220161122     A                                      EDTCDE(Z)
006230161122     A                                  3 22'-'
006240161122     A            V3CNSP    R        O  3 24REFFLD(ARBNSP *LIBL/FNARB00F)
006250161122     A                                      TEXT('numero spedizione')
006260161122     A                                      DSPATR(HI)
006270161122     A                                      EDTCDE(2)
006280161122     A                                      DSPATR(UL)
006290161122     A                                  3 35'del'
006300161122     A            V3CDSP         8Y 0O  3 39TEXT('data spedizione (visualizzazi-
006310161122     A                                      one)')
006320161122     A                                      DSPATR(HI)
006330161122     A                                      EDTWRD('  /  /    ')
006340161122     A                                      DSPATR(UL)
006350161122     A                                  3 50'LnArrivo'
006360161122     A            V3CLNA    R        O  3 59REFFLD(ARBLNA *LIBL/FNARB00F)
006370161122     A                                      DSPATR(HI)
006380161122     A                                      DSPATR(UL)
006390161122     A            V3DLNA        18A  O  3 63TEXT('DESCRIZIONE FILIALE')
006400161122     A                                      DSPATR(HI)
006410161122     A            V1DTSP         8A  O  4 73DSPATR(&ATRTSP)
006420161122     A                                  5  2'ABILITAZIONI'
006430161122     A                                      DSPATR(UL)
006440161122     A                                      DSPATR(HI)
006450161122     A            V3CGES        58A  O  5 15DSPATR(HI)
006460161122     A                                  5 74'dett?'
006470161122     A            V3CGESD        1A  B  5 80
006480161122     A                                  6  2'Codice Autotrasportatore '
006490161122     A            VIDPDC5   R        O  6 31REFFLD(ARBPDC *LIBL/FNARB00F)
006500161122     A                                      DSPATR(HI)
006510161122     A                                      EDTCDE(Z)
006520161122     A            DESPDC        28A  O  6 39DSPATR(HI)
006530161122     A  62
006540161122     AO 27        V1DFBC        10A  O  4 50
006550161122     A  66
006560161122     AO 27                                  DSPATR(RI)
006570161122     A  62                                  COLOR(BLU)
006580161122     A                                  7  2'DISTINTA : Del...........'
006590161122     A            VIDDDC5   R        O  7 28REFFLD(ARBDDC *LIBL/FNARB00F)
006600161122     A                                      EDTWRD('  /  /    ')
006610161122     A                                      DSPATR(HI)
006620161122     A                                  7 39'Num'
006630161122     A            ARBNDC    R        O  7 43REFFLD(ARBNDC *LIBL/FNARB00F)
006640161122     A                                      DSPATR(HI)
006650161122     A                                      EDTCDE(2)
006660161122     A            V7DFPP         3A  O  7 53DSPATR(HI)
006670161122     A            VIDPDA         6A  O  7 57DSPATR(&ATRPDA)
006680161122     A  88                              7 64'Assegnaz.'
006690161122     A  88        V5DNGD         7A  O  7 74DSPATR(HI)
006700161122     A                                  8  2'Tipo Mancata Consegna....'
006710161122     A            VIDTMC    R        O  8 28REFFLD(ARBTMC *LIBL/FNARB00F)
006720161122     A                                      DSPATR(HI)
006730161122     A            V5DTMC    R   44   O  8 30REFFLD(§2ADES *LIBL/DS2A)
006740161122     A                                  9  2'C O N S E G N A:'
006750161122     A                                      DSPATR(UL)
006760161122     A                                      DSPATR(HI)
006770161122     A                                  9 47'Numero tentativi'
006780161122     A            VIDNTC    R        O  9 75REFFLD(ARBNTC *LIBL/FNARB00F)
006790161122     A                                      DSPATR(HI)
006800161122     A                                      EDTCDE(Z)
006810161122     A                                 10  2'TEORICA'
006820161122     A            V08DCE    R        O 10 10REFFLD(ARBDCE *LIBL/FNARB00F)
006830161122     A                                      EDTWRD('  /  /    ')
006840161122     A                                      DSPATR(HI)
006850161122     A            V5DDCM         6A  O 10 21
006860161122     A            V08DCM    R        O 10 28REFFLD(ARBDCM *LIBL/FNARB00F)
006870161122     A                                      EDTWRD('  /  /    ')
006880161122     A  69N19                               DSPATR(RI)
006890161122     A  69 19                               DSPATR(HI)
006900161122     A            VIDHMC         5A  O 10 41
006910161122     A  69N19                               DSPATR(RI)
006920161122     A  69 19                               DSPATR(HI)
006930161122     A                                 10 47'Ore ritardo.....'
006940161122     A            VIDNRC    R        O 10 72REFFLD(ARBNRC *LIBL/FNARB00F)
006950161122     A                                      DSPATR(HI)
006960161122     A                                      EDTCDE(Q)
006970161122     A                                 11  2'Consegne  Particolari ...'
006980161122     A            ARBTC1    R        O 11 28REFFLD(ARBTC1 *LIBL/FNARB00F)
006990161122     A                                      DSPATR(HI)
007000161122     A            V5DTC1    R   16   O 11 30REFFLD(§1PDES *LIBL/DS1P)
007010161122     A                                      DSPATR(HI)
007020161122     A            ARBTC2    R        O 11 64REFFLD(ARBTC2 *LIBL/FNARB00F)
007030161122     A                                      DSPATR(HI)
007040161122     A            V5DTC2    R   14   O 11 66REFFLD(§1PDES *LIBL/DS1P)
007050161122     A                                      DSPATR(HI)
007060161122     A                                 12  2'Prima  Consegna  Parziale'
007070161122     A            VIDDCP    R        O 12 28REFFLD(ARBDCP *LIBL/FNARB00F)
007080161122     A                                      EDTWRD('  /  /    ')
007090161122     A                                      DSPATR(HI)
007100161122     A                                 12 47'Consegna Anomala'
007110161122     A            ARBCCA    R        O 12 64REFFLD(ARBCCA *LIBL/FNARB00F)
007120161122     A                                      DSPATR(HI)
007130161122     A            DESCCA        14A  O 12 66DSPATR(HI)
007140161122     A  29
007150161122     AON33
007160161122     AO 33 38                          13  2'INCASSI -->'
007170161122     A                                      DSPATR(UL)
007180161122     A                                      DSPATR(HI)
007190161122     A  29                             13 14'Contrassegno:'
007200161122     A                                      DSPATR(UL)
007210161122     A  29        VIDICC    R    2   O 13 28REFFLD(ARBICC *LIBL/FNARB00F)
007220161122     A                                      DSPATR(HI)
007230161122     A N33
007240161122     AO 33 38                          13 47'Fattura........:'
007250161122     A                                      DSPATR(UL)
007260161122     A N33
007270161122     AO 33 38     VIDICA    R    2   O 13 64REFFLD(ARBICA *LIBL/FNARB00F)
007280161122     A                                      DSPATR(HI)
007290161122     A  70                             13 69'Tipo'
007300161122     A  70        VIDMIF    R        O 13 74REFFLD(ARBMIF *LIBL/FNARB00F)
007310161122     A                                      DSPATR(HI)
007320161122     A  70                             14  2'Incasso Parziale:'
007330161122     A  70                             14 20'Causale'
007340161122     A  70        VIDFIP    R        O 14 28REFFLD(ARBFIP *LIBL/FNARB00F)
007350161122     A                                      DSPATR(HI)
007360161122     A  70                             14 47'Importo'
007370161122     A  70        VIDIMP        13A  O 14 63DSPATR(HI)
007380161122     A  70        V5CDIV         3A  O 14 78DSPATR(HI)
007390161122     A  70                             15 47'Totale Parziale'
007400161122     A  70        VIDIPP        13A  O 15 63DSPATR(HI)
007410161122     A                                 16  2'MANDATO INTROITO:'
007420161122     A                                      DSPATR(UL)
007430161122     A                                 16 23'Data'
007440161122     A            VIDDMI    R        O 16 28REFFLD(ARBDMI *LIBL/FNARB00F)
007450161122     A                                      EDTWRD('  /  /    ')
007460161122     A                                      DSPATR(HI)
007470161122     A                                 16 47'Numero..........'
007480161122     A            VIDNMI    R        O 16 67REFFLD(ARBNMI *LIBL/FNARB00F)
007490161122     A                                      DSPATR(HI)
007500161122     A                                      EDTCDE(2)
007510161122     A  88                             17  2'GIRO DI CONSEGNA:'
007520161122     A                                      DSPATR(HI)
007530161122     A                                      DSPATR(UL)
007540161122     A  88                             17 21'Codice'
007550161122     A  88        V5CCGI        10A  O 17 28DSPATR(HI)
007560161122     A  88                             17 39'-'
007570161122     A  88        V5DCGI        29A  O 17 41DSPATR(HI)
007580161122     A  88        V5DTGI        10A  O 17 71DSPATR(HI)
007590161122     A  88                             18  4'Elaborazione G E O.....'
007600161122     A  88        V5DTTL        12A  O 18 28DSPATR(HI)
007610161122     A  88                             18 41'Esito'
007620161122     A  88        V5CARGERR      2A  O 18 47DSPATR(HI)
007630161122     A  88                             18 50'-'
007640161122     A  88        V5DARGERR     29A  O 18 52DSPATR(HI)
007650161122     A  88                             19  4'Livello normalizzazione'
007660161122     A  88        V5CLNO         2A  O 19 28DSPATR(HI)
007670161122     A  88        V5DLNO        30A  O 19 41DSPATR(HI)
007680161122     A            V7DBVA         6A  O  4 41COLOR(BLU)
007690951220     A**************************************************************************
007700131107     A          R LRI6Z05
007710021217     A                                      OVERLAY
007720021217     A            FD05          62A  O 24  2
007730021217     A            F24D05        16A  O 24 65
007740000000     A**************************************************************************
007750131107     A          R LRI6D06
007760110705     A*%%TS  SD  20110705  102409  EDPES       REL-V6R1M0  5761-WDS
007770110705     A                                      OVERLAY
007780110705     A            ATRBL4A        1   P
007790110705     A            V1DTSP         8A  O  3 72DSPATR(RI)
007800110705     A                                  4  2'SPEDIZIONE:'
007810110705     A                                      DSPATR(UL)
007820110705     A            V3CLNP    R        O  4 15REFFLD(ARBLNP *LIBL/FNARB00F)
007830110705     A                                      DSPATR(HI)
007840110705     A                                      DSPATR(UL)
007850110705     A            V3CNRS    R        O  4 20REFFLD(ARBNRS *LIBL/FNARB00F)
007860110705     A                                      DSPATR(HI)
007870110705     A                                      EDTCDE(Z)
007880110705     A                                      DSPATR(UL)
007890110705     A            V3CNSP    R        O  4 24REFFLD(ARBNSP *LIBL/FNARB00F)
007900110705     A                                      DSPATR(HI)
007910110705     A                                      EDTCDE(Z)
007920110705     A                                      DSPATR(UL)
007930110705     A                                  4 33'del'
007940110705     A            V3CDSP         8Y 0O  4 38DSPATR(HI)
007950110705     A                                      EDTWRD('  /  /    ')
007960110705     A                                      DSPATR(UL)
007970110705     A                                  4 53'Rifer.Mitt.'
007980110705     A            VIDRMN    R        O  4 65REFFLD(ARBRMN *LIBL/FNARB00F)
007990110705     A                                      DSPATR(HI)
008000110705     A                                      EDTCDE(Z)
008010110705     A                                  5  2'Linea Arrivo'
008020110705     A            V3CLNA    R        O  5 15REFFLD(ARBLNA *LIBL/FNARB00F)
008030110705     A                                      DSPATR(HI)
008040110705     A                                  5 19'-'
008050110705     A            D15LNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
008060110705     A                                      DSPATR(HI)
008070110705     A                                  5 38'Destinat.'
008080110705     A            V32RSD    R   32   O  5 48REFFLD(ARBRSD *LIBL/FNARB00F)
008090110705     A                                      DSPATR(HI)
008100110705     A                                  6  2'Cli.Fatturaz'
008110110705     A            V6CKSC         7S 0O  6 15DSPATR(HI)
008120110705     A            V6DKSC        25A  O  6 23DSPATR(HI)
008130110705     A                                  6 53'Tariffa'
008140110705     A            V6CCTR         3S 0O  6 61DSPATR(HI)
008150110705     A            V6DCTR        10A  O  6 65
008160110705     A                                  7  7'--------  Proposta Tassazione da B-
008170110705     A                                      ollettazione  ---------'
008180110705     A                                      DSPATR(&ATRBL4A)
008190110705     A                                  8  7'Cliente'
008200110705     A                                      DSPATR(&ATRBL4A)
008210110705     A            V6CAR4KSC      7  0O  8 15DSPATR(HI)
008220110705     A                                      DSPATR(&ATRBL4A)
008230110705     A            V6DAR4KSC     25   O  8 23DSPATR(&ATRBL4A)
008240110705     A                                  8 53'Tariffa'
008250110705     A                                      DSPATR(&ATRBL4A)
008260110705     A            V6CAR4CTR      3   O  8 61DSPATR(HI)
008270110705     A                                      DSPATR(&ATRBL4A)
008280110705     A                                  9  3'Colli'
008290110705     A                                  9 12'Peso Fatt.'
008300110705     A                                  9 27'Volume Fatt.'
008310110705     A                                  9 43'Qta'' Fatturabile'
008320110705     A                                  9 62'Codice Tassazione'
008330110705     A            VIDNCL    R        O 10  2REFFLD(ARBNCL *LIBL/FNARB00F)
008340110705     A                                      DSPATR(HI)
008350110705     A                                      EDTCDE(2)
008360110705     A            VIDPKF    R        O 10 12REFFLD(ARBPKB *LIBL/FNARB00F)
008370110705     A                                      DSPATR(HI)
008380110705     A                                      EDTCDE(2)
008390110705     A                                 10 22'Kg.'
008400110705     A            VIDFVF    R        O 10 28REFFLD(ARBFVF *LIBL/FNARB00F)
008410110705     A                                      DSPATR(HI)
008420110705     A            VIDVLF    R        O 10 32REFFLD(ARBVLF *LIBL/FNARB00F)
008430110705     A                                      DSPATR(HI)
008440110705     A                                      EDTCDE(4)
008450110705     A            VIDQFT    R     Y  O 10 42REFFLD(ARBQFT *LIBL/FNARB00F)
008460110705     A                                      EDTCDE(2)
008470110705     A                                      DSPATR(HI)
008480110705     A            V6CCTS    R        O 10 62REFFLD(ARBCTS *LIBL/FNARB00F)
008490110705     A                                      DSPATR(HI)
008500110705     A            V6DCTS        15A  O 10 65TEXT('DESCRIZIONE')
008510110705     A                                 12 10'Divisa'
008520110705     A                                 12 28'Importo / L.IVA / Numero / Data FA-
008530110705     A                                      TTURA'
008540110705     A            VIDDIV         3A  O 13 12DSPATR(HI)
008550110705     A            VIDIFT        13A  O 13 22DSPATR(HI)
008560110705     A            VIDFIV    R        O 13 39REFFLD(AR6FIV *LIBL/FIAR600F)
008570110705     A                                      DSPATR(HI)
008580110705     A                                      EDTCDE(Z)
008590110705     A            VIDNFT    R        O 13 45REFFLD(AR6NFT *LIBL/FIAR600F)
008600110705     A                                      DSPATR(HI)
008610110705     A                                      EDTCDE(2)
008620110705     A            VIDDFT        10A  O 13 56DSPATR(HI)
008630110705     A                                 15  7'Trasporto'
008640110705     A                                 15 21'Tot.Imponibile'
008650110705     A                                 15 47'I.V.A.'
008660110705     A                                 15 58'Esenzione IVA'
008670110705     A            VIDPOR        13A  O 16  3DSPATR(HI)
008680110705     A            VIDIMV        13A  O 16 22DSPATR(HI)
008690110705     A            VIDIVA        13A  O 16 40DSPATR(HI)
008700110705     A            VIDCEI    R        O 16 58REFFLD(AR6CEI *LIBL/FIAR600F)
008710110705     A                                      DSPATR(HI)
008720110705     A            DESCEI    R        O 16 60REFFLD(§EIDES *LIBL/DSEI)
008730110705     A            VIDFIM         8A  O 17 27
008740110705     A                                 18  2'--------- Varie ---------'
008750110705     A                                 18 29'--------- Varie ---------'
008760110705     A                                 18 56'--------- Varie ---------'
008770000000     A**************************************************************************
008780131107     A          R LRI6S06                   SFL
008790110705     A*%%TS  SD  20110705  102409  EDPES       REL-V6R1M0  5761-WDS
008800110705     A            V6CSV1    R        O 19  2REFFLD(AR6SV1 *LIBL/FIAR600F)
008810110705     A                                      DSPATR(HI)
008820110705     A            V6CVA1        13A  O 19  4DSPATR(HI)
008830110705     A            V6CDE1         9A  O 19 18TEXT('DESCRIZIONE')
008840000000     A**************************************************************************
008850131107     A          R LRI6C06                   SFLCTL(LRI6S06)
008860110705     A*%%TS  SD  20110705  102409  EDPES       REL-V6R1M0  5761-WDS
008870110705     A                                      CF12
008880110705     A                                      OVERLAY
008890110705     A N35                                  SFLDSP
008900110705     A N35                                  SFLDSPCTL
008910110705     A  35                                  SFLCLR
008920110705     A                                      SFLSIZ(0016)
008930110705     A                                      SFLPAG(0015)
008940110705     A                                      SFLLIN(0002)
008950110705     A  28        V1CMSG        78   M
008960110705     A                                 24  2'F12=Ritorno'
008970000000     A**************************************************************************
008980000000     A*  FR3F VIDCPC  FORMATO RIEPILOGATIVO DELLA BOLLA IN ARRIVO
008990000000     A**************************************************************************
009000180124     A          R LRI6D07
009010180124     A*%%TS  SD  20180124  144140  EDPES       REL-V7R2M0  5770-WDS
009020180124     A  63
009030180124     AO 61                                  CF01
009040180124     A                                      CA03
009050180124     A  95                                  CF05
009060180124     A  17                                  CF06
009070180124     A  67                                  CF07
009080180124     A  18                                  CF08
009090180124     A  74 16                               CF23
009100180124     A  98                                  CF10
009110180124     A  77                                  CF11
009120180124     A                                      CF12
009130180124     A  24                                  CF13
009140180124     A  03                                  CF14
009150180124     A                                      CA15
009160180124     A  64                                  CF16
009170180124     A  17                                  CF17
009180180124     A  94                                  CF18
009190180124     A                                      CF19
009200180124     A                                      CF20
009210180124     A                                      CF21
009220180124     A  86                                  CF22
009230180124     A                                      CF24
009240180124     A  04                                  CF02
009250180124     A  22                                  CF04
009260180124     A                                      CA09
009270180124     A                                      OVERLAY
009280180124     A  28        V1CMSG        78   M
009290180124     A            ATRPDA         1A  P
009300180124     A            ATRTSP         1A  P
009310180124     A            ATRINC         1A  P
009320180124     A                                  3  3'SPEDIZIONE:'
009330180124     A                                      DSPATR(UL)
009340180124     A            V3CLNP    R        O  3 15REFFLD(ARBLNP *LIBL/FNARB00F)
009350180124     A                                      DSPATR(HI)
009360180124     A                                      DSPATR(UL)
009370180124     A            V3CNRS    R        O  3 19REFFLD(ARBNRS *LIBL/FNARB00F)
009380180124     A                                      DSPATR(HI)
009390180124     A                                      DSPATR(UL)
009400180124     A                                      EDTCDE(Z)
009410180124     A                                  3 22'-'
009420180124     A            V3CNSP    R        O  3 24REFFLD(ARBNSP *LIBL/FNARB00F)
009430180124     A                                      DSPATR(HI)
009440180124     A                                      EDTCDE(2)
009450180124     A                                      DSPATR(UL)
009460180124     A                                  3 35'del'
009470180124     A            V3CDSP         8Y 0O  3 39TEXT('data spedizione (visualizzazi-
009480180124     A                                      one)')
009490180124     A                                      DSPATR(HI)
009500180124     A                                      EDTWRD('  /  /    ')
009510180124     A                                      DSPATR(UL)
009520180124     A                                  3 50'LnArrivo'
009530180124     A            V3CLNA    R        O  3 59REFFLD(ARBLNA *LIBL/FNARB00F)
009540180124     A                                      DSPATR(HI)
009550180124     A            V7DLNA        18A  O  3 63DSPATR(HI)
009560180124     A                                      TEXT('DESCRIZIONE FILIALE')
009570180124     A            V3CCBO    R        O  4  3REFFLD(ARBCBO *LIBL/FNARB00F)
009580180124     A                                      DSPATR(HI)
009590180124     A            V5DCBO        15A  O  4  6TEXT('DESCRIZIONE')
009600180124     A            V1DAR8        12A  O  4 24DSPATR(HI)
009610180124     A  62                              4 45'BOLLA:'
009620180124     A                                      DSPATR(UL)
009630180124     A  62
009640180124     AO 27        V1DFBC        10A  O  4 52
009650180124     A  66
009660180124     AO 27                                  DSPATR(RI)
009670180124     A  62                                  COLOR(BLU)
009680180124     A            V1DBAM         6A  O  4 65
009690180124     A  76                                  DSPATR(HI)
009700180124     A            V1DTSP         8A  O  4 73DSPATR(&ATRTSP)
009710180124     A                                  5  3'Mittente'
009720180124     A            V28RSM        24A  O  5 12DSPATR(HI)
009730180124     A                                      DSPATR(UL)
009740180124     A                                      TEXT('RAG.SOCIALE MITTENTE 1')
009750180124     A            V25LOM    R   25   O  5 37REFFLD(ARBLOM *LIBL/FNARB00F)
009760180124     A                                      DSPATR(HI)
009770180124     A                                      DSPATR(UL)
009780180124     A            V7CPRM         3A  O  5 64DSPATR(HI)
009790180124     A                                      DSPATR(UL)
009800180124     A                                      TEXT('PROVINCIA MITTENTE')
009810180124     A            V7DINC         3   O  5 69DSPATR(&ATRINC)
009820180124     A            V7DBVA         6A  O  5 73TEXT('FLAG "COLLI DI VALORE"')
009830180124     A                                      COLOR(BLU)
009840180124     A            V3CKSC    R        O  6  4REFFLD(ARBKSC *LIBL/FNARB00F)
009850180124     A                                      DSPATR(HI)
009860180124     A                                      EDTCDE(Z)
009870180124     A                                  6 14'Rifer.'
009880180124     A            VIDRMN    R        O  6 21REFFLD(ARBRMN *LIBL/FNARB00F)
009890180124     A                                      DSPATR(HI)
009900180124     A                                      EDTCDE(Z)
009910180124     A                                      DSPATR(UL)
009920180124     A            VIDRMA    R        O  6 37REFFLD(ARBRMA *LIBL/FNARB00F)
009930180124     A                                      DSPATR(HI)
009940180124     A                                      DSPATR(UL)
009950180124     A                                  6 54'Segn'
009960180124     A            VIDFLS         3A  O  6 59DSPATR(HI)
009970180124     A                                      DSPATR(UL)
009980180124     A            VIDNCDA       15A  O  6 63DSPATR(HI)
009990180124     A                                      DSPATR(UL)
010000180124     A            VIDZNC         2Y 0O  6 79DSPATR(HI)
010010180124     A                                  7  2'Arrivo Colli'
010020180124     A N96        V06DAM         6Y 0O  7 15TEXT('DATA ARRIVO MERCE A FILIALE A-
010030180124     A                                      RRIVO')
010040180124     A                                      EDTWRD('  /  /  ')
010050180124     A                                      DSPATR(HI)
010060180124     A  96                              7 16'NO'
010070180124     A                                      DSPATR(HI)
010080180124     A N96        V7DALNA        1A  O  7 24
010090180124     A N96        V7DLNAA        7A  O  7 26
010100180124     A N96        V7DDAM         8A  O  7 34DSPATR(HI)
010110180124     A                                  7 43'Colli'
010120180124     A            VIDNCL    R        O  7 49REFFLD(ARBNCL *LIBL/FNARB00F)
010130180124     A                                      DSPATR(HI)
010140180124     A                                      EDTCDE(Z)
010150180124     A                                      DSPATR(UL)
010160180124     A                                  7 55'Peso'
010170180124     A            VIDPKF    R        O  7 60REFFLD(ARBPKB *LIBL/FNARB00F)
010180180124     A                                      DSPATR(HI)
010190180124     A                                      EDTCDE(4)
010200180124     A                                      DSPATR(UL)
010210180124     A                                  7 69'Vol'
010220180124     A            VIDFVF    R        O  7 73REFFLD(ARBFVB *LIBL/FNARB00F)
010230180124     A                                      DSPATR(HI)
010240180124     A                                      DSPATR(UL)
010250180124     A            VIDVLF    R        O  7 75REFFLD(ARBVLB *LIBL/FNARB00F)
010260180124     A                                      EDTCDE(4)
010270180124     A                                      DSPATR(HI)
010280180124     A                                      DSPATR(UL)
010290180124     A            V7DRIG1       77A  O  8  2
010300180124     A            V3CGESD        1A  B  8 80VALUES(' ' '?')
010310180124     A  55                                  DSPATR(PR)
010320180124     A  55                                  DSPATR(ND)
010330180124     A  69        V7DCONS       11A  O  9  2DSPATR(UL)
010340180124     A                                      COLOR(RED)
010350180124     A N69        V7DST1        79A  O  9  2COLOR(RED)
010360180124     A  69        V08DCM    R        O  9 15REFFLD(ARBDCM *LIBL/FNARB00F)
010370180124     A                                      EDTWRD('  /  /    ')
010380180124     A N19                                  DSPATR(RI)
010390180124     A  19                                  DSPATR(HI)
010400180124     A                                      COLOR(RED)
010410180124     A  69        VIDHMC         5A  O  9 26
010420180124     A N19                                  DSPATR(RI)
010430180124     A  19                                  DSPATR(HI)
010440180124     A                                      COLOR(RED)
010450180124     A            V7DCCA         9A  O  9 34COLOR(RED)
010460180124     A  69        DESCCA7       22A  O  9 44DSPATR(HI)
010470180124     A                                      COLOR(RED)
010480180124     A  69                              9 69'Ritardo'
010490180124     A  69        VIDNRC    R        O  9 77REFFLD(ARBNRC *LIBL/FNARB00F)
010500180124     A                                      DSPATR(HI)
010510180124     A                                      EDTCDE(Q)
010520180124     A            V7DST2        79A  O 10  2COLOR(RED)
010530180124     A            V7DST3        77A  O 11  2
010540180124     A  58                                  COLOR(RED)
010550180124     A            VIDDEC_F       1A  B 11 80VALUES(' ' '?')
010560180124     A N54                                  DSPATR(ND)
010570180124     A N54                                  DSPATR(PR)
010580180124     A N97N84                          12  2'DISTINTA'
010590180124     A  97                             12  2'Entrata Colli'
010600180124     A N97N84     ARBNDC    R        O 12 11REFFLD(ARBNDC *LIBL/FNARB00F)
010610180124     A                                      DSPATR(HI)
010620180124     A                                      EDTCDE(Z)
010630180124     A  97        V7DDSE        10A  O 12 16DSPATR(HI)
010640180124     A N97N84     V7DFPP         3A  O 12 19DSPATR(HI)
010650180124     A N97N84     VIDPDA         6A  O 12 23COLOR(RED)
010660180124     A                                      DSPATR(&ATRPDA)
010670180124     A  97        V7DDSED        8A  O 12 28DSPATR(HI)
010680180124     A N97N84     V7DDEL         3A  O 12 31
010690180124     A N97N84     VIDDDC    R        O 12 35REFFLD(ARBDDC *LIBL/FNARB00F)
010700180124     A                                      EDTWRD('  /  /    ')
010710180124     A                                      DSPATR(HI)
010720180124     A            V7DNCL_DE     18A  O 12 47
010730180124     A            V7DNCL_CO     11A  O 12 66DSPATR(HI)
010740180124     A N84        V7DAUT         6A  O 13 31
010750180124     A N84        VIDPDC    R        O 13 38REFFLD(ARBPDC *LIBL/FNARB00F)
010760180124     A                                      DSPATR(HI)
010770180124     A                                      EDTCDE(Z)
010780180124     A N84        DESPD1        34A  O 13 47DSPATR(HI)
010790180124     A            V7DUEVD       13A  O 14  2
010800180124     A            V7DUEVB       65A  O 14 16DSPATR(HI)
010810180124     A                                 15  2'-----------------------------------
010820180124     A                                      ------------------------------------
010830180124     A                                      ----------'
010840180124     A                                 16  2'Destinat'
010850180124     A            V4CNOM        70A  O 16 11DSPATR(HI)
010860180124     A                                      DSPATR(UL)
010870180124     A                                      TEXT('RAGIONE SOCIALE DESTINATARIO')
010880180124     A            VIDKSC    R        O 17  2REFFLD(ARBKSC *LIBL/FNARB00F)
010890180124     A                                      DSPATR(HI)
010900180124     A                                      EDTCDE(Z)
010910180124     A            V33IND        33A  O 17 11DSPATR(HI)
010920180124     A                                      DSPATR(UL)
010930180124     A                                      TEXT('INDIRIZZO DESTINATARIO')
010940180124     A            V4CLOD        35A  O 17 46DSPATR(HI)
010950180124     A                                      DSPATR(UL)
010960180124     A                                      TEXT('LOCALITA'' DESTINATARIO')
010970180124     A                                 18  2'C/Assegno'
010980180124     A            VIDTIC    R        O 18 12REFFLD(AR9TIC *LIBL/FIAR900F)
010990180124     A                                      DSPATR(HI)
011000180124     A            VIDCAS    R        O 18 15REFFLD(AR9CAS *LIBL/FIAR900F)
011010180124     A                                      DSPATR(HI)
011020180124     A                                      EDTCDE(4)
011030180124     A            VIDVCA    R        O 18 30REFFLD(AR9VCA *LIBL/FIAR900F)
011040180124     A                                      DSPATR(HI)
011050180124     A  65                             18 34'?'
011060180124     A  65        VIDBEN         1A  B 18 36VALUES(' ' '?')
011070180124     A  29        V7DICC         9A  O 18 39DSPATR(HI)
011080180124     A                                      TEXT('S= INCASSATO CONTRASSEGNO')
011090180124     A            V1DFFD        10A  O 18 55DSPATR(HI)
011100180124     A            V4CCAD    R        O 18 68REFFLD(ARBCAD *LIBL/FNARB00F)
011110180124     A                                      DSPATR(HI)
011120180124     A                                      DSPATR(UL)
011130180124     A            V7CPRD         3A  O 18 78DSPATR(HI)
011140180124     A                                      DSPATR(UL)
011150180124     A                                      TEXT('PROVINCIA DESTINATARIO')
011160180124     A                                 19  2'Consegne Particolari'
011170180124     A            ARBTC1    R        O 19 23REFFLD(ARBTC1 *LIBL/FNARB00F)
011180180124     A                                      DSPATR(HI)
011190180124     A            V7DTC1    R   25   O 19 25REFFLD(§1PDES *LIBL/DS1P)
011200180124     A                                      DSPATR(HI)
011210180124     A                                 19 58'Consegna Richiesta'
011220180124     A            ARBTC2    R        O 20 23REFFLD(ARBTC2 *LIBL/FNARB00F)
011230180124     A                                      DSPATR(HI)
011240180124     A            V7DTC2    R        O 20 25REFFLD(§1PDES *LIBL/DS1P)
011250180124     A                                      DSPATR(HI)
011260180124     A            VIDTCR    R   11   O 20 53REFFLD(ARBTCR *LIBL/FNARB00F)
011270180124     A                                      DSPATR(HI)
011280180124     A            VIDDCR    R        O 20 65REFFLD(ARBDCR *LIBL/FNARB00F)
011290180124     A                                      DSPATR(HI)
011300180124     A                                      EDTWRD('  /  /    ')
011310180124     A            VIDHCR    R        O 20 76REFFLD(ARBHCR *LIBL/FNARB00F)
011320180124     A                                      DSPATR(HI)
011330180124     A                                      EDTWRD('  :  ')
011340180124     A                                 21  2'Particolarità:'
011350180124     A                                 21 17'Giacenza'
011360180124     A  42                             21 26'?'
011370180124     A  42        V4IGGA         1A  B 21 28
011380180124     A            V4CGGA         2A  O 21 30DSPATR(HI)
011390180124     A                                 21 34'Consegna'
011400180124     A  43                             21 43'?'
011410180124     A  43        V4IGMA         1A  B 21 45VALUES(' ' '?')
011420180124     A            V4CGMA         2A  O 21 47DSPATR(HI)
011430180124     A                                 21 51'Varie'
011440180124     A  44                             21 57'?'
011450180124     A  44        V4IGVA         1A  B 21 59VALUES(' ' '?')
011460180124     A            V4CGVA         2A  O 21 61DSPATR(HI)
011470180124     A            V7DGGC        11A  O 21 64
011480180124     A            VIDGC1    R        O 21 76REFFLD(ARBGC1 *LIBL/FNARB00F)
011490180124     A                                      DSPATR(HI)
011500180124     A            VIDGC2    R        O 21 79REFFLD(ARBGC2 *LIBL/FNARB00F)
011510180124     A                                      DSPATR(HI)
011520180124     A            V4CNO1    R        O 22  2REFFLD(AR4NOT *LIBL/FIAR400F)
011530180124     A                                      DSPATR(HI)
011540180124     A            V4CNO2    R        O 22 39REFFLD(AR4NOT *LIBL/FIAR400F)
011550180124     A                                      DSPATR(HI)
011560180124     A  92        LEGAME        58A  O 23  2DSPATR(RI)
011570180124     A                                 23 62'F15=Bolla'
011580180124     A                                      DSPATR(HI)
011590180124     A                                 23 73'F3=Fine'
011600180124     A            FD07          62A  O 24  2
011610180124     A            F24D07        16A  O 24 65
011620000000     A**************************************************************************
011630131107     A          R LRI6S08                   SFL
011640950103     A            V8CI80         1A  H      TEXT('INDICATORE 80')
011650950103     A            V8CI81         1A  H      TEXT('INDICATORE 81')
011660950103     A            V8CI82         1A  H      TEXT('INDICATORE 82')
011670950103     A            V8CI83         1A  H      TEXT('INDICATORE 83')
011680950103     A            V8CAAP    R        O 11  2REFFLD(LBLAAP *LIBL/FNLBL00F)
011690950103     A  81                                  DSPATR(RI)
011700950103     A                                      EDTCDE(Z)
011710950103     A            V8CLPP    R        O 11  7REFFLD(LBLLPP *LIBL/FNLBL00F)
011720950103     A  81                                  DSPATR(RI)
011730950103     A                                      EDTCDE(Z)
011740950103     A            V8CNRP    R        O 11 11REFFLD(LBLNRP *LIBL/FNLBL00F)
011750950103     A  81                                  DSPATR(RI)
011760950103     A                                      EDTCDE(Z)
011770950103     A            V8CNSP    R        O 11 14REFFLD(LBLNSP *LIBL/FNLBL00F)
011780950103     A  81                                  DSPATR(RI)
011790950103     A                                      EDTCDE(Z)
011800950103     A            V8CLAP    R        O 11 22REFFLD(LBLLAP *LIBL/FNLBL00F)
011810950103     A  81                                  DSPATR(RI)
011820950103     A                                      EDTCDE(Z)
011830950103     A            V8CAAN    R        O 11 30REFFLD(LBLAAN *LIBL/FNLBL00F)
011840950103     A  83                                  DSPATR(ND)
011850950103     A  82                                  DSPATR(RI)
011860950103     A                                      EDTCDE(Z)
011870950103     A            V8CLPN    R        O 11 35REFFLD(LBLLPN *LIBL/FNLBL00F)
011880950103     A  83                                  DSPATR(ND)
011890950103     A  82                                  DSPATR(RI)
011900950103     A                                      EDTCDE(Z)
011910950103     A            V8CNRN    R        O 11 39REFFLD(LBLNRN *LIBL/FNLBL00F)
011920950103     A  83                                  DSPATR(ND)
011930950103     A  82                                  DSPATR(RI)
011940950103     A                                      EDTCDE(Z)
011950950103     A            V8CNSN    R        O 11 42REFFLD(LBLNSN *LIBL/FNLBL00F)
011960950103     A  83                                  DSPATR(ND)
011970950103     A  82                                  DSPATR(RI)
011980950103     A                                      EDTCDE(Z)
011990950103     A            V8CLAN    R        O 11 50REFFLD(LBLLAN *LIBL/FNLBL00F)
012000950103     A  83                                  DSPATR(ND)
012010950103     A  82                                  DSPATR(RI)
012020950103     A                                      EDTCDE(Z)
012030950103     A            V8CPRE        23A  O 11 57
012040950103     A            V8CSCE         1A  B 11 55DSPATR(UL)
012050950103     A                                      VALUES('5' ' ')
012060950103     A  80                                  DSPATR(ND)
012070950103     A  80                                  DSPATR(PR)
012080950103     A                                 12  1'  '
012090000000     A**************************************************************************
012100131107     A          R LRI6C08                   SFLCTL(LRI6S08)
012110991026     A                                      CF12
012120991026     A                                      OVERLAY
012130991026     A  78                                  SFLDSP
012140991026     A  79                                  SFLDSPCTL
012150991026     A N79                                  SFLCLR
012160991026     A  23                                  SFLEND
012170991026     A                                      SFLFOLD(CA09)
012180991026     A                                      SFLSIZ(0007)
012190991026     A                                      SFLPAG(0006)
012200991026     A            REC8           4S 0H      SFLRCDNBR
012210991026     A  28        V1CMSG        78   M
012220991026     A                                  4  2'SPEDIZIONE:'
012230991026     A                                      DSPATR(UL)
012240991026     A            V3CLNP    R        O  4 15REFFLD(ARBLNP *LIBL/FNARB00F)
012250991026     A                                      DSPATR(HI)
012260991026     A                                      DSPATR(UL)
012270991026     A            V3CNRS    R        O  4 20REFFLD(ARBNRS *LIBL/FNARB00F)
012280991026     A                                      DSPATR(HI)
012290991026     A                                      EDTCDE(Z)
012300991026     A                                      DSPATR(UL)
012310991026     A            V3CNSP    R        O  4 24REFFLD(ARBNSP *LIBL/FNARB00F)
012320991026     A                                      DSPATR(HI)
012330991026     A                                      EDTCDE(Z)
012340991026     A                                      DSPATR(UL)
012350991026     A                                  4 33'del'
012360991026     A            V3CDSP         8Y 0O  4 38DSPATR(HI)
012370991026     A                                      EDTWRD('  /  /    ')
012380991026     A                                      DSPATR(UL)
012390991026     A                                  4 53'Rifer.Mitt.'
012400991026     A            VIDRMN    R        O  4 65REFFLD(ARBRMN *LIBL/FNARB00F)
012410991026     A                                      DSPATR(HI)
012420991026     A                                      EDTCDE(Z)
012430991026     A                                  5  2'Linea Arrivo'
012440991026     A            V3CLNA    R        O  5 15REFFLD(ARBLNA *LIBL/FNARB00F)
012450991026     A                                      DSPATR(HI)
012460991026     A                                  5 19'-'
012470991026     A            D15LNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
012480991026     A                                      DSPATR(HI)
012490991026     A                                  5 38'Destinat.'
012500991026     A            V32RSD    R   32   O  5 48REFFLD(ARBRSD *LIBL/FNARB00F)
012510991026     A                                      DSPATR(HI)
012520991026     A                                  7  9'B O L L A'
012530991026     A                                  7 37'B O L L A'
012540991026     A                                  8  2'  P R E C E D E N T E  '
012550991026     A                                      DSPATR(UL)
012560991026     A                                  8 30'    S E G U E N T E    '
012570991026     A                                      DSPATR(UL)
012580991026     A                                  8 55'5'
012590991026     A                                      DSPATR(UL)
012600991026     A                                      DSPATR(HI)
012610991026     A                                  9  2'Anno'
012620991026     A                                  9  7'LNP'
012630991026     A                                  9 11'Sr'
012640991026     A                                  9 14'Nr.sped'
012650991026     A                                  9 22'LNA'
012660991026     A                                  9 30'Anno'
012670991026     A                                  9 35'LNP'
012680991026     A                                  9 39'Sr'
012690991026     A                                  9 42'Nr.sped'
012700991026     A                                  9 50'LNA'
012710000000     A**************************************************************************
012720131107     A          R LRI6Z08
012730941230     A                                      OVERLAY
012740941230     A                                 24  2'F12=Ritorno'
012750941230     A                                 24 38'INVIO=Prosegui'
012760040216     A**************************************************************************
012770131107     A          R LRI6D09
012780041130     A*%%TS  SD  20041130  105522  EDPMB       REL-V4R4M0  5769-PW1
012790041130     A                                      CF12
012800041130     A                                      OVERLAY
012810041130     A            V1DTSP         8A  O  3 72TEXT('TIPO SERVIZIO BOLLA')
012820041130     A                                      DSPATR(RI)
012830041130     A                                  4  2'SPEDIZIONE:'
012840041130     A                                      DSPATR(UL)
012850041130     A            V3CLNP         3S 0O  4 15DSPATR(HI)
012860041130     A                                      DSPATR(UL)
012870041130     A                                      TEXT('FILIALE PARTENZA')
012880041130     A            V3CNRS         2Y 0O  4 20DSPATR(HI)
012890041130     A                                      EDTCDE(Z)
012900041130     A                                      DSPATR(UL)
012910041130     A                                      TEXT('NUMERO SERIE')
012920041130     A            V3CNSP         7Y 0O  4 24DSPATR(HI)
012930041130     A                                      EDTCDE(Z)
012940041130     A                                      DSPATR(UL)
012950041130     A                                      TEXT('NUMERO SPEDIZIONE')
012960041130     A                                  4 33'del'
012970041130     A            V3CDSP         8Y 0O  4 38DSPATR(HI)
012980041130     A                                      EDTWRD('  /  /    ')
012990041130     A                                      DSPATR(UL)
013000041130     A                                  4 53'Rifer.Mitt.'
013010041130     A            VIDRMN        15Y 0O  4 65DSPATR(HI)
013020041130     A                                      EDTCDE(Z)
013030041130     A                                      TEXT('RIFERIMENTO MITTENTE NUM.')
013040041130     A                                  5  2'Linea Arrivo'
013050041130     A            V3CLNA         3S 0O  5 15DSPATR(HI)
013060041130     A                                      TEXT('FILIALE ARRIVO')
013070041130     A                                  5 19'-'
013080041130     A            D15LNA        15A  O  5 21DSPATR(HI)
013090041130     A                                      TEXT('DESCRIZIONE FILIALE')
013100041130     A                                  5 38'Destinat.'
013110041130     A            V32RSD        32A  O  5 48DSPATR(HI)
013120041130     A                                      TEXT('RAGIONE SOCIALE DESTINATARIO')
013130041130     A                                  7  1'----------------------  E S T E N -
013140041130     A                                      S I O N E    B O L L A  ------------
013150041130     A                                      -----------'
013160041130     A                                      DSPATR(HI)
013170041130     A                                  9  2'Cliente Fatturazione'
013180041130     A            V9CKSC         7S 0O  9 25DSPATR(HI)
013190041130     A            V9DKSC        35A  O  9 34DSPATR(HI)
013200041130     A                                 11 16'----- Tariffa ------'
013210041130     A                                 11 45'---- Contrassegno ----'
013220041130     A            V9CCTR         3Y 0O 12 16DSPATR(HI)
013230041130     A            V9DCTR        15A  O 12 21
013240041130     A            VIDCAS        13Y 3O 12 45DSPATR(HI)
013250041130     A                                      EDTCDE(2)
013260041130     A            VIDVCA         3A  O 12 64DSPATR(HI)
013270041130     A                                 15 14'Divisa'
013280041130     A                                 15 30'Importo / L.IVA / Numero / Data FA-
013290041130     A                                      TTURA'
013300041130     A            V9CDIV         3A  O 16 16DSPATR(HI)
013310041130     A            V9CIFT        13A  O 16 24DSPATR(HI)
013320041130     A            V9CFIV         3Y 0O 16 41DSPATR(HI)
013330041130     A                                      EDTCDE(Z)
013340041130     A                                      TEXT('COD.FILIALE IVA')
013350041130     A            V9CNFT         6Y 0O 16 47DSPATR(HI)
013360041130     A                                      EDTCDE(2)
013370041130     A                                      TEXT('NUMERO FATTURA')
013380041130     A            V9CDFT        10A  O 16 57DSPATR(HI)
013390041130     A                                 18  2'---- Varie ----'
013400041130     A                                 18 18'---- Varie ----'
013410041130     A            V9DFI2        10A  O 18 35
013420041130     A N06                             18 47'Importo I.V.A.'
013430041130     A  06                             18 47'Importo Bollo'
013440041130     A                                 18 62'Esenzione IVA'
013450041130     A            V9CSV1         1A  O 19  2DSPATR(HI)
013460041130     A            V9CVA1        13A  O 19  4DSPATR(HI)
013470041130     A            V9CSV5         1A  O 19 18DSPATR(HI)
013480041130     A            V9CVA5        13A  O 19 20DSPATR(HI)
013490041130     A            V9DFIM         8A  O 19 36DSPATR(HI)
013500041130     A            V9CIVA        13A  O 19 47DSPATR(HI)
013510041130     A            V9CCEI         1A  O 19 62DSPATR(HI)
013520041130     A                                      TEXT('CODICE ESENZIONE IVA')
013530041130     A            V9DCEI        15A  O 19 64TEXT('DESCRIZIONE')
013540041130     A            V9CSV2         1A  O 20  2DSPATR(HI)
013550041130     A            V9CVA2        13A  O 20  4DSPATR(HI)
013560041130     A            V9CSV6         1A  O 20 18DSPATR(HI)
013570041130     A            V9CVA6        13A  O 20 20DSPATR(HI)
013580041130     A            V9CSV3         1A  O 21  2DSPATR(HI)
013590041130     A            V9CVA3        13A  O 21  4DSPATR(HI)
013600041130     A            V9CSV4         1A  O 22  2DSPATR(HI)
013610041130     A            V9CVA4        13A  O 22  4DSPATR(HI)
013620041130     A                                 24  2'F12=Ritorno'
013630990119     A**************************************************************************
013640131107     A          R LRI6S11                   SFL
013650990119     A            V11AAC         4  0H
013660990119     A            V11SCE         1A  B  7  2DSPATR(HI)
013670990119     A                                      VALUES('5' ' ')
013680990119     A            V11FIL         3  0O  7  4DSPATR(HI)
013690990119     A            V11NCA         7Y 0O  7  8DSPATR(HI)
013700990119     A                                      EDTCDE(Z)
013710990119     A            V11DCA         8Y 0O  7 17EDTWRD('  /  /    ')
013720990119     A            V11FCA         3  0O  7 29
013730990119     A            V11DFA        48   O  7 33
013740990119     A**************************************************************************
013750131107     A          R LRI6C11                   SFLCTL(LRI6S11)
013760991026     A                                      CF12
013770991026     A                                      OVERLAY
013780991026     A  78                                  SFLDSP
013790991026     A  79                                  SFLDSPCTL
013800991026     A N79                                  SFLCLR
013810991026     A  23                                  SFLEND
013820991026     A                                      SFLSIZ(0017)
013830991026     A                                      SFLPAG(0016)
013840991026     A            V1DTSP         8A  O  3 72DSPATR(RI)
013850991026     A                                  4  2'SPEDIZIONE:'
013860991026     A                                      DSPATR(UL)
013870991026     A            V3CLNP    R        O  4 15REFFLD(BLPLNP *LIBL/FNBLP00F)
013880991026     A                                      DSPATR(HI)
013890991026     A                                      DSPATR(UL)
013900991026     A            V3CNRS    R        O  4 20REFFLD(BLPNRS *LIBL/FNBLP00F)
013910991026     A                                      DSPATR(HI)
013920991026     A                                      EDTCDE(Z)
013930991026     A                                      DSPATR(UL)
013940991026     A            V3CNSP    R        O  4 24REFFLD(BLPNSP *LIBL/FNBLP00F)
013950991026     A                                      DSPATR(HI)
013960991026     A                                      EDTCDE(Z)
013970991026     A                                      DSPATR(UL)
013980991026     A                                  4 33'del'
013990991026     A            V3CDSP         8Y 0O  4 38DSPATR(HI)
014000991026     A                                      EDTWRD('  /  /    ')
014010991026     A                                      DSPATR(UL)
014020991026     A                                  4 53'Rifer.Mitt.'
014030991026     A            VIDRMN    R        O  4 65REFFLD(BLPRMN *LIBL/FNBLP00F)
014040991026     A                                      DSPATR(HI)
014050991026     A                                      EDTCDE(Z)
014060991026     A                                  5  2'Linea Arrivo'
014070991026     A            V1CLNA    R        O  5 15REFFLD(BLPLNA *LIBL/FNBLP00F)
014080991026     A                                      DSPATR(HI)
014090991026     A                                  5 19'-'
014100991026     A            D15LNA    R   15   O  5 21REFFLD(ORGDES *LIBL/AZORG00F)
014110991026     A                                      DSPATR(HI)
014120991026     A                                  5 38'Destinat.'
014130991026     A            V32RSD    R   32   O  5 48REFFLD(BLPRSD *LIBL/FNBLP00F)
014140991026     A                                      DSPATR(HI)
014150991026     A                                  6  2'5|Comunicazione Anomalia |  F a s -
014160991026     A                                      e                                  -
014170991026     A                                               |'
014180991026     A                                      DSPATR(UL)
014190991026     A                                      DSPATR(HI)
014200040216     A**************************************************************************
014210131107     A          R LRI6Z11
014220990119     A                                      OVERLAY
014230990119     A                                 24  3'F12=Ritorno'
014240990119     A                                 24 36'INVIO=Prosegui'
014250091214     A**************************************************************************
014260131107     A          R LRI6WDAS
014270091214     A*%%TS  SD  20091214  120625  EDPES       REL-V5R4M0  5722-WDS
014280091214     A                                      OVERLAY
014290091214     A                                      WINDOW(17 2 6 45)
014300091214     A                                  1  1'Beneficiario C/Assegno:'
014310091214     A            WDABEN        20   O  1 25DSPATR(UL)
014320091214     A            WDASCDI        7A  O  3  1DSPATR(HI)
014330091214     A            WDASRSC       35A  O  3 10DSPATR(HI)
014340091214     A                                  5 30'INVIO=Prosegui'
014350141010     A**************************************************************************
014360141010     A          R LRI6WDDC
014370141010     A*%%TS  SD  20141010  112434  EDPRM       REL-V7R1M0  5770-WDS
014380141010     A                                      CF19
014390141010     A                                      OVERLAY
014400141010     A                                      WINDOW(9 25 4 45)
014410141010     A                                  2  1'Presenti Disposizioni di consegna -
014420141010     A                                      in sospeso:'
014430141010     A                                  3  1'premere'
014440141010     A                                  3  9'F19 per verificarle'
014450141010     A                                      DSPATR(HI)
