000100020219     A*--------------------------------------------------------------*
000200031125     A* Parametri per L'AGGIORNAMENTO DELLA BOLLA PER TOGLIERE       *
000300031125     A*               I RIFERIMENTI DELLA DISTINTA                   *
000400960119     A*--------------------------------------------------------------*
000500031125     A          R D98REC
000600031125     A            I98AAS         4S 0       TEXT('ANNO SPEDIZ. ORIG.')
000700031125     A            I98LNP         3S 0       TEXT('LNP SPEDIZ. ORIG.')
000800031125     A            I98NRS         2S 0       TEXT('SERIE SPEDIZ. ORIG.')
000900031125     A            I98NSP         7S 0       TEXT('NR. SPEDIZ. ORIG.')
001000020219     A*
001100020219     A* Output
001200031125     A            O98ESITO       1A         TEXT('ESITO 0 = OK 1 = ERRORE')
001300101213     A* ------
001400101217     A            I98DELINS      1A         TEXT('BLK=TOGLI/M=METTI')
001500101217     A            I98INTERR      1A         TEXT('BLK=NO/S=SI INTERROGAZIONE')
001600101213     A            I98STRCMT      1A         TEXT('BLK=SI/N=NO X FARE STRCMTCTL')
001700101213     A            I98VIDEO       1A         TEXT('BLK=SI/N=NO GESTIONE VIDEO')
001800101213     A            I98ALCDST      1A         TEXT('BLK=SI/N=NO CTL.SE DIST.ALLOC-
001900101213     A                                      ATA')
002000101213     A            I98CTLDST      1A         TEXT('BLK=SI/N=NO CONTROLLARE LA -
002100101213     A                                      DISTINTA')
002200110103     A            I98FGS         3S 0       TEXT('FILIALE GES.DIST.OBBLIGATORIO-
002300101213     A                                      SE RICHIAMATO')
002400101223     A            I98NPG         1S 0       TEXT('CATEGORIA FOGLIO')
002500110103     A            I98NDC         6S 0       TEXT('NR.DIST.OBBLIGATORIO SE RICHI-
002600101213     A                                      AMATO')
002700101213     A*
002800101223     A* Output  dell'Errore legato all'esito
002900101214     A            O98MSGERR     66A         TEXT('MSG DI ERRORE ESPLICITO')
