000100110929/*PARMS DFTACTGRP(*NO) ACTGRP('*NEW')                                       */
000600060905
000700090610             PGM        PARM(&KPJBA)
000800090610
000900090610             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
001500050531
001700110929             CALL       PGM(FNLR36R) PARM(&KPJBA)
003800990908
003900050606             ENDPGM
