000010121011     A*%%TS  SD  20121011  133614  EDPRM       REL-V6R1M0  5761-WDS
000020000000     A*
000030121011     A*%%EC
000040121011     A                                      DSPSIZ(24 80 *DS3)
000050121011     A                                      PRINT
000060121011     A                                      CA03
000070000000     A**************************************************************************
000080121011     A          R LRI1T01
000090121011     A*%%TS  SD  20121011  130840  EDPRM       REL-V6R1M0  5761-WDS
000100121011     A            RSUT          20A  O  1  2
000110121011     A                                  1 26'*  Ricerca filiale CHI SONO BRT  *'
000120121011     A                                      DSPATR(RI)
000130121011     A                                      DSPATR(UL)
000140121011     A                                  1 62'FNLRI1R'
000150121011     A                                  1 72DATE
000160121011     A                                      EDTCDE(Y)
000170121011     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000180121011     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000190121011     A                                  2 72TIME
000200121003     A          R LRI1D01
000210121003     A*%%TS  SD  20121003  101652  EDPRM       REL-V6R1M0  5761-WDS
000220121003     A                                      OVERLAY
000230121003     A  28        VIDMSG        78   M
000240121003     A                                  6  3'Codice CHI SONO:'
000250121003     A            D01CHI        14A  B  6 20
000260121003     A                                 24  2'F3=Fine'
000270121003     A                                 24 15'INVIO=Ricerca'
000280121011     A          R LRI1D02
000290121011     A*%%TS  SD  20121011  133614  EDPRM       REL-V6R1M0  5761-WDS
000300121011     A                                      CA12
000310121011     A                                      OVERLAY
000320121011     A                                  6 11'Codice CHI SONO:'
000330121011     A            D02CHI        14A  O  6 29DSPATR(HI)
000340121011     A                                 24  2'F3=Fine'
000350121011     A                                 24 15'F12=RITORNO'
000360121011     A            D02INF        14A  O  9 29DSPATR(HI)
000370121011     A            D02LNPI        3Y 0O 11 32EDTCDE(Z)
000380121011     A            D02AASI        4Y 0O 11 47EDTCDE(Z)
000390121011     A            D02DFSI        8Y 0O 13 61EDTWRD('  /  /    ')
000400121011     A  99N99     D02NUMI       12Y 0O 14 32EDTCDE(2)
000410121011     A            D02SUP        14A  O 16 29DSPATR(HI)
000420121011     A            D02LNPS        3Y 0O 18 32EDTCDE(Z)
000430121011     A            D02AASS        4Y 0O 18 47EDTCDE(Z)
000440121011     A            D02DFSS        8Y 0O 20 61EDTWRD('  /  /    ')
000450121011     A  99N99     D02NUMS       12Y 0O 21 32EDTCDE(2)
000460121011     A            D02NSPI       10A  O 11 36
000470121011     A            D02NSPS       10A  O 18 36
000480121011     A            D02CATI        5A  O 13 32
000490121011     A            D02CATS        5A  O 20 32
000500121011     A            D02NPSI        2A  O 13 76
000510121011     A            D02NPSS        2A  O 20 76
000520121011     A            D02PESI       15A  O 13 41
000530121011     A            D02PESS       15A  O 20 41
000540121011     A                                  9  1'Codice CHI SONO precedente'
000550121011     A                                      DSPATR(UL)
000560121011     A                                 11  8'Spedizione . . . . . .'
000570121011     A                                 13  8'Prima spunta del collo'
000580121011     A                                 16  1'Codice CHI SONO successivo'
000590121011     A                                      DSPATR(UL)
000600121011     A                                 18  8'Spedizione . . . . . .'
000610121011     A                                 20  8'Prima spunta del collo'
000620121011     A  99N99                          21  8'Scarto numerico  . . .'
000630121011     A  99N99                          14  8'Scarto numerico  . . .'
000640121011     A            D02DII         2A  O 13 38
000650121011     A            D02DELI        3A  O 13 57
000660121011     A            D02PSTI        3A  O 13 72
000670121011     A            D02DIS         2A  O 20 38
000680121011     A            D02DELS        3A  O 20 57
000690121011     A            D02PSTS        3A  O 20 72
000700121011     A                                 19  8'Segnacollo . . . . . .'
000710121011     A            D02NSCS        9A  O 19 40
000720121011     A                                 12  8'Segnacollo . . . . . .'
000730121011     A            D02NSCI        9A  O 12 40
000740121011     A            D02FLSI        7A  O 12 32
000750121011     A            D02FLSS        7A  O 19 32
