000100170203     A*%%TS  SD  20170203  163657  EDPAB       REL-V7R2M0  5770-WDS
000200170203     A*%%EC
000300170203     A                                      DSPSIZ(24 80 *DS3)
000400170203     A                                      CHGINPDFT(HI CS)
000500170203     A                                      PRINT
000600170203     A                                      ERRSFL
000700170203     A                                      HELP
000800940314    >A*---------------------------------------------------------------
000900170203     A          R W1
001000170203     A*%%TS  SD  20170203  163657  EDPAB       REL-V7R2M0  5770-WDS
001100170203     A                                      WINDOW(10 5 11 55)
001200170203     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
001300170203     A                                          '))
001400170203     A                                      USRRSTDSP
001500170203     A                                      CF12
001600170203     A  07                                  CF07
001700170206     A                                      KEEP
001800170208     A*****                                 OVERLAY
001900170203     A            RSUT          20A  O  2  2
002000170203     A                                  2 37'FNLR50WR'
002100170203     A                                  2 46DATE
002200170203     A                                      EDTCDE(Y)
002300170203     A            KNSIF         10A  O  3  2
002400170203     A            KNMUS         10A  O  3 13
002500170203     A                                  3 46TIME
002600170203     A            W1D001        50A  O  5  3DSPATR(RI)
002700170203     A            W1D002        50A  O  6  3DSPATR(RI)
002800170203     A            W1VARIA       50A  O  7  3
002900170203     A            P1ERR0        50A  O  8  3
003000170203     A            P1ERR1        50A  O  9  3
003100170203     A            P1ERR2        50A  O 10  3
003200940606     A*--------------------------------------------------------*
003300940608     A          R ASSUME
003400940608     A                                      TEXT('Serve x preservare il video p-
003500940608     A                                      recedente')
003600940608     A                                      ASSUME
003700940608     A                                  1  2' '
