000100141202     A*%%TS  SD  20141202  114751  EDPAB       REL-V7R1M0  5770-WDS
000200141202     A*** FILE : FNLRQ0D *--------------------------------------------*
000300141202     A*%%EC
000400141202     A                                      DSPSIZ(24 80 *DS3)
000500141202     A                                      PRINT
000600101215     A**-------------------------------------------------------------**
000700141202     A          R W001FRZ
000800141202     A*%%TS  SD  20141202  114751  EDPAB       REL-V7R1M0  5770-WDS
000900141202     A                                      CF07
001000141202     A                                      CA12
001100141202     A                                      KEEP
001200141202     A                                      OVERLAY
001300141202     A                                      WINDOW(6 8 10 53)
001400141202     A                                      WDWBORDER((*DSPATR HI))
001500141202     A            DES001        50A  O  2  2DSPATR(HI)
001600141202     A            DES002        50A  O  3  2
001700141202     A            DES003        50A  O  4  2
001800141202     A            DES004        50A  O  5  2
001900141202     A            DES005        50A  O  6  2
002000141202     A            ERR001        50A  O  7  2
002100141202     A            ERR002        50A  O  8  2
002200141202     A                                  9  6'F7=Forzare'
002300141202     A                                      DSPATR(HI)
002400141202     A                                  9 36'F12=Ritorno'
002500141202     A                                      DSPATR(HI)
002600110113     A*--------------------------------------------------------*
002700110113     A          R ASSUME
002800110113     A*%%TS  SD  20090312  115708  EDPAB       REL-V5R4M0  5722-WDS
002900110113     A                                      TEXT('Serve x preservare il video p-
003000110113     A                                      recedente')
003100110113     A                                      ASSUME
003200110113     A                                  1  2' '
