000100020219     A*--------------------------------------------------------------*
000200030825     A* Parametri per L'AGGIORNAMENTO ORM NELLA GESTIONE RITIRI      *
000300030825     A*               CONTESTUALI ALLA CONSEGNA                      *
000400960119     A*--------------------------------------------------------------*
000500030825     A          R D99REC
000600030825     A            I99TLA         1          TEXT('TIPO LANCIO')
000700030825     A            I99AAS         4S 0       TEXT('ANNO SPEDIZ. ORIG.')
000800030825     A            I99LNP         3S 0       TEXT('LNP SPEDIZ. ORIG.')
000900030826     A            I99NRS         2S 0       TEXT('SERIE SPEDIZ. ORIG.')
001000030825     A            I99NSP         7S 0       TEXT('NR. SPEDIZ. ORIG.')
001100030826     A            I99LNA         3S 0       TEXT('LNA SPEDIZ. FIGLIA')
001200030825     A            I99POE         3S 0       TEXT('P.O EMITTENTE ORM')
001300030826     A            I99NSR         2S 0       TEXT('SERIE ORM')
001400030825     A            I99NOR         7S 0       TEXT('NR. ORM')
001500030825     A            I99NRV         2S 0       TEXT('NR. VIAGGIO ORM')
001600030825     A            I99FAO         3S 0       TEXT('FASE ORM')
001700030825     A            I99CAR         2A         TEXT('CAUSALE CHIUSURA ORM')
001800030825     A            I99NPG         1S 0       TEXT('CATEGORIA FOGLIO')
001900030825     A            I99NDC         6S 0       TEXT('NUMERO DISTINTA')
002000030825     A            I99DDC         8S 0       TEXT('DATA DISTINTA')
002100031020     A            I99COMIT       1A         TEXT('1=COMMIT')
002200020219     A*
002300020219     A* Output
002400020219     A*
002500020219     A* - Codice di errore
002600030825     A            O99ERR         1A         TEXT('CODICE ERRORE')
