000010160429     A*%%TS  SD  20160429  121442  EDPBA       REL-V7R1M0  5770-WDS
000020911212     A*  91/12/12  13:35:40    EDPXX       REL-R03M00  5728-PW1
000030911015     A*** FILE : FLFR01D *--------------------------------------------*
000040911015     A*          GESTIONE FOGLIO DI VIAGGIO VARI                       *
000050911015     A***-------------------------------------------------------------**
000060160429     A*%%EC
000070160429     A                                      DSPSIZ(24 80 *DS3)
000080160429     A                                      PRINT
000090911212     A*  91/12/12  13:35:40    EDPXX       REL-R03M00  5728-PW1
000100160429     A          R LR50D01
000110160429     A*%%TS  SD  20160429  120921  EDPBA       REL-V7R1M0  5770-WDS
000120160429     A                                      CA03
000130160429     A  21
000140160429     AON02                                  CF18
000150160429     A N03
000160160429     AON02                                  CF01
000170160429     A N02                                  CF11
000180160429     A  97N02                               CF19
000190160429     A N98                                  CF02
000200160429     A                                      OVERLAY
000210160429     A  90        $MSG          70   M
000220160429     A            RSUT          20A  O  1  2
000230160429     A                                  1 25'Preparazione Distinte Uscita Conse-
000240160429     A                                      gna'
000250160429     A                                      DSPATR(UL)
000260160429     A                                      DSPATR(RI)
000270160429     A            VIDPGM         7A  O  1 65
000280160429     A                                  1 73DATE
000290160429     A                                      EDTCDE(Y)
000300160429     A            KNSIF         10A  O  2  2
000310160429     A            KNMUS         10A  O  2 13
000320160429     A                                  3 16'Punto operativo di consegna:'
000330160429     A            V1CLNA         3Y 0B  3 52TEXT('Linea di arrivo')
000340160429     A N20N17                               DSPATR(HI)
000350160429     A  20
000360160429     AO 02                                  DSPATR(PR)
000370160429     A                                      CHECK(RB)
000380160429     A                                      EDTCDE(Z)
000390160429     A  17                                  DSPATR(RI)
000400160429     A  17                                  DSPATR(PC)
000410160429     A                                  5 16'Punto operativo padroncino.:'
000420160429     A            V1CFPD         3Y 0B  5 52TEXT('Filiale padroncino')
000430160429     A N19                                  DSPATR(HI)
000440160429     A                                      CHECK(RZ)
000450160429     A  19                                  DSPATR(PC)
000460160429     A  19                                  DSPATR(RI)
000470160429     A  02                                  DSPATR(PR)
000480160429     A                                  7 16'Num. Precedente ...........:'
000490160429     A            V1CNDP         7Y 0O  7 48TEXT('Numero distinta precedente')
000500160429     A                                      DSPATR(HI)
000510160429     A                                      DSPATR(RI)
000520160429     A                                      EDTCDE(Z)
000530160429     A                                  9 16'Data Distinta..............:'
000540160429     A            V1CDDC         8Y 0B  9 45TEXT('Data distinta')
000550160429     A N11                                  DSPATR(HI)
000560160429     A                                      CHECK(RB)
000570160429     A  11                                  DSPATR(RI)
000580160429     A  11                                  DSPATR(PC)
000590160429     A                                      EDTWRD('  /  /    ')
000600160429     A  02                                  DSPATR(PR)
000610160429     A                                 11 16'Num. Distinta.............?:'
000620160429     A            V1CNDC         7A  B 11 48TEXT('Numero distinta')
000630160429     A N12                                  DSPATR(HI)
000640160429     A                                      CHECK(RZ)
000650160429     A  12                                  DSPATR(RI)
000660160429     A  12                                  DSPATR(PC)
000670160429     A                                      CHECK(FE)
000680160429     A  02                                  DSPATR(PR)
000690160429     A                                 11 56'(solo per modifica)'
000700160429     A                                 13 16'Cod. Padroncino...........?:'
000710160429     A            V1CCPC         4A  B 13 51TEXT('Codice padroncino')
000720160429     A N13                                  DSPATR(HI)
000730160429     A                                      CHECK(RZ)
000740160429     A N90
000750160429     AO 13                                  DSPATR(PC)
000760160429     A  13                                  DSPATR(RI)
000770160429     A  02                                  DSPATR(PR)
000780160429     A            MSGV1         25A  O 13 56
000790160429     A  45                                  DSPATR(RI)
000800160429     A  45                                  DSPATR(BL)
000810160429     A                                 14 16'Tipo distinta..............:'
000820160429     A N04                                  DSPATR(ND)
000830160429     A            V1CTPM         1A  B 14 54TEXT('PARCEL/MESSAGGERIE')
000840160429     A  04                                  DSPATR(HI)
000850160429     A N04                                  DSPATR(ND)
000860160429     A                                      VALUES('M' 'P')
000870160429     A  02
000880160429     AON04                                  DSPATR(PR)
000890160429     A                                 14 56'(P=Parcel/M=Messaggerie)'
000900160429     A N04                                  DSPATR(ND)
000910160429     A                                 15 16'Turno......................:'
000920160505     A N01                                  DSPATR(ND)
000990160429     A            V1CTUR         1A  B 15 54
001000160429     A  01                                  DSPATR(HI)
001010160429     A N01                                  DSPATR(ND)
001011160429     A  91                                  DSPATR(PC)
001020160429     A                                      VALUES('1' '2' ' ')
001030160429     A  02
001040160429     AON01                                  DSPATR(PR)
001050160502     A                                 15 56'(1=Primo/2=Secondo)'
001060160505     A N01                                  DSPATR(ND)
001070160429     A                                 16 16'Tipo Uscita................:'
001080160429     A            V1CFPP         1A  B 16 54TEXT('Tipo Uscita')
001090160429     A                                      DSPATR(HI)
001100160429     A                                      CHECK(RZ)
001110160429     A                                      VALUES('M' 'P')
001120160429     A  82
001130160429     AO 02                                  DSPATR(PR)
001140160429     A                                 16 56'(M=Mattino/P=Pomeriggio)'
001150160429     A                                 17 16'Picking....................:'
001160160429     A            V1CPEP         1A  B 17 54TEXT('Picking   S/N')
001170160429     A                                      DSPATR(HI)
001180160429     A                                      CHECK(RZ)
001190160429     A                                      VALUES('S' 'N')
001200160429     A  02                                  DSPATR(PR)
001210160429     A                                 17 56'(S=SI/N=NO)'
001220160429     A                                 19 16'Inserimento spedizioni.....:'
001230160429     A            V1CISP         1A  B 19 54TEXT('Inserimento spedizioni M/P')
001240160429     A                                      DSPATR(HI)
001250160429     A                                      VALUES('M' 'P')
001260160429     A                                 19 56'(M=Manuale/P=Pistola)'
001270160429     A                                 20 16'Dati a  PDA................:'
001280160429     A N71                                  DSPATR(ND)
001290160429     A            V1CPDA         1A  B 20 54TEXT('DATI PER PDA')
001300160429     A N71                                  DSPATR(ND)
001310160429     A  72
001320160429     AON71                                  DSPATR(PR)
001330160429     A  10                                  DSPATR(RI)
001340160429     A  10                                  DSPATR(PC)
001350160429     A N10                                  DSPATR(HI)
001360160429     A                                      VALUES('O' 'C' 'E' 'N')
001370160429     A                                 20 56'(O=ORM/C=Con/E=Ent/N=No)'
001380160429     A N71                                  DSPATR(ND)
001390160429     A                                 21 16'Test su PDA................:'
001400160429     A N71                                  DSPATR(ND)
001410160429     A            V1CTSTPDA      1A  B 21 54TEXT('TEST X PDA')
001420160429     A N71                                  DSPATR(ND)
001430160429     A  72
001440160429     AON71                                  DSPATR(PR)
001450160429     A  69                                  DSPATR(RI)
001460160429     A  69                                  DSPATR(PC)
001470160429     A N69                                  DSPATR(HI)
001480160429     A                                      VALUES('O' 'C' 'E' ' ')
001490160429     A                                 21 56'(O=ORM/C=Con/E=Ent/_=No)'
001500160429     A N71                                  DSPATR(ND)
001510160429     A                                 22  8'ATTENZIONE: Ci sono Disposizioni d-
001520160429     A                                      i consegna in sospeso da confermare'
001530160429     A                                      DSPATR(RI)
001540160429     A N97                                  DSPATR(ND)
001550160429     A            MSGV          25A  O 23  1DSPATR(BL)
001560160429     A                                 23 28'F1=Conferma Variazione'
001570160429     A  03
001580160429     AO 02                                  DSPATR(ND)
001590160429     A N98                             23 59'F2=Toglie spediz.'
001600160429     A                                 24  2'F3=Fine Lavoro'
001610160429     A                                 24 19'F18=Cambio P.O.'
001620160429     A N21
001630160429     AO 02                                  DSPATR(ND)
001640160429     A                                 24 38'F19=Disp.consegna'
001650160429     A                                      DSPATR(HI)
001660160429     A                                      DSPATR(BL)
001670160429     A N97                                  DSPATR(ND)
001680160429     A                                 24 59'F11=Sblocco Distinta'
001690160429     A  02                                  DSPATR(ND)
001700911128     A*  91/11/28  11:43:12    EDPCED      REL-R03M00  5728-PW1
001710150929     A          R LR50D02
001720150929     A*%%TS  SD  20150929  162344  EDPAB       REL-V7R1M0  5770-WDS
001730150929     A                                      CA12
001740150929     A                                      CF10
001750150929     A                                      CF07
001760150929     A                                      CF08
001770150929     A                                      CF13
001780150929     A                                      CF17
001790150929     A                                      CF02
001800150929     A  47                                  CF06
001810150929     A  46                                  CF11
001820150929     A  42                                  CF19
001830150929     A  48                                  CF14
001840150929     A  53                                  CF15
001841160502     A  59                                  CF09
001850150929     A  73 90                               MSGALARM
001860150929     A                                      OVERLAY
001870150929     A            RSUT          20A  O  1  2
001880150929     A                                  1 25'PREPARAZIONE DISTINTA USCITA CONSE-
001890150929     A                                      GNA'
001900150929     A                                      DSPATR(UL)
001910150929     A                                      DSPATR(RI)
001920150929     A            VIDPGM         7A  O  1 65
001930150929     A                                  1 73DATE
001940150929     A                                      EDTCDE(Y)
001950150929     A            KNSIF         10A  O  2  2
001960150929     A            KNMUS         10A  O  2 13
001970150929     A                                  2 31'Selezione per n.spedizione'
001980150929     A                                      DSPATR(UL)
001990150929     A                                      DSPATR(RI)
002000150929     A                                  5  2'PADRONCINO:'
002010150929     A                                      DSPATR(RI)
002020150929     A                                      DSPATR(UL)
002030150929     A            V05PAD        35A  O  5 14
002040150929     A                                  7 23'Anno Spedizione....:'
002050150929     A            VIDANS         4Y 0B  7 44DSPATR(HI)
002060150929     A                                      EDTCDE(Z)
002070150929     A  17N73                               ERRMSG('Anno errato' 17)
002080150929     A                                      CHECK(RB)
002090150929     A                                 10 23'P.O. di partenza...:'
002100150929     A            V03LNP         3Y 0B 10 44DSPATR(HI)
002110150929     A                                      EDTCDE(Z)
002120150929     A N36                                  DSPATR(PC)
002130150929     A                                      CHECK(RB)
002140150929     A  14N73                               ERRMSG('Linea errata' 14)
002150150929     A  66N73                               ERRMSG('Fil.partenza errata Non pos-
002160150929     A                                      te non valida per distinta SDA' 66)
002170150929     A  94N73                               ERRMSG('Eventuali variazioni andran-
002180150929     A                                      no perse premendo cmd12' 94)
002190150929     A                                 11 39' '
002200150929     A                                 13 23'Numero Spedizione..:'
002210150929     A            V03NSP         7Y 0B 13 44DSPATR(HI)
002220150929     A                                      EDTCDE(Z)
002230150929     A                                      CHECK(RB)
002240150929     A  29N73                               ERRMSG('Immettere Numero spedizione-
002250150929     A                                      ' 29)
002260150929     A  22N73                               ERRMSG('Spedizione bloccata/giacent-
002270150929     A                                      e' 22)
002280150929     A  24N73                               ERRMSG('Spedizione consegnata/in co-
002290150929     A                                      nsegna altra distinta' 24)
002300150929     A  25N73                               ERRMSG('Linea arrivo spedizione non-
002310150929     A                                       in gestione' 25)
002320150929     A  26N73                               ERRMSG('Spedizione non abilitata al-
002330150929     A                                      la consegna TOTALMENTE Non forzabil-
002340150929     A                                      e' 26)
002350150929     A  68N73                               ERRMSG('Spedizione non abilitata al-
002360150929     A                                      la consegna PARZIALMENTE F17 per Fo-
002370150929     A                                      rzare' 68)
002380150929     A  65N73                               ERRMSG('Spedizione di un perfect or-
002390150929     A                                      der F8 per Forzare l''inserimento' -
002400150929     A                                      65)
002410150929     A  27N73                               ERRMSG('Spedizione non abilitata al-
002420150929     A                                      l"incasso C/assegno' 27)
002430160316     A  99N73                               ERRMSG('La spedizione deve essere i-
002440160316     A                                      nserita in una distinta "fittizia"-
002450160316     A                                      ' 99)
002460150929     A  28N73                               ERRMSG('Spedizione non abilitata al-
002470150929     A                                      l"incasso Ass.to' 28)
002480150929     A  15N73                               ERRMSG('Spedizione Inesistente' 15)
002490150929     A  30N73                               ERRMSG('Spedizione consegnata con d-
002500150929     A                                      istinta da contabilizz.' 30)
002510150929     A  89N73                               ERRMSG('Spedizione legata ad altra -
002520150929     A                                      bolla ! Immettere la derivata (figl-
002530150929     A                                      ia)' 89)
002540150929     A  38N73                               ERRMSG('Spedizione legata a bolla m-
002550150929     A                                      amma già consegnata con C/A da cont-
002560150929     A                                      abilizzare' 38)
002570150929     A  39N73                               ERRMSG('Spedizione legata a bolla m-
002580150929     A                                      amma già presente in un''altra dist-
002590150929     A                                      inta' 39)
002600150929     A  44N73                               ERRMSG('Data consegna richiesta > d-
002610150929     A                                      ata distinta' 44)
002620150929     A  57N73                               ERRMSG('Spedizione già inserita in -
002630150929     A                                      questa distinta' 57)
002640150929     A  46N73                               ERRMSG('APPUNTAMENTO:senza Nr.di te-
002650150929     A                                      lefono manca data consegna richiest-
002660150929     A                                      a FORZATURA=F11')
002670150929     A  67N73                               ERRMSG('APPUNTAMENTO:con Nr.di tele-
002680150929     A                                      fono manca data consegna richiesta -
002690150929     A                                      NON FORZABILE !!!')
002700150929     A  47N73                               ERRMSG('Spedizione in fermo deposit-
002710150929     A                                      o conferma inserimento = F6')
002720150929     A  42N73                               ERRMSG('Spedizione messa in consegn-
002730150929     A                                      a nel turno di chiusura conferma in-
002740150929     A                                      serimento = F19')
002750150929     A  58N73                               ERRMSG('Spedizione "V.PACCO" non am-
002760150929     A                                      messa' 58)
002770150929     A  48N73                               ERRMSG('Spedizione con particolarit-
002780150929     A                                      à consegna di attesa. F14 per confe-
002790150929     A                                      rmare inserimento' 48)
002800150929     A  53N73                               ERRMSG('Per la sped. è stato inviat-
002810150929     A                                      o il Contro Alert. F15 per confe-
002820150929     A                                      rmare inserimento' 53)
002821160502     A  59N73                               ERRMSG('La sped. è del secondo -
002822160502     A                                      turno di consegna. F9 per confe-
002823160502     A                                      rmare inserimento' 59)
002830150929     A                                 16 23'Serie Spedizione...:'
002840150929     A            V03NRS         2Y 0B 16 44DSPATR(HI)
002850150929     A                                      EDTCDE(Z)
002860150929     A                                      CHECK(RB)
002870150929     A                                 19 23'Barcode spedizione.:'
002880150929     A            V03PIS        18Y 0B 19 44DSPATR(HI)
002890150929     A                                      EDTCDE(Z)
002900150929     A  36                                  DSPATR(PC)
002910150929     A                                      CHECK(ER)
002920150929     A  40 73                               ERRMSG('Errore barcode' 40)
002930150929     A  51 73                               ERRMSG('Scegliere spedizione o barc-
002940150929     A                                      ode' 51)
002950150929     A  17 73                               ERRMSG('Anno errato' 17)
002960150929     A  14 73                               ERRMSG('Linea errata' 14)
002970150929     A  66 73                               ERRMSG('Fil.partenza errata Non pos-
002980150929     A                                      te non valida per distinta SDA' 66)
002990150929     A  94 73                               ERRMSG('Eventuali variazioni andran-
003000150929     A                                      no perse premendo cmd12' 94)
003010150929     A  29 73                               ERRMSG('Immettere Numero spedizione-
003020150929     A                                      ' 29)
003030150929     A  22 73                               ERRMSG('Spedizione bloccata/giacent-
003040150929     A                                      e' 22)
003050150929     A  24 73                               ERRMSG('Spedizione consegnata/in co-
003060150929     A                                      nsegna altra distinta' 24)
003070150929     A  25 73                               ERRMSG('Linea arrivo spedizione non-
003080150929     A                                       in gestione' 25)
003090150929     A  26 73                               ERRMSG('Spedizione non abilitata al-
003100150929     A                                      la consegna TOTALMENTE Non forzabil-
003110150929     A                                      e' 26)
003120150929     A  68 73                               ERRMSG('Spedizione non abilitata al-
003130150929     A                                      la consegna PARZIALMENTE F17 per Fo-
003140150929     A                                      rzare' 68)
003150150929     A  65 73                               ERRMSG('Spedizione di un perfect or-
003160150929     A                                      der F8 per Forzare l''inserimento' -
003170150929     A                                      65)
003180150929     A  27 73                               ERRMSG('Spedizione non abilitata al-
003190150929     A                                      l"incasso C/assegno' 27)
003200160316     A  99 73                               ERRMSG('La spedizione deve essere i-
003210160316     A                                      nserita in una distinta "fittizia"-
003220160316     A                                      ' 99)
003230150929     A  28 73                               ERRMSG('Spedizione non abilitata al-
003240150929     A                                      l"incasso Ass.to' 28)
003250150929     A  15 73                               ERRMSG('Spedizione Inesistente' 15)
003260150929     A  30 73                               ERRMSG('Spedizione consegnata con d-
003270150929     A                                      istinta da contabilizz.' 30)
003280150929     A  89 73                               ERRMSG('Spedizione legata ad altra -
003290150929     A                                      bolla ! Immettere la derivata (figl-
003300150929     A                                      ia)' 89)
003310150929     A  38 73                               ERRMSG('Spedizione legata a bolla m-
003320150929     A                                      amma già consegnata con C/A da cont-
003330150929     A                                      abilizzare' 38)
003340150929     A  39 73                               ERRMSG('Spedizione legata a bolla m-
003350150929     A                                      amma già presente in un''altra dist-
003360150929     A                                      inta' 39)
003370150929     A  44 73                               ERRMSG('Data consegna richiesta > d-
003380150929     A                                      ata distinta' 44)
003390150929     A  57 73                               ERRMSG('Spedizione già inserita in -
003400150929     A                                      questa distinta' 57)
003410150929     A  46 73                               ERRMSG('APPUNTAMENTO:senza Nr.di te-
003420150929     A                                      lefono manca data consegna richiest-
003430150929     A                                      a FORZATURA=F11')
003440150929     A  67 73                               ERRMSG('APPUNTAMENTO:con Nr.di tele-
003450150929     A                                      fono manca data consegna richiesta -
003460150929     A                                      NON FORZABILE !!!')
003470150929     A  47 73                               ERRMSG('Spedizione in fermo deposit-
003480150929     A                                      o conferma inserimento = F6')
003490150929     A  42 73                               ERRMSG('Spedizione messa in consegn-
003500150929     A                                      a nel turno di chiusura conferma in-
003510150929     A                                      serimento = F19')
003520150929     A  58 73                               ERRMSG('Spedizione "V.PACCO" non am-
003530150929     A                                      messa' 58)
003540150929     A  48 73                               ERRMSG('Spedizione con particolarit-
003550150929     A                                      à consegna di attesa. F14 per confe-
003560150929     A                                      rmare inserimento' 48)
003570150929     A                                 23  2'F13=Blocco/Sblocco'
003580150929     A            V03F2         11A  O 23 23
003590150929     A                                 23 36'F15=Forza se C_Alert'
003600150929     A                                 23 60'F17=Forz. Merce'
003610150929     A                                 24  2'F10=Fine selez. avanzamento'
003620150929     A                                 24 33'F7=Interrogazione Bolle'
003630150929     A                                 24 60'F12=Video Precedente'
003640941107     A*** FILE : FLFR01D *--------------------------------------------*
003650941107     A*          GESTIONE FOGLIO DI VIAGGIO VARI                       *
003660941107     A***-------------------------------------------------------------**
003670110804     A          R LR50S03                   SFL
003680110804     A*%%TS  SD  20110804  160928  EDPBA       REL-V6R1M0  5761-WDS
003690110804     A                                      SFLNXTCHG
003700110804     A            V3CAAS         4S 0H
003710110804     A            V3CXCO         1A  H
003720110804     A            V3CPST         4S 0H
003730110804     A            V3CRAG        70A  H
003740110804     A            V3CCLI         7S 0H
003750110804     A            V3CTB1         1A  H
003760110804     A            V3CSEL         1A  B  6  2
003770110804     A N18                                  DSPATR(HI)
003780110804     A                                      VALUES(' ' 'E' 'I' 'V')
003790110804     A  18                                  DSPATR(RI)
003800110804     A                                      DSPATR(PC)
003810110804     A            V3CNGD         3Y 0B  6  4DSPATR(HI)
003820110804     A                                      EDTCDE(Z)
003830110804     A  64                                  DSPATR(PR)
003840110804     A                                      COMP(GT 0)
003850110804     A  64                                  DSPATR(ND)
003860110804     A            V3CSTP         3Y 0B  6  8EDTCDE(Z)
003870110804     A N16                                  DSPATR(HI)
003880110804     A  64                                  DSPATR(PR)
003890110804     A  16                                  DSPATR(RI)
003900110804     A                                      COMP(LT 999)
003910110804     A  64                                  DSPATR(ND)
003920110804     A            V3CRSD        20A  O  6 12
003930110804     A  88                                  DSPATR(RI)
003940110804     A            V3CNCL         5Y 0O  6 36EDTCDE(Z)
003950110804     A            V3CGMC         4Y 0O  6 42EDTCDE(Z)
003960110804     A            V3CGC1         2A  O  6 47
003970110804     A            V3CLNA         3Y 0O  6 50
003980110804     A            V3CZNC         2S 0O  6 54
003990110804     A            V3CCBO         2A  O  6 57
004000110804     A            V3CTIC         2A  O  6 60
004010110804     A            V3CVCA         3A  O  6 63
004020110804     A            V3CCAS        13Y 3O  6 67EDTWRD('          ,   ')
004030110804     A            V3CLNP         3S 0O  7  4
004040110804     A  88                                  DSPATR(RI)
004050110804     A            V3CNRS         2S 0O  7  9
004060110804     A  88                                  DSPATR(RI)
004070110804     A            V3CIND        20A  O  7 12
004080110804     A  88                                  DSPATR(RI)
004090110804     A            V3CPKF         7Y 1O  7 33EDTWRD('      , ')
004100110804     A            V3CHCR         4Y 0O  7 42EDTCDE(Z)
004110110804     A            V3CGC2         2A  O  7 47
004120110804     A            V3DTC2        10A  O  7 51
004130110804     A            V3CVAS         3A  O  7 63
004140110804     A            V3CIMA        13Y 3O  7 67EDTCDE(3)
004150110804     A  41                                  DSPATR(ND)
004160110804     A            V3CNSP         7Y 0O  8  4EDTCDE(Z)
004170110804     A  88
004180110804     AO 35                                  DSPATR(RI)
004190110804     A  63                                  DSPATR(BL)
004200110804     A            V3CCAD         5   O  8 12
004210110804     A  88                                  DSPATR(RI)
004220110804     A            V3CLOD        11A  O  8 18
004230110804     A  88                                  DSPATR(RI)
004240110804     A            V3CPRD         2A  O  8 30
004250110804     A  88                                  DSPATR(RI)
004260110804     A            V3CVLF         5Y 3O  8 35EDTCDE(4)
004270110804     A            V3DANO         5A  O  8 44TEXT('campo anomalie')
004280110804     A                                      DSPATR(HI)
004290110804     A                                      DSPATR(BL)
004300110804     A            V3DTC1        10A  O  8 51
004310110804     A            V3CRSM        15A  O  8 63
004320110804     A            V3CTSP         1A  O  8 79
004330941108     A*--------------------------------------------------------------------
004340990917     A          R LR50C03                   SFLCTL(LR50S03)
004350990917     A*%%TS  SD  19990917  124626  EDPRE       REL-V4R2M0  5769-PW1
004360990917     A                                      SFLSIZ(0007)
004370990917     A                                      SFLPAG(0006)
004380990917     A                                      CF10
004390990917     A                                      CF06
004400990917     A N02                                  CA16
004410990917     A                                      CF22
004420990917     A                                      CA12(81)
004430990917     A                                      OVERLAY
004440990917     A  60                                  SFLDSP
004450990917     A  61                                  SFLDSPCTL
004460990917     A  62                                  SFLCLR
004470990917     A  60                                  SFLEND
004480990917     A            NRRKEY         4S 0H      SFLRCDNBR(CURSOR)
004490990917     A            RSUT          20A  O  1  2
004500990917     A            VIDPGM         7A  O  1 63
004510990917     A                                  1 71DATE
004520990917     A                                      EDTCDE(Y)
004530990917     A                                  1 23'PREPARAZIONE DISTINTA USCITA CONSE-
004540990917     A                                      GNA'
004550990917     A                                      DSPATR(UL)
004560990917     A                                      DSPATR(RI)
004570990917     A                                  4  1' E Lnp/Nrs Indirizzo              -
004580990917     A                                       Peso   Ora Ch. Consegne    Div  Im-
004590990917     A                                      p.Asseg. T'
004600990917     A                                  3  1' I Giro/St.Destinatario           -
004610990917     A                                       Colli  G/M GG lin/zon   TI Div. Co-
004620990917     A                                      ntrassegno'
004630990917     A                                  5  1' V Spediz. Cap   Località    Pr.  -
004640990917     A                                      Volume   Anom.  Particol.   Mittent-
004650990917     A                                      e        s'
004660990917     A                                      DSPATR(UL)
004670990917     A            V05PAD        35A  O  2 13
004680990917     A                                  2  2'PADRONCINO'
004690990917     A                                      DSPATR(RI)
004700990917     A                                  2 61'DISTINTA'
004710990917     A                                      DSPATR(RI)
004720990917     A N05                                  DSPATR(ND)
004730990917     A            V01NDC         7Y 0O  2 71
004740990917     A N05                                  DSPATR(ND)
004750990917     A                                      EDTCDE(Z)
004760911128     A*  91/11/28  11:43:12    EDPCED      REL-R03M00  5728-PW1
004770911015     A*** FILE : FLFR01D *--------------------------------------------*
004780911015     A*          GESTIONE FOGLIO DI VIAGGIO VARI                       *
004790911015     A***-------------------------------------------------------------**
004800961217     A          R LR50Z03
004810961217     A*%%TS  SD  19961217  115851  EDPRE       REL-V3R6M0  5716-PW1
004820961217     A                                 24  2'F6=Conferma'
004830961217     A  75        $MSG          70   M
004840961217     A                                 24 16'F10=Nuova Bolla'
004850961217     A                                 24 35'F12=Vid.Iniziale'
004860961217     A N02                             24 54'F16=Annull.'
004870961217     A                                 24 67'F22=Giro/Stop'
004880961217     A  79        $ERR          70   M
004890911107     A*  91/11/07  15:09:36    EDPXX       REL-R03M00  5728-PW1
004900911106     A*** FILE : FLFR50D *--------------------------------------------*
004910911106     A*          PREPARAZIONE DISTINTA CONSEGNA                        *
004920911106     A***-------------------------------------------------------------**
004930941109     A          R LR50D03
004940941109     A*%%TS  SD  19941109  120408  EDPRE       REL-V2R3M0  5738-PW1
004950941109     A                                      OVERLAY
004960941109     A                                 24 18'Confermi Annullamento...(SI/NO) ?'
004970941109     A                                      DSPATR(HI)
004980941109     A            V08SNO         2A  B 24 53VALUES('NO' 'SI')
004990941109     A                                      DSPATR(PC)
005000911128     A*  91/11/28  12:24:08    EDPCED      REL-R03M00  5728-PW1
005010050225     A          R LR50D04
005020050225     A*%%TS  SD  20050225  163121  EDPMM       REL-V4R4M0  5769-PW1
005030050225     A N07                                  CF06
005040050225     A                                      CA12(80)
005050050225     A                                      OVERLAY
005060050225     A            RSUT          20A  O  1  2
005070050225     A                                  1 25'PREPARAZIONE DISTINTA USCITA CONSE-
005080050225     A                                      GNA'
005090050225     A                                      DSPATR(UL)
005100050225     A                                      DSPATR(RI)
005110050225     A            VIDPGM         7A  O  1 65
005120050225     A                                  1 73DATE
005130050225     A                                      EDTCDE(Y)
005140050225     A            KNSIF         10A  O  2  2
005150050225     A            KNMUS         10A  O  2 13
005160050225     A                                  2 37'Totale distinta'
005170050225     A                                      DSPATR(UL)
005180050225     A                                      DSPATR(RI)
005190050225     A                                  2 73TIME
005200050225     A                                  3  3'Dati padroncino'
005210050225     A                                      DSPATR(UL)
005220050225     A            V06PAD        35A  O  3 19
005230050225     A                                  3 56'Peso'
005240050225     A            V02PTO         6Y 1O  3 61EDTCDE(4)
005250050225     A                                  3 70'Vol.'
005260050225     A            V02CTO         5Y 3O  3 75EDTCDE(4)
005270050225     A                                  5 30'Dati distinta  '
005280050225     A                                      DSPATR(UL)
005290050225     A                                  6 18'Totale Peso'
005300050225     A            V06PKG         7Y 1O  6 52EDTCDE(4)
005310050225     A                                  8 18'Totale Volume'
005320050225     A            V06VOL         5Y 3O  8 54EDTCDE(4)
005330050225     A                                 10 18'Totale num.spedizione'
005340050225     A            V06TSP         3Y 0O 10 57EDTCDE(Z)
005350050225     A                                 12 18'Totale num. STOP'
005360050225     A            V06STP         3Y 0O 12 57EDTCDE(Z)
005370050225     A  08                             14 15'Da incassare in.........'
005380050225     A                                      DSPATR(UL)
005390050225     A  08        V06DVI         3A  O 14 40
005400050225     A  08        V06TIN        14Y 3O 14 46EDTCDE(1)
005410050225     A  09                             15 15'Da incassare in.........'
005420050225     A                                      DSPATR(UL)
005430050225     A  09        V06DVE         3A  O 15 40
005440050225     A  09        V06TEN        14Y 3O 15 46EDTCDE(1)
005450050225     A  53                             16 15'Da incassare in altre divise'
005460050225     A                                      DSPATR(UL)
005470050225     A  53        V4CTIV        14Y 3O 16 46EDTCDE(1)
005480050225     A  06                             19 21'Stampa distinta...........(N/S)'
005490050225     A  06        V06SIN         1A  B 19 58VALUES('N' 'S')
005500050225     A  06                             19 61'N=No'
005510050225     A  06                             20 61'S=Stampa distinta'
005520050225     A                                 23  2'                                  -
005530050225     A                                                                         -
005540050225     A                                               '
005550050225     A                                      DSPATR(UL)
005560050225     A                                 24  2'F6=Conferma'
005570050225     A  07                                  DSPATR(ND)
005580050225     A                                 24 58'F12=Videata Precedente'
005590050225     A  06                             18 21'Gestione inserimento bancali'
005600050225     A                                      DSPATR(ND)
005610050225     A  06        V06BAN         1A  B 18 58VALUES('S' 'N')
005620050225     A                                      DSPATR(ND)
005630050225     A                                      DSPATR(PR)
005640050225     A  06                             18 61'(S/N)'
005650050225     A                                      DSPATR(ND)
