000100950517     A*--------------------------------------------------------------*
000200101220     A* DS parametri SISTEMA DISTINTE CONSEGNA - GESTIONE            *
000300950517     A*--------------------------------------------------------------*
000400101220     A          R FNLRQ2
000500950517     A*
000600110103     A            LRQ2CMDO       2          TEXT('COMANDO RITORNO')
000700110103     A            LRQ2MSGO      70          TEXT('MESSAGGIO ERRORE')
