000100950524             PGM        PARM(&KPJBA)
000200950524             DCL        VAR(&KPJBA)    TYPE(*CHAR)  LEN(502)
000201050427
003400050426             OVRPRTF    FILE(FNLRF7P) DEVTYPE(*SCS) LPI(6) CPI(15) +
003401050428                          FRONTMGN(*DEVD) PAGRTT(*AUTO)
003402050427
005000050427             CALL       PGM(FNLR55R) PARM(&KPJBA)
006900950911
006901050428             DLTOVR     FILE(FNLRF7P)
006902050428
007000950524             ENDPGM
