000100021212      *--------------------------------------------------------------*
000200021212      * DS per passaggio parametri Visualizzazione note Supermercati *
000300021212      *--------------------------------------------------------------*
000400030121     A                                      REF(CNDIZION)
000500030121     A          R FNLRB3                    TEXT('DS X PASSAGGIO PARAMETRI')
000600030122     A            RB3RSU        20          TEXT('Ragione sociale/p.o. utente')
000700030121     A            RB3FIL    R               REFFLD($FIL)
000800030121     A            RB3AAS    R               REFFLD($AAS)
000900030121     A            RB3LNP    R               REFFLD($LNP)
001000030121     A            RB3NRS    R               REFFLD($NRS)
001100030121     A            RB3NSP    R               REFFLD($NSP)
001200030121     A            RB3DSP    R               REFFLD($DA8)
001300030121     A                                      TEXT('Data spedizione')
001400030121     A            RB3RMN    R               REFFLD($RMN)
001500030121     A            RB3LNA    R               REFFLD($LNA)
001600030121     A            RB3RSD    R               REFFLD($RSD)
001700030121     A            RB3PKF    R               REFFLD($PKF)
001800030121     A            RB3NCL    R               REFFLD($NCL)
001900030121     A            RB3VLB    R               REFFLD($VLB)
002000030121     A            RB3TBA    R               REFFLD($TBA)
002100030121     A            RB3NBA    R               REFFLD($NBA)
002200030121     A            RB3TB2    R               REFFLD($NBA)
002300030121     A                                      TEXT('2° Tipo Bancale')
002400030121     A            RB3NB2    R               REFFLD($NBA)
002500030121     A                                      TEXT('Numero bancali di tipo 2')
