000100980409     H DECEDIT('0,') DATEDIT(*DMY.)
000200980409      *--------------------------------------------------------------*
000300980409      *         - GESTIONE DISTINTA ARRIVI ESTERO -                  *
000400980409      *             -- SUBFILE LINEE DI ARRIVO --                    *
000500980409      *--------------------------------------------------------------*
000600091029     FFNLRK1DH  CF   E             WORKSTN
000700980409      *----------------------------------------------------------------*
000800980409      *  Azzeramento campi primo subfile
000900091029     C                   EXFMT     LRK1WHP
001000980409      *
001100980409     C                   SETON                                        LR
001200980409      *---------------------------------------------------------*
