000010070516     A*%%TS  SD  20070516  095153  EDPES       REL-V5R3M0  5722-WDS
000020000000     A*  VISUALIZZAZIONE AFFIDABILITA'
000030000000     A*
000040070516     A*%%EC
000050070516     A                                      DSPSIZ(24 80 *DS3)
000060070516     A                                      PRINT
000070070516     A                                      CA03
000080000000     A**************************************************************************
000090070516     A          R LR97D01
000100070516     A*%%TS  SD  20070516  095153  EDPES       REL-V5R3M0  5722-WDS
000110070516     A  30                                  CA05
000120070516     A                                      CA12
000130070516     A                                      CA21
000140070516     A            R97RSU        20A  O  1  2
000150070516     A                                  1 24'*  VISUALIZZAZIONE  AFFIDABILITA''-
000160070516     A                                        *'
000170070516     A                                      DSPATR(RI)
000180070516     A                                      DSPATR(UL)
000190070516     A                                  1 62'FNLR97R'
000200070516     A                                  1 72DATE
000210070516     A                                      EDTCDE(Y)
000220070516     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000230070516     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000240070516     A                                  2 72TIME
000250070516     A                                  4  2'SPEDIZIONE:'
000260070516     A                                      DSPATR(UL)
000270070516     A            R97LNP    R        O  4 15REFFLD(R97LNP FNLR97)
000280070516     A                                      DSPATR(HI)
000290070516     A                                      DSPATR(UL)
000300070516     A            R97NRS    R        O  4 20REFFLD(R97NRS FNLR97)
000310070516     A                                      EDTCDE(Z)
000320070516     A                                      DSPATR(HI)
000330070516     A                                      DSPATR(UL)
000340070516     A            R97NSP    R        O  4 24REFFLD(R97NSP FNLR97)
000350070516     A                                      DSPATR(HI)
000360070516     A                                      EDTCDE(Z)
000370070516     A                                      DSPATR(UL)
000380070516     A                                  4 33'Del'
000390070516     A            R97DSP    R        O  4 38REFFLD(R97DSP FNLR97)
000400070516     A                                      EDTWRD('  /  /    ')
000410070516     A                                      DSPATR(HI)
000420070516     A                                  4 52'Rifer.Mitt.'
000430070516     A            R97RMN    R        O  4 65REFFLD(R97RMN FNLR97)
000440070516     A                                      DSPATR(HI)
000450070516     A                                      EDTCDE(Z)
000460070516     A                                  5  2'Linea Arrivo'
000470070516     A            R97LNA    R        O  5 15REFFLD(R97LNA FNLR97)
000480070516     A                                      DSPATR(HI)
000490070516     A                                      EDTCDE(Z)
000500070516     A                                  5 19'-'
000510070516     A            V1DLNA    R   15   O  5 21REFFLD(R97DLA FNLR97)
000520070516     A                                      DSPATR(HI)
000530070516     A                                  5 38'Destinat.'
000540070516     A            V1CRSD    R   32   O  5 48REFFLD(R97RSD FNLR97)
000550070516     A                                      DSPATR(HI)
000560070516     A                                  7  2'Tipo Servizio'
000570070516     A            V1CTSP    R        O  7 19REFFLD(D98TSP TNSD99DS)
000580070516     A                                      DSPATR(HI)
000590070516     A                                  7 21'-'
000600070516     A            V1DTSP         8A  O  7 23DSPATR(HI)
000610070516     A                                  7 32'Consegna Richiesta'
000620070516     A            V1DTCR        11A  O  7 51DSPATR(HI)
000630070516     A            W98DCR    R    6 00O  7 63REFFLD(D98DCR TNSD99DS)
000640070516     A                                      DSPATR(HI)
000650070516     A                                      EDTWRD('  /  /  ')
000660070516     A                                  7 72'Ore'
000670070516     A            D98HCR    R        O  7 76REFFLD(D98HCR TNSD99DS)
000680070516     A                                      DSPATR(HI)
000690070516     A                                      EDTWRD('  :  ')
000700070516     A                                  8  2'Contrass.'
000710070516     A            R97VCA    R        O  8 13REFFLD(R97VCA FNLR97)
000720070516     A                                      DSPATR(HI)
000730070516     A            R97CAS    R        O  8 17REFFLD(R97CAS FNLR97)
000740070516     A                                      DSPATR(HI)
000750070516     A                                      EDTCDE(4)
000760070516     A                                  8 32'Data 1° Consegna Parziale'
000770070516     A            V1CDCP    R    6 00O  8 63REFFLD(R97DCP FNLR97)
000780070516     A                                      DSPATR(HI)
000790070516     A                                      EDTWRD('  /  /  ')
000800070516     A                                  9  2'Fermo Deposito'
000810070516     A            DEPOSV         3A  O  9 19DSPATR(HI)
000820070516     A                                  9 32'Giacenza: Apertura'
000830070516     A            W98DAG    R    6 00O  9 53REFFLD(D98DAG TNSD99DS)
000840070516     A                                      DSPATR(HI)
000850070516     A                                      EDTWRD('  /  /  ')
000860070516     A                                  9 63'Chiusura'
000870070516     A            W98DCG    R    6 00O  9 73REFFLD(D98DCG TNSD99DS)
000880070516     A                                      DSPATR(HI)
000890070516     A                                      EDTWRD('  /  /  ')
000900070516     A                                 10  2'Mancata Consegna'
000910070516     A            MANCAV    R        O 10 19REFFLD(D98CMC TNSD99DS)
000920070516     A                                      DSPATR(HI)
000930070516     A            §2ADEV    R   57A  O 10 23REFFLD(§2ADES DS2A)
000940070516     A                                      DSPATR(HI)
000950070516     A                                 11 75'Ore'
000960070516     A                                 12  2'                           AFFIDAB-
000970070516     A                                      ILITA''  PARTENZA                  -
000980070516     A                                        '
000990070516     A                                      DSPATR(UL)
001000070516     A                                 12 73'rit/ant'
001010070516     A            DESDSP        15   O 13  2
001020070516     A            W98DSP    R        O 13 18REFFLD(D98DSP TNSD99DS)
001030070516     A                                      EDTWRD('  /  /    ')
001040070516     A                                      DSPATR(HI)
001050070516     A                                 13 29'Data Partenza Primo Collo'
001060070516     A            R97DPC    R        O 13 57REFFLD(R97DPC FNLR97)
001070070516     A                                      EDTWRD('  /  /    ')
001080070516     A                                      DSPATR(HI)
001090070516     A                                 13 73'(delta)'
001100070516     A                                 14  2'Data Bordero'''
001110070516     A            R97DBR    R        O 14 18REFFLD(R97DBR FNLR97)
001120070516     A                                      EDTWRD('  /  /    ')
001130070516     A                                      DSPATR(HI)
001140070516     A                                 14 29'Data Partenza Ultimo Collo'
001150070516     A            R97DUC    R        O 14 57REFFLD(R97DUC FNLR97)
001160070516     A                                      EDTWRD('  /  /    ')
001170070516     A                                      DSPATR(HI)
001180070516     A N99        D98NPI    R        O 14 75REFFLD(D98NPI TNSD99DS)
001190070516     A                                      DSPATR(HI)
001200070516     A                                      EDTCDE(L)
001210070516     A                                 16  2'                            AFFIDA-
001220070516     A                                      BILITA''  CLIENTE                  -
001230070516     A                                        '
001240070516     A                                      DSPATR(UL)
001250070516     A                                 17  2'Data Spedizione'
001260070516     A            DASPCV         8Y 0O 17 18EDTWRD('  /  /    ')
001270070516     A                                      DSPATR(HI)
001280070516     A                                 17 29'Consegna Teorica: Data'
001290070516     A            W98DCE    R        O 17 52REFFLD(D98DCE TNSD99DS)
001300070516     A                                      EDTWRD('  /  /    ')
001310070516     A                                      DSPATR(HI)
001320070516     A                                 17 63'Ore'
001330070516     A            D98HCE    R        O 17 67REFFLD(D98HCE TNSD99DS)
001340070516     A                                      DSPATR(HI)
001350070516     A                                      EDTWRD('  :  ')
001360070516     A                                 18 29'CONSEGNA REALE:'
001370070516     A                                      DSPATR(HI)
001380070516     A                                 18 47'Data'
001390070516     A            W98DCM    R        O 18 52REFFLD(D98DCM TNSD99DS)
001400070516     A                                      EDTWRD('  /  /    ')
001410070516     A                                      DSPATR(HI)
001420070516     A                                 18 63'Ore'
001430070516     A            D98HMC    R        O 18 67REFFLD(D98HMC TNSD99DS)
001440070516     A                                      DSPATR(HI)
001450070516     A                                      EDTWRD('  :  ')
001460070516     A N99        D98NRC    R        O 18 75REFFLD(D98NRC TNSD99DS)
001470070516     A                                      DSPATR(HI)
001480070516     A                                      EDTCDE(L)
001490070516     A                                 20  2'                           AFFIDAB-
001500070516     A                                      ILITA''  CONSEGNA                  -
001510070516     A                                        '
001520070516     A                                      DSPATR(UL)
001530070516     A                                 21  2'Arrivo Ultimo Collo: Data'
001540070516     A            W98DTI    R        O 21 29REFFLD(D98DTI TNSD99DS)
001550070516     A                                      DSPATR(HI)
001560070516     A                                      EDTWRD('  /  /    ')
001570070516     A                                 21 41'Ore'
001580070516     A            D98HTI    R        O 21 46REFFLD(D98HTI TNSD99DS)
001590070516     A                                      DSPATR(HI)
001600070516     A                                      EDTWRD('0 :  ')
001610070516     A                                 22  2'Consegna Teorica:    Data'
001620070516     A            W98DCI    R        O 22 29REFFLD(D98DCI TNSD99DS)
001630070516     A                                      DSPATR(HI)
001640070516     A                                      EDTWRD('  /  /    ')
001650070516     A                                 22 41'Ore'
001660070516     A            D98HCI    R        O 22 46REFFLD(D98HCI TNSD99DS)
001670070516     A                                      DSPATR(HI)
001680070516     A                                      EDTWRD('0 :  ')
001690070516     A N99        D98NCI    R        O 22 75REFFLD(D98NCI TNSD99DS)
001700070516     A                                      DSPATR(HI)
001710070516     A                                      EDTCDE(L)
001720070516     A            V1CMSG        78A  O 23  2DSPATR(BL)
001730070516     A                                      DSPATR(HI)
001740070516     A                                 24  2'F3=Fine'
001750070516     A  30                             24 15'F5=Eventi'
001760070516     A                                 24 30'F12=Precedente'
001770070516     A                                 24 50'F21=Dett.Colli'
