000100091029     A*%%TS  SD  20091029  143245  EDPAB       REL-V5R4M0  5722-WDS
000200091029     A*%%EC
000300091029     A                                      DSPSIZ(24 80 *DS3)
000400091029     A                                      PRINT
000500091029     A          R LRK1WHP
000600091029     A*%%TS  SD  20091029  143005  EDPAB       REL-V5R4M0  5722-WDS
000700091029     A                                      OVERLAY
000800091029     A                                      WINDOW(5 19 8 40)
000900091029     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
001000091029     A                                          '))
001100091029     A                                  7 27'Enter=Continua'
001200091029     A                                  2  7'1 = Collo arrivato'
001300091029     A                                  4  7'3+18 = Danneggiato'
001400091029     A                                  6  7'3+117 = Mancante'
001500091029     A          R ASSUME
001600091029     A                                      ASSUME
001700091029     A                                  1  2' '
