000100070226     A*--------------------------------------------------------------*
000200070226     A* DS per modifica AUT in distinta per PDA                      *
000300070226     A*--------------------------------------------------------------*
000400070226     A          R LRD1REC
000500070226     A*
000600070226     A            LRD1FGS        3S 0       TEXT('P.o. gestione')
000700070226     A            LRD1NDC        6S 0       TEXT('Numero distinta')
000800070226     A            LRD1PDRO       7S 0       TEXT('Autotrasportatore OLD')
000900070226     A            LRD1PDRN       7S 0       TEXT('Autotrasportatore NEW')
