000100041013      *--------------------------------------------------------------*
000200041013      * DS per impostazione parametri RIENTRI  ORM
000300041013      *--------------------------------------------------------------*
000400041013     A          R FNLRF9
000500041013      *
000600041013     A            RF9MOD         1A         TEXT('Tipo richiamo: BLANK= ELABORA-
000700041013     A                                        R= RIELABORA')
000800041013     A            RF9DAE         8S 0       TEXT('DATA ELABORAZIONE')
000900041013     A            RF9FGS         3S 0       TEXT('P.O. DA ELABORARE')
001000041013      *
