000100890918     A*--------------------------------------------------------------*
000200140813     A*  DS  PER GESTIONE DISPOSIZIONI DI CONSEGNA
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500141024     A          R LRY03REC                  TEXT('DS GESTIONE DISPO CONSEGNA')
000600961016     A*  CAMPI DI INPUT
000700140813     A            ILRY03TLA      1A         TEXT('TIPO LANCIO PROGRAMMA')
000800140813     A            ILRY03TCH      1A         TEXT('TIPO CHIAMATA:" "=STD ')
000900140813     A            ILRY03AAS R     S         REFFLD($AAS)
001000140813     A            ILRY03LNP R     S         REFFLD($LNP)
001100140813     A            ILRY03NRS R     S         REFFLD($NRS)
001200140813     A            ILRY03NSP R     S         REFFLD($NSP)
001300141006     A            ILRY03FGS R     S         REFFLD($FGS)
001400140909     A            ILRY03PRG     11S 0       TEXT('PROGRESSIVO RICHIESTA')
001500140813     A            ILRY03TIPD     1A         TEXT('TIPO DISPOSIZIONE')
001600141024     A* ABILITAZIONE TASTI FUNZIONALI
001700141024     A            ILRY03DF12     1A         TEXT('PER DIROTT ABIL F12 S/N')
001800141024     A            ILRY03DF21     1A         TEXT('PER DIROTT ABIL F21 S/N')
001900141024     A            ILRY03DF06     1A         TEXT('PER DIROTT ABIL F06 S/N')
002000141024     A
002100141024     A            ILRY03EF12     1A         TEXT('ESCL.DIROTT ABIL F12 S/N')
002200141024     A            ILRY03EF21     1A         TEXT('ESCL.DIROTT ABIL F21 S/N')
002300141024     A            ILRY03EF06     1A         TEXT('ESCL.DIROTT ABIL F06 S/N')
002400141024     A
002500141024     A* " " --> FERMA NEL PROGRAMMA DI ESECUZIONE LRY03
002600141024     A* "N" --> NON FERMA NEL PROGRAMMA DI ESECUZIONE LRY03 --> CHIAMATA CIECA
002700141024     A            ILRY03FFR      1A         TEXT('TIPO FERMATA')
002800141024     A
002900141024     A*** STAMPANTI PER ESECUZIONE  ***
003000141024     A*    OBBLIGATORIE PER CHIAMA CIECA
003100141024     A*    FACOLTATIVE SE FERMA NEL PROGRAMMA DI ESECIZIONE :
003200141024     A*      SE NON PASSATE, VERRANNO RICHIESTE
003300141024     A            ILRY03MDB     10A         TEXT('MODULO BOLLE')
003400141024     A            ILRY03MDE     10A         TEXT('MODULO ETICH.')
003500141024     A            ILRY03PRB     10A         TEXT('PRINTER BOLLE')
003600141024     A            ILRY03PRE     10A         TEXT('PRINTER ETICH.')
003700141024     A            ILRY03PSS     10A         TEXT('PGM ST.SEGNACOLLI.')
003800141024     A            ILRY03MDB4    10A         TEXT('MODULO STAMPA LDV SU A4')
003900141024     A            ILRY03MDB5    10A         TEXT('MODULO STAMPA LDV SU A5')
004000141024     A            ILRY03BSL      1A         TEXT('"S"=STAMPA LDV SU LASER')
004100141024     A            ILRY03PSL     10A         TEXT('PGM PER STAMPA LDV')
004200141024     A            ILRY03PRB4    10A         TEXT('STAMPANTE PER LDV SU A4')
004300141024     A            ILRY03PRB5    10A         TEXT('STAMPANTE PER LDV SU A5')
004400141024
004500141024     A            ILRY03FLO     20A         TEXT('USI FUTURI')
004600141024
004700141024     A
004800961016     A* CAMPO DI OUTPUT:
004900140813     A            OLRY03ERR      1A         TEXT('ERRORE')
005000140813     A            OLRY03MSG     78A         TEXT('MSG DI ERRORE-NON GESTITO')
005100140813     A            OLRY03F12      1A         TEXT('"1"=PREMUTO F12')
