000100100426      *PARMS DEVTYPE(*AFPDS) PAGESIZE(66 132 *ROWCOL) LPI(8) CPI(15)
000200110517      *PARMS OVRFLW(66) PRTQLTY(*STD) DRAWER(*FORMDF) PAGRTT(90)
000300080725      *PARMS UOM(*INCH) FORMTYPE(*LDVPDA) SAVE(*NO) USRDTA('LDV_PDA')
000400110517     /*PRM devtype(*afpds) pagesize(66 132 *rowcol) lpi(8) cpi(15)
000500110517     /*PRM ovrflw(66) prtqlty(*std) drawer(*formdf) pagrtt(90)
000600100422     /*PRM uom(*inch) formtype(*LDVPDA) save(*no) usrdta('LdV_PDA')
000700100422     /*END
000800030515      *---------------------------------------------------------------*
000900100422      *?Stampa LDV con HP laser fincato da AS - foglio x PDA         ?*
001000030515      *---------------------------------------------------------------*
001100030515     A                                      REF(CNDIZION)
001200030515
001300060921      *---------------------------------------------------------------*
001400060921      *?PARTE SUPERIORE: Logo / "Cornice" / Barcode / ...            ?*
001500060921      *---------------------------------------------------------------*
001600030515
001700081024     A          R SP30BOX1
001800080725      *
001900080725      *-------------------------------------*
002000080725      *
002100080725      * » PAGSEG([library-name/]page-segment-name
002200080725      *          position-down position-across
002300080725      *          (*SIZE width|&width-field height|&height-field)
002400080725      *          (*ROTATION rotation|&rotation))
002500080725      *   1 - Nome dell'oggetto contenente l'immagine (con eventuale libreria)
002600080725      *   2 - Distanza dell'immagine dal lato superiore del foglio
002700080725      *   3 - Distanza dell'immagine dal lato sinistro  del foglio
002800080725      *   Parametri facoltativi:
002900080725      *   4 - Dimensione .........: altezza + lunghezza
003000080725      *   5 - Rotazione (in gradi): 0, 90, 180, 270.
003100080725      *   N.B.: dai test eseguiti su AS888, la richiesta di rotazione
003200080725      *   ¯¯¯¯¯ del logo di 90°, ha come unico effetto la NON stampa
003300080725      *         del logo stesso.
003400080725      *         Per questo motivo conviene creare un nuovo oggetto:
003500080725      *           come il "vecchio" logo, ma già girato di 90°.
003600170608     A                                      PAGSEG(GAITRAOBJ/LOGOBRTF -
003700170613     A                                             7.650  7.000)
003800170608     A*//                                          7.800  7.330)
003900080725      *
004000080725      *-------------------------------------*
004100030515      *
004200030515      * » BOX(first-corner-down first-corner-across
004300030515      *       diagonal-corner-down diagonal-corner-across line-width)
004400030515      *   1 - Distanza del 1° bordo orizzontale (dal lato superiore del foglio)
004500030515      *   2 - Distanza del 1° bordo verticale   (dal lato sinistro  del foglio)
004600030515      *   3 - Distanza del 2° bordo orizzontale (dal lato superiore del foglio)
004700030515      *   4 - Distanza del 2° bordo verticale   (dal lato sinistro  del foglio)
004800030515      *   5 - Spessore della riga: in inches - da .001 a 22.750,
004900030515      *                            *NARROW   - .008 in.,
005000030515      *                            *MEDIUM   - .017 in.,
005100030515      *                            *WIDE     - .025 in.
005200030515      *
005300071017      * Area superiore (Bartolini)
005400071017      *      > superiore (mittente)
005500100430     A                                      BOX(0.20  0.25  +
005600130125     A                                          0.958 3.908 *NARROW)
005700071017      *      > generale
005800100426     A                                      BOX(0.95  0.25  +
005900100426     A                                          3.75  8.30  *NARROW)
006000071017      *      > contrassegno
006100110516     A     20                               BOX(2.10  6.45  +
006200110516     A                                          2.58  8.30  *WIDE)
006300071017      *      > totale da esigere al ritiro o alla consegna
006400110516     A     21                               BOX(2.555 6.45  +
006500100426     A                                          3.08  8.30  *WIDE)
006600030515      *
006700030515      *-------------------------------------*
006800030515      *
006900030515      * » LINE(position-down position-across line-lenght line-direction
007000030515      *        line-width)
007100030515      *   1 - Distanza della linea dal lato superiore del foglio
007200030515      *   2 - Distanza della linea dal lato sinistro  del foglio
007300030515      *   3 - Lunghezza della riga
007400030515      *   4 - Tipo riga (*HRZ = orizzontale, *VRT = verticale)
007500030515      *   5 - Spessore della riga: in inches - da .001 a 22.750,
007600030515      *                            *NARROW   - .008 in.,
007700030515      *                            *MEDIUM   - .017 in.,
007800030515      *                            *WIDE     - .025 in.
007900030515      *
008000030515      * Linee orizzontali per la parte superiore
008100030515      *                                     » Mittente
008200030515      *                                     » Destinatario
008300130125     A                                      LINE(1.75 0.25 3.65 +
008400100429     A                                           *HRZ *NARROW)
008500030515      *                                     » Colli / Peso / Volume / Natura
008600100429     A                                      LINE(2.45 0.25 1.90 +
008700100429     A                                           *HRZ *NARROW)
008800030515      *                                     » Zona / "*" / F.Dep.
008900100929     A                                      LINE(2.73 0.25 1.90 +
009000100429     A                                           *HRZ *NARROW)
009100030515      *                                     » Segnacolli
009200100429     A                                      LINE(3.20 0.25 1.90 +
009300100429     A                                           *HRZ *NARROW)
009400030515      *                                     » Consegne particolari
009500030515      * . . . . . . . . . . . . . . . . . . *
009600030515      *                                     ». Mittente
009700030515      *                                     ». Destinatario
009800030515      *                                     ». Servizio
009900130125     A                                      LINE(2.35 2.15 1.75 +
010000100429     A                                           *HRZ *NARROW)
010100030515      *                                     ». Data e ora consegna richiesta
010200130125     A                                      LINE(2.73 2.15 1.75 +
010300100429     A                                           *HRZ *NARROW)
010400030515      *                                     ». Turni di chiusura
010500130125     A                                      LINE(3.072 2.15 1.75 +
010600100429     A                                           *HRZ *NARROW)
010700030515      * - - - - - - - - - - - - - - - - - - *
010800030515      *                                     »» Riferimento mittente
010900130125     A                                      LINE(1.32 3.90 2.55 +
011000100429     A                                           *HRZ *NARROW)
011100030515      *                                     »» Nominativo e telefono
011200130125     A                                      LINE(1.75 3.90 2.55 +
011300100429     A                                           *HRZ *NARROW)
011400030515      *                                     »» Note e Particolarità
011500130125     A                                      LINE(3.072 3.90 2.55 +
011600100429     A                                           *HRZ *NARROW)
011700030515      *                                     »» Nome e cognome / Firma / Data
011800030515      * - - - - - - - - - - - - - - - - - - *
011900030515      *                                     »»» Spedizione
012000100429     A                                      LINE(1.32 6.45 1.85 +
012100100429     A                                           *HRZ *NARROW)
012200030515      *                                     »»» Imponibile / IVA / Totale
012300030515      *                                     »»» Fattura n° / del
012400030515      *                                     »»» Contrassegno
012500030515      *                                     »»» Totale da esigere
012600100429     A       N21                            LINE(3.072 6.45 1.85 +
012700100429     A                                           *HRZ *NARROW)
012800030515      *                                     »» Nome e cognome / Firma / Data
012900030515      *-------------------------------------*
013000031031      * Linee verticali per la parte superiore
013100100929     A                                      LINE(1.75 2.15 2.00 +
013200100429     A                                           *VRT *NARROW)
013300130125     A                                      LINE(0.95 3.90 2.122 +
013400100429     A                                           *VRT *NARROW)
013500110516     A                                      LINE(0.95 6.45 1.15 +
013600100429     A                                           *VRT *NARROW)
013700110516     A       N21                            LINE(2.10 6.45 0.98 +
013800100429     A                                           *VRT *NARROW)
013900030515      *-------------------------------------*
014000030515      * Richieste: nome, firma, data e ora
014100100429     A  35                                  LINE(3.55 2.20 2.20 +
014200100429     A                                           *HRZ *NARROW)
014300100427     A     72
014400100429     AO 35                                  LINE(3.55 4.45 2.00 +
014500100429     A                                           *HRZ *NARROW)
014600100429     A  35                                  LINE(3.55 6.50 1.70 +
014700100429     A                                           *HRZ *NARROW)
014800030515      *-------------------------------------*
014900030515      *
015000030515      * Diciture / Dati
015100030515      *
015200110516      * - Dati "BRT S.p.A."
015300030515     A            TBAR          50A
015400110516     A*//                                   TEXT('"Bartolini S.p.A."')
015500110516     A                                      TEXT('"BRT S.p.A."')
015600030515     A                                      FONT(02305 (*POINTSIZE 6))
015700110516     A*// x BARTOLINI S.p.A.                POSITION(0.32 5.95)
015800110516     A*// x BRT S.p.A.                      POSITION(0.32 6.22)
015900120124     A                                      POSITION(0.32 7.22)
016000060503     A            TBA1          50A
016100060503     A                                      TEXT('"Sede Operativa ed -
016200060503     A                                      Amministrativa:"')
016300060504     A                                      FONT(02305 (*POINTSIZE 5))
016400120124     A                                      POSITION(0.40 6.525)
016500060503     A            TBA2          50A
016600060503     A                                      TEXT('Indirizzo')
016700060504     A                                      FONT(02305 (*POINTSIZE 5))
016800120124     A                                      POSITION(0.48 6.440)
016900060504     A            TBA3          50A
017000060504     A                                      TEXT('Sede Legale')
017100060504     A                                      FONT(02304 (*POINTSIZE 4))
017200120124     A                                      POSITION(0.55 6.495)
017300060504     A            TBA4          50A
017400060504     A                                      TEXT('Partita IVA')
017500060504     A                                      FONT(02304 (*POINTSIZE 5))
017600120124     A                                      POSITION(0.64 6.730)
017700060504     A            TBA5          50A
017800060504     A                                      TEXT('Capitale sociale')
017900060504     A                                      FONT(02304 (*POINTSIZE 4))
018000120124     A                                      POSITION(0.71 6.490)
018100060504     A            TBA6          50A
018200071017     A                                      TEXT('"info on-line" - VUO-
018300071017     A                                      TO')
018400060504     A                                      FONT(02304 (*POINTSIZE 6))
018500120124     A                                      POSITION(0.80 6.405)
018600060504     A            TBA7          50A
018700100427     A                                      TEXT('Sito internet')
018800060504     A                                      FONT(02305 (*POINTSIZE 7))
018900120124     A                                      POSITION(0.80 7.125)
019000100427      *
019100100427      * - Intestazione areee
019200100929     A            *NONE                     'MITTENTE'
019300100929     A                                      FONT(02304 (*POINTSIZE 5.0))
019400100430     A                                      POSITION(0.300  0.300)
019500100427      *
019600100929     A            *NONE                     'DESTINATARIO'
019700100929     A                                      FONT(02304 (*POINTSIZE 5.0))
019800100427     A                                      POSITION(1.050  0.300)
019900100929     A            *NONE                     'FILIALE DI ARRIVO'
020000100929     A                                      FONT(02304 (*POINTSIZE 5.0))
020100100430     A                                      POSITION(1.050  2.750)
020200100929     A            *NONE                     'RIF. MITTENTE'
020300100929     A                                      FONT(02304 (*POINTSIZE 5.0))
020400130125     A                                      POSITION(1.050  3.950)
020500100929     A            *NONE                     'SPEDIZIONE'
020600100929     A                                      FONT(02304 (*POINTSIZE 5.0))
020700100429     A                                      POSITION(1.050  6.500)
020800100427      *
020900100929     A            *NONE                     'TELEFONO E NOMINATIVO'
021000100929     A                                      FONT(02304 (*POINTSIZE 5.0))
021100130125     A                                      POSITION(1.420  3.950)
021200100427      *
021300100929     A            *NONE                     'COLLI'
021400100929     A                                      FONT(02304 (*POINTSIZE 5.0))
021500100929     A                                      POSITION(1.850  0.400)
021600100929     A            *NONE                     'PESO'
021700100929     A                                      FONT(02304 (*POINTSIZE 5.0))
021800100929     A                                      POSITION(1.850  1.150)
021900100929     A            *NONE                     'VOLUME'
022000100929     A                                      FONT(02304 (*POINTSIZE 5.0))
022100100929     A                                      POSITION(1.850  1.750)
022200100929     A            *NONE                     'SERVIZIO'
022300100929     A                                      FONT(02304 (*POINTSIZE 5.0))
022400100929     A                                      POSITION(1.850  2.200)
022500100929     A            *NONE                     'NOTE E PARTICOLARITÀ'
022600100929     A                                      FONT(02304 (*POINTSIZE 5.0))
022700130125     A                                      POSITION(1.850  3.950)
022800100427      *
022900100929     A            *NONE                     'NATURA DELLA MERCE'
023000100929     A                                      FONT(02304 (*POINTSIZE 5.0))
023100100429     A                                      POSITION(2.250  0.300)
023200110516      *
023300110516     A  20        *NONE                     'CONTRASSEGNO'
023400110516     A                                      FONT(02304 (*POINTSIZE 5.0))
023500110516     A                                      HIGHLIGHT
023600110516     A*//                                   POSITION(2.100  6.500)
023700110516     A                                      POSITION(2.250  6.500)
023800100427      *
023900100929     A            *NONE                     'DATA E ORA CONSEGNA +
024000100929     A                                       RICHIESTA'
024100100929     A                                      FONT(02304 (*POINTSIZE 5.0))
024200100429     A                                      POSITION(2.450  2.200)
024300100427      *
024400100929     A            *NONE                     'ZONA'
024500100929     A                                      FONT(02304 (*POINTSIZE 5.0))
024600100427     A                                      POSITION(2.550  0.300)
024700110516      *
024800110516     A     21     *NONE                     'TOTALE DA ESIGERE +
024900110516     A                                       ALLA CONSEGNA'
025000110516     A                                      FONT(02304 (*POINTSIZE 5.0))
025100110516     A                                      HIGHLIGHT
025200110516     A                                      POSITION(2.680  6.500)
025300100427      *
025400100929     A            *NONE                     'SEGNACOLLI'
025500100929     A                                      FONT(02304 (*POINTSIZE 5.0))
025600100929     A                                      POSITION(2.830  0.300)
025700100929     A            *NONE                     'TURNO DI CHIUSURA'
025800100929     A                                      FONT(02304 (*POINTSIZE 5.0))
025900100929     A                                      POSITION(2.830  2.200)
026000100427      *
026100100929     A            *NONE                     'CONSEGNE PARTICOLARI'
026200100929     A                                      FONT(02304 (*POINTSIZE 5.0))
026300100427     A                                      POSITION(3.310  0.300)
026400100427      *
026500100929     A  35        *NONE                     '(nome e cognome in +
026600100929     A                                        stampatello)'
026700100929     A                                      FONT(02304 (*POINTSIZE 5.0))
026800100427     A                                      POSITION(3.650  2.200)
026900100929     A     72
027000100929     AO 35        *NONE                     '(firma)'
027100100929     A                                      FONT(02304 (*POINTSIZE 5.0))
027200100429     A                                      POSITION(3.650  4.450)
027300100427      *
027400100929     A  35        *NONE                     '(data e ora)'
027500100929     A                                      FONT(02304 (*POINTSIZE 5.0))
027600100429     A                                      POSITION(3.650  6.500)
027700100427      *
027800030515
027900030515      *---------------------------------------------------------------*
028000100427      *?Lettera di Vettura (posizionamento immagine x PDA)           ?*
028100030515      *---------------------------------------------------------------*
028200030515
028300081024     A          R SP30LDV1
028400071017     A                                      TEXT('Parte della LdV da -
028500071017     A                                      ritornare in "BARTOLINI"')
028600030515      *
028700030515      * » FONT(font-identifier point-size)
028800030515      *
028900030515      * - Courier CPI(17.5) ..............: FONT(00248)
029000030515      * - Courier CPI(15) ................: FONT(00222)
029100030515      * - Courier CPI(13.3) ..............: FONT(00204)
029200030515      * - Courier CPI(12) ................: FONT(00085)
029300030515      * - Courier CPI(10) ................: FONT(00011)
029400030515      * - Gothic  CPI(17.5) ..............: FONT(00400)
029500040426      * - Gothic  CPI(15) ................: FONT(00230)
029600030515      * - Gothic  CPI(12) ................: FONT(00066)
029700030515      * - Gothic  CPI(10) ................: FONT(00040)
029800030515      *
029900100423     A                                      FONT(02304 (*POINTSIZE 4.0))
030000030515     A                                      SKIPB(0002)
030100030515      *
030200030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
030300100422  3  A                                     5' '
030400030515     A                                      SPACEB(001)
030500030515      * > Mittente: codice cliente  /  Tariffa  /
030600030515      *   /  Sigla operatore video  /  "DDT"
030700100427     A*//                                  6'MITTENTE'
030800030515      * > >
030900030515      * > > >
031000030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
031100100422  4  A                                     5' '
031200030515     A                                      SPACEB(001)
031300030515      * > Mittente: ragione sociale
031400030515      * > >
031500030515      * > > >
031600030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
031700100422  5  A                                     5' '
031800030515     A                                      SPACEB(001)
031900030515      * > Mittente: indirizzo
032000030515      * > >
032100030515      * > > >
032200030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
032300100422  6  A                                     5' '
032400030515     A                                      SPACEB(001)
032500030515      * > Mittente: cap/località/provincia/nazione
032600030515      * > >
032700030515      * > > >
032800030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
032900100422  7  A                                     5' '
033000030515     A                                      SPACEB(001)
033100030515      * > Mittente: originale
033200030515      * > >
033300030515      * > > >
033400030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
033500100422  8  A                                     5' '
033600030515     A                                      SPACEB(001)
033700030515      * >
033800030515      * > >
033900030515      * > > >
034000030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
034100100422  9  A                                     5' '
034200030515     A                                      SPACEB(001)
034300070308      * > Destinatario: codice cliente  /  Tariffa  /  Filiale Arrivo
034400100427     A*//                                  6'DESTINATARIO'
034500100427     A*//                                 44'FILIALE DI ARRIVO:'
034600030515      * > > Rif. Mittente numerico
034700100427     A*//                                 60'RIF. MITTENTE'
034800030515      * > > >
034900100427     A*//                                 99'SPEDIZIONE'
035000030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
035100100422 10  A                                     5' '
035200030515     A                                      SPACEB(001)
035300030515      * > Destinatario: ragione sociale
035400030515      * > > Rif. Mittente alfanumerico
035500030515      * > > > Spedizione
035600030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
035700030515      *
035800100422 11  A                                     5' '
035900030515     A                                      SPACEB(001)
036000030515      * > Destinatario: estensione ragione sociale
036100030515      * > >
036200030515      * > > >
036300030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
036400100422 12  A                                     5' '
036500030515     A                                      SPACEB(001)
036600030515      * > Destinatario: indirizzo
036700030515      * > >
036800100427     A*//                                 60'TELEFONO  E  NOMINATIVO'
036900030515      * > > > Importi: imponibile IVA
037000030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
037100100422 13  A                                     5' '
037200030515     A                                      SPACEB(001)
037300030515      * > Destinatario: cap/località/provincia/nazione
037400030515      * > > Nominativo (e telefono)
037500030515      * > > > Importi: iva-esenzione
037600030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
037700100422 14  A                                     5' '
037800030515     A                                      SPACEB(001)
037900030515      * >
038000030515      * > >
038100030515      * > > > Importi: totale fattura
038200030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
038300100422 15  A                                     5' '
038400030515     A                                      SPACEB(001)
038500030515      * >
038600100427     A*//                                  8' COLLI'
038700100427     A*//                                + 5'  PESO'
038800100427     A*//                                + 3' VOLUME'
038900030515      * >+ Servizio
039000100427     A*//                                 34'SERVIZIO'
039100030716      * > > Note e particolarità
039200100427     A*//                                 60'NOTE  E  PARTICOLARITÀ'
039300030716      * > > > Importi: divisa fattura
039400030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
039500100422 16  A                                     5' '
039600030515     A                                      SPACEB(001)
039700030515      * > Colli: numero / peso / volume
039800030515      * >+ Servizio (1)
039900030515      * > > Note e particolarità (1)
040000030515      * > > > Fattura
040100030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
040200100422 17  A                                     5' '
040300030515     A                                      SPACEB(001)
040400030515      * >
040500030515      * >+ Servizio (2)
040600030515      * > > Note e particolarità (2)
040700030515      * > > >
040800100427     A*//  20                             99'CONTRASSEGNO'
040900100427     A*//                                   HIGHLIGHT
041000030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
041100100422 18  A                                     5' '
041200030515     A                                      SPACEB(001)
041300100426      * >
041400100427     A*//                                  6'NATURA DELLA MERCE'
041500030515      * > > Note e particolarità (3)
041600030515      * > > >
041700030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
041800100422 19  A                                     5' '
041900030515     A                                      SPACEB(001)
042000100426      * > Colli: natura merce
042100030515      * >+
042200030515      * > > Note e particolarità (4)
042300100427      * > > >
042400100427     A*//  20                             95'CONTRASSEGNO'
042500100427     A*//                                   FONT(02304 (*POINTSIZE 4.0))
042600100427     A*//                                   HIGHLIGHT
042700030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
042800100422 20  A                                     5' '
042900030515     A                                      SPACEB(001)
043000100426      * >
043100100426      * >+
043200100427     A*//                                 34'DATA E ORA CONSEGNA RICHI-
043300100427     A*//                                   ESTA'
043400030515      * > > Note e particolarità (5)
043500030515      * > > > Contrassegno
043600030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
043700100422 21  A                                     5' '
043800030515     A                                      SPACEB(001)
043900100426      * > Zona / "*" / Codice Giro o Numero Distinta
044000100427     A*//                                  6'ZONA'
044100100426      * >+ Data e ora consegna richieste
044200030515      * > > Note e particolarità (6)
044300100427      * > > > Contrassegno
044400030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
044500100422 22  A                                     5' '
044600030515     A                                      SPACEB(001)
044700100426      * >
044800100426      * >+
044900030515      * > >
045000100427      * > > >
045100030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
045200100422 23  A                                     5' '
045300030515     A                                      SPACEB(001)
045400100426      * > Segnacolli / "Colli di valore"
045500100427     A*//                                  6'SEGNACOLLI'
045600100426      * >+
045700100427     A*//                                 34'TURNO DI CHIUSURA'
045800030515      * > > Privato / Appuntamento
045900030515      * > > > Importo totale da esigere al ritiro o alla consegna
046000100427     A*//  21 35                          99'TOTALE DA ESIGERE +
046100100427     A*//                                    ALLA CONSEGNA'
046200100427     A*//                                   HIGHLIGHT
046300100427     A*//  21 36                          99'TOTALE DA ESIGERE +
046400100427     A*//                                    AL RITIRO'
046500100427     A*//                                   HIGHLIGHT
046600030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
046700100422 24  A                                     5' '
046800030515     A                                      SPACEB(001)
046900030515      * > Segnacolli
047000100426      * >+ "Fermo Deposito" (in alternativa ai turni chiusura)
047100100426      * >+ Turno chiusura (1)
047200030515      * > >
047300030515      * > > >
047400030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
047500100422 25  A                                     5' '
047600030515     A                                      SPACEB(001)
047700030515      * >
047800100426      * >+ Turno chiusura (2)
047900100426      * > >  /  > > >
048000030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
048100100422 26  A                                     5' '
048200030515     A                                      SPACEB(001)
048300030515      * >
048400030515      * >+  /  > >  /  > > >
048500030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
048600100422 27  A                                     5' '
048700030515     A                                      SPACEB(001)
048800100426      * >
048900100427     A*//                                  6'CONSEGNE PARTICOLARI'
049000030515      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
049100100422 28  A                                     5' '
049200030515     A                                      SPACEB(001)
049300100426      * > Consegna particolare 1
049400100426      * >+  /  > >  /  > > > Eventuale testo "NON UTILIZZARE PER ..."
049500100426      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
049600100426 28  A                                     5' '
049700100426     A                                      SPACEB(001)
049800100426      * > Consegna particolare 2
049900100426      * >+  /  > >  /  > > >
050000100427     A*//  35                             34'(nome e cognome in stampa-
050100100427     A*//                                   tello)'
050200100427     A*//     72
050300100427     A*//O 35                             68'(firma)'
050400100427     A*//  35                             99'(data e ora)'
050500030515
050600030515      *---------------------------------------------------------------*
050700060921      *?Salto di una riga (vuota)                                    ?*
050800030515      *---------------------------------------------------------------*
050900030515
051000081024     A          R SP30NUL
051100080725     A                                      SPACEB(0001)
051200080725     A                                     5' '
051300081024
051400081024      *---------------------------------------------------------------*
051500081024      *?"Separazione" delle 2 parti della bolla                      ?*
051600081024      *---------------------------------------------------------------*
051700081024
051800081024     A          R SP30SEP
051900081024     A                                      TEXT('Separazione "box"')
052000081024     A                                     5' '
052100100429     A                                      SKIPB(0032)
052200080725
052300080725      *---------------------------------------------------------------*
052400080725      *?BOX PER PROMEMORIA PER AUTOTRASPORTATORE                     ?*
052500080725      *---------------------------------------------------------------*
052600080725
052700081024     A          R SP30AR53
052800080725     A                                      TEXT('"Bancali da Rendere"-
052900080725     A                                      , "Supermercato", -
053000080725     A                                      "Promemoria": box')
053100080725      *
053200100430     A                                      BOX(3.80  0.25  +
053300100429     A                                          5.20  8.30  *NARROW)
053400081023
053500081023      *---------------------------------------------------------------*
053600081023      *?Dati "DPD"                                                   ?*
053700081023      *---------------------------------------------------------------*
053800081023
053900081024     A          R SP30DPD
054000081023     A                                      TEXT('Intestazione "DPD" --
054100100429     A                                       Logo')
054200081023      *
054300081023      * Logo
054400081023      *
054500081023      * » PAGSEG([library-name/]page-segment-name
054600081023      *          position-down position-across
054700081023      *          (*SIZE width|&width-field height|&height-field)
054800081023      *          (*ROTATION rotation|&rotation))
054900081023      *   1 - Nome dell'oggetto contenente l'immagine
055000081023      *       (con eventuale libreria)
055100081023      *   2 - Distanza dell'immagine dal lato superiore del foglio
055200081023      *   3 - Distanza dell'immagine dal lato sinistro  del foglio
055300081023      *   Parametri facoltativi:
055400081023      *   4 - Dimensione .........: altezza + lunghezza
055500081023      *   5 - Rotazione (in gradi): 0, 90, 180, 270.
055600081023      *   N.B.1: per mantenere il logo anche DOPO aver trasferito una
055700081023      *          stampa di codesto prtf in altro AS/400
055800081023      *          - vedi OUTQ(EDP888) da AS888 o OUTQ(SETRAS) da fil. -
055900081023      *          pare NECESSARIO aver specificato il nome della
056000081023      *          libreria relativa al logo. Incredibile ma vero !!!
056100081023      *   N.B.2: il nome del logo sarebbe "parametrizzabile", ma tale
056200081023      *          parametro va definito lungo 8 char: non sarebbe quindi
056300081023      *          possibile specificare, in tale parametro, anche il
056400081023      *          il nome della libreria e il "/" separatore (comunque
056500081024      *          specificabili separatamente).
056600110516     A                                      PAGSEG(GAITRAOBJ/LOGODPD0 +
056700110516     A                                             6.550 6.450)
056800081023
056900081023      *---------------------------------------------------------------*
057000081023      *?Dati "FEDEX"                                                 ?*
057100081023      *---------------------------------------------------------------*
057200081023
057300100429     A          R SP30FED
057400081023     A                                      TEXT('Intestazione "FedEx"-
057500081023     A                                       - Box')
057600100429     A                                      FONT(02304 (*POINTSIZE 5.0))
057700100429      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
057800100429      * Box generale:
057900100430     A                                      BOX(3.98  0.25  +
058000100430     A                                          5.20  8.30  *NARROW)
058100100429      * Unica linea separatrice orizzontale:
058200100430     A                                      LINE(4.09  0.25  8.05 +
058300100429     A                                           *HRZ  *NARROW)
058400100429      * Linee verticali nel box:
058500100429     A                                      LINE(4.040 0.250 1.16 +
058600100429     A                                           *VRT  *NARROW)
058700081023      *                                     » Signature
058800100430     A                                      LINE(4.040 1.480 1.16 +
058900100429     A                                           *VRT  *NARROW)
059000081023      *                                     » Print Name
059100100430     A                                      LINE(4.040 3.000 1.16 +
059200100429     A                                           *VRT  *NARROW)
059300081023      *                                     » Sender's Account Number
059400100430     A                                      LINE(4.040 3.900 1.16 +
059500100429     A                                           *VRT  *NARROW)
059600100429      *                                     » Package Tracking Number
059700100430     A                                      LINE(4.040 5.300 1.16 +
059800100429     A                                           *VRT  *NARROW)
059900081023      *                                     » Recipient Address
060000100430     A                                      LINE(4.040 6.250 1.16 +
060100100429     A                                           *VRT  *NARROW)
060200081023      *                                     » Pcs.
060300100430     A                                      LINE(4.040 6.450 1.16 +
060400100429     A                                           *VRT  *NARROW)
060500081023      *                                     » Serv.
060600100430     A                                      LINE(4.040 6.650 1.16 +
060700100429     A                                           *VRT  *NARROW)
060800081023      *                                     » Time
060900100430     A                                      LINE(4.040 7.900 1.16 +
061000100429     A                                           *VRT  *NARROW)
061100081023      *                                     » Status
061200100929      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
061300100929      * Simil-Logo FedEx
061400100929     A            *NONE                     'FedEx'
061500100929     A                                      POSITION(3.960  0.250)
061600100929     A                                      FONT(34123 (*POINTSIZE 20))
061700100929      * > > Richieste: nome, firma
061800100929     A            *NONE                     'Employee Signature'
061900100929     A                                      POSITION(3.960  2.200)
062000100929     A            *NONE                     'Employee Number'
062100100929     A                                      POSITION(3.960  4.700)
062200100929      * > > >
062300100929     A            *NONE                     'DELIVERY RECORD'
062400100929     A                                      POSITION(3.920  7.020)
062500100929     A                                      FONT(02305)
062600100929      *- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -*
062700100929     A            *NONE                     'Signature'
062800100929     A                                      POSITION(4.060  0.700)
062900100929     A            *NONE                     'Print Name'
063000100929     A                                      POSITION(4.060  2.100)
063100100929     A            *NONE                     'Sender''s Account Number'
063200100929     A                                      POSITION(4.060  3.030)
063300100929     A            *NONE                     'Package Tracking Number'
063400100929     A                                      POSITION(4.060  4.170)
063500100929     A            *NONE                     'Recipient Address'
063600100929     A                                      POSITION(4.060  5.520)
063700100929     A            *NONE                     'Pcs.'
063800100929     A                                      POSITION(4.060  6.290)
063900100929     A            *NONE                     'Serv.'
064000100929     A                                      POSITION(4.060  6.470)
064100100929     A            *NONE                     'Time'
064200100929     A                                      POSITION(4.060  7.200)
064300100929     A            *NONE                     'Status'
064400100929     A                                      POSITION(4.060  8.000)
064500100423
064600100423      *---------------------------------------------------------------*
064700100423
064800100423     A          R SP30ROW
064900100423     A                                      TEXT('Riga di dettaglio')
065000100423     A*//                                   FONT(00211)
065100100423      *
065200100423     A            PTXT         125A
065300100423     A                                      TEXT('Riga di dettaglio')
065400100426     A                                      POSITION(&§ROW   0.30)
065500100423      *
065600100423      * Parametri
065700100423     A            §ROW           5S 3P
065800100427
065900100427      *---------------------------------------------------------------*
066000100427
066100100427     A          R SP30R30
066200100427     A                                      TEXT('"Per ricevuta della -
066300100427     A                                      merce senza riserve"')
066400100427      *
066500100427     A            PTXT         125A
066600100427     A                                      TEXT('Riga di dettaglio')
066700100427     A                                      POSITION(&§ROW   2.20)
066800100430     A                                      FONT(00281)
066900100427      *
067000100427      * Parametri
067100100427     A            §ROW           5S 3P
