000100040224             PGM        PARM(&KPJBA)
000200040224             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
000300040224 ALCOBJ:     ALCOBJ     OBJ((FNNCR00T *FILE *EXCL))
000400040224             MONMSG     MSGID(CPF1002) EXEC(GOTO CMDLBL(ALCOBJ))
000500040224             CALL       PGM(TRTR10R) PARM(&KPJBA)
000600040224             DLCOBJ     OBJ((FNNCR00T *FILE *EXCL))
000700040224             ENDPGM
