000010121018     A*%%TS  SD  20121018  171738  EDPAB       REL-V6R1M0  5761-WDS
000020000000     A*---------------------------------------------------------------*
000030121018     A*%%EC
000040121018     A                                      DSPSIZ(24 80 *DS3)
000050121018     A                                      CHGINPDFT(HI CS)
000060121018     A                                      PRINT
000070121018     A                                      CA03
000080940926     A*
000090940926     A**-------------------------------------------------------------**
000100121018     A          R EU77D01
000110121018     A*%%TS  SD  20121018  171738  EDPAB       REL-V6R1M0  5761-WDS
000120121018     A                                      CF06
000130121018     A            D1C0SN         1A  H
000140121018     A            RSUT          20A  O  1  2
000150121018     A                                  1 24'*   Dati Fatturazione   B R T     -
000160121018     A                                       *'
000170121018     A                                      DSPATR(RI)
000180121018     A                                      DSPATR(UL)
000190121018     A                                  1 61'FIEU77R'
000200121018     A                                  1 71DATE
000210121018     A                                      EDTCDE(Y)
000220121018     A            KNSIF         10A  O  2  2
000230121018     A            KNMUS         10A  O  2 13
000240121018     A                                  2 24' L a n c i o    E s t r a z i o n -
000250121018     A                                      e '
000260121018     A                                      DSPATR(RI)
000270121018     A                                  2 71TIME
000280121018     A                                  4 41'999=Tutti'
000290121018     A                                  5 27'Network'
000300121018     A                                      COLOR(WHT)
000310121018     A            D1NTW          3A  B  5 35DSPATR(HI)
000320121018     A                                      DSPATR(CS)
000330121018     A  41                                  ERRMSG('Inserire NETWORK' 41)
000340121018     A  46                                  ERRMSG('Il Network può essere gesti-
000350121018     A                                      to solo da EDP' 46)
000360121018     A                                      VALUES('DPD' 'FED' '   ' '310' '320-
000370121018     A                                      ' '325' '330' '340' '345' '350' '36-
000380121018     A                                      0' '370' '390' '380' '999' '311' '3-
000390121018     A                                      75' '333' '341')
000400121018     A                                  5 40'(DPD FED 310 311 320 325 330 340 3-
000410121018     A                                      41'
000420121018     A                                  6 41'345 350 360 370 375 380 390 333)'
000430121018     A                                  7 18'Data Spediz. dal'
000440121018     A                                      COLOR(WHT)
000450121018     A            D1DDAL         8Y 0B  7 35
000460121018     A  44                                  DSPATR(PC)
000470121018     A  44                                  ERRMSG('Data non corretta' 44)
000480121018     A                                      EDTCDE(8)
000490121018     A N28                                  DSPATR(CS)
000500121018     A  28                                  DSPATR(PR)
000510121018     A                                  8 32'al'
000520121018     A                                      COLOR(WHT)
000530121018     A            D1DAL          8Y 0B  8 35
000540121018     A  45
000550121018     AO 42                                  DSPATR(PC)
000560121018     A  42                                  ERRMSG('Data non corretta' 42)
000570121018     A  45                                  ERRMSG('Data AL.. inferiore della D-
000580121018     A                                      ata DAL...' 45)
000590121018     A                                      EDTCDE(8)
000600121018     A                                      DSPATR(CS)
000610121018     A                                 13 18'Batch/Interattiva'
000620121018     A N29                                  DSPATR(ND)
000630121018     A            D1TIP          1A  B 13 36CHGINPDFT
000640121018     A                                      VALUES('B' 'I')
000650121018     A N29                                  DSPATR(PR)
000660121018     A N29                                  DSPATR(ND)
000670121018     A  29                                  DSPATR(CS)
000680121018     A                                 13 39'B/I'
000690121018     A N29                                  DSPATR(ND)
000700121018     A                                 24  4'F3=Fine'
000710121018     A                                 24 32'F6=Conferma'
000720041015     A**-------------------------------------------------------------**
000730041015     A          R EU77D02
000740041015     A*%%TS  SD  20041015  145636  EDPAB       REL-V4R4M0  5769-PW1
000750041015     A                                      CF06
000760041015     A            D1C0SN         1A  H
000770041015     A            RSUT          20A  O  1  2
000780120305     A                                  1 24'*   Dati Fatturazione   B R T     -
000790041015     A                                       *'
000800041015     A                                      DSPATR(RI)
000810041015     A                                      DSPATR(UL)
000820041015     A                                  1 61'FIEU77R'
000830041015     A                                  1 71DATE
000840041015     A                                      EDTCDE(Y)
000850041015     A            KNSIF         10A  O  2  2
000860041015     A            KNMUS         10A  O  2 13
000870041015     A                                  2 24' L a n c i o    E s t r a z i o n -
000880041015     A                                      e '
000890041015     A                                      DSPATR(RI)
000900041015     A                                  2 71TIME
000910041015     A                                  7 16'Attenzione non è possibile lanciar-
000920041015     A                                      e il programma'
000930041015     A                                      COLOR(WHT)
000940041015     A                                  9 13'Sono state aggiunte degli altri co-
000950041015     A                                      dici VARIE in tab.CC'
000960041015     A                                      COLOR(WHT)
000970041015     A                                 11 15'Deve essere allineata la relativa -
000980041015     A                                      tabella TNEVA00F'
000990041015     A                                      COLOR(WHT)
001000041015     A                                 12 11'Prima di poter importare i dati Ba-
001010041015     A                                      rtolini di Fatturazione'
001020041015     A                                      COLOR(WHT)
001030041015     A                                 24  4'F3=Fine'
