000001041007     A*%%***********************************************************************
000002041007     A*%%TS  RD  20041007  162727  EDPAB       REL-V4R4M0  5769-PW1
000003041007     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004041007     A*%%FI       0000000000000000000000000000000000000000000000000
000005041007     A*%%***********************************************************************
000006041007     A          R TESTA
000007041007     A*%%***********************************************************************
000008041007     A*%%RI 00000
000009041007     A*%%***********************************************************************
000010041007     A                                      SKIPB(001)
000011041007     A                                      CPI(10)
000012041007     A                                      SPACEA(001)
000013041007     A                                     2
000014041007     A                                      'Quadratura Fatture Partner'
000015041007     A                                      UNDERLINE
000016041007     A            PARTNER        3A  O    31
000017041007     A                                      HIGHLIGHT
000018041007     A                                      UNDERLINE
000019041007     A                                    37
000020041007     A                                      'periodo fatture  dal '
000021041007     A                                      UNDERLINE
000022041007     A            DADATA          L  O    59
000023041007     A                                      HIGHLIGHT
000024041007     A                                      UNDERLINE
000025041007     A                                    71
000026041007     A                                      'al'
000027041007     A                                      UNDERLINE
000028041007     A            ADATA           L  O    75
000029041007     A                                      HIGHLIGHT
000030041007     A                                      UNDERLINE
000031041007     A            DAY             L  O   100
000032041007     A            ORE             T  O   112
000033041007     A                                   124
000034041007     A                                      'pag.'
000035041007     A            PAGE           3  0    129
000036041007     A                                      EDTCDE(Z)
000037041007     A                                      SPACEA(001)
000038041007     A  01                                 2
000039041007     A                                      'Fattura nr.'
000040041007     A                                      SPACEB(005)
000041041007     A  01        NRFAT         15A  O    14
000042041007     A                                      HIGHLIGHT
000043041007     A  02                                37
000044041007     A                                      'incasellate dal'
000045041007     A  02        DAINCA          L  O    54
000046041007     A                                      HIGHLIGHT
000047041007     A  02                                66
000048041007     A                                      'al'
000049041007     A  02        AINCA           L  O    70
000050041007     A                                      HIGHLIGHT
000051041007     A                                   120
000052041007     A                                      'pgm'
000053041007     A                                   125
000054041007     A                                      'FIEU83R'
000055041007     A*%%***********************************************************************
000056041007     A*%%SS
000057041007     A*%%CL 006
000058041007     A*%%CL 001
000059041007     A*%%***********************************************************************
000060041007     A          R TESDETTA
000061041007     A*%%***********************************************************************
000062041007     A*%%RI 00000
000063041007     A*%%***********************************************************************
000064041007     A                                      SPACEA(001)
000065041007     A                                      SPACEB(001)
000066041007     A                                      CPI(10)
000067041007     A                                     3
000068041007     A                                      'Fattura nr.'
000069041007     A                                      HIGHLIGHT
000070041007     A                                    21
000071041007     A                                      'del'
000072041007     A                                      HIGHLIGHT
000073041007     A                                    33
000074041007     A                                      'Riferimento'
000075041007     A                                      HIGHLIGHT
000076041007     A                                    51
000077041007     A                                      'S p e d i z i o n e'
000078041007     A                                      HIGHLIGHT
000079041007     A                                    73
000080041007     A                                      'LNA'
000081041007     A                                      HIGHLIGHT
000082041007     A                                    78
000083041007     A                                      'TB'
000084041007     A                                      HIGHLIGHT
000085041007     A                                    87
000086041007     A                                      'Importo'
000087041007     A                                      HIGHLIGHT
000088041007     A                                   103
000089041007     A                                      'Grp'
000090041007     A                                      HIGHLIGHT
000091041007     A                                   120
000092041007     A                                      'Incasellata'
000093041007     A                                      HIGHLIGHT
000094041007     A*%%***********************************************************************
000095041007     A*%%SS
000096041007     A*%%CL 001
000097041007     A*%%***********************************************************************
000098041007     A          R DETTAGLI
000099041007     A*%%***********************************************************************
000100041007     A*%%RI 00000
000101041007     A*%%***********************************************************************
000102041007     A                                      CPI(10)
000103041007     A                                      SPACEA(001)
000104041007     A            ECFNFP    R              1
000105041007     A                                      REFFLD(ECFNFP TNECF00F)
000106041007     A            ECFDFP    R             +2
000107041007     A                                      REFFLD(ECFDFP TNECF00F)
000108041007     A                                      EDTWRD('    /  /  ')
000109041007     A            ECFRIF    R             +2
000110041007     A                                      REFFLD(ECFRIF TNECF00F)
000111041007     A            ECFAAS    R             +1
000112041007     A                                      REFFLD(ECFAAS TNECF00F)
000113041007     A                                      EDTCDE(Z)
000114041007     A            ECFLNP    R             +1
000115041007     A                                      REFFLD(ECFLNP TNECF00F)
000116041007     A                                      EDTCDE(Z)
000117041007     A            ECFNRS    R             +1
000118041007     A                                      REFFLD(ECFNRS TNECF00F)
000119041007     A                                      EDTCDE(Z)
000120041007     A            ECFNSP    R             +1
000121041007     A                                      REFFLD(ECFNSP TNECF00F)
000122041007     A                                      EDTCDE(Z)
000123041007     A            ECFLNA    R             +3
000124041007     A                                      REFFLD(ECFLNA TNECF00F)
000125041007     A            ECFTBL    R             +2
000126041007     A                                      REFFLD(ECFTBL TNECF00F)
000127041007     A            ECFIMP    R             +2
000128041007     A                                      REFFLD(ECFIMP TNECF00F)
000129041007     A                                      EDTCDE(K)
000130041007     A            ECFGRP    R             +3
000131041007     A                                      REFFLD(ECFGRP TNECF00F)
000132041007     A            ECFDTA    R            +15
000133041007     A                                      REFFLD(ECFDTA TNECF00F)
000134041007     A*%%***********************************************************************
000135041007     A*%%SS
000136041007     A*%%CL 001
000137041007     A*%%***********************************************************************
000138041007     A          R TOTGRP
000139041007     A*%%***********************************************************************
000140041007     A*%%RI 00000
000141041007     A*%%***********************************************************************
000142041007     A                                      SPACEB(001)
000143041007     A                                      CPI(10)
000144041007     A                                      SPACEA(001)
000145041007     A                                    61
000146041007     A                                      'Totale x Gruppo'
000147041007     A            GRUPPO    R             78
000148041007     A                                      REFFLD(ECFGRP TNECF00F)
000149041007     A                                      HIGHLIGHT
000150041007     A            TOTGIM    R             82
000151041007     A                                      REFFLD(ECFIMP TNECF00F)
000152041007     A                                      EDTCDE(K)
000153041007     A                                      HIGHLIGHT
000154041007     A*%%***********************************************************************
000155041007     A*%%SS
000156041007     A*%%CL 001
000157041007     A*%%***********************************************************************
000158041007     A          R TOTFATTU
000159041007     A*%%***********************************************************************
000160041007     A*%%RI 00000
000161041007     A*%%***********************************************************************
000162041007     A                                      SPACEB(001)
000163041007     A                                      CPI(10)
000164041007     A                                      SPACEA(001)
000165041007     A                                    30
000166041007     A                                      'TOTALE Fattura nr.'
000167041007     A                                      HIGHLIGHT
000168041007     A            SAVNFP    R             49
000169041007     A                                      REFFLD(ECFNFP TNECF00F)
000170041007     A                                      HIGHLIGHT
000171041007     A            SAVDFP    R             +1
000172041007     A                                      REFFLD(ECFDFP TNECF00F)
000173041007     A                                      EDTWRD('    /  /  ')
000174041007     A            TOTFAT    R             82
000175041007     A                                      REFFLD(ECFIMP TNECF00F)
000176041007     A                                      EDTCDE(K)
000177041007     A                                      HIGHLIGHT
000178041007     A*%%***********************************************************************
000179041007     A*%%SS
000180041007     A*%%CL 001
000181041007     A*%%***********************************************************************
000182041007     A          R TOTALE
000183041007     A*%%***********************************************************************
000184041007     A*%%RI 00000
000185041007     A*%%***********************************************************************
000186041007     A                                      SPACEB(001)
000187041007     A                                      CPI(10)
000188041007     A                                      SPACEA(001)
000189041007     A                                    62
000190041007     A                                      'TOTALE  PERIODO'
000191041007     A                                      HIGHLIGHT
000192041007     A            TOTGEN    R             82
000193041007     A                                      REFFLD(ECFIMP TNECF00F)
000194041007     A                                      EDTCDE(K)
000195041007     A                                      HIGHLIGHT
000196041007     A*%%***********************************************************************
000197041007     A*%%SS
000198041007     A*%%CL 001
000199041007     A*%%***********************************************************************
000200041007     A          R NODATI
000201041007     A*%%***********************************************************************
000202041007     A*%%RI 00000
000203041007     A*%%FS 003
000204041007     A*%%***********************************************************************
000205041007     A                                      SPACEB(004)
000206041007     A                                      CPI(10)
000207041007     A                                      SPACEA(004)
000208041007     A                                    41
000209041007     A                                      '*-- NON  TROVATI  DATI  PER  LA  R-
000210041007     A                                      ICHIESTA  EFFETTUATA --*'
000211041007     A                                      HIGHLIGHT
000212041007     A*%%***********************************************************************
000213041007     A*%%SS
000214041007     A*%%CL 004
000215041007     A*%%CP+999CRTPRTF
000216041007     A*%%CP+    FILE(GAITRAFIL/FIEU83P)
000217041007     A*%%CP+    DEVTYPE(*SCS)
000218041007     A*%%CP     PAGESIZE(*N       132      *N     )
000219041007     A*%%CS+999CRTPRTF
000220041007     A*%%CS+    FILE(QTEMP/QPRDRPT)
000221041007     A*%%CS+    DEVTYPE(*SCS)
000222041007     A*%%CS     PAGESIZE(*N 132)
000223041007     A*%%***********************************************************************
000224041007     **
