000100130830     A          R FIEURCV05                 TEXT('RECEIVER')
000200090203      *
000300130830     A            RECEIVER       8          TEXT('M. CONSIGNMENT HEADER        -
000400130830     A                                      (ALWAYS = "RECEIVER")             ')
000500130830     A            NUMORDER       2S 0       TEXT('M. FIXE VALUE "4",DEFINE THE -
000600130830     A                                      HEARCHICAL ORDER OF THE SUBTYPE   ')
000700130830     A            RCUSTID       17          TEXT('O. GEOPOST CUSTOMER NUMBER OF-
000800130830     A                                       THE CONSIGNEE  (E.G. FILLED FOR   -
000900130830     A                                      DIRECT PARCEL SHOP DELIVERY)      ')
001000150702     A            RNAME1        35          TEXT('C. RECIPIENT NAME 1         ')
001100130830     A            RNAME2        35          TEXT('O. RECIPIENT NAME 2          -
001200130830     A                                      (IN THE SOME CASE, THIS            -
001300130830     A                                      INFORMATION IS NOT MANAGED BY BU) ')
001400130830     A            RCOMPNAME     35          TEXT('C. RECIPIENT COMPANY NAME    -
001500130830     A                                      FOR HISTORICAL REASON THIS FIELD   -
001600130830     A                                      CAN T BE SET EVERY TIME BUT IT HAS -
001700130830     A                                      TO BE SET EVERY TIME IT IS POSSIBLE-
001800130830     A                                      THIS FIELD HAS TO BE ADD ON ALL    -
001900130830     A                                      APPLICATION, FILES, DATABASE AND   -
002000130830     A                                      FLOW WHERE THEY ARE UPDATED.      ')
002100130830     A            RCOMPNAME2    35          TEXT('O. RECIPIENT COMPANY NAME 2  -
002200130830     A                                      FOR HISTORICAL REASON THIS FIELD   -
002300130830     A                                      CAN T BE SET EVERY TIME BUT IT HAS -
002400130830     A                                      TO BE SET EVERY TIME IT IS POSSIBLE-
002500130830     A                                      THIS FIELD HAS TO BE ADD ON ALL    -
002600130830     A                                      APPLICATION, FILES, DATABASE AND   -
002700130830     A                                      FLOW WHERE THEY ARE UPDATED.      ')
002800150702     A            RPUDOID       20          TEXT('C. ID NUMBER OF PUDO POINT   -
002900130830     A                                      (PARCEL SHOP, POST OFFICE, CUSTOMER-
003000130830     A                                       NETWORK POINT, ETC., .)EG.:1234P ')
003100130830     A            RSTREET       35          TEXT('M. RECIPIENT STREET         ')
003200130830     A            RPROPNUM       8          TEXT('O. HOUSE NUMBER OF THE       -
003300130830     A                                      CONSIGNEE.                         -
003400130830     A                                      FOR HISTORICAL REASON THIS FIELD   -
003500130830     A                                      CAN T BE SET EVERY TIME BUT IT HAS -
003600130830     A                                      TO BE SET EVERY TIME IT IS POSSIBLE-
003700130830     A                                      THIS FIELD HAS TO BE ADD ON ALL    -
003800130830     A                                      APPLICATION, FILES, DATABASE AND   -
003900130830     A                                      FLOW WHERE THEY ARE UPDATED.      ')
004000130830     A            RADD2         35          TEXT('O. RECEIVER ADDRESS LINE 2  ')
004100130830     A            RADD3         35          TEXT('O. RECEIVER ADDRESS LINE 3  ')
004200130830     A            RFLOOR        35          TEXT('O. FLOOR NUMBER OF THE       -
004300130830     A                                      CONSIGNEE.                        ')
004400130830     A            RBUILDING     35          TEXT('O. BUILDING NAME THE CONSIGN -
004500130830     A                                      CONSIGNEE.                        ')
004600130830     A            RDEPARTMEN    35          TEXT('O. DEPARTMENT NAME THE       -
004700130830     A                                      CONSIGNEE.                        ')
004800141008     A            RCOUNTRYCD     3          TEXT('M. RECIPIENT COUNTRY         -
004900130830     A                                      (ISO 3166 PLUS. ACCORDING TO BIC7  -
005000130830     A                                      SPECIFICATION), 3 NUMERICAL PLACES')
005100150702     A            RSTATE         2          TEXT('C. STATE WITHIN THE RECIPIENT-
005200130830     A                                       COUNTRY, E.G. CA FOR CALIFORNIA.  -
005300130830     A                                      CONDITIONAL, ACCORDING TO COUNTRY  -
005400130830     A                                      CODE.                             ')
005500130830     A            RZIPCODE       9          TEXT('M. RECIPIENT POST CODE.      -
005600130830     A                                      CONDITIONAL, ACCORDING TO COUNTRY  -
005700130830     A                                      CODE.                             ')
005800130830     A            RTOWN         35          TEXT('M. RECIPIENT CITY           ')
005900141008     A            RDOORCODE      8          TEXT('O. CODE FOR THE DOOR CODE   ')
006000130830     A            RCONTACT      35          TEXT('O. RECIPIENT CONTACT PERSON. -
006100130830     A                                      HE IS NOT THE CONSIGNEE NAME.     ')
006200150702     A            RCONTPHO1     30          TEXT('O. RECIPIENT TELEPHONE NUMBER-
006300130830     A                                       HAS TO BE ENCODED:                -
006400130830     A                                      +NNXXXXXXXX WHERE NN IS THE NUMERIC-
006500130830     A                                       COUNTRY CODE, OR 00NNXXXXXXXX     -
006600130830     A                                      WHERE NN IS THE NUMERIC COUNTRY CD.-
006700130830     A                                      THIS PHONE NUMBER HAS TO BECOME    -
006800130830     A                                      MANDATORY FOR INTERNATIONAL PARCEL')
006900150702     A            RCONTPHO2     30          TEXT('O. RECIPIENT TELEPHONE NUMBER-
007000130830     A                                       HAS TO BE ENCODED:                -
007100130830     A                                      +NNXXXXXXXX WHERE NN IS THE NUMERIC-
007200130830     A                                       COUNTRY CODE, OR 00NNXXXXXXXX     -
007300130830     A                                      WHERE NN IS THE NUMERIC COUNTRY CD.-
007400130830     A                                      THIS PHONE NUMBER HAS TO BECOME    -
007500130830     A                                      MANDATORY FOR INTERNATIONAL PARCEL')
007600130830     A            RINTERPHO     35S 0       TEXT('O. NAME ON THE INTERPHONE   ')
007700130830     A            RFAX          30          TEXT('O. RECIPIENT FAX NUMBER     ')
007800150702     A            REMAIL       100          TEXT('O. RECIPIENT EMAIL ADDRESS  ')
007900130830     A            RCOMMENT      70          TEXT('O. RECIPIENT COMMENTS       ')
008000150702     A            RGPSLAT       16A         TEXT('O. LATITUDINE GPS (.) SEPAR. -
008100150702     A                                      USE OF WGS84 STANDAR              ')
008200150702     A            RGPSLONG      16A         TEXT('O. LONGITUDINE GPS (.)SEPAR. -
008300150702     A                                      USE OF WGS84 STANDAR              ')
