000100940922     A*--------------------------------------------------------------*
000200161223     A*  DS per parametri da passare al pgm. FIEU39R
000300940922     A*--------------------------------------------------------------*
000301160824     A                                      REF(CNDIZION)
000400161223     A          R FIEU39R
000402161228     A            I39TLA         1A         TEXT('TIPO LANCIO PROGRAMMA')
000500161223     A            I39POE    R     S         REFFLD($FIL)
000501161223     A                                      TEXT('PUNTO OPERATIVO EMITTENTE')
000502161223     A                                      COLHDG('P.O.' 'EMI.')
000503161223     A                                      EDTCDE(Z)
000600161223     A            I39NSR    R     S         REFFLD($NRS)
000700161223     A            I39NOR    R     S         REFFLD($NRI)
000800161223     A            I39NRV    R     S         REFFLD($NVI)
000900161223     A            I39NPR        14A         TEXT('PARCEL DPD')
001100161223     A            O39ESITO       1          TEXT('0=OK E=ERR.GENERICO P=BOLLA-
001101161223     A                                       PARTITA N=BOLLA NON TROV. B=BOLL-
001102161223     A                                      A NON AGGIORNAB.')
001200161223     A            O39FILLER     20          TEXT('USI FUTURI')
