000100950929     A*------------------------------------------------------------------------*
000200151001     A          R FIEU009
000300041014      *
000400151001     A            F09DEPOT       4A         TEXT('DEPOT DPD')
000500151001     A                                      COLHDG('DEPOT DPD')
000600040823      *
000700151001     A            F09LNP         3S 0       TEXT('LINEA DI PARTENZA')
000800151001     A                                      COLHDG('LINEA DI PARTENZA')
000900040826      *
001000151001     A            F09NSP         7S 0       TEXT('NR.SPEDIZIONI')
001100151001     A                                      COLHDG('NR.SPEDIZIONI')
001200040826      *
001300151001     A            F09PERC        5S 1       TEXT('PERCENTUALE LNP')
001400151001     A                                      COLHDG('PERCENTUALE LNP')
001500040826      *
001600151001     A            F09FLG         1A         TEXT('REC UTILIZZATO')
001700151001     A                                      COLHDG('REC UTILIZZATO')
001800151007      *     SIGNIFICATI DEI FLAG
001900151007      *
002000151007      *      (*) = Il depot non è più presente sul cappario
002100151007      *      (N) = Non vi sono spedizioni provenienti dal Depot
002200151007      *
002300040826      *
002400151001     A          K F09DEPOT
002500151001     A          K F09LNP
