000010060207     A*%%TS  SD  20060207  135932  EDPRM       REL-V5R3M0  5722-WDS
000020060207     A*** FILE : FNLV85D *--------------------------------------------*
000030060207     A***      GESTIONE MOTIVO VARIAZIONE BOLLA                        *
000040940210     A***-------------------------------------------------------------**
000050060207     A*%%EC
000060060207     A                                      DSPSIZ(24 80 *DS3)
000070060207     A                                      CHGINPDFT(HI UL)
000080060207     A                                      PRINT
000090940331*****A****                                  WINDOW(8 39 15 36)
000100940218*****A****                                  WDWBORDER((*DSPATR RI) (*CHAR '  -
000110940218*****A****                                        '))
000120941215     A*
000130941215     A**-------------------------------------------------------------**
000140060207     A          R LV85D01
000150060207     A*%%TS  SD  20060207  135932  EDPRM       REL-V5R3M0  5722-WDS
000160060207     A                                      WINDOW(3 23 7 54)
000170060207     A                                      CF06
000180060207     A                                      CF12
000190060207     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
000200060207     A                                          '))
000210060207     A                                      WDWBORDER((*DSPATR RI))
000220060207     A                                  6 40'F12=Ritorno'
000230060207     A                                  1 15'Motivo variazione bolla'
000240060207     A                                      DSPATR(HI)
000250060207     A                                  3  2'Codice (?):'
000260060207     A  28        D01MSG        50   M
000270060207     A            D01NT1        50A  B  4  2
000280060207     A  02                                  DSPATR(PC)
000290060207     A                                      CHECK(LC)
000300060207     A            D01NT2        50A  B  5  2CHECK(LC)
000310060207     A            D01MTV         3A  B  3 14
000320060207     A  01                                  DSPATR(PC)
000330060207     A            D01DMT        20A  O  3 18
000340060207     A                                  6 26'F6=Conferma'
000350941215     A*
000360941215     A**-------------------------------------------------------------**
000370060207     A          R LV85D02
000380060207     A*%%TS  SD  20060207  100456  EDPRM       REL-V5R3M0  5722-WDS
000390060207     A                                      KEEP
000400060207     A                                      ASSUME
000410060207     A                                      OVERLAY
000420060207     A                                      PUTOVR
000430060207     A                                  2  1' '
000440060207     A                                      OVRATR
