000100890918     A*--------------------------------------------------------------*
000200090326     A*  DS RICHIESTA DATA SCADENZA TARIFFE AUT X CAMBIO P.I.
000500890918     A*--------------------------------------------------------------*
000600890918     A                                      REF(CNDIZION)
000700090326     A          R DS§D27                    TEXT('RICHIESTA DATA SCADENZA TARIF-
000800090326     A                                      FE AUT. X CAMBIO P.I.')
000801090331     A            D27CMT         1A         TEXT('COMMIT ON/OFF')
000802090331     A            D27TIP         1A         TEXT('TIPO ANAGARFICO A/D')
000803090326     A            D27PDR         7S 0       TEXT('TIPO ANAGARFICO A/D')
000804090326     A            D27SOC         3A         TEXT('SOCIETÀ NEW')
000805090326     A            D27KSC         8A         TEXT('CODICE FORNITORE NEW')
000809090326     A            D27ERR         1A         TEXT('1=ERRORE')
