000100890918     A*--------------------------------------------------------------*
000200941027     A*  DS PER CONTROLLO FILIALE GESTIONE
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500941027     A          R D50REC                    TEXT('DS X CONTROLLO FILIALE GESTIO-
000600941027     A                                      NE')
000700170424     A****
000800170424     A* INPUT
000900170424     A****
001000941027     A            D50TLA         1A         TEXT('TIPO LANCIO PROGRAMMA')
001100170428     C** PER ORA IL PROFILO UTENTE NON È USATO
001200170428     C*  SAREBBE DA CONSIDERARE AL POSTO DI KNMUS
001300170428     C*  SE SERVIRÀ FAREMO LA MODIFICA
001400941027     A            D50PRU        10A         TEXT('PROFILO UTENTE')
001500941027     A            D50FGS         3S 0       TEXT('FILIALE GESTIONE')
001600170424     A****
001700170424     A*   O U T P U T:
001800170424     A****
001900941027     A            D50ERR         1A         TEXT('CODICE DI ERRORE-CORRISPONDE -
002000941027     A                                      ALLA POSIZ. DEL MSG IN SKIERA')
002100170424     A            D50MSG        75A         TEXT('MESSAGGIO DI ERRORE')
002200170424     A* FILIALE GESTIONE VALIDA IN PARTENZA S/N
002300170424     A* FILIALE GESTIONE VALIDA IN ARRIVO   S/N
002400170424     A* SE RICHIESTI ENTRAMBI I TIPI CONTROLLO :
002500170424     A*   SE ENTRAMBE SONO "N" VERRÀ RESTITUITO ANCHE L'ERRORE
002600170424     A** SE UNA DELLE DUE È "S" L'ERRORE NON VERRÀ RESTITUITO
002700170424     A            D50VAL_P       1A         TEXT('S/N VALIDO IN PARTENZA')
002800170424     A            D50VAL_A       1A         TEXT('S/N VALIDO IN ARRIVO')
002900170424     A****
003000170424     A* INPUT : TIPO CONTROLLO
003100170424     A****
003200170424     A* " " O "P" - SOLO PARTENZA (£1 - TRUL06R)
003300170424     A* "A"       - SOLO ARRIVO (TRUL09R)
003400170424     A* "E"       - ENTRAMBI
003500170424     A            D50TCN         1A         TEXT('TIPO CONTROLLO')
003600941027     A*
