000010980603     A*%%TS  SD  19980603  084132  EDPSDI      REL-V3R7M0  5716-PW1
000020911011     A*  91/10/11  10:14:50    ANGELO      REL-R03M00  5728-PW1
000030980603     A*%%EC
000040980603     A                                      DSPSIZ(24 80 *DS3)
000050980603     A                                      PRINT
000060911011     A*  91/10/11  10:14:50    ANGELO      REL-R03M00  5728-PW1
000070980526     A          R LVL301V
000080980526     A*%%TS  SD  19980526  185039  EDPSDI      REL-V3R7M0  5716-PW1
000090980526     A                                      CA03
000100980526     A                                      BLINK
000110980526     A  50                                  MSGALARM
000120980526     A            SOCIEV        20A  O  1  3TEXT('Società.')
000130980526     A                                      DSPATR(HI)
000140980526     A                                  1 26' INSERIMENTO DATA RITIRO RESI '
000150980526     A                                      DSPATR(RI)
000160980526     A                                  1 73DATE
000170980526     A                                      EDTCDE(Y)
000180980526     A                                 15  3'Filiale . . . . . . . . .(R).'
000190980526     A                                      DSPATR(ND)
000200980526     A                                 16  3'Codice  . . . . . . . . .(R).'
000210980526     A                                      DSPATR(ND)
000220980526     A                                 22  2'F3=Fine'
000230980526     A  51        MSGV          40A  O 24  2TEXT('Messaggio.')
000240980526     A  51                                  DSPATR(RI)
000250980526     A                                 24 67'ME-TRA s.r.l.'
000260980526     A                                      DSPATR(HI)
000270980526     A                                  4  3'Numero reso. . . . . .'
000280980526     A            NRSV           6Y 0B  4 26TEXT('Codice società')
000290980526     A  61                                  DSPATR(RI)
000300980526     A                                      DSPATR(CS)
000310980526     A                                      DSPATR(UL)
000320980526     A  21                                  DSPATR(PC)
000330980526     A                                      CHECK(FE)
000340980526     A                                      EDTCDE(Z)
000350980526     A                                      CHECK(RB)
000360950406     A*         R URZ0501V
000370980526     A          R LVL302V
000380980526     A*%%TS  SD  19980526  185039  EDPSDI      REL-V3R7M0  5716-PW1
000390980526     A                                      CF06
000400980526     A                                      CA12
000410980526     A                                      BLINK
000420980526     A  50                                  MSGALARM
000430980526     A            SOCIEV        20A  O  1  3TEXT('Società.')
000440980526     A                                      DSPATR(HI)
000450980526     A                                  1 26' STAMPA SEGNACOLLI SPEDIZIONI '
000460980526     A                                      DSPATR(RI)
000470980526     A                                  1 73DATE
000480980526     A                                      EDTCDE(Y)
000490980526     A                                 22  2'F6=Conferma'
000500980526     A  51        MSGV          40A  O 24  2TEXT('Messaggi.')
000510980526     A  51                                  DSPATR(RI)
000520980526     A                                 10  3'Cliente. . . . . . . .'
000530980526     A            RGSV          35A  O 10 26TEXT('Ragione sociale.')
000540980526     A            INDV          35A  O 11 26TEXT('Indirizzo.')
000550980526     A            PRVV           2A  O 12 59TEXT('Provincia.')
000560980526     A            LOCV          25A  O 12 32TEXT('Località.')
000570980526     A                                 24 67'ME-TRA s.r.l.'
000580980526     A                                      DSPATR(HI)
000590980526     A                                 22 15'F12=Preced.'
000600980526     A                                  4  3'Codice società . . . .'
000610980526     A            NRSV           6Y 0O  4 26TEXT('Codice società')
000620980526     A                                      DSPATR(CS)
000630980526     A                                      DSPATR(UL)
000640980526     A                                      EDTCDE(Z)
000650980526     A            CAPV           5A  O 12 26TEXT('CAP.')
000660980526     A                                  7  3'Data ritiro. . . . . .'
000670980526     A            DTAV           8Y 0B  7 26TEXT('Data ritiro.')
000680980526     A  62                                  DSPATR(RI)
000690980526     A                                      DSPATR(CS)
000700980526     A                                      DSPATR(UL)
000710980526     A  22                                  DSPATR(PC)
000720980526     A                                      CHECK(FE)
000730980526     A                                      CHECK(RB)
000740980526     A                                      EDTWRD('  /  /    ')
