000010111014     A*%%TS  SD  20111014  101807  EDPRM       REL-V6R1M0  5761-WDS
000020911030     A*  91/10/30  13:47:00    EDPES       REL-R03M00  5728-PW1
000030110523     A*** FILE : FNLV79D *--------------------------------------------*
000040110523     A*          INTERROGAZIONE EMAIL DESTINATARIO                     *
000050000000     A***-------------------------------------------------------------**
000060111014     A*%%EC
000070111014     A                                      DSPSIZ(24 80 *DS3)
000080111014     A                                      PRINT
000090911030     A*  91/10/30  13:47:00    EDPES       REL-R03M00  5728-PW1
000100070412     A****                                  OVERLAY
000110111014     A          R LV79W01
000120111014     A*%%TS  SD  20111014  101807  EDPRM       REL-V6R1M0  5761-WDS
000130111014     A                                      WINDOW(16 6 6 70 *NOMSGLIN *NORSTCS-
000140111014     A                                      R)
000150111014     A                                      CF12
000160070412     A*******                               OVERLAY
000170111014     A  28        W01MSG        42   M
000180111014     A                                  6 54'INVIO=Prosegui'
000190111014     A                                  1  1'Email Destinatario:'
000200111014     A            W1CEMD        70A  O  2  1DSPATR(HI)
000210111014     A                                  4  1'Data/ora invio Email:'
000220111014     A            V1CDAT         8Y 0O  4 23EDTCDE(8)
000230111014     A                                      DSPATR(HI)
000240111014     A            W1CORA         6Y 0O  4 34DSPATR(HI)
000250111014     A                                      EDTWRD('0  :  :  ')
000260070327     A**-------------------------------------------------------------**
000270110601     A          R LV79D02
000280110601     A*%%TS  SD  20110601  104549  EDPRM       REL-V6R1M0  5761-WDS
000290110601     A                                      KEEP
000300110601     A                                      ASSUME
000310110601     A                                      OVERLAY
000320110601     A                                      PUTOVR
000330110601     A                                  2  1' '
000340110601     A                                      OVRATR
