000100910403     H DECEDIT('0,') DATEDIT(*DMY.)
000200971124     F* FNLV23RZ *---------------------------------------------------*
000300910520     F*               STAMPA SEGNACOLLO BORDERO'                     *
000400971124     F*               CON ZEBRA 8 DOT/MM                             *
000500910403     F*--------------------------------------------------------------*
000600941216     FFNLV22P   O    F  132        PRINTER
000700951021     D §RI             S              1    DIM(25)
000800910403     D                 DS
000900910515     D  §N5                    1      5  0
001000910515     D  §S5                    1      5
001100910515     D                                     DIM(5)
001200910515     D                 DS
001300910515     D  §N7                    1      7  0
001400910515     D  §S7                    1      7
001500910403     D                                     DIM(7)
001600910515     D DSBLB         E DS
001700910515     D                 DS
001800910515     D  DATA                   1      6  0
001900910515     D  GG                     1      2
002000910515     D  MM                     3      4
002100910515     D  AA                     5      6
002200910403     I/SPACE 3
002300910403     C*---------------------------------------------------------------*
002400910521     C     *ENTRY        PLIST
002500910521     C                   PARM                    DSBLB
002600910403     C*
002700941216     C* VERIFICA SE I CAMPI SONO IMPOSTATI
002800920221     C     §LBARR        COMP      *BLANKS                            1717
002900941216     C     §LBNSP        COMP      *ZEROS                             1616
003000941216     C     §LBSCA        COMP      *BLANKS                            1515
003100941216     C     §LBNBR        COMP      *ZEROS                             1414
003200941216     C     §LBINO        COMP      *BLANK                             1313
003300910515     C** INIZIALIZZA STAMPANTE
003400941216     C                   EXCEPT    LV23
003500910403     C*
003600910515     C** STAMPA INTESTAZIONE
003700910515     C*
003800941216     C                   EXCEPT    LV23D1
003900910515     C*
004000910515     C*  STAMPA N° F.V. e DATA
004100910515     C*
004200910515     C* TOGLI GLI ZERI NON SIGNIFICATIVI DAL NUM. F.V.
004300910403     C                   SETOFF                                       77
004400910515     C                   MOVE      *BLANK        §A5               5
004500910515     C                   Z-ADD     §LBNFV        §N5
004600910515     C                   DO        5             §1                1 0
004700910515     C     §S5(§1)       IFEQ      *ZERO
004800910515     C                   MOVE      *BLANK        §S5(§1)
004900910403     C                   ELSE
005000910403     C                   SETON                                        77
005100910403     C                   END
005200910403     C  N77              END
005300910515     C                   MOVEA     §S5           §A5
005400910515     C* METTO DATA FOGLIO VIAGGIO SU RIGA DI STAMPA
005500910515     C                   MOVE      §LBDAT        DATA
005600910515     C*
005700941216     C                   EXCEPT    LV23H
005800910515     C*
005900941216     C* STAMPO NUMERO BORDERO' (NON PIU' USATO)
006000930216     C* TOGLI GLI ZERI NON SIGNIFICATIVI DAL NUM. BORDERO'
006100930216     C                   SETOFF                                       77
006200930216     C                   MOVE      *BLANK        §A5
006300930216     C                   Z-ADD     §LBNBR        §N5
006400930216     C                   DO        5             §1
006500930216     C     §S5(§1)       IFEQ      *ZERO
006600930216     C                   MOVE      *BLANK        §S5(§1)
006700930216     C                   ELSE
006800930216     C                   SETON                                        77
006900930216     C                   END
007000930216     C  N77              END
007100930216     C                   MOVEA     §S5           §A5
007200930216     C*
007300941216     C   14              EXCEPT    LV23X2
007400930216     C*
007500910515     C* STAMPA NUMERO SPEDIZIONI
007600910403     C*
007700910515     C* TOGLI GLI ZERI NON SIGNIFICATIVI DAL NUM. SPEDIZIONI
007800910515     C                   SETOFF                                       77
007900910515     C                   MOVE      *BLANK        §A7               7
008000910515     C                   Z-ADD     §LBNSP        §N7
008100910515     C                   DO        7             §1
008200910515     C     §S7(§1)       IFEQ      *ZERO
008300910515     C                   MOVE      *BLANK        §S7(§1)
008400910515     C                   ELSE
008500910515     C                   SETON                                        77
008600910515     C                   END
008700910515     C  N77              END
008800910515     C                   MOVEA     §S7           §A7
008900910515     C*
009000941216     C   16              EXCEPT    LV23D2
009100910515     C*
009200910515     C* STAMPA DATI VETTORE
009300941216     C                   EXCEPT    LV23D3
009400910515     C*
009500910515     C* STAMPA DATI CONDUCENTE
009600941216     C                   EXCEPT    LV23D4
009700910515     C*
009800910515     C                   MOVEA     *BLANKS       §RI
009900910515     C* STAMPA LINEA PARTENZA + DECODIFICA
010000910403     C*
010100910516     C                   MOVEA     §LBLNP        §RI(1)
010200910516     C                   MOVEA     §LBDLP        §RI(5)
010300910515     C*
010400941216     C                   EXCEPT    LV23D5
010500910515     C*
010600910515     C                   MOVEA     *BLANKS       §RI
010700910515     C* STAMPA LINEA ARRIVO + DECODIFICA
010800910515     C*
010900910516     C                   MOVEA     §LBLNA        §RI(1)
011000910516     C                   MOVEA     §LBDLA        §RI(5)
011100910515     C*
011200941216     C                   EXCEPT    LV23D6
011300910515     C*
011400910515     C* STAMPA FILIALE DI SCARICO
011500910515     C*
011600941216     C   15              EXCEPT    LV23D7
011700910403     C*
011800941216     C* STAMPA FILIALE DI INOLTRO
011900941216     C   13              EXCEPT    LV23D8
012000941216     C*
012100941216     C* STAMPA SE PARTITO CON ARRIVI (NON PIU USATO)
012200941216     C   17              EXCEPT    LV23X8
012300910403     C*
012400910403     C* STAMPA CHIUSURA ETICHETTA
012500941216     C                   EXCEPT    LV23D9
012600910403     C*
012700910403     C                   SETON                                        LR
012800941216     OFNLV22P   E            LV23        1
012900011114     O                                              '^XA'
013000011114     O          E            LV23        1
013100011114     O                                              '^POI'
013200010801     O          E            LV23        1
013300010801     O                                              '^LH80,00'
013400971124     O          E            LV23        1
013500971124     O                                              '^PRC^MSY^FS'
013600010801      * GIRA ETICHETTA A 180° PER SPERIMENTARE PORTARE '^LH100,10'e attivare le
013700010801     O********* Foglio Viaggio
013800010801     O          E            LV23D1      1
013900010801     O                                              '^FO050,010'
014000010801     O                                              '^ACN,36,10'
014100010801     O                                              '^FD'
014200010801     O                                              'F.V.'
014300010801     O                                              '^FS'
014400010801     O********* N° F.V. + Data
014500010801     O          E            LV23H       1
014600010801     O                                              '^FO100,010'
014700010801     O                                              '^ACN,36,10'
014800010801     O                                              '^FD'
014900010801     O                                              'N.: '
015000010801     O                                              '^FS'
015100010801     O          E            LV23H       1
015200010801     O                                              '^FO200,000'
015300010801     O                                              '^A0N,060,036'
015400010801     O                                              '^FD'
015500010801     O                       §A5
015600010801     O                                              '^FS'
015700010801     O          E            LV23H       1
015800010801     O                                              '^FO320,010'
015900010801     O                                              '^ACN,36,10'
016000010801     O                                              '^FD'
016100010801     O                                              'Del: '
016200010801     O                                              '^FS'
016300010801     O          E            LV23H       1
016400010801     O                                              '^FO450,000'
016500010801     O                                              '^A0N,60,36'
016600010801     O                                              '^FD'
016700010801     O                       GG
016800010801     O                                              '/'
016900010801     O                       MM
017000010801     O                                              '/'
017100010801     O                       AA
017200010801     O                                              '^FS'
017300930216     O********* N° Borderò
017400941216     O          E            LV23X2      1
017500010801     O                                              '^FO050,070'
017600971125     O                                              '^AAN,27,10'
017700971124     O                                              '^FD'
017800971125     O                                              'Bordero'' n.:'
017900971125     O                                              '^FS'
018000971125     O          E            LV23X2      1
018100010801     O                                              '^FO250,050'
018200971125     O                                              '^ACN,54,20'
018300971125     O                                              '^FD'
018400971124     O                       §A5
018500971124     O                                              '^FS'
018600910515     O********* N° Spedizioni
018700941216     O          E            LV23D2      1
018800010801     O                                              '^FO050,120'
018900971125     O                                              '^AAN,27,10'
019000971124     O                                              '^FD'
019100971125     O                                              'Spedizioni n.:'
019200971125     O                                              '^FS'
019300971125     O          E            LV23D2      1
019400010801     O                                              '^FO250,100'
019500971125     O                                              '^ACN,54,20'
019600971125     O                                              '^FD'
019700971124     O                       §A7
019800971124     O                                              '^FS'
019900910515     O********* Vettore
020000941216     O          E            LV23D3      1
020100010801     O                                              '^FO050,180'
020200971125     O                                              '^AAN,27,10'
020300971124     O                                              '^FD'
020400971124     O                                              'Vettore: '
020500971125     O                                              '^FS'
020600971125     O          E            LV23D3      1
020700010801     O                                              '^FO250,160'
020800971125     O                                              '^ACN,54,20'
020900971125     O                                              '^FD'
021000971124     O                       §LBVET
021100971124     O                                              '^FS'
021200910515     O********* Conducente
021300941216     O          E            LV23D4      1
021400010801     O                                              '^FO050,240'
021500971125     O                                              '^AAN,27,10'
021600971124     O                                              '^FD'
021700971125     O                                              'Conducente:'
021800971125     O                                              '^FS'
021900971125     O          E            LV23D4      1
022000010801     O                                              '^FO250,220'
022100971125     O                                              '^ACN,54,20'
022200971125     O                                              '^FD'
022300971124     O                       §LBCON
022400971124     O                                              '^FS'
022500910515     O********* Linea Partenza + decodifica
022600941216     O          E            LV23D5      1
022700010801     O                                              '^FO000,310'
022800971125     O                                              '^AAN,27,10'
022900971124     O                                              '^FD'
023000971124     O                                              'Da: '
023100971124     O                                              '^FS'
023200941216     O          E            LV23D5      1
023300010801     O                                              '^FO040,290'
023400010801     O                                              '^A0N,060,060'
023500971124     O                                              '^FD'
023600971125     O                       §RI
023700971124     O                                              '^FS'
023800910515     O********* Linea Arrivo   + decodifica
023900941216     O          E            LV23D6      1
024000010801     O                                              '^FO000,370'
024100971125     O                                              '^AAN,27,10'
024200971124     O                                              '^FD'
024300971124     O                                              'A: '
024400971124     O                                              '^FS'
024500971124     O          E            LV23D6      1
024600010801     O                                              '^FO040,350'
024700010801     O                                              '^A0N,060,060'
024800971124     O                                              '^FD'
024900971125     O                       §RI
025000971124     O                                              '^FS'
025100910515     O********* Filiale di scarico
025200941216     O          E            LV23D7      1
025300010801     O                                              '^FO000,425'
025400971125     O                                              '^AAN,27,10'
025500971124     O                                              '^FD'
025600971124     O                                              'Scarico: '
025700971124     O                                              '^FS'
025800941216     O          E            LV23D7      1
025900010801     O                                              '^FO100,415'
026000010801     O                                              '^A0N,045,036'
026100971124     O                                              '^FD'
026200971124     O                       §LBSCA
026300971124     O                                              '^FS'
026400910515     O********* Filiale di inoltro
026500941216     O          E            LV23D8      1
026600010801     O                                              '^FO000,470'
026700971125     O                                              '^AAN,27,10'
026800971124     O                                              '^FD'
026900971125     O                                              'V I A  :'
027000971124     O                                              '^FS'
027100941216     O          E            LV23D8      1
027200010801     O                                              '^FO100,460'
027300010801     O                                              '^A0N,045,036'
027400971124     O                                              '^FD'
027500971124     O                       §LBINO
027600971124     O                                              '^FS'
027700920221     O********* FILIALE PARTITA CON GLI ARRIVI
027800941216     O          E            LV23X8      1
027900010801     O                                              '^FO520,400'
028000010801     O                                              '^GBN,080,080,060'
028100971125     O                                              '^FS'
028200971125     O          E            LV23X8      1
028300010801     O                                              '^FO540,410'
028400010801     O                                              '^AGN,060,040'
028500971125     O                                              '^FR'
028600971125     O                                              '^FD'
028700971125     O                       §LBARR
028800971125     O                                              '^FS'
028900941216     O          E            LV23D9      1
029000971124     O                                              '^XZ'
