000001110505     A*%%***********************************************************************
000002110505     A*%%TS  RD  20110505  100445  EDPMB       REL-V6R1M0  5761-WDS
000003110505     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004110505     A*%%FI       0000000000000000000000000000000000000000000000000
000005110505     A*%%***********************************************************************
000006110505     A          R LV46T01
000007110505     A*%%***********************************************************************
000008110505     A*%%RI 00000
000009110505     A*%%FS 007
000010110505     A*%%***********************************************************************
000011110505     A                                      SKIPB(008)
000012110505     A*%%***********************************************************************
000013110505     A*%%SS
000014110505     A*%%***********************************************************************
000015110505     A          R LV46T02
000016110505     A*%%***********************************************************************
000017110505     A*%%RI 00000
000018110505     A*%%***********************************************************************
000019110505     A                                      SPACEB(001)
000020110505     A                                      SPACEA(001)
000021110505     A                                    44
000022110505     A                                      'LISTE MIT DEN FILIALEN IN ITALIEN'
000023110505     A                                      HIGHLIGHT
000024110505     A                                      UNDERLINE
000025110505     A            I45GDS         8  0     97
000026110505     A                                      EDTCDE(Y)
000027110505     A*%%***********************************************************************
000028110505     A*%%SS
000029110505     A*%%CL 001
000030110505     A*%%***********************************************************************
000031110505     A          R LV46R01
000032110505     A*%%***********************************************************************
000033110505     A*%%RI 00000
000034110505     A*%%***********************************************************************
000035110505     A                                      SPACEB(001)
000036110505     A            PDESREG      120A  O     1
000037110505     A                                      HIGHLIGHT
000038110505     A                                      UNDERLINE
000039110505     A*%%***********************************************************************
000040110505     A*%%SS
000041110505     A*%%***********************************************************************
000042110505     A          R LV46D01
000043110505     A*%%***********************************************************************
000044110505     A*%%RI 00000
000045110505     A*%%***********************************************************************
000046110505     A                                      SPACEB(001)
000047110505     A            ORGDES        20A  O     3
000048110505     A                                    29
000049110505     A                                      ':'
000050110505     A            ORGIND        20A  O    31
000051110505     A            ORGCPF         5  0O    52
000052110505     A            ORGLOC        20A  O    58
000053110505     A            ORGPRO         2A  O    79
000054110505     A                                    83
000055110505     A                                      'TEL.'
000056110505     A            ORGTEL        13A  O    88
000057110505     A                                   102
000058110505     A                                      'FAX.'
000059110505     A            ORGFAX        13A  O   107
000060110505     A*%%***********************************************************************
000061110505     A*%%SS
000062110505     A*%%***********************************************************************
000063110505     A          R LV46F01
000064110505     A*%%***********************************************************************
000065110505     A*%%RI 00000
000066110505     A*%%FS 003
000067110505     A*%%***********************************************************************
000068110505     A                                      SPACEB(004)
000069110505     A                                     1
000070110505     A                                      'Wenn Sie Informationen über die vo-
000071110505     A                                      m Auslandsservice bedienten Länder -
000072110505     A                                      wünschen, konsultieren Sie die Webs-
000073110505     A                                      ite'
000074110505     A                                     1
000075110505     A                                      'www.bartolini.it oder wenden Sie s-
000076110505     A                                      ich direkt an unseren Kundenservice-
000077110505     A                                      .'
000078110505     A                                      SPACEB(001)
000079110505     A*%%***********************************************************************
000080110505     A*%%SS
000081110505     A*%%CL 001
000082110505     A*%%CP+999CRTPRTF
000083110505     A*%%CP+    FILE(GAITRAFIL/FNLV46P4)
000084110505     A*%%CP+    DEVTYPE(*SCS)
000085110505     A*%%CP+    PAGESIZE(*N 124)
000086110505     A*%%CP+    CPI(16.7)
000087110505     A*%%CP     OVRFLW(63)
000088110505     A*%%***********************************************************************
