000100120329             PGM        PARM(&KPJBA)
000200911021             DCL        VAR(&KPJBA)    TYPE(*CHAR)  LEN(502)
000300120618
000400120330             CRTDUPOBJ  OBJ(WFIPLG0F) FROMLIB(*LIBL) OBJTYPE(*FILE) +
000500120329                          TOLIB(QTEMP)
000600120329             MONMSG     MSGID(CPF0000)
000700120618
000800120329             CALL       PGM(FNLvp11R) PARM(&KPJBA)
000900930402
001000080327             ENDPGM
