000100080327             PGM        PARM(&KPJBA &NRRPLG &ESITOL)
000200911021             DCL        VAR(&KPJBA)    TYPE(*CHAR)  LEN(502)
000201080327             DCL        VAR(&NRRPLG) TYPE(*DEC) LEN(9 0)
000300080327             DCL        VAR(&esitol) TYPE(*CHAR) LEN(1)
006700080327             OVRDBF     FILE(FNLVp3d) SHARE(*YES)
006800080327             CALL       PGM(FNLvp3R) PARM(&KPJBA &nrrplg &esitol)
007000941124             DLTOVR     FILE(*ALL)
007300930402
007400080327             ENDPGM
