000100040930     A*%%TS  SD  20040930  122409  EDPAB       REL-V4R4M0  5769-PW1
000200040930     A*%%EC
000300040930     A                                      DSPSIZ(24 80 *DS3)
000400040930     A                                      REF(*LIBL/DS2F)
000500040930     A                                      CHGINPDFT(HI CS)
000600040930     A                                      PRINT
000700040930     A                                      ERRSFL
000800040930     A                                      CA03
000900040930     A                                      ALTHELP
001000040930     A                                      HLPTITLE(' ')
001100040930     A                                      HLPPNLGRP(LABEL TRTB87D2H)
001200040930     A                                      HELP
001300940314    >A*---------------------------------------------------------------
001400040930     A          R S1                        SFL
001500040930     A*%%TS  SD  20040930  121159  EDPAB       REL-V4R4M0  5769-PW1
001600040930     A                                      TEXT('SUBFILE')
001700040930     A  32                                  SFLNXTCHG
001800040930     A            S1ANN          1A  O  6  2
001900040930     A            S1OPZ          2Y 0B  6  6TEXT('Campo Opzione')
002000040930     A  41                                  DSPATR(RI PC)
002100040930     A                                      EDTCDE(Z)
002200040930     A                                      CHECK(ER)
002300040930     A                                      CHECK(RB)
002400040930     A                                      VALUES(1 2 3 4 5 0)
002500040930     A            S1COD          1A  O  6 11DSPATR(HI)
002600040930     A            S1DES     R        O  6 14REFFLD(§2FDES)
002700940606     A*-------------------------------------*
002800040930     A          R C1                        SFLCTL(S1)
002900040930     A*%%TS  SD  20040930  122409  EDPAB       REL-V4R4M0  5769-PW1
003000040930     A                                      CF10
003100040930     A                                      OVERLAY
003200040930     A                                      SFLCSRRRN(&C1NRR)
003300040930     A  30                                  SFLDSP
003400040930     A  31                                  SFLDSPCTL
003500040930     A N31                                  SFLCLR
003600040930     A  33                                  SFLEND
003700040930     A                                      SFLSIZ(0012)
003800040930     A                                      SFLPAG(0011)
003900040930     A  41                                  SFLMSG('Opzione non abilitata alla -
004000040930     A                                      riga' 41)
004100040930     A                                      WINDOW(Z1)
004200040930     A            C1RCD          4S 0H      SFLRCDNBR(CURSOR)
004300040930     A            C1NRR          5S 0H
004400040930     A                                  1  3'Tipi Comunicazione Giacenze'
004500040930     A                                  2 15'(Tab.:2F)'
004600040930     A N11                              3  2'2=Modifica'
004700040930     A N11                              3 14'3=Copia'
004800040930     A N11                              3 22'4=Annulla'
004900040930     A                                  3 33'5=Visualizza'
005000040930     A  11                              4  2'1=Selezione'
005100040930     A                                  5  1'Ann Opz  Cod Descrizione          -
005200040930     A                                          '
005300040930     A                                      DSPATR(HI)
005400940606    >A          R D1
005500940202     A                                      OVERLAY
005600940606     A                                      WINDOW(Z1)
005700940603     A                                  9  5'Non trovati dati'
005800940603     A                                      DSPATR(HI)
005900030113     A          R Z1
006000030113     A*%%TS  SD  20030113  152725  EDPAB       REL-V4R4M0  5769-PW1
006100030113     A                                      TEXT('Piede del sfl')
006200030113     A                                      WINDOW(3 5 19 45)
006300030113     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
006400030113     A                                          '))
006500030113     A                                      USRRSTDSP
006600030113     A                                 18  4'F3=Fine'
006700030113     A                                 18 16'F10=Immissione'
006800940606     A*--------------------------------------------------------*
006900940608     A          R ASSUME
007000940608     A                                      TEXT('Serve x preservare il video p-
007100940608     A                                      recedente')
007200940608     A                                      ASSUME
007300940608     A                                  1  2' '
