000010110914     A*%%TS  SD  20110914  104630  EDPMB       REL-V6R1M0  5761-WDS
000020110914     A*%%EC
000030110914     A                                      DSPSIZ(24 80 *DS3)
000040110914     A                                      CHGINPDFT(HI UL)
000050110914     A                                      PRINT
000060110914     A                                      CA12
000070041221     A****************************************************************
000080041221     A*
000090041221     A*
000100041221     A*
000110110914     A          R TB84D01
000120110914     A*%%TS  SD  20110914  104630  EDPMB       REL-V6R1M0  5761-WDS
000130110914     A            RSUT          20A  O  1  2
000140110914     A                                  1 28'** Invio VAB al cliente **'
000150110914     A                                      DSPATR(RI)
000160110914     A                                  1 61'TRTB841R'
000170110914     A                                  1 72DATE
000180110914     A                                      EDTCDE(Y)
000190110914     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000200110914     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000210110914     A                                  2 72TIME
000220110914     A                                  8  3'Cliente..............:'
000230110914     A            V1CKSC         7Y 0O  8 26DSPATR(HI)
000240110914     A                                      EDTCDE(Z)
000250110914     A            V1DKSC        40   O  8 34COLOR(BLU)
000260110914     A                                 24 69'F12=Ritorno'
000270110914     A                                      COLOR(BLU)
000280110914     A                                 10  3'Unificante invio dati:'
000290110914     A                                 13  3'Incluso VAB per Triangolazione ORM-
000300110914     A                                      :'
000310110914     A            V1CKSU         7Y 0O 10 26EDTCDE(Z)
000320110914     A                                      DSPATR(HI)
000330110914     A            V1DKSU        40   O 10 34COLOR(BLU)
000340110914     A            V1CVTO         2A  O 13 39DSPATR(HI)
