000100120305      */*PRM RSTDSP(*YES) DFRWRT(*YES) DECFMT(*JOB)
000200120305      */*END
000300060510     A*%%TS  SD  20060510  133119  EDPMB       REL-V5R3M0  5722-WDS
000400060427     A***-------------------------------------------------------------**
000500060427     A*           GESTIONE TABELLA CONSEGNE ANOMALE                   **
000600940826     A***-------------------------------------------------------------**
000700060510     A*%%EC
000800060510     A                                      DSPSIZ(24 80 *DS3)
000900060510     A                                      CHGINPDFT(HI UL)
001000060510     A                                      PRINT
001100060419     A**-------------------------------------------------------------**
001200060427     A          R TB22T1
001300060427     A*%%TS  SD  20060427  103519  EDPMB       REL-V5R3M0  5722-WDS
001400060427     A            RSUT          20A  O  1  2
001500060427     A            VTCTIT        28A  O  1 27DSPATR(RI)
001600060427     A                                      DSPATR(UL)
001700060427     A            VTCPGM        10A  O  1 59
001800060427     A                                  1 71DATE
001900060427     A                                      EDTCDE(Y)
002000060427     A            KNSIF         10A  O  2  2
002100060427     A            KNMUS         10A  O  2 13
002200060427     A            VTCMOD        11A  O  2 35
002300060427     A                                  2 71TIME
002400940826     A**-------------------------------------------------------------**
002500060427     A          R TB22D1
002600060427     A*%%TS  SD  20060427  103519  EDPMB       REL-V5R3M0  5722-WDS
002700060427     A                                      CA03
002800060427     A                                      OVERLAY
002900060427     A  28        V1CMSG        78   M
003000060427     A                                  9 25'Consegna Anomala .....:'
003100060427     A            V1CCOD         2A  B  9 50
003200060427     A  40                                  DSPATR(PC)
003300060427     A                                 24  2'F3=Fine Lavoro'
003400940826     A**-------------------------------------------------------------**
003500060510     A          R TB22D2
003600060510     A*%%TS  SD  20060510  133119  EDPMB       REL-V5R3M0  5722-WDS
003700060510     A N03                                  CF16
003800060510     A  03                                  CF05
003900060510     A                                      CF12
004000060510     A                                      CF06
004100060510     A                                      CA03
004200060510     A                                      CF09
004300060510     A                                      OVERLAY
004400060510     A  28        V1CMSG        78   M
004500060510     A                                  4  2'Consegna Anomala ..........:'
004600060510     A            V1CCOD         2A  O  4 31
004700120305     A                                  5  2'Descrizione bolle BRT .....:'
004800060510     A            V1CDEI    R        B  5 31REFFLD(DS§7O/§7ODEI *LIBL/DS7O)
004900060510     A  41                                  DSPATR(PC)
005000160502     A                                  6  2'Descrizione Breve .........:'
005100160502     A            V1CDEB    R        B  6 31REFFLD(DS§7O/§7ODEB *LIBL/DS7O)
005200060510     A                                  7  2'Visualizza consegna anomala in bol-
005300060510     A                                      le'
005400060510     A                                      DSPATR(UL)
005500060510     A                                  8  2'Partenza:'
005600060510     A            V1CVCP    R        B  8 13REFFLD(DS§7O/§7OVCP *LIBL/DS7O)
005700060510     A                                      VALUES(' ' 'S' 'N')
005800060510     A                                  8 16'(S=visualizza sempre anche se cons-
005900060510     A                                      egnata'
006000060510     A                                  9  2'Arrivi .:'
006100060510     A            V1CVCA    R        B  9 13REFFLD(DS§7O/§7OVCA *LIBL/DS7O)
006200060510     A                                      VALUES(' ' 'S' 'N')
006300060510     A                                  9 17'N=visualizza solo quando non conse-
006400060510     A                                      gnata)'
006500060510     A                                 10  2'D = Dirottamento ..........:'
006600060510     A            V1CFDI    R        B 10 31REFFLD(DS§7O/§7OFDI *LIBL/DS7O)
006700060510     A                                      VALUES(' ' 'D')
006800060510     A                                 11  2'Stampa per estero .........:'
006900060510     A            V1CFST    R        B 11 31REFFLD(DS§7O/§7OFST *LIBL/DS7O)
007000060510     A                                      VALUES(' ' 'N')
007100060510     A                                 11 34'(N=No)'
007200060510     A                                 12  2'S = Reso ..................:'
007300060510     A            V1CRES    R        B 12 31REFFLD(DS§7O/§7ORES *LIBL/DS7O)
007400060510     A                                      VALUES(' ' 'S')
007500060510     A                                 13  2'Tipo consegna anomala IDD .:'
007600060510     A            V1CIDD    R        B 13 31REFFLD(DS§7O/§7OIDD *LIBL/DS7O)
007700060510     A                                      VALUES(' ' 'A' 'P')
007800060510     A                                 13 34'(" "=No IDD A=IDD Arrivo P=IDD Par-
007900060510     A                                      tenza)'
008000120305     A                                 14  2'T&T per bolle BRT .........:'
008100060510     A            V1CINC    R        B 14 31REFFLD(DS§7O/§7OINC *LIBL/DS7O)
008200060510     A                                      VALUES(' ' 'S' 'T')
008300060510     A                                 14 34'(" "=No T&T S=Ritiro T=Contatta P.-
008400060510     A                                      O.)'
008500060510     A                                 15  2'T&T per bolle Poste .......:'
008600060510     A            V1CINCP   R        B 15 31REFFLD(DS§7O/§7OINCP *LIBL/DS7O)
008700060510     A                                      VALUES(' ' 'C' 'D')
008800060510     A                                 15 34'(" "=No T&T C=Consegnata D=Data a -
008900060510     A                                      Poste)'
009000060510     A                                 16  2'S = Scrive evento .........:'
009100060510     A            V1CICV    R        B 16 31REFFLD(DS§7O/§7OICV *LIBL/DS7O)
009200060510     A                                      VALUES(' ' 'S')
009300060510     A                                 17  2'Codice evento T&T ........?:'
009400060510     A            V1CCEV    R        B 17 31REFFLD(DS§7O/§7OCEV *LIBL/DS7O)
009500060510     A  42                                  DSPATR(PC)
009600060510     A            DESCEV        30A  O 17 36
009700060510     A                                 18  2'Utilizzo in chiusura dist. :'
009800060510     A            V1CFPT    R        B 18 31REFFLD(DS§7O/§7OFPT *LIBL/DS7O)
009900060510     A                                      VALUES(' ' 'B' 'N' 'P')
010000120305     A                                 18 34'(B=Bolle BRT P=Bolle Poste " "=Ent-
010100120305     A                                      rambi'
010200060510     A                                 19 35'N=No)'
010300060510     A                                 20  2'Riconsegna merce a SDA ....:'
010400060510     A            V1CRMS    R        B 20 31REFFLD(DS§7O/§7ORMS *LIBL/DS7O)
010500060510     A                                      VALUES('N' 'S')
010600060510     A                                 20 34'(S=Sì N=No)'
010700060510     A                                 21  2'Crea anomalia 139 .........:'
010800060510     A            V1C139    R        B 21 31REFFLD(DS§7O/§7O139 *LIBL/DS7O)
010900060510     A                                      VALUES(' ' 'N')
011000060510     A                                 21 34'(N=No)'
011100060510     A                                 22  2'POD Image visualizzabile ..:'
011200060510     A            V1CPODIMG R        B 22 31REFFLD(DS§7O/§7OPODIMG *LIBL/DS7O)
011300060510     A                                      VALUES('N' 'S')
011400060510     A                                 22 34'(S=Sì N=No)'
011500060510     A                                 22 51'Tipo legame:'
011600060510     A            V1CTLE    R        B 22 64REFFLD(DS§7O/§7OTLE *LIBL/DS7O)
011700120305      *
011800060510     A                                 24  2'F3=Fine Lavoro'
011900060510     A                                 24 19'F6=Conferma'
012000060510     A                                 24 33'F9=Traduzione'
012100060510     A N03                             24 49'F16=Annullamento'
012200060510     A  03                             24 49'F5-Ripristino'
012300060510     A                                 24 68'F12=Ritorno'
012400060418     A**-------------------------------------------------------------**
012500060418     A          R TB22W1
012600060418     A                                      CF06
012700060418     A                                      CF12
012800060418     A                                      OVERLAY
012900060418     A                                      WINDOW(5 8 10 62)
013000060418     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
013100060418     A                                          '))
013200060418     A                                      USRRSTDSP
013300060418     A                                  1 18'Gestione dati trasmissione'
013400060418     A                                      DSPATR(HI)
013500060418     A                                      DSPATR(UL)
013600060418     A                                  3  1'Tipo trasmissione:'
013700060418     A            W1FTT     R        B  3 20REFFLD(TBLFTT TABEL00F)
013800060418     A                                      VALUES(' ' '1')
013900060418     A                                  3 24'(" "=No "1"=Si)'
014000060418     A                                  4  1'P.O. trasmissione:'
014100060418     A            W1FLT     R        O  4 20REFFLD(TBLFLT TABEL00F)
014200060418     A                                      EDTWRD('0   ')
014300060418     A                                  5  1'Flag trasmissione:'
014400060418     A            W1FTR     R        O  5 20REFFLD(TBLFTR TABEL00F)
014500060418     A                                  5 24'(" "=Da trasm. "R"=Ricev. "T"=Tras-
014600060418     A                                      m.)'
014700060418     A                                  6  1'Data trasmissione:'
014800060418     A            W1DTR     R        O  6 20REFFLD(TBLDTR TABEL00F)
014900060418     A                                      EDTCDE(Y)
015000060418     A                                  8 15'F6=Conferma'
015100060418     A                                  8 48'F12=Ritorno'
015200060420     A**-------------------------------------------------------------**
015300060427     A          R TB22S1                    SFL
015400060427     A*%%TS  SD  20060427  142813  EDPMB       REL-V5R3M0  5722-WDS
015500060427     A            S1HCDLIN       1S 0H
015600060427     A            S1DLIN        20A  O  7  3
015700060427     A            S1CDEI    R        B  7 26REFFLD(DS§7O/§7ODEI *LIBL/DS7O)
015800060427     A  43                                  DSPATR(PC)
015900060427     A  05                                  DSPATR(PR)
016000160502     A            S1CDEB    R        B  7 49REFFLD(DS§7O/§7ODEB *LIBL/DS7O)
016100060427     A  05                                  DSPATR(PR)
016200060420     A**-------------------------------------------------------------**
016300060510     A          R TB22C1                    SFLCTL(TB22S1)
016400060510     A*%%TS  SD  20060510  133119  EDPMB       REL-V5R3M0  5722-WDS
016500060510     A                                      SFLSIZ(9999)
016600060510     A                                      SFLPAG(0016)
016700060510     A N05                                  CF06
016800060510     A  05                                  CF12
016900060510     A                                      CA03
017000060510     A                                      OVERLAY
017100060510     A  20                                  SFLDSP
017200060510     A  21                                  SFLDSPCTL
017300060510     A N21                                  SFLCLR
017400060510     A  30                                  SFLEND(*MORE)
017500060510     A            REC            4S 0H      SFLRCDNBR
017600060510     A  28        V1CMSG        78   M
017700060510     A                                  4  4'Codice:'
017800060510     A                                      DSPATR(HI)
017900060510     A            V1CCOD         2A  O  4 12DSPATR(HI)
018000060510     A            V1CDEI        20A  O  4 15DSPATR(HI)
018100060510     A                                  6  3'Lingua'
018200060510     A                                      DSPATR(UL)
018300120305     A                                  6 26'Descrizione BRT'
018400060510     A                                      DSPATR(UL)
018500160502     A                                  6 49'Descrizione Breve'
018600060510     A                                      DSPATR(UL)
018700160502     A            V1CDEB         8A  O  4 37DSPATR(HI)
018800060418     A***-----------------------------------------------------------***
018900060509     A          R TB22Z1
019000060509     A*%%TS  SD  20060509  105423  EDPMB       REL-V5R3M0  5722-WDS
019100060509     A                                      OVERLAY
019200060509     A N05                             24 35'F6=Conferma'
019300060509     A  05                             24 68'F12=Ritorno'
