000100110803      //--------------------------------------------------------------
000200110810      //?TRTB841R - Interrogazione tabella 3Q
000300110803      //--------------------------------------------------------------
000400110803     h Decedit('0,') Datedit(*ymd.) Option(*nodebugio)
000500110803
000600110803      //---------------------------------------------------------------
000700110803      //?Dichiarazione file.
000800110803      //---------------------------------------------------------------
000900110803
001000110803      // - Tabelle
001100110810     fTABEL00F  if   e           k disk
001200110803
001300110803      // - Video
001400110810     fTRTB841D  cf   e             workstn
001500110803
001600110803      //---------------------------------------------------------------
001700110803      //?Definizione costanti.
001800110803      //---------------------------------------------------------------
001900110803
002000110803      //---------------------------------------------------------------
002100110803      //?Definizione schiere.
002200110803      //---------------------------------------------------------------
002300110803
002400110803      //---------------------------------------------------------------
002500110803      //?Definizione aree dati.
002600110803      //---------------------------------------------------------------
002700110803
002800110803      // - Dati utente
002900110803     d §AzUte        e ds                  extname(AZUTE00F)
003000110803     d                                     dtaara
003100110803     d §DatiUte      e ds                  extname(dDatiUte)
003200110803     d                                     dtaara
003300110803
003400110803      //---------------------------------------------------------------
003500110803      //?Definizione strutture dati.
003600110803      //---------------------------------------------------------------
003700110803
003800110803      // - Parametri ricevuti
003900110803     d KPJBA         e ds
004000110803     d TNTA61DS      e ds
004100110803
004200110803      // - Reperimento dati utente
004300110803     d TIBS34DS      e ds
004400110803
004500110810      // - Tabella 3Q
004600110810     d ds3Q          e ds                  inz
004700110803
004800110803      //---------------------------------------------------------------
004900110803      //?Definizione variabili globali.
005000110803      //---------------------------------------------------------------
005100110803
005200110803      // - Flags booleani
005300110803     d $Fine           s               n   inz(*off)
005400110803     d $InzD01         s               n   inz(*on)
005500110803
005600110803      //---------------------------------------------------------------
005700110803      //?Definizione procedure esterne.
005800110803      //---------------------------------------------------------------
005900110803
006000110803      //---------------------------------------------------------------
006100110803      //?Prototipi.
006200110803      //---------------------------------------------------------------
006300110803
006400110803      /copy gaitrasrc/srcprotopr,tibs34r
006500110810      /copy gaitrasrc/srcprotopi,tibs69r
006600110810      /copy gaitrasrc/srcprotopr,tibs69r
006700110803
006800110803      //---------------------------------------------------------------
006900110803      //?Definizione key-list.
007000110803      //---------------------------------------------------------------
007100110803
007200110803      //---------------------------------------------------------------
007300110803      //?Riepilogo indicatori.
007400110803      //---------------------------------------------------------------
007500110803
007600110803      //---------------------------------------------------------------
007700110803
007800110803      //---------------------------------------------------------------
007900110803      //?M A I N - L I N E
008000110803      //---------------------------------------------------------------
008100110803
008200110803     c     *Entry        plist
008300110803     c                   parm                    KPJBA
008400110803     c                   parm                    TNTA61DS
008500110803
008600110803      /free
008700110803
008800110803       //?Operazioni iniziali
008900110803       exsr RoutInz;
009000110803
009100110803       //?Gestione video
009200110803       DOW $Fine = *off;
009300110803         exsr GesD01;
009400110803       ENDDO;
009500110803
009600110803       //?Operazioni finali
009700110803       exsr RoutEnd;
009800110803
009900110803       //--------------------------------------------------------------
010000110803       //?Operazioni iniziali.
010100110803       //--------------------------------------------------------------
010200110803       BEGSR RoutInz;
010300110803
010400110803         //?Reperimento dati job
010500110803         exsr DatiJob;
010600110805
010700110805         IF  TA61ksc <= *zeros;
010800110805           TA61err = *on;
010900110805           TA61msg = 'Richiesto il codice cliente';
011000110805           $Fine = *on;
011100110805         ENDIF;
011200110803
011300110803       ENDSR;
011400110803
011500110803       //--------------------------------------------------------------
011600110803       //?Reperimento Dati del job (Utente/Operativi).
011700110803       //--------------------------------------------------------------
011800110803       BEGSR DatiJob;
011900110803
012000110803         in(E) §AzUte;
012100110803         if NOT %error;
012200110803           in(E) §DatiUte;
012300110803         endif;
012400110803         if %error or RSut = *blanks;
012500110803           clear TIBS34ds;
012600110803           tibs34r(tibs34ds);
012700110803           in §AzUte;
012800110803           in §DatiUte;
012900110803         endif;
013000110803
013100110803       ENDSR;
013200110803
013300110803       //--------------------------------------------------------------
013400110803       //?Gestione videata.
013500110803       //--------------------------------------------------------------
013600110803       BEGSR GesD01;
013700110803
013800110803         //?Iniziallizazione videata
013900110803         IF $InzD01 = *on;
014000110803           exsr InzD01;
014100110803           $InzD01 = *off;
014200110803         ENDIF;
014300110803
014400110803       //?Emissione videata
014500110810         exfmt TB84D01;
014600110803
014700110803       //?F12 = Ritorno
014800110803         IF  *inkl;
014900110803           $fine = *on ;
015000110803           leavesr ;
015100110803         ENDIF;
015200110803
015300110803       ENDSR;
015400110803
015500110803       //--------------------------------------------------------------
015600110803       //?Caricamento videata D01.
015700110803       //--------------------------------------------------------------
015800110803       BEGSR InzD01;
015900110803
016000110810         clear V1Dksc;
016100110810         clear V1Dksu;
016200110812         clear V1Cvto;
016300110810
016400110810       //?Decodifico il cliente
016500110810         clear  tibs69ds;
016600110810         I69kac = TA61ksc;
016700110810         TIBS69R (tibs69ds:ds_cnaco:ds_cnind:ds_cnclp:ds_fncls);
016800110810         V1Cksc = TA61ksc;
016900110811         IF  O69err = *blanks;
017000110811           V1Dksc = ACORag;
017100110811         ELSE;
017200110811           V1Dksc = '? ? ? ? ? ?';
017300110811         ENDIF;
017400110810
017500110810       //?Aggancio la tabella
017600110810         clear ds3Q;
017700110810         TBLkut = 1;
017800110810         TBLcod = '3Q';
017900110810         TBLkey = %editc(V1Cksc:'X');
018000110810
018100110810         chain (TBLkut : TBLcod : TBLkey) TABEL00F;
018200110810         IF  %Found(TABEL00F) and TBLflg = *blanks;
018300110811
018400110811           ds3Q = TBLuni;
018500110810
018600110810         //?Se presente decodifico l'unificante
018700110810           IF  §3Qcks <> 0;
018800110810             clear  tibs69ds;
018900110810             I69kac = §3Qcks;
019000110810             TIBS69R (tibs69ds:ds_cnaco:ds_cnind:ds_cnclp:ds_fncls);
019100110810             V1Cksu = §3Qcks;
019200110811             IF  O69err = *blanks;
019300110811               V1Dksu = ACORag;
019400110811             ELSE;
019500110811               V1Dksu = '? ? ? ? ? ?';
019600110811             ENDIF;
019700110810           ELSE;
019800110810             clear V1Cksu;
019900110810           ENDIF;
020000110810
020100110810         //?Flag triangolazione ORM
020200110812           IF  §3Qvto = 'S';
020300110812             V1Cvto = 'SI';
020400110914           ELSE;
020500110914             V1Cvto = 'NO';
020600110812           ENDIF;
020700110810
020800110810         ENDIF;
020900110803
021000110803       ENDSR;
021100110803
021200110803       //--------------------------------------------------------------
021300110803       //?Operazioni finali.
021400110803       //--------------------------------------------------------------
021500110803       BEGSR RoutEnd;
021600110803
021700110803         *inLR = *on;
021800110803         return;
021900110803
022000110803       ENDSR;
