000100110803      //--------------------------------------------------------------
000200110810      //?TRTB841R - Interrogazione tabella 3Q
000300110803      //--------------------------------------------------------------
000400110803     h Decedit('0,') Datedit(*ymd.) Option(*nodebugio)
000500110803
000600110803      //---------------------------------------------------------------
000700110803      //?Dichiarazione file.
000800110803      //---------------------------------------------------------------
000900110803
001000110803      // - Tabelle
001100110810     fTABEL00F  if   e           k disk
001200120112      // - Regole cliente x scambio dati
001300120112     fTIVIR06L  if   e           k disk    usropn
001400120112     f                                     extfile(wLibVir)
001500110803
001600110803      // - Video
001700110810     fTRTB841D  cf   e             workstn
001800110803
001900110803      //---------------------------------------------------------------
002000110803      //?Definizione costanti.
002100110803      //---------------------------------------------------------------
002200110803
002300110803      //---------------------------------------------------------------
002400110803      //?Definizione schiere.
002500110803      //---------------------------------------------------------------
002600110803
002700110803      //---------------------------------------------------------------
002800110803      //?Definizione aree dati.
002900110803      //---------------------------------------------------------------
003000110803
003100110803      // - Dati utente
003200110803     d §AzUte        e ds                  extname(AZUTE00F)
003300110803     d                                     dtaara
003400110803     d §DatiUte      e ds                  extname(dDatiUte)
003500110803     d                                     dtaara
003600110803
003700110803      //---------------------------------------------------------------
003800110803      //?Definizione strutture dati.
003900110803      //---------------------------------------------------------------
004000110803
004100110803      // - Parametri ricevuti
004200110803     d KPJBA         e ds
004300110803     d TNTA61DS      e ds
004400120112
004500120112      // - Ricerca/Controllo tabelle
004600120112     d TIBS02ds      e ds                  inz
004700110803
004800110803      // - Reperimento dati utente
004900110803     d TIBS34DS      e ds
005000120112
005100120112      // - Tabella ISV
005200120112     d dISV          e ds                  inz
005300110803
005400110810      // - Tabella 3Q
005500110810     d ds3Q          e ds                  inz
005600110803
005700110803      //---------------------------------------------------------------
005800110803      //?Definizione variabili globali.
005900110803      //---------------------------------------------------------------
006000110803
006100110803      // - Flags booleani
006200110803     d $Fine           s               n   inz(*off)
006300110803     d $InzD01         s               n   inz(*on)
006400120112
006500120112      // - Nome libreria file tivir00f
006600120112     d wLibVir         s             21a   inz
006700120112
006800120112      // - Campi di comodo
006900120112     d wTipoServ       s                   like(VIRfi1)
007000120112     d w008a           s              8a   inz
007100120112
007200120112      // - Campi di comodo x date
007300120112     d wOggi           s              8s 0 inz
007400110803
007500110803      //---------------------------------------------------------------
007600110803      //?Definizione procedure esterne.
007700110803      //---------------------------------------------------------------
007800110803
007900110803      //---------------------------------------------------------------
008000110803      //?Prototipi.
008100110803      //---------------------------------------------------------------
008200110803
008300120112      /copy gaitrasrc/srcprotopr,tibs02r
008400110803      /copy gaitrasrc/srcprotopr,tibs34r
008500110810      /copy gaitrasrc/srcprotopi,tibs69r
008600110810      /copy gaitrasrc/srcprotopr,tibs69r
008700110803
008800110803      //---------------------------------------------------------------
008900110803      //?Definizione key-list.
009000110803      //---------------------------------------------------------------
009100110803
009200110803      //---------------------------------------------------------------
009300110803      //?Riepilogo indicatori.
009400110803      //---------------------------------------------------------------
009500110803
009600110803      //---------------------------------------------------------------
009700110803
009800110803      //---------------------------------------------------------------
009900110803      //?M A I N - L I N E
010000110803      //---------------------------------------------------------------
010100110803
010200110803     c     *Entry        plist
010300110803     c                   parm                    KPJBA
010400110803     c                   parm                    TNTA61DS
010500110803
010600110803      /free
010700110803
010800110803       //?Operazioni iniziali
010900110803       exsr RoutInz;
011000110803
011100110803       //?Gestione video
011200110803       DOW $Fine = *off;
011300110803         exsr GesD01;
011400110803       ENDDO;
011500110803
011600110803       //?Operazioni finali
011700110803       exsr RoutEnd;
011800110803
011900110803       //--------------------------------------------------------------
012000110803       //?Operazioni iniziali.
012100110803       //--------------------------------------------------------------
012200110803       BEGSR RoutInz;
012300110803
012400110803         //?Reperimento dati job
012500110803         exsr DatiJob;
012600110805
012700110805         IF  TA61ksc <= *zeros;
012800110805           TA61err = *on;
012900110805           TA61msg = 'Richiesto il codice cliente';
013000110805           $Fine = *on;
013100110805         ENDIF;
013200120112
013300120112       //?Controllo in che sistema informativo sono
013400120112       //?S.I. di Prova o S.I. di Produzione
013500120112         IF  (%subst(knsif : 7 : 1) = 'P');
013600120112         //?Imposto la libreria per file TIVIR
013700120112             wLibVir = 'GAITRAGRPS/TIVIR06L';
013800120112         ELSE;
013900120112             wLibVir = 'GAITRAGRU/TIVIR06L';
014000120112         ENDIF;
014100120112
014200120112       //?Apro il file
014300120112         open  TIVIR06L;
014400120112
014500120112       //?Imposto la data del giorno
014600120112         wOggi = %dec(%date());
014700110803
014800110803       ENDSR;
014900110803
015000110803       //--------------------------------------------------------------
015100110803       //?Reperimento Dati del job (Utente/Operativi).
015200110803       //--------------------------------------------------------------
015300110803       BEGSR DatiJob;
015400110803
015500110803         in(E) §AzUte;
015600110803         if NOT %error;
015700110803           in(E) §DatiUte;
015800110803         endif;
015900110803         if %error or RSut = *blanks;
016000110803           clear TIBS34ds;
016100110803           tibs34r(tibs34ds);
016200110803           in §AzUte;
016300110803           in §DatiUte;
016400110803         endif;
016500110803
016600110803       ENDSR;
016700110803
016800110803       //--------------------------------------------------------------
016900110803       //?Gestione videata.
017000110803       //--------------------------------------------------------------
017100110803       BEGSR GesD01;
017200110803
017300110803         //?Iniziallizazione videata
017400110803         IF $InzD01 = *on;
017500110803           exsr InzD01;
017600110803           $InzD01 = *off;
017700110803         ENDIF;
017800110803
017900110803       //?Emissione videata
018000110810         exfmt TB84D01;
018100110803
018200110803       //?F12 = Ritorno
018300110803         IF  *inkl;
018400110803           $fine = *on ;
018500110803           leavesr ;
018600110803         ENDIF;
018700110803
018800110803       ENDSR;
018900110803
019000110803       //--------------------------------------------------------------
019100110803       //?Caricamento videata D01.
019200110803       //--------------------------------------------------------------
019300110803       BEGSR InzD01;
019400110803
019500110810         clear V1Dksc;
019600110810         clear V1Dksu;
019700120112         clear V1Disv;
019800110812         clear V1Cvto;
019900110810
020000110810       //?Decodifico il cliente
020100110810         clear  tibs69ds;
020200110810         I69kac = TA61ksc;
020300110810         TIBS69R (tibs69ds:ds_cnaco:ds_cnind:ds_cnclp:ds_fncls);
020400110810         V1Cksc = TA61ksc;
020500110811         IF  O69err = *blanks;
020600110811           V1Dksc = ACORag;
020700110811         ELSE;
020800110811           V1Dksc = '? ? ? ? ? ?';
020900110811         ENDIF;
021000110810
021100110810       //?Aggancio la tabella
021200110810         clear ds3Q;
021300110810         TBLkut = 1;
021400110810         TBLcod = '3Q';
021500110810         TBLkey = %editc(V1Cksc:'X');
021600110810
021700110810         chain (TBLkut : TBLcod : TBLkey) TABEL00F;
021800110810         IF  %Found(TABEL00F) and TBLflg = *blanks;
021900110811
022000110811           ds3Q = TBLuni;
022100110810
022200110810         //?Se presente decodifico l'unificante
022300110810           IF  §3Qcks <> 0;
022400110810             clear  tibs69ds;
022500110810             I69kac = §3Qcks;
022600110810             TIBS69R (tibs69ds:ds_cnaco:ds_cnind:ds_cnclp:ds_fncls);
022700110810             V1Cksu = §3Qcks;
022800110811             IF  O69err = *blanks;
022900110811               V1Dksu = ACORag;
023000110811             ELSE;
023100110811               V1Dksu = '? ? ? ? ? ?';
023200110811             ENDIF;
023300110810           ELSE;
023400110810             clear V1Cksu;
023500110810           ENDIF;
023600120112
023700120112         //?Cerco la modalità invio dati
023800120112           IF  V1Cksu > 0;
023900120112             clear wTipoServ;
024000120112             w008a = *all'0';
024100120112             %subst(w008a:2:7) = %editc(V1Cksu:'X');
024200120112             setll (w008a : 'BT') TIVIR06L;
024300120112             reade (w008a : 'BT') TIVIR06L;
024400120112             DOW  not %eof(TIVIR06L);
024500120112               IF  VIRdtf >= woggi;
024600120112                 wTipoServ = VIRfi1;
024700120112               ENDIF;
024800120112               reade (w008a : 'BT') TIVIR06L;
024900120112             ENDDO;
025000120112           //?Decodifico la modalità invio dati
025100120112             clear TIBS02ds;
025200120112             T02mod = 'C';
025300120112             T02cod = 'ISV';
025400120112             T02ke1 = wTipoServ;
025500120112             T02sif = KNSIF;
025600120112             TNTBE_RicercaControllo  (kpjba : tibs02ds);
025700120112             IF  T02err = *blanks;
025800120112               dISV = T02Uni;
025900120112             ENDIF;
026000120112             V1Disv = §ISVdesc;
026100120112           ENDIF;
026200110810
026300110810         //?Flag triangolazione ORM
026400110812           IF  §3Qvto = 'S';
026500110812             V1Cvto = 'SI';
026600110914           ELSE;
026700110914             V1Cvto = 'NO';
026800110812           ENDIF;
026900110810
027000110810         ENDIF;
027100110803
027200110803       ENDSR;
027300110803
027400110803       //--------------------------------------------------------------
027500110803       //?Operazioni finali.
027600110803       //--------------------------------------------------------------
027700110803       BEGSR RoutEnd;
027800110803
027900110803         *inLR = *on;
028000110803         return;
028100110803
028200110803       ENDSR;
