000100891030     H DFTNAME(CN0500) DATEDIT(*YMD)
000200150831     F* TRTB37R1 -----------------------------------------------------*
000300920723     F*-----------------*                                             *
000400010830     F*              - GESTIONE TABELLA "TIPI INCASSO"                *
000500920723     F*---------------------------------------------------------------*
000600150831     FTRTB37D1  CF   E             WORKSTN
000700150903     D kpjba         e DS
000800930208     D PARAM           DS
000900930208     D  VIDFLG                 1      2
001000150903     D UT§DSE        E DS                  EXTNAME(UT§DSE0F)
001100920731     C*****************************************************************
001200891030     C     *ENTRY        PLIST
001300150903     C                   PARM                    kpjba
001400150903     C                   Z-ADD     1             CODUT
001500150903     C                   CALL      'X§PARUT'
001600150903     C                   PARM                    UT§DSE
001700150903     C                   MOVEL     RAGUT         RSUT
001800150903     C                   movel     kpjbu         PARAM
001900920723     C*
002000920723     C*---------------------------------------------------------------*
002100010830     C                   MOVEL     *BLANKS       V1SCE
002200920204     C*
002300891030     C     INIZIO        TAG
002400010830     C                   EXFMT     TB37D00
002500010830     C** F3=FINE
002600150902     C   KC              CLEAR                   VIDFLG
002700920731     C   KC              GOTO      FINE
002800920910     C*
002900150901     C                   MOVEL     V1SCE         VIDFLG
003000150901     C     VIDFLG        IFEQ      *BLANK
003100010830     C                   GOTO      INIZIO
003200150903     c                   else
003300150903     c                   movel     param         kpjbu
003400150901     C                   END
003500920731     C*
003600891030     C     FINE          TAG
003700891030     C                   SETON                                        LR
003800920731     C*
003900920803     C*---------------------------------------------------------------*
