000010011121     A*%%TS  SD  20011121  140630  EDPBA       REL-V4R4M0  5769-PW1
000020950718     A*------------------------------------------------------------------------*
000030011121     A*%%EC
000040011121     A                                      DSPSIZ(24 80 *DS3)
000050011121     A                                      CHGINPDFT
000060011121     A                                      CF01
000070011121     A                                      CF02
000080011121     A                                      CF03
000090011121     A                                      CF04
000100011121     A                                      CF05
000110011121     A                                      CF06
000120011121     A                                      CF07
000130011121     A                                      CF08
000140011121     A                                      CF09
000150011121     A                                      CF10
000160011121     A                                      CF11
000170011121     A                                      CF12
000180011121     A                                      CF13
000190011121     A                                      CF14
000200011121     A                                      CF15
000210011121     A                                      CF16
000220011121     A                                      CF17
000230011121     A                                      CF18
000240011121     A                                      CF19
000250011121     A                                      CF20
000260011121     A                                      CF21
000270011121     A                                      CF22
000280011121     A                                      CF23
000290011121     A                                      CF24
000300011121     A                                      HELP
000310011120     A          R TOP
000320011120     A*%%TS  SD  20011120  141202  EDPBA       REL-V4R4M0  5769-PW1
000330011120     A                                      WINDOW(4 17 17 45)
000340950718     A*------------------------------------------------------------------------*
000350011120     A          R SFL01                     SFL
000360011120     A*%%TS  SD  20011120  141202  EDPBA       REL-V4R4M0  5769-PW1
000370011120     A            S01OPZ         1A  B  7  5DSPATR(UL)
000380011120     A            S01COD         8A  O  7  7
000390011120     A            S01DES        25   O  7 16
000400950718     A*------------------------------------------------------------------------*
000410011120     A          R CTL01                     SFLCTL(SFL01)
000420011120     A*%%TS  SD  20011120  141202  EDPBA       REL-V4R4M0  5769-PW1
000430011120     A                                      SFLSIZ(0010)
000440011120     A                                      SFLPAG(0009)
000450011120     A                                      WINDOW(TOP)
000460011121     A                                      OVERLAY
000470011121     A N41                                  SFLDSP
000480011121     A N40                                  SFLDSPCTL
000490011121     A  40                                  SFLCLR
000500011120     A                                      SFLDROP(CF09)
000510011120     A            RCDNBR         4S 0H      SFLRCDNBR(*TOP)
000520011120     A                                  3  1'Inizio elenco'
000530011120     A                                      COLOR(WHT)
000540011120     A            VDES          19A  B  3 27DSPATR(UL)
000550011120     A            VTIPR         45   O  1  1COLOR(WHT)
000560011120     A                                  5  1'1=Scelta'
000570011120     A                                      COLOR(BLU)
000580011120     A                                  6  5'O'
000590011120     A                                      DSPATR(UL)
000600011120     A                                      COLOR(WHT)
000610011120     A                                  6  7'Codice  '
000620011120     A                                      DSPATR(UL)
000630011120     A                                      COLOR(WHT)
000640011120     A                                  6 16'Descrizione              '
000650011120     A                                      DSPATR(UL)
000660011120     A                                      COLOR(WHT)
000670011120     A            DESTPS        11   O  3 15COLOR(WHT)
000680011121     A          R BOT
000690011121     A*%%TS  SD  20011121  140630  EDPBA       REL-V4R4M0  5769-PW1
000700011121     A                                      WINDOW(TOP)
000710011121     A                                      OVERLAY
000720011121     A                                 16 15'F11=Ordinamento'
000730011121     A                                      COLOR(BLU)
000740011121     A                                 16 32'F12=Ritorno'
000750011121     A                                      COLOR(BLU)
000760011121     A                                 16  1'F5=Rivisual.'
000770011121     A                                      COLOR(BLU)
000780011121     A          R ASSUME
000790011121     A*%%TS  SD  19940608  111038  CAMPORESI   REL-V2R2M0  5738-PW1
000800011121     A                                      TEXT('Serve x preservare il video p-
000810011121     A                                      recedente')
000820011121     A                                      ASSUME
000830011121     A                                  1  2' '
