000100110914     A*%%TS  SD  20110914  115108  EDPMB       REL-V6R1M0  5761-WDS
000200110914     A*%%EC
000300110914     A                                      DSPSIZ(24 80 *DS3)
000400110914     A                                      CHGINPDFT(HI UL)
000500110914     A                                      PRINT
000600110914     A                                      CA12
000700041221     A****************************************************************
000800041221     A*
000900041221     A*
001000041221     A*
001100110914     A          R TB40D01
001200110914     A*%%TS  SD  20110914  115108  EDPMB       REL-V6R1M0  5761-WDS
001300110914     A            RSUT          20A  O  1  2
001400110914     A                                  1 28'** Invio dati Consegna **'
001500110914     A                                      DSPATR(RI)
001600110915     A                                  1 61'TRTB401R'
001700110914     A                                  1 72DATE
001800110914     A                                      EDTCDE(Y)
001900110914     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
002000110914     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
002100110914     A                                  2 72TIME
002200110914     A                                  6  4'Cliente..............:'
002300110914     A            V1CKSC         7Y 0O  6 27DSPATR(HI)
002400110914     A                                      EDTCDE(Z)
002500110914     A            V1DKSC        40   O  6 35COLOR(BLU)
002600110914     A                                  8  4'Unificante invio dati:'
002700110914     A            V1CKSU         7Y 0O  8 27EDTCDE(Z)
002800110914     A                                      DSPATR(HI)
002900110914     A            V1DKSU        40   O  8 35COLOR(BLU)
003000110914     A                                 11  4'Invio data consegna...:'
003100110914     A            V1CCQ1         2A  O 11 28DSPATR(HI)
003200110914     A                                 11 35'Invio data lasciato avviso....:'
003300110914     A            V1CCQ2         2A  O 11 67DSPATR(HI)
003400110914     A                                 13 35'Invio consegna richiesta......:'
003500110914     A            V1CCQ8         2A  O 13 67DSPATR(HI)
003600110914     A                                 15  4'Invio consegna anomala:'
003700110914     A            V1CCQ4         2A  O 15 28DSPATR(HI)
003800110914     A            V1CCQ5         2A  O 13 28DSPATR(HI)
003900110914     A                                 15 35'Invio evento messa in consegna:'
004000110914     A            V1CCQ3         2A  O 15 67DSPATR(HI)
004100110914     A                                 17  4'Incluso VAC per Triangolazione ORM-
004200110914     A                                      :'
004300110914     A            V1CVTO         2A  O 17 40DSPATR(HI)
004400110914     A                                 19  4'Invio VAC consecutivi NON uguali..-
004500110914     A                                      :'
004600110914     A            V1CCTB         2A  O 19 40DSPATR(HI)
004700110914     A                                 24 69'F12=Ritorno'
004800110914     A                                      COLOR(BLU)
004900110914     A                                 13  4'Invio giacenze........:'
