000100020910     A          R BIG
000200020910     A            VARFIL        10
000300020910     A*******     USRNAM        10
000400020910     A            VARUSN        10
000500020910     A            OUTQNM        10
000600020910     A********    USRDTA        10
000700020910     A            VARDTA        10
000800020910     A            S1STAT         6
000900020910     A            S1TOTP         6  0
001000020910     A            DATFOP         7
001100020910     A            TIMFOP         6
001200020910     A          K S1TOTP
