000001021017     A**************************************************************************
000002021017     A*  KPMSG01L - VISTA LOGICA FILE Messaggi
000003021017     A**************************************************************************
000400021017     A                                      UNIQUE
000500021017     A          R KPMSG000                  FORMAT(KPMSG00F)
000600021017     A                                      PFILE(KPMSG00F)
001400021028     A          K MSGNRA
