000010160429     A*%%TS  SD  20160429  114911  EDPMM       REL-V7R1M0  5770-WDS
000020911217     A*  91/12/17  15:14:44    EDPDB       REL-R03M00  5728-PW1
000030160429     A*%%EC
000040160429     A                                      DSPSIZ(24 80 *DS3)
000050160429     A                                      REF(*LIBL/CNDIZION)
000060160429     A                                      CHGINPDFT
000070160429     A                                      MSGLOC(24)
000080160429     A                                      PRINT
000090911217     A*  91/12/17  15:14:44    EDPDB       REL-R03M00  5728-PW1
000100160429     A          R SC43D01
000110160429     A*%%TS  SD  20160429  114911  EDPMM       REL-V7R1M0  5770-WDS
000120160429     A                                      TEXT('Record di immissione')
000130160429     A                                      CA12
000140160429     A N79                                  CF04
000150160429     A  77                                  CF06
000160160429     A  09                                  CF09
000170160429     A  09                                  CF10
000180160429     A  08                                  CF08
000190160429     A                                      CF07
000200160429     A            V1CAAS         4S 0H
000210160429     A  28        $MSG          70   M
000220160429     A            RSUT          20A  O  1  2TEXT('RAG.SOC. UTENTE')
000230160429     A N79                              1 26'*  INTERROGAZIONE CONTRASSEGNI  *'
000240160429     A                                      DSPATR(RI)
000250160429     A                                      DSPATR(UL)
000260160429     A  79                              1 28'*   MANUTENZIONE CONTRASSEGNI   *'
000270160429     A                                      DSPATR(RI)
000280160429     A                                      DSPATR(UL)
000290160429     A            NOMPGM        10A  O  1 62
000300160429     A                                  1 73DATE
000310160429     A                                      EDTCDE(Y)
000320160429     A            KNSIF         10A  O  2  2
000330160429     A            KNMUS         10A  O  2 13
000340160429     A                                  2 73TIME
000350160429     A  38                              3  2'PAGAMENTO C/A BLOCCATO'
000360160429     A                                      DSPATR(RI)
000370160429     A                                      DSPATR(UL)
000380160429     A                                      DSPATR(BL)
000390160429     A                                  3 25'Stato C/Asseg.:'
000400160429     A            V1CSTA         1Y 0B  3 41
000410160429     A N40                                  DSPATR(HI)
000420160429     A N77                                  DSPATR(PR)
000430160429     A                                      DSPATR(CS)
000440160429     A  40                                  DSPATR(RI)
000450160429     A  40                                  DSPATR(PC)
000460160429     A            V1DSTA        22A  O  3 43
000470160429     A  85        V1CTRA        14A  O  3 66DSPATR(RI)
000480160429     A                                  4  2'Linea di partenza:'
000490160429     A            V1CLNP         3Y 0O  4 21TEXT('LINEA PARTENZA')
000500160429     A                                      DSPATR(HI)
000510160429     A                                      EDTCDE(Z)
000520160429     A                                      DSPATR(CS)
000530160429     A                                  4 25'Numero spediz.:'
000540160429     A            V1CNRS         2Y 0O  4 41TEXT('SERIE SPEDIZIONE')
000550160429     A                                      DSPATR(HI)
000560160429     A                                      EDTCDE(Z)
000570160429     A            V1CNSP         7Y 0O  4 44DSPATR(HI)
000580160429     A                                      EDTCDE(Z)
000590160429     A                                  4 53'Codice cliente.:'
000600160429     A            V1CKSC         7Y 0O  4 73DSPATR(HI)
000610160429     A                                      EDTCDE(Z)
000620160429     A                                      DSPATR(CS)
000630160429     A            V1DLNP        20A  O  5  2DSPATR(HI)
000640160429     A                                      DSPATR(UL)
000650160429     A                                  5 25'Data spediz...:'
000660160429     A            V1CDSP         8Y 0O  5 41DSPATR(HI)
000670160429     A                                      EDTWRD('  /  /    ')
000680160429     A                                  5 53'Data distinta..:'
000690160429     A            V1CDDC         8Y 0O  5 70DSPATR(HI)
000700160429     A                                      EDTWRD('  /  /    ')
000710160429     A                                  6  2'Linea di arrivo..:'
000720160429     A            V1CLNA         3Y 0B  6 21
000730160429     A N41                                  DSPATR(HI)
000740160429     A                                      EDTCDE(4)
000750160429     A N77N78
000760160429     AO 09
000770160429     AO 52                                  DSPATR(PR)
000780160429     A  41                                  DSPATR(RI)
000790160429     A                                      DSPATR(CS)
000800160429     A  41                                  DSPATR(PC)
000810160429     A                                  6 25'Rif.Alfa.:'
000820160429     A            V1CRMA        15A  O  6 36DSPATR(HI)
000830160429     A                                  6 53'Numero distinta:'
000840160429     A            V1CNDT         7Y 0O  6 73DSPATR(HI)
000850160429     A                                      EDTCDE(Z)
000860160429     A            V1DLNA        20A  O  7  2DSPATR(HI)
000870160429     A                                      DSPATR(UL)
000880160429     A                                  7 25'Rif.Num..:'
000890160429     A            V1CRMN        15Y 0O  7 36DSPATR(HI)
000900160429     A                                      EDTCDE(Z)
000910160429     A                                  7 53'Data arrivo....:'
000920160429     A            V1CDTA         8Y 0O  7 70DSPATR(HI)
000930160429     A                                      EDTWRD('  /  /    ')
000940160429     A                                  8  2'__________________________________-
000950160429     A                                      ___________________________________-
000960160429     A                                      _________'
000970160429     A                                  9  2'Rif. Incasso....:'
000980160429     A            V1CNRA        10A  B  9 20
000990160429     A  09
001000160429     AON77N76                               DSPATR(PR)
001010160429     A                                      DSPATR(CS)
001020160429     A  09
001030160429     AON45                                  DSPATR(HI)
001040160429     A  09
001050160429     AO 45                                  DSPATR(RI)
001060160429     A  45                                  DSPATR(PC)
001070160429     A                                  9 31'Data ass.:'
001080160429     A            V1CDTE         8Y 0B  9 42
001090160429     A  09
001100160429     AON77N76                               DSPATR(PR)
001110160429     A                                      DSPATR(CS)
001120160429     A N48                                  DSPATR(HI)
001130160429     A  48                                  DSPATR(RI)
001140160429     A  48                                  DSPATR(PC)
001150160429     A                                      EDTWRD('  /  /    ')
001160160429     A                                  9 54'Tipo Ass..:'
001170160429     A            V1CTPA         1A  B  9 66
001180160429     A N46                                  DSPATR(HI)
001190160429     A                                      DSPATR(CS)
001200160429     A  46                                  DSPATR(RI)
001210160429     A  09
001220160429     AON77N76                               DSPATR(PR)
001230160429     A  46                                  DSPATR(PC)
001240160429     A                                  9 68'Tipo Int.:'
001250160429     A            V1CTPI         1A  O  9 79DSPATR(HI)
001260160429     A                                 10  2'Data Regist.Inc.:'
001270160429     A            V1CDRI         8Y 0O 10 20DSPATR(CS)
001280160429     A N48                                  DSPATR(HI)
001290160429     A  48                                  DSPATR(RI)
001300160429     A  48                                  DSPATR(PC)
001310160429     A                                      EDTWRD('  /  /    ')
001320160429     A                                 10 31'Nr.Regist:'
001330160429     A            V1CNRI         6Y 0O 10 42DSPATR(HI)
001340160429     A                                      EDTCDE(Z)
001350160429     A                                 10 49'Cambio'
001360160429     A                                      DSPATR(ND)
001370160429     A            V1CCMB         9Y 4B 10 56EDTWRD('     ,    ')
001380160429     A                                      DSPATR(ND)
001390160429     A                                      DSPATR(PR)
001400160429     A                                 10 68' " Bol/Inc'
001410160429     A            V1CFUS         1A  O 10 79DSPATR(HI)
001420160429     A                                 11  2'Cod. Int.Assegno:'
001430160429     A            V1CCDI         7Y 0B 11 20
001440160429     A N42                                  DSPATR(HI)
001450160429     A                                      EDTCDE(Z)
001460160429     A  09
001470160429     AON77                                  DSPATR(PR)
001480160429     A  42                                  DSPATR(RI)
001490160429     A                                      DSPATR(CS)
001500160429     A  42                                  DSPATR(PC)
001510160429     A            V1CABI         5Y 0B 11 31EDTCDE(Z)
001520160429     A N47                                  DSPATR(HI)
001530160429     A  47                                  DSPATR(RI)
001540160429     A                                      DSPATR(CS)
001550160429     A  09
001560160429     AON77N76                               DSPATR(PR)
001570160429     A  47                                  DSPATR(PC)
001580160429     A            V1CCAB         5Y 0B 11 37
001590160429     A N47                                  DSPATR(HI)
001600160429     A  47                                  DSPATR(RI)
001610160429     A                                      EDTCDE(Z)
001620160429     A                                      DSPATR(CS)
001630160429     A  09
001640160429     AON77N76                               DSPATR(PR)
001650160429     A            V1CDES        30A  O 11 44DSPATR(HI)
001660160429     A                                 12  2'Inc.Confermato in sede:'
001670160429     A            V1CMAS         1A  O 12 26DSPATR(HI)
001680160429     A                                 12 44'Tipo Incasso Bol.:'
001690160429     A N88                                  DSPATR(ND)
001700160429     A            V1CTICI        2A  O 12 63DSPATR(HI)
001710160429     A N88                                  DSPATR(ND)
001720160429     A                                 12 68'Variato.:'
001730160429     A N89
001740160429     AON88                                  DSPATR(ND)
001750160429     A            V1CTICMB       2A  O 12 78DSPATR(HI)
001760160429     A N89
001770160429     AON88                                  DSPATR(ND)
001780160429     A                                 13  2'Intestazione Assegno   '
001790160429     A                                      DSPATR(UL)
001800160429     A                                 13 27'     M i t t e n t e   '
001810160429     A                                      DSPATR(HI)
001820160429     A                                      DSPATR(UL)
001830160429     A                                 13 52'   D e s t i n a t a r i o  '
001840160429     A                                      DSPATR(HI)
001850160429     A                                      DSPATR(UL)
001860160429     A            V1DINT        23A  O 14  2DSPATR(HI)
001870160429     A            V1DMIO        23A  B 14 27DSPATR(HI)
001880160429     A N77N76
001890160429     AO 09
001900160429     AON71                                  DSPATR(PR)
001910160429     A                                 14 52'R.Soc.:'
001920160429     A            V1CRSD        20A  O 14 60DSPATR(HI)
001930160429     A            V1CVII        23A  O 15  2DSPATR(HI)
001940160429     A            V1CVIM        23A  B 15 27DSPATR(HI)
001950160429     A N77N76
001960160429     AO 09
001970160429     AON71                                  DSPATR(PR)
001980160429     A                                 15 52'Local.:'
001990160429     A            V1CPAR         7A  O 15 60DSPATR(HI)
002000160429     A            V1CCIT        23A  O 16  2DSPATR(HI)
002010160429     A            V1CLOM        23A  B 16 27DSPATR(HI)
002020160429     A N77N76
002030160429     AO 09
002040160429     AON71                                  DSPATR(PR)
002050160429     A                                 16 52'Prov..:'
002060160429     A            V1CPRO         2A  O 16 60DSPATR(HI)
002070160429     A            V1CCAI         9A  O 17  2DSPATR(HI)
002080160429     A  14                             17 12'Pr'
002090160429     A            V1CPRI         2A  O 17 15DSPATR(HI)
002100160429     A  13                             17 19'Nz'
002110160429     A            V1CNZI         3A  O 17 22DSPATR(HI)
002120160429     A            V1CCAM         9A  B 17 27DSPATR(HI)
002130160429     A N77N76
002140160429     AO 09
002150160429     AON71                                  DSPATR(PR)
002160160429     A  10                             17 37'Pr'
002170160429     A            V1CPRM         2A  B 17 40DSPATR(HI)
002180160429     A N77N76
002190160429     AO 09
002200160429     AON71                                  DSPATR(PR)
002210160429     A  11                             17 44'Nz'
002220160429     A            V1CNZM         3A  B 17 47DSPATR(HI)
002230160429     A N77N76
002240160429     AO 09
002250160429     AON71                                  DSPATR(PR)
002260160429     A                                 18  2'Dt.Pagam.:'
002270160429     A            V1CDDP         8Y 0O 18 13DSPATR(HI)
002280160429     A                                      EDTWRD('  /  /    ')
002290160429     A                                 18 25'Rif..:'
002300160429     A            V1CNDP         7Y 0O 18 32DSPATR(HI)
002310160429     A                                      EDTCDE(Z)
002320160429     A                                 18 40'Tipo..:'
002330160429     A            V1CFPC         1A  O 18 48DSPATR(HI)
002340160429     A                                 18 54'Banca:'
002350160429     A            V1CBNA         7Y 0O 18 61DSPATR(HI)
002360160429     A                                      EDTCDE(Z)
002370160429     A                                 20  2'Dt.Regis.:'
002380160429     A            V1CDRG         8Y 0O 20 13
002390160429     A N48                                  DSPATR(HI)
002400160429     A  48                                  DSPATR(RI)
002410160429     A  48                                  DSPATR(PC)
002420160429     A                                      EDTWRD('  /  /    ')
002430160429     A                                 20 25'Num..:'
002440160429     A            V1CNRG         6Y 0O 20 33DSPATR(HI)
002450160429     A                                      EDTCDE(Z)
002460160429     A                                 20 40'Cambio:'
002470160429     A                                      DSPATR(ND)
002480160429     A            V1CCMP         9Y 4O 20 48EDTWRD('     ,    ')
002490160429     A                                      DSPATR(ND)
002500160429     A            V1DBNA        20A  O 20 60
002510160429     A                                 21  2'Numero giac.:'
002520160429     A            V1CNGC         7Y 0O 21 16DSPATR(HI)
002530160429     A                                      EDTCDE(Z)
002540160429     A                                 21 25'Data apert.:'
002550160429     A            V1CDGC         8Y 0O 21 38DSPATR(HI)
002560160429     A                                      EDTWRD('  /  /    ')
002570160429     A                                 21 58'Cod.Particolarità.:'
002580160429     A            V1CGCA         2A  O 21 78DSPATR(HI)
002590160429     A                                 22  2'Raggruppam..:'
002600160429     A                                      DSPATR(RI)
002610160429     A            V1CRGF         3Y 0B 22 16
002620160429     A N43                                  DSPATR(HI)
002630160429     A N43                                  DSPATR(UL)
002640160429     A  09
002650160429     AON77N78                               DSPATR(PR)
002660160429     A                                      EDTCDE(4)
002670160429     A  43                                  DSPATR(RI)
002680160429     A  43                                  DSPATR(PC)
002690160429     A                                 22 25'Tipo bolla.:'
002700160429     A                                      DSPATR(RI)
002710160429     A            V1CTBL         2A  O 22 38DSPATR(HI)
002720160429     A                                      DSPATR(UL)
002730160429     A                                 22 42'IMPORTO C/ASS.:'
002740160429     A                                      DSPATR(RI)
002750160429     A            V1CCAS        12Y 2B 22 58
002760160429     A N44                                  DSPATR(HI)
002770160429     A                                      DSPATR(UL)
002780160429     A  09
002790160429     AON77N78                               DSPATR(PR)
002800160429     A  44                                  DSPATR(RI)
002810160429     A                                      COMP(GT ,00)
002820160429     A                                      EDTWRD('          ,  ')
002830160429     A                                 22 73'VAL.'
002840160429     A                                      DSPATR(RI)
002850160429     A            V1CVCA         3A  B 22 78
002860160429     A  09
002870160429     AON77N78                               DSPATR(PR)
002880160429     A N49                                  DSPATR(HI)
002890160429     A  49                                  DSPATR(RI)
002900160429     A  49                                  DSPATR(PC)
002910160429     A                                      DSPATR(UL)
002920160429     A                                 23  2'                                  -
002930160429     A                                                                         -
002940160429     A                                               '
002950160429     A                                      DSPATR(UL)
002960160429     A N79                             24  2'F4=Storico'
002970160429     A  77                             24 13'F6=Aggiorna'
002980160429     A                                 24 26'F7=Int.Bol.'
002990160429     A  08                             24 39'F8=Pag.Infragru.'
003000160429     A                                 24 56'F12=Ritorno'
003010160429     A                                 24 68'F9=Multiass.'
003020160429     A N09                                  DSPATR(ND)
003030160429     A  09                                  DSPATR(HI)
003040160429     A  09                                  DSPATR(RI)
003050160429     A                                 19  2'Cliente Beneficiario:'
003060160429     A            V1CKFS         8Y 0O 19 24DSPATR(HI)
003070160429     A                                      EDTCDE(Z)
003080160429     A            V1CKFSD       44A  O 19 33
003090950711     A          R SC43D02
003100950711     A*%%TS  SD  19941103  122018  EDPRE       REL-V2R3M0  5738-PW1
003110950711     A                                      CA12
003120950711     A            RSUT          20A  O  1  2TEXT('RAG.SOC. UTENTE')
003130950711     A                                  1 27'** INTERROGAZIONE CONTRASSEGNI **'
003140950711     A                                      DSPATR(RI)
003150950711     A                                      DSPATR(UL)
003160950711     A                                  1 73DATE
003170950711     A                                      EDTCDE(Y)
003180950711     A            NOMPGM        10A  O  1 63
003190950711     A                                  2 36' DATI BOLLA '
003200950711     A                                      DSPATR(RI)
003210950711     A                                      DSPATR(UL)
003220950711     A                                 13 23'NON CI SONO DATI DA VISUALIZZARE'
003230950711     A                                      DSPATR(HI)
003240950711     A                                 24  2'F12=Precedente'
003250950711     A                                 23  2'                                  -
003260950711     A                                                                         -
003270950711     A                                               '
003280950711     A                                      DSPATR(UL)
003290950711     A                                  2 73TIME
003300950711     A            KNSIF         10   O  2  2
003310950711     A            KNMUS         10   O  2 13
