000001120305     A*%%***********************************************************************
000002120305     A*%%TS  RD  20120305  110348  EDPBA       REL-V6R1M0  5761-WDS
000003120305     A*%%FI+10700000000000001010000000000000000000000000000000000000
000004120305     A*%%FI       1111111111111111111111111100000000000000000000000
000005120305     A*%%PR 1070096I
000006120305     A*%%FD Stampa lettera smarrimento assegno
000007120305     A*%%***********************************************************************
000008120305     A*PARMS PAGESIZE(66 96) CPI(12) FORMTYPE(LETSMA) SAVE(*YES)
000009120305     A*PARMS OVRFLW(60)
000010120305     A*%%***********************************************************************
000011120305     A*%%EC
000012120305     A*%%***********************************************************************
000013120305     A                                      REF(QGPL/QINVREC INVREC)
000014120305     A          R SALTO
000015120305     A*%%***********************************************************************
000016120305     A*%%RI 00000
000017120305     A*%%FS 004
000018120305     A*%%***********************************************************************
000019120305     A                                  5  1
000020120305     A                                      ' '
000021120305     A*%%***********************************************************************
000022120305     A*%%SS
000023120305     A*%%***********************************************************************
000024120305     A          R TES01
000025120305     A*%%***********************************************************************
000026120305     A*%%RI 00000
000027120305     A*%%FS 008
000028120305     A*%%***********************************************************************
000029120305     A                                      SPACEB(009)
000030120305     A                                    47
000031120305     A                                      'Spett.'
000032120305     A                                      SKIPB(010)
000033120305     A  80                                23
000034120305     A                                      '--->'
000035120305     A                                      SPACEB(001)
000036120305     A                                      HIGHLIGHT
000037120305     A            RAGD          35A  O    47
000038120305     A                                      SKIPB(011)
000039120305     A            INDD          35A  O    47
000040120305     A                                      SKIPB(012)
000041120305     A            CAPD           9A  O    47
000042120305     A                                      SKIPB(013)
000043120305     A            LOCD          40A  O    57
000044120305     A                                      SKIPB(013)
000045120305     A                                    39
000046120305     A                                      'e p.c.  Filiale di'
000047120305     A                                      SKIPB(015)
000048120305     A  81                                23
000049120305     A                                      '--->'
000050120305     A                                      SPACEB(001)
000051120305     A                                      HIGHLIGHT
000052120305     A            POD           20A  O    47
000053120305     A                                      SKIPB(016)
000054120305     A                                    39
000055120305     A                                      'e p.c.  Filiale di'
000056120305     A                                      SKIPB(018)
000057120305     A  82                                23
000058120305     A                                      '--->'
000059120305     A                                      SPACEB(001)
000060120305     A                                      HIGHLIGHT
000061120305     A            POM           20A  O    47
000062120305     A                                      SKIPB(019)
000063120305     A                                    39
000064120305     A                                      'e p.c.  Spett.'
000065120305     A                                      SKIPB(021)
000066120305     A  83                                23
000067120305     A                                      '--->'
000068120305     A                                      SPACEB(001)
000069120305     A                                      HIGHLIGHT
000070120305     A            RAGM          35A  O    47
000071120305     A                                      SKIPB(022)
000072120305     A            INDM          35A  O    47
000073120305     A                                      SKIPB(023)
000074120305     A            CAPM           9A  O    47
000075120305     A                                      SKIPB(024)
000076120305     A            LOCM          40A  O    57
000077120305     A                                      SKIPB(024)
000078120305     A                                    11
000079120305     A                                      'Bologna,'
000080120305     A                                      SKIPB(029)
000081120305     A            GMAUDT         8  0O    20
000082120305     A                                      EDTWRD('0  .  .    ')
000083120305     A                                      SKIPB(029)
000084120305     A                                    11
000085120305     A                                      'OGGETTO:'
000086120305     A                                      SKIPB(031)
000087120305     A                                    20
000088120305     A                                      'Smarrimento assegno/i non trasferi-
000089120305     A                                      bile.'
000090120305     A                                      HIGHLIGHT
000091120305     A                                      SKIPB(031)
000092120305     A                                    11
000093120305     A                                      'Gentili Signori,'
000094120305     A                                      SKIPB(033)
000095120305     A                                    11
000096120305     A                                      'siamo rammaricati di dovervi comun-
000097120305     A                                      icare che a fronte'
000098120305     A                                      SKIPB(035)
000099120305     A                                    +1
000100120305     A                                      'del contrassegno di'
000101120305     A                                      HIGHLIGHT
000102120305     A            SDIVIS         4A  O    84
000103120305     A                                      HIGHLIGHT
000104120305     A            SASSC         11S 2O    11
000105120305     A                                      EDTCDE(2)
000106120305     A                                      HIGHLIGHT
000107120305     A                                      SPACEB(001)
000108120305     A                                    +1
000109120305     A                                      'ralativo alla spedizione'
000110120305     A                                      SKIPB(036)
000111120305     A                                      HIGHLIGHT
000112120305     A            SIDBOLLA      12A  O    +1
000113120305     A                                      TEXT('ID bolla')
000114120305     A                                      HIGHLIGHT
000115120305     A                                    +1
000116120305     A                                      'del'
000117120305     A            SDTASPE        8S 0O    68
000118120305     A                                      EDTWRD('0  .  .    ')
000119120305     A                                      HIGHLIGHT
000120120305     A                                    11
000121120305     A                                      'Mittente'
000122120305     A                                      HIGHLIGHT
000123120305     A                                      SKIPB(037)
000124120305     A            RAGMO         30A  O    20
000125120305     A                                      HIGHLIGHT
000126120305     A                                      SKIPB(037)
000127120305     A                                    51
000128120305     A                                      'Destinatario'
000129120305     A                                      HIGHLIGHT
000130120305     A                                      SKIPB(037)
000131120305     A            RAGDO         30A  O    64
000132120305     A                                      HIGHLIGHT
000133120305     A                                      SKIPB(037)
000134120305     A                                    11
000135120305     A                                      'è stato smarrito quanto segue:'
000136120305     A                                      SPACEB(001)
000137120305     A                                    11
000138120305     A                                      'Ass.   Data          Importo      -
000139120305     A                                          Banca                   '
000140120305     A                                      SPACEB(002)
000141120305     A*%%***********************************************************************
000142120305     A*%%SS
000143120305     A*%%CL 010
000144120305     A*%%CL 001
000145120305     A*%%CL 001
000146120305     A*%%CL 001
000147120305     A*%%CL 002
000148120305     A*%%CL 001
000149120305     A*%%CL 002
000150120305     A*%%CL 001
000151120305     A*%%CL 002
000152120305     A*%%CL 001
000153120305     A*%%CL 001
000154120305     A*%%CL 001
000155120305     A*%%CL 005
000156120305     A*%%CL 002
000157120305     A*%%CL 002
000158120305     A*%%CL 002
000159120305     A*%%CL 001
000160120305     A*%%CL 001
000161120305     A*%%CL 001
000162120305     A*%%CL 002
000163120305     A*%%***********************************************************************
000164120305     A          R DET01
000165120305     A*%%***********************************************************************
000166120305     A*%%RI 00000
000167120305     A*%%***********************************************************************
000168120305     A            SNRAP          4A  O    11
000169120305     A                                      HIGHLIGHT
000170120305     A                                      SPACEB(001)
000171120305     A            SDTEP          8S 0O    16
000172120305     A                                      EDTWRD('0  .  .    ')
000173120305     A                                      HIGHLIGHT
000174120305     A            SDIVISP        4A  O    +2
000175120305     A            SASSP         11S 2O    33
000176120305     A                                      EDTCDE(2)
000177120305     A                                      HIGHLIGHT
000178120305     A            DESABI        40A  O    49
000179120305     A                                      HIGHLIGHT
000180120305     A*%%***********************************************************************
000181120305     A*%%SS
000182120305     A*%%CL 001
000183120305     A*%%***********************************************************************
000184120305     A          R TOT01
000185120305     A*%%***********************************************************************
000186120305     A*%%RI 00000
000187120305     A*%%FS 001
000188120305     A*%%***********************************************************************
000189120305     A                                      SPACEB(002)
000190120305     A                                    11
000191120305     A                                      'In allegato  alla  presente  vi tr-
000192120305     A                                      asmettiamo copia  della  denuncia  -
000193120305     A                                      di'
000194120305     A*%%***********************************************************************
000195120305     A*%%SS
000196120305     A*%%***********************************************************************
000197120305     A          R TOT02
000198120305     A*%%***********************************************************************
000199120305     A*%%RI 00000
000200120305     A*%%***********************************************************************
000201120305     A                                      SPACEB(001)
000202120305     A                                    11
000203120305     A                                      'smarrimento presentata al Comando -
000204120305     A                                      dei Carabinieri che vorrete inoltra-
000205120305     A                                      re'
000206120305     A*%%***********************************************************************
000207120305     A*%%SS
000208120305     A*%%***********************************************************************
000209120305     A          R TOT03
000210120305     A*%%***********************************************************************
000211120305     A*%%RI 00000
000212120305     A*%%***********************************************************************
000213120305     A                                      SPACEB(001)
000214120305     A                                    11
000215120305     A                                      'all'' Istituto Bancario che ha ril-
000216120305     A                                      asciato il/i titolo/i, al fine di p-
000217120305     A                                      ro-'
000218120305     A*%%***********************************************************************
000219120305     A*%%SS
000220120305     A*%%***********************************************************************
000221120305     A          R TOT04
000222120305     A*%%***********************************************************************
000223120305     A*%%RI 00000
000224120305     A*%%***********************************************************************
000225120305     A                                      SPACEB(001)
000226120305     A                                    11
000227120305     A                                      'cedere al bolocco cautelativo che -
000228120305     A                                      ne eviti un possibile uso fraudolen-
000229120305     A                                      to.'
000230120305     A*%%***********************************************************************
000231120305     A*%%SS+
000232120305     A*%%SS                        .
000233120305     A*%%***********************************************************************
000234120305     A          R TOT05
000235120305     A*%%***********************************************************************
000236120305     A*%%RI 00000
000237120305     A*%%FS 001
000238120305     A*%%***********************************************************************
000239120305     A                                      SPACEB(002)
000240120305     A                                    11
000241120305     A                                      'Vi chiediamo cortesemente di voler-
000242120305     A                                       provvedere ad emettere nuovo titol-
000243120305     A                                      o,'
000244120305     A*%%***********************************************************************
000245120305     A*%%SS
000246120305     A*%%***********************************************************************
000247120305     A          R TOT06
000248120305     A*%%***********************************************************************
000249120305     A*%%RI 00000
000250120305     A*%%***********************************************************************
000251120305     A                                      SPACEB(001)
000252120305     A                                    11
000253120305     A                                      'di importo pari al valore del cont-
000254120305     A                                      rassegno e non trasferibile, che vo-
000255120305     A                                      r-'
000256120305     A*%%***********************************************************************
000257120305     A*%%SS
000258120305     A*%%***********************************************************************
000259120305     A          R TOT07
000260120305     A*%%***********************************************************************
000261120305     A*%%RI 00000
000262120305     A*%%***********************************************************************
000263120305     A                                      SPACEB(001)
000264120305     A                                    11
000265120305     A                                      'rete consegnare al nostro incarica-
000266120305     A                                      to che vi contatterà a breve.      -
000267120305     A                                        '
000268120305     A*%%***********************************************************************
000269120305     A*%%SS
000270120305     A*%%***********************************************************************
000271120305     A          R TOT08
000272120305     A*%%***********************************************************************
000273120305     A*%%RI 00000
000274120305     A*%%FS 001
000275120305     A*%%***********************************************************************
000276120305     A                                      SPACEB(002)
000277120305     A                                    11
000278120305     A                                      'Scusandoci  per  la perdita di tem-
000279120305     A                                      po che vi  abbiamo  involontariamen-
000280120305     A                                      te'
000281120305     A*%%***********************************************************************
000282120305     A*%%SS
000283120305     A*%%***********************************************************************
000284120305     A          R TOT09
000285120305     A*%%***********************************************************************
000286120305     A*%%RI 00000
000287120305     A*%%***********************************************************************
000288120305     A                                      SPACEB(001)
000289120305     A                                    11
000290120305     A                                      'procurato, cogliamo l'' occasione -
000291120305     A                                      per porgervi distinti saluti.'
000292120305     A*%%***********************************************************************
000293120305     A*%%SS
000294120305     A*%%***********************************************************************
000295120305     A          R TOT10
000296120305     A*%%***********************************************************************
000297120305     A*%%RI 00000
000298120305     A*%%FS 001
000299120305     A*%%***********************************************************************
000300120305     A                                      SPACEB(002)
000301120305     A            RAGSOC        22A  O    47
000302120305     A*%%***********************************************************************
000303120305     A*%%SS
000304120305     A*%%CP+999CRTPRTF
000305120305     A*%%CP+    FILE(GAITRASRC/TNSC71P)
000306120305     A*%%CP+    DEVTYPE(*SCS)
000307120305     A*%%CP     PAGESIZE(*N       132      *N     )
000308120305     A*%%***********************************************************************
