000010120322     A*%%TS  SD  20120322  155135  EDPBA       REL-V6R1M0  5761-WDS
000020890816     A*** FILE: TRAS03D *--------------------------------------------**
000030890816     A*              IMMISSIONE C/ASSEGNI DA GESTIONE -              **
000040000000     A***------------------------------------------------------------**
000050120322     A*%%EC
000060120322     A                                      DSPSIZ(24 80 *DS3)
000070120322     A                                      CA03
000080120322     A                                      CF06
000090120322     A                                      CF07
000100120322     A                                      CF08
000110120322     A  44                                  CF09
000120120322     A  44                                  CF10
000130120322     A          R SC01D01
000140120322     A*%%TS  SD  20120322  155135  EDPBA       REL-V6R1M0  5761-WDS
000150120322     A  28        $MSG          70   M
000160120322     A            RSUT          20A  O  1  2TEXT('RAG.SOC. UTENTE')
000170120322     A                                  1 30'*VARIAZIONE ANAGRAFICO*'
000180120322     A                                      DSPATR(RI)
000190120322     A                                      DSPATR(UL)
000200120322     A                                  1 63'TNSC01R'
000210120322     A                                  1 72DATE
000220120322     A                                      EDTCDE(Y)
000230120322     A            KNSIF         10A  O  2  2
000240120322     A            KNMUS         10A  O  2 13
000250120322     A                                  2 28'*CLIENTE VARIO CONTRASSEGNO*'
000260120322     A                                      DSPATR(RI)
000270120322     A                                      DSPATR(UL)
000280120322     A                                  2 72TIME
000290120322     A                                  4  8'Anno Spedizione.....:'
000300120322     A                                      DSPATR(HI)
000310120322     A            VAAS           4Y 0B  4 30CHECK(RZ)
000320120322     A                                      EDTCDE(Z)
000330120322     A  01                                  DSPATR(RI)
000340120322     A  01                                  DSPATR(PC)
000350120322     A                                  6  8'Linea di partenza...:'
000360120322     A                                      DSPATR(HI)
000370120322     A            VLNP           3Y 0B  6 30EDTCDE(Z)
000380120322     A  02                                  DSPATR(PC)
000390120322     A  02                                  DSPATR(RI)
000400120322     A            DESLNP        20A  O  6 35DSPATR(HI)
000410120322     A                                  8  8'Numero di spedizione:'
000420120322     A                                      DSPATR(HI)
000430120322     A            VNRS           2Y 0B  8 30CHECK(RB)
000440120322     A                                      EDTCDE(Z)
000450120322     A                                  8 33'-'
000460120322     A                                      DSPATR(HI)
000470120322     A            VNSP           7Y 0B  8 35CHECK(RB)
000480120322     A                                      EDTCDE(Z)
000490120322     A  03                                  DSPATR(RI)
000500120322     A  03                                  DSPATR(PC)
000510120322     A                                 12  8'Ragione sociale.....:'
000520120322     A                                      DSPATR(HI)
000530120322     A            VRSD          35A  B 12 30
000540120322     A  04                                  DSPATR(RI)
000550120322     A  04                                  DSPATR(PC)
000560120322     A                                 14  8'Indirizzo...........:'
000570120322     A                                      DSPATR(HI)
000580120322     A            VVID          35A  B 14 30
000590120322     A  05                                  DSPATR(RI)
000600120322     A  05                                  DSPATR(PC)
000610120322     A                                 16  8'C.A.P...............:'
000620120322     A                                      DSPATR(HI)
000630120322     A            VCAD           9A  B 16 30
000640120322     A  06                                  DSPATR(RI)
000650120322     A  06                                  DSPATR(PC)
000660120322     A                                 18  8'Località e provincia:'
000670120322     A                                      DSPATR(HI)
000680120322     A            VCID          35A  B 18 30
000690120322     A  07                                  DSPATR(RI)
000700120322     A  07                                  DSPATR(PC)
000710120322     A            VPRM           2A  B 18 66
000720120322     A  08                                  DSPATR(RI)
000730120322     A  08                                  DSPATR(PC)
000740120322     A                                 20  8'Nazione.............:'
000750120322     A                                      DSPATR(HI)
000760120322     A            VNZM           3A  B 20 30
000770120322     A  09                                  DSPATR(RI)
000780120322     A  09                                  DSPATR(PC)
000790120322     A                                 23  2'                                  -
000800120322     A                                                                         -
000810120322     A                                              '
000820120322     A                                      DSPATR(UL)
000830120322     A                                 24  2'F6=Conferma'
000840120322     A                                 24 16'F3=Fine lavoro'
000850120322     A                                 24 33'F7=Int. C/Ass.'
000860120322     A                                 24 50'F8=Int.Bolle'
000870120322     A                                 24 64'F9=Multiassegni'
000880120322     A N44                                  DSPATR(ND)
000890120322     A  44                                  DSPATR(RI)
000900120322     A  44                                  DSPATR(HI)
