000100991230     A*%%TS  SD  19991230  163901  EDPRE       REL-V4R2M0  5769-PW1
000200911217     A*  91/12/17  15:14:44    EDPDB       REL-R03M00  5728-PW1
000300991230     A*%%EC
000400991230     A                                      DSPSIZ(24 80 *DS3)
000500991230     A                                      REF(*LIBL/CNDIZION)
000600991230     A                                      CHGINPDFT
000700991230     A                                      MSGLOC(24)
000800991230     A                                      PRINT
000900941102     A          R SC21Z01
001000941102     A*%%TS  SD  19941102  150155  EDPRE       REL-V2R3M0  5738-PW1
001100941102     A                                 24 29'F7=Interrogazione Bolle'
001200941102     A                                 24  2'F3=Fine Lavoro'
001300941102     A                                 24 66'F12=Precedente'
001400910918     A*  91/09/18  11:56:50    EDPDB       REL-R03M00  5728-PW1
001500941103     A          R SC21S01                   SFL
001600941103     A*%%TS  SD  19941103  164557  EDPRE       REL-V2R3M0  5738-PW1
001700941103     A  70                                  SFLNXTCHG
001800941103     A            ANNO           4Y 0H
001900941103     A            VSEL           1A  B  7  2DSPATR(UL)
002000941103     A                                      CHECK(ER)
002100941103     A                                      VALUES(' ' '1')
002200941103     A            VLNP1          3A  O  7  4DSPATR(UL)
002300941103     A            VDAT           4A  O  7  8DSPATR(UL)
002400941103     A            VSER1          2A  O  7 13DSPATR(UL)
002500941103     A            VSPE1          7Y 0O  7 16DSPATR(CS)
002600941103     A                                      EDTCDE(Z)
002700941103     A            VMIT          10A  O  7 24DSPATR(UL)
002800941103     A            VDES          10A  O  7 35DSPATR(UL)
002900941103     A            VRIF          15Y 0O  7 46EDTCDE(Z)
003000941103     A                                      DSPATR(UL)
003100941103     A            VIMP          13Y 3O  7 66DSPATR(CS)
003200941103     A                                      EDTWRD('          ,   ')
003300941103     A            VVCA           3A  O  7 62
003400910905     A*  91/09/05  16:48:38    EDPDB       REL-R03M00  5728-PW1
003500991230     A          R SC21C01                   SFLCTL(SC21S01)
003600991230     A*%%TS  SD  19991230  141118  EDPRE       REL-V4R2M0  5769-PW1
003700991230     A                                      SFLSIZ(0015)
003800991230     A                                      SFLPAG(0014)
003900991230     A                                      CA12
004000991230     A N30                                  CA03
004100991230     A N30                                  CF07
004200991230     A                                      ROLLUP(98)
004300991230     A                                      OVERLAY
004400991230     A N30                                  SFLDSP
004500991230     A N31                                  SFLDSPCTL
004600991230     A  30 31                               SFLCLR
004700991230     A  81                                  SFLEND
004800991230     A            DSPNR1         4S 0H      SFLRCDNBR(CURSOR)
004900991230     A            RSUT          20A  O  1  2
005000991230     A                                  1 25'** Interrogazione contrassegni **'
005100991230     A                                      DSPATR(RI)
005200991230     A                                      DSPATR(UL)
005300991230     A                                  1 72DATE
005400991230     A                                      EDTCDE(Y)
005500991230     A            KNSIF         10A  O  2  2
005600991230     A                                  6  2'1 LNP D.Sp Sr.Spediz. Mittente   D-
005700991230     A                                      estinat.  Rif. Mittemte   Div    Im-
005800991230     A                                      porto    '
005900991230     A                                      DSPATR(UL)
006000991230     A                                      DSPATR(HI)
006100991230     A            NOMPGM         9A  O  1 61
006200991230     A  02                              4  2'Nr. Riferimento mittente..:'
006300991230     A                                      DSPATR(UL)
006400991230     A                                      DSPATR(HI)
006500991230     A  02        NRMIT         15Y 0O  4 30DSPATR(HI)
006600991230     A                                      EDTCDE(4)
006700991230     A  03                              4  2'Data di spedizione.: da'
006800991230     A                                      DSPATR(UL)
006900991230     A                                      DSPATR(HI)
007000991230     A  03        SDD            8Y 0O  4 26DSPATR(HI)
007100991230     A                                      EDTWRD('  /  /    ')
007200991230     A  03                              4 38'a'
007300991230     A                                      DSPATR(UL)
007400991230     A                                      DSPATR(HI)
007500991230     A  03        SDA            8Y 0O  4 41DSPATR(HI)
007600991230     A                                      EDTWRD('  /  /    ')
007700991230     A  04                              4  2'Data documento...: da'
007800991230     A                                      DSPATR(HI)
007900991230     A                                      DSPATR(UL)
008000991230     A  04        PDD            8Y 0O  4 24DSPATR(HI)
008100991230     A                                      EDTWRD('  /  /    ')
008200991230     A  04                              4 35'a'
008300991230     A                                      DSPATR(UL)
008400991230     A                                      DSPATR(HI)
008500991230     A  04        PDA            8Y 0O  4 37DSPATR(HI)
008600991230     A                                      EDTWRD('  /  /    ')
008700991230     A  04                              4 49'Numero documento...:'
008800991230     A                                      DSPATR(UL)
008900991230     A                                      DSPATR(HI)
009000991230     A  04        NDC            7Y 0O  4 70DSPATR(HI)
009100991230     A                                      EDTCDE(4)
009200991230     A  05                              4  2'Stato C/Assegno..:'
009300991230     A                                      DSPATR(UL)
009400991230     A                                      DSPATR(HI)
009500991230     A  05        V1CSTA         1Y 0O  4 21DSPATR(HI)
009600991230     A                                      EDTCDE(4)
009700991230     A            KNMUS         10A  O  2 13
009800991230     A            V1DSTA        30A  O  4 23DSPATR(HI)
009900931011     A*  91/09/05  15:58:05    EDPDB       REL-R03M00  5728-PW1
010000991230     A          R SC21D01
010100991230     A*%%TS  SD  19991230  163901  EDPRE       REL-V4R2M0  5769-PW1
010200991230     A                                      OVERLAY
010300991230     A                                 21 37'Tot.Contrassegni in'
010400991230     A                                      DSPATR(HI)
010500991230     A            TOT           14Y 3O 21 65DSPATR(HI)
010600991230     A                                      EDTWRD('           ,   ')
010700991230     A  07                             23 37'Tot.Contrassegni in divisa:'
010800991230     A                                      DSPATR(HI)
010900991230     A  07        TOTV          14Y 3O 23 65DSPATR(HI)
011000991230     A                                      EDTWRD('           ,   ')
011100991231     A  08                             22 37'Tot.Contrassegni in'
011200991230     A                                      DSPATR(HI)
011300991231     A  08        TOTEUR        14Y 3O 22 65DSPATR(HI)
011400991230     A                                      EDTWRD('           ,   ')
011500991230     A            DIVCOR         3   O 21 57DSPATR(HI)
011600991231     A  08        DIVALT         3   O 22 57DSPATR(HI)
011700991230     A                                 21 61'..:'
011800991230     A                                      DSPATR(HI)
011900991231     A  08                             22 61'..:'
012000991230     A                                      DSPATR(HI)
012100931012     A          R SC21D02
012200931012     A*%%TS  SD  19931012  132140  EDPRE       REL-V2R1M0  5738-PW1
012300931012     A                                      CLRL(*NO)
012400931012     A                                      OVERLAY
012500931012     A                                 15 23'NON CI SONO DATI DA VISUALIZZARE'
012600931012     A                                      DSPATR(HI)
012700941102     A          R SC21Z02
012800941102     A*%%TS  SD  19941102  150155  EDPRE       REL-V2R3M0  5738-PW1
012900941102     A                                 24  2'F12=Precedente'
