000010950712     A*%%TS  SD  19950712  140340  EDPRE       REL-V2R3M0  5738-PW1
000020911217     A*  91/12/17  15:14:44    EDPDB       REL-R03M00  5728-PW1
000030950712     A*%%EC
000040950712     A                                      DSPSIZ(24 80 *DS3)
000050950712     A                                      REF(*LIBL/CNDIZION)
000060950712     A                                      CHGINPDFT
000070950712     A                                      MSGLOC(24)
000080950712     A                                      PRINT
000090950706     A          R SC41Z01
000100950706     A*%%TS  SD  19950706  115317  EDPRE       REL-V2R3M0  5738-PW1
000110950706     A                                 24 20'F7=Interrogazione Bolle'
000120950706     A                                 24  2'F3=Fine Lavoro'
000130950706     A                                 24 66'F12=Precedente'
000140950706     A N02                             24 47'F9=Altri Dati'
000150950712     A          R SC41S01                   SFL
000160950712     A*%%TS  SD  19950712  140340  EDPRE       REL-V2R3M0  5738-PW1
000170950712     A  22                                  SFLNXTCHG
000180950712     A            V1CAAS         4Y 0H
000190950712     A            V1CSCE         1A  B  7  2DSPATR(UL)
000200950712     A                                      VALUES(' ' '1')
000210950712     A            V1CLNP         3Y 0O  7  4DSPATR(UL)
000220950712     A                                      EDTCDE(Z)
000230950712     A            V1CDSP         4Y 0O  7  8DSPATR(UL)
000240950712     A                                      EDTWRD('  /  ')
000250950712     A            V1CNRS         2Y 0O  7 14DSPATR(UL)
000260950712     A                                      EDTCDE(Z)
000270950712     A            V1CNSP         7Y 0O  7 17DSPATR(CS)
000280950712     A                                      EDTCDE(Z)
000290950712     A            V1CMIT        15A  O  7 25DSPATR(UL)
000300950712     A            V1CDES        15A  O  7 41DSPATR(UL)
000310950712     A            V1CVCA         3A  O  7 77
000320950712     A            V1CIMP        13Y 3O  7 58DSPATR(CS)
000330950712     A                                      EDTCDE(2)
000340950712     A                                  8  2'Rif.Mitt.:'
000350950712     A            V1CRMN        15Y 0O  8 13EDTCDE(Z)
000360950712     A                                      DSPATR(UL)
000370950712     A            V1CTBL         2   H
000380910905     A*  91/09/05  16:48:38    EDPDB       REL-R03M00  5728-PW1
000390950707     A          R SC41C01                   SFLCTL(SC41S01)
000400950707     A*%%TS  SD  19950707  154722  EDPRE       REL-V2R3M0  5738-PW1
000410950707     A                                      SFLSIZ(0009)
000420950707     A                                      SFLPAG(0008)
000430950707     A                                      CA12
000440950707     A  20                                  CA03
000450950707     A  20                                  CF07
000460950707     A                                      ROLLUP(25)
000470950707     A                                      OVERLAY
000480950707     A  20                                  SFLDSP
000490950707     A  21                                  SFLDSPCTL
000500950707     A N20N21                               SFLCLR
000510950707     A  23                                  SFLEND
000520950707     A                                      SFLDROP(CF09)
000530950707     A            DSPNR1         4S 0H      SFLRCDNBR(CURSOR)
000540950707     A            RSUT          20A  O  1  2
000550950707     A                                  1 25'** Interrogazione contrassegni **'
000560950707     A                                      DSPATR(RI)
000570950707     A                                      DSPATR(UL)
000580950707     A                                  1 72DATE
000590950707     A                                      EDTCDE(Y)
000600950707     A            KNSIF         10A  O  2  2
000610950707     A                                  6  2'1 LNP D.Sp  Sr.Spediz. Mittente   -
000620950707     A                                           Destinatario           Importo-
000630950707     A                                          Valuta'
000640950707     A                                      DSPATR(UL)
000650950707     A                                      DSPATR(HI)
000660950707     A            NOMPGM         9A  O  1 61
000670950707     A  02                              4  2'Nr.Rif.Mitt:'
000680950707     A                                      DSPATR(UL)
000690950707     A                                      DSPATR(HI)
000700950707     A  02        V1CRMN        15Y 0O  4 15DSPATR(HI)
000710950707     A                                      EDTCDE(4)
000720950707     A  03                              4  2'Data di spedizione.: da'
000730950707     A                                      DSPATR(UL)
000740950707     A                                      DSPATR(HI)
000750950707     A  03        V1CSDD         8Y 0O  4 26DSPATR(HI)
000760950707     A                                      EDTWRD('  /  /    ')
000770950707     A  03                              4 38'a'
000780950707     A                                      DSPATR(UL)
000790950707     A                                      DSPATR(HI)
000800950707     A  03        V1CSDA         8Y 0O  4 41DSPATR(HI)
000810950707     A                                      EDTWRD('  /  /    ')
000820950707     A  04                              4  2'Data docum.: da'
000830950707     A                                      DSPATR(HI)
000840950707     A                                      DSPATR(UL)
000850950707     A  04        V1CPDD         8Y 0O  4 18DSPATR(HI)
000860950707     A                                      EDTWRD('  /  /    ')
000870950707     A  04                              4 29'a'
000880950707     A                                      DSPATR(UL)
000890950707     A                                      DSPATR(HI)
000900950707     A  04        V1CPDA         8Y 0O  4 31DSPATR(HI)
000910950707     A                                      EDTWRD('  /  /    ')
000920950707     A  04                              4 42'Nr.:'
000930950707     A                                      DSPATR(UL)
000940950707     A                                      DSPATR(HI)
000950950707     A  04        V1CNDC         7Y 0O  4 47DSPATR(HI)
000960950707     A                                      EDTCDE(4)
000970950707     A            KNMUS         10A  O  2 13
000980950707     A  02                              4 32'data sped.: da'
000990950707     A                                      DSPATR(HI)
001000950707     A                                      DSPATR(UL)
001010950707     A  02        V1CSD1         8Y 0O  4 47DSPATR(HI)
001020950707     A                                      EDTCDE(8)
001030950707     A  02                              4 58'a'
001040950707     A                                      DSPATR(UL)
001050950707     A                                      DSPATR(HI)
001060950707     A  02        V1CSA1         8Y 0O  4 60DSPATR(HI)
001070950707     A                                      EDTCDE(8)
001080950707     A  02                              4 72'lnp.'
001090950707     A                                      DSPATR(UL)
001100950707     A                                      DSPATR(HI)
001110950707     A  02        V1CLP1         3Y 0O  4 77DSPATR(HI)
001120950707     A                                      EDTCDE(4)
001130950707     A  03                              4 55'Codice Cliente:'
001140950707     A                                      DSPATR(HI)
001150950707     A                                      DSPATR(UL)
001160950707     A  03        V1CKCS         7Y 0O  4 71DSPATR(HI)
001170950707     A                                      EDTCDE(4)
001180950707     A  04                              4 55'Tp.Int:'
001190950707     A                                      DSPATR(HI)
001200950707     A                                      DSPATR(UL)
001210950707     A  04        V1CINT         1A  O  4 63DSPATR(HI)
001220950707     A  04                              4 66'Cliente'
001230950707     A                                      DSPATR(HI)
001240950707     A                                      DSPATR(UL)
001250950707     A  04        V1CKCP         7Y 0O  4 74DSPATR(HI)
001260950707     A                                      EDTCDE(4)
001270950707     A  05                              4  2'Data distinta..:'
001280950707     A                                      DSPATR(HI)
001290950707     A  05        V1CDDT         8Y 0O  4 19TEXT('Data distinta')
001300950707     A                                      DSPATR(HI)
001310950707     A                                      DSPATR(UL)
001320950707     A                                      EDTCDE(8)
001330950707     A  05                              4 32'Numero..:'
001340950707     A                                      DSPATR(HI)
001350950707     A  05        V1CNDT         7Y 0O  4 42DSPATR(UL)
001360950707     A                                      DSPATR(HI)
001370950707     A                                      EDTCDE(4)
001380950707     A  05                              4 55'Raggruppamento...:'
001390950707     A                                      DSPATR(HI)
001400950707     A                                      DSPATR(UL)
001410950707     A  05        V1CRGP         3Y 0O  4 74DSPATR(HI)
001420950707     A                                      DSPATR(UL)
001430950707     A                                      EDTCDE(4)
001440950706     A          R SC41D02
001450950706     A*%%TS  SD  19950706  114953  EDPRE       REL-V2R3M0  5738-PW1
001460950706     A                                      CLRL(*NO)
001470950706     A                                      OVERLAY
001480950706     A                                 15 23'NON CI SONO DATI DA VISUALIZZARE'
001490950706     A                                      DSPATR(HI)
001500950706     A          R SC41Z02
001510950706     A*%%TS  SD  19950706  114953  EDPRE       REL-V2R3M0  5738-PW1
001520950706     A                                 24  2'F12=Precedente'
