000100950302     A          R TNSC66                    TEXT('RIPRISTINO FILE PULIZIA C/A -
000200940712     A                                           DI SEDE')
000300940712     A*
000400950302     A            D66BOL        10          TEXT('NOME FILE SALVATAGGIO BOLLE')
000500950302     A            D66VAR        10          TEXT('NOME FILE SALVATAGGIO VARIAZ')
000600980105     A            D66LIB        10          TEXT('NOME LIBRERIA CARICAMENTO')
000700980105     A            D66LBR        10          TEXT('NOME LIBRERIA RESIDENZA FILE')
000800120326     A            D66MUL        10          TEXT('NOME FILE SALVATAG.MULTIASS.')
