000100150529     A*%%TS  SD  20150529  113122  EDPMM       REL-V7R1M0  5770-WDS
000200911217     A*  91/12/17  15:14:44    EDPDB       REL-R03M00  5728-PW1
000300150529     A*%%EC
000400150529     A                                      DSPSIZ(24 80 *DS3)
000500150529     A                                      REF(*LIBL/CNDIZION)
000600150529     A                                      CHGINPDFT
000700150529     A                                      MSGLOC(24)
000800150529     A                                      PRINT
000900150528     A          R SC41Z01
001000150528     A*%%TS  SD  20150528  095843  EDPMM       REL-V7R1M0  5770-WDS
001100150528     A                                 24  2'F1=Sel.tutte'
001200150528     A                                 24 66'F12=Precedente'
001300150528     A N02                             24 49'F9=Altri Dati'
001400150528     A                                 24 34'F6=Conferma'
001500150528     A                                      DSPATR(HI)
001600150520     A          R SC41S01                   SFL
001700150520     A*%%TS  SD  20150520  103312  EDPMM       REL-V7R1M0  5770-WDS
001800150520     A  22                                  SFLNXTCHG
001900150522     A            VNRA          10A  H
002000150520     A            V1CAAS         4Y 0H
002100150520     A            V1CSCE         1A  B  7  2DSPATR(UL)
002200150529     A                                      VALUES(' ' '1' '7')
002300150520     A            V1CLNP         3Y 0O  7  4DSPATR(UL)
002400150520     A                                      EDTCDE(Z)
002500150520     A            V1CDSP         4Y 0O  7  8DSPATR(UL)
002600150520     A                                      EDTWRD('  /  ')
002700150520     A            V1CNRS         2Y 0O  7 14DSPATR(UL)
002800150520     A                                      EDTCDE(Z)
002900150520     A            V1CNSP         7Y 0O  7 17DSPATR(CS)
003000150520     A                                      EDTCDE(Z)
003100150520     A            V1CMIT        15A  O  7 25DSPATR(UL)
003200150520     A            V1CDES        15A  O  7 41DSPATR(UL)
003300150520     A            V1CVCA         3A  O  7 75
003400150520     A            V1CIMP        13Y 3O  7 57DSPATR(CS)
003500150520     A                                      EDTCDE(2)
003600150520     A                                  8  2'Rif.Mitt.:'
003700150520     A            V1CRMN        15Y 0O  8 13EDTCDE(Z)
003800150520     A                                      DSPATR(UL)
003900150520     A            V1CTBL         2A  H
004000150520     A            V1CMUL         1   O  7 79
004100910905     A*  91/09/05  16:48:38    EDPDB       REL-R03M00  5728-PW1
004200150529     A          R SC41C01                   SFLCTL(SC41S01)
004300150529     A*%%TS  SD  20150529  113122  EDPMM       REL-V7R1M0  5770-WDS
004400150529     A                                      SFLSIZ(0009)
004500150529     A                                      SFLPAG(0008)
004600150529     A                                      CA12
004700150529     A                                      CF01
004800150529     A                                      ROLLUP(25)
004900150529     A                                      CF06
005000150529     A                                      OVERLAY
005100150529     A  20                                  SFLDSP
005200150529     A  21                                  SFLDSPCTL
005300150529     A N20N21                               SFLCLR
005400150529     A  23                                  SFLEND
005500150529     A                                      SFLDROP(CF09)
005600150529     A            DSPNR1         4S 0H      SFLRCDNBR(CURSOR)
005700150529     A            RSUT          20A  O  1  2
005800150529     A                                  1 26'*Gestione smarrimento assegni *'
005900150529     A                                      DSPATR(RI)
006000150529     A                                      DSPATR(UL)
006100150529     A                                  1 72DATE
006200150529     A                                      EDTCDE(Y)
006300150529     A            KNSIF         10A  O  2  2
006400150529     A                                  6  2'1 LNP D.Sp  Sr.Spediz. Mittente   -
006500150529     A                                           Destinatario           Importo-
006600150529     A                                          Val M'
006700150529     A                                      DSPATR(UL)
006800150529     A                                      DSPATR(HI)
006900150529     A            NOMPGM         9A  O  1 61
007000150529     A                                  3 10'Data recapito segn.'
007100150529     A                                      DSPATR(UL)
007200150529     A                                      DSPATR(HI)
007300150529     A  04        VIDDDP         8Y 0O  3 31DSPATR(HI)
007400150529     A                                      EDTWRD('  /  /    ')
007500150529     A  04                              3 43'Nr.Segnacollo'
007600150529     A                                      DSPATR(UL)
007700150529     A                                      DSPATR(HI)
007800150529     A  04        VIDNDP         7Y 0O  3 57DSPATR(HI)
007900150529     A                                      EDTCDE(4)
008000150529     A            KNMUS         10A  O  2 13
008100150529     A                                  4  3'Opzioni:  1=Azzera dati pagamento -
008200150529     A                                      7=Multiassegni'
008300950706     A          R SC41D02
008400950706     A*%%TS  SD  19950706  114953  EDPRE       REL-V2R3M0  5738-PW1
008500950706     A                                      CLRL(*NO)
008600950706     A                                      OVERLAY
008700950706     A                                 15 23'NON CI SONO DATI DA VISUALIZZARE'
008800950706     A                                      DSPATR(HI)
008900950706     A          R SC41Z02
009000950706     A*%%TS  SD  19950706  114953  EDPRE       REL-V2R3M0  5738-PW1
009100950706     A                                 24  2'F12=Precedente'
009200150529     A          R SC41R01
009300150529     A*%%TS  SD  20150529  113122  EDPMM       REL-V7R1M0  5770-WDS
009400150529     A                                      CA03
009500150529     A  28        $MSG          70   M
009600150529     A            RSUT          20A  O  1  2
009700150529     A                                  1 26'*Gestione smarrimento assegni *'
009800150529     A                                      DSPATR(RI)
009900150529     A                                      DSPATR(UL)
010000150529     A                                  1 72DATE
010100150529     A                                      EDTCDE(Y)
010200150529     A            KNSIF         10A  O  2  2
010300150529     A            NOMPGM         9A  O  1 61
010400150529     A                                 22  3'F3=Fine'
010500150529     A            VIDNDP         7Y 0B  8 37EDTCDE(Z)
010600150529     A                                      DSPATR(HI)
010700150529     A                                      DSPATR(UL)
010800150529     A                                 10  2'Data Spedizione...:'
010900150529     A            VIDDDP         8Y 0B 10 37EDTCDE(8)
011000150529     A                                      DSPATR(HI)
011100150529     A                                      DSPATR(UL)
011200150529     A                                  8  2'Recapito contrassegni/segnacollo'
