000100941114     A*--------------------------------------------------------------*
000200120110     A* DS INCASSO ASSEGNI MITTENTE                                  *
000300941114     A*--------------------------------------------------------------*
000400110919     A          R FNLR539
000500080423     A* OBBLIGATORI INPUT
000600120110     A            D539CMTI       1          TEXT('COMMIT S/N')
000700120209     A            D539AMBI       1          TEXT('S=SEDE/" "=FILIALE/P=PARTENZA-
000800120209     A                                      ')
000900110922     A            D539TPCI       1          TEXT('TIPO CHIAMATA: M=MODIFICA -
001000120110     A                                      V=VISUALIZZA A=ANNULLAMENTO I=INSER-
001100120110     A                                      IMENTO')
001200120110     A* OBBLIGATORI IN INSERIMENO
001300120110     A            D539FGSI       3S 0       TEXT('P.O. DISTINTA')
001400120110     A            D539NDCI       7S 0       TEXT('NR. DISTINTA')
001500120110     A            D539OPZI       2          TEXT('OPZ CHIUS.DISTINTA')
001600120110     A* OBBLIGATORI IN MODIFICA/ANNULLAMENTO/VISUALIZZA
001700110922     A            D539AASI       4S 0       TEXT('ANNO SPED.')
001800110921     A            D539LNPI       3S 0       TEXT('LINEA PART. SPED.')
001900110921     A            D539NRSI       2S 0       TEXT('SERIE SPED.')
002000110919     A            D539NSPI       7S 0       TEXT('NR. SPED.')
002100120110     A            D539AANI       4S 0       TEXT('ANNO BOLLA FIGLIA CONSEGNATA')
002200120110     A            D539LPNI       3S 0       TEXT('LNP BOLLA FIGLIA CONSEGNATA')
002300120110     A            D539NRNI       2S 0       TEXT('NSR BOLLA FIGLIA CONSEGNATA')
002400120110     A            D539NSNI       7S 0       TEXT('NSP BOLLA FIGLIA CONSEGNATA')
002500080515     A* OUTPUT
002600110921     A            D539ERRO       1          TEXT('CODICE ERRORE')
002700110921     A            D539MSGO      70          TEXT('MSG ERRORE')
