000001071022     A*%%***********************************************************************
000002071022     A*%%TS  RD  20071022  123218  EDPBA       REL-V5R4M0  5722-WDS
000003071022     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004071022     A*%%FI       0000000000000000000000000000000000000000000000000
000005071022     A*%%***********************************************************************
000006071022      *PARMS CPI(15) PAGRTT(0) FORMTYPE(LETCAOMM)
000007071022     A          R TES01
000008071022     A*%%***********************************************************************
000009071022     A*%%RI 00000
000010071022     A*%%FS 010
000011071022     A*%%***********************************************************************
000012071022     A                                 11  7
000013071022     A                                      'BARTOLINI SPA'
000014071022     A                                 12  7
000015071022     A                                      'FILIALE DI'
000016071022     A            POM           20A       +1
000017071022     A                                 14 60
000018071022     A                                      'Spett.le'
000019071022     A                                 15 60
000020071022     A                                      'FILIALE DI'
000021071022     A            POD           20A       +1
000022071022     A                                 20  7
000023071022     A                                      'Ns.rif.:'
000024071022     A            CDTPOM        32A    21  7
000025071022     A                                 24  7
000026071022     A                                      'Oggetto:'
000027071022     A                                      HIGHLIGHT
000028071022     A                                    +1
000029071022     A                                      'contrassegno omesso per'
000030071022     A            SDIV           3        +1
000031071022     A            SASS          13S 3     +1
000032071022     A                                      EDTCDE(2)
000033071022     A                                 25 16
000034071022     A                                      'Spedizione n.'
000035071022     A            SLNP           3S 0     +1
000036071022     A                                      EDTCDE(Z)
000037071022     A            SNRS           2S 0     +1
000038071022     A                                      EDTCDE(Z)
000039071022     A            SNSP           7S 0     +1
000040071022     A                                      EDTCDE(Z)
000041071022     A                                    +1
000042071022     A                                      'del'
000043071022     A            SGMSP          4S 0     +1
000044071022     A                                      EDTWRD('  /  ')
000045071022     A                                    +0
000046071022     A                                      '/'
000047071022     A            SAAS           4S 0     +0
000048071022     A                                 26 16
000049071022     A                                      'mittente'
000050071022     A            RAGMO         35A       +1
000051071022     A                                    +1
000052071022     A                                      'destinatario'
000053071022     A            RAGDO         35A       +1
000054071022     A                                 31  7
000055071022     A                                      'A seguito della segnalazione del m-
000056071022     A                                      ittente è emerso che l''importo ind-
000057071022     A                                      icato in oggetto del'
000058071022     A                                 32  7
000059071022     A                                      'contrassegno gravante su tale sped-
000060071022     A                                      izione non è stato riportato nella -
000061071022     A                                      lettera di vettura e che a'
000062071022     A                                 33  7
000063071022     A                                      'causa di questa mancata indicazion-
000064071022     A                                      e l''autotrasportatore incaricato d-
000065071022     A                                      ella consegna non ha potuto'
000066071022     A                                 34  7
000067071022     A                                      'incassarlo dal destinatario.'
000068071022     A                                 36  7
000069071022     A                                      'A tale proposito vi informiamo di -
000070071022     A                                      aver provveduto in data'
000071071022     A            SDTCOM        10A       +1
000072071022     A                                    +1
000073071022     A                                      'a rigenerare'
000074071022     A                                 37  7
000075071022     A                                      'la spedizione gravandola del contr-
000076071022     A                                      assegno previsto dal D.D.T.consegna-
000077071022     A                                      toci dal mittente che'
000078071022     A                                 38  7
000079071022     A                                      'provvediamo ad allegarvi.'
000080071022     A                                 40  7
000081071022     A                                      'Vi ringraziamo per la collaborazio-
000082071022     A                                      ne e porgiamo cordiali saluti.'
000083071022     A                                 43 53
000084071022     A                                      'Filiale di'
000085071022     A            POMO          20A       +1
000086071022     A                                 44  7
000087071022     A                                      'Allegato:'
000088071022     A                                 45  7
000089071022     A                                      'originale D.D.T.mittente'
000090071022     A*%%***********************************************************************
000091071022     A*%%SS
000092071022     A*%%CL 001
000093071022     A*%%CL 002
000094071022     A*%%CL 001
000095071022     A*%%CL 005
000096071022     A*%%CL 001
000097071022     A*%%CL 003
000098071022     A*%%CL 001
000099071022     A*%%CL 001
000100071022     A*%%CL 005
000101071022     A*%%CL 001
000102071022     A*%%CL 001
000103071022     A*%%CL 001
000104071022     A*%%CL 002
000105071022     A*%%CL 001
000106071022     A*%%CL 001
000107071022     A*%%CL 002
000108071022     A*%%CL 003
000109071022     A*%%CL 001
000110071022     A*%%CL 001
000111071022     A*%%CP+999CRTPRTF
000112071022     A*%%CP+    FILE(GAITRASRC/TNSC04MP)
000113071022     A*%%CP+    DEVTYPE(*SCS)
000114071022     A*%%CP     PAGESIZE(*N       132      *N     )
000115071022     A*%%***********************************************************************
