000100151026      *PARMS CPI(15) PAGESIZE(66 198) HOLD(*YES)
000200151026      */*PRM CPI(15) PAGESIZE(66 198) HOLD(*YES)
000300151026      */*END
000400931012     A*---------------------------------------------------------------*
000500931014     A*   FILIALI: INTERROGAZIONE CONTRASSEGNI                        *
000600931012     A*---------------------------------------------------------------*
000700931012     A          R PAG00
000800941103     A            RSUT          20      1  1
000900950707     A  02                              1 23'                                **-
001000950707     A                                        STAMPA BOLLE CONTRASSEGNI PER RIF-
001100950707     A                                      ERIM. MITTENTE NUMERICO/DATA SPEDIZ-
001200950707     A                                      IONE  **                           -
001300950707     A                                              '
001400950707     A  03                              1 23'                                  -
001500950707     A                                          **  STAMPA BOLLE CONTRASSEGNI P-
001600950707     A                                      ER DATA SPEDIZIONE/CODICE CLIENTE  -
001700950707     A                                      **                                 -
001800950707     A                                              '
001900950707     A  04                              1 23'                                  -
002000950707     A                                            **  STAMPA BOLLE CONTRASSEGNI-
002100950707     A                                       PER DATA/NUM. DOCUM. PAGAMENTO ** -
002200950707     A                                                                         -
002300950707     A                                              '
002400151026     A  05                              1 23'                                  -
002500151026     A                                                     **  STAMPA BOLLE CON-
002600151026     A                                      TRASSEGNI PER ID BONIFICO  **      -
002700151026     A                                                                         -
002800151026     A                                              '
002900941103     A                                  1156'Pgm:'
003000941103     A            NOMPGM        11      1161
003100941103     A                                  1173'Data :'
003200941103     A                                  1180DATE
003300931013     A                                      EDTWRD('  /  /  ')
003400941103     A                                  1190'Pag:'
003500941103     A            PAGE           4  0   1195
003600931013     A                                      EDTCDE(4)
003700941103     A            KNSIF         10      2  1
003800941103     A            KNMUS         10      2 12
003900941103     A                                  2180TIME
004000950707     A                                 10 59'***--------------------------------
004100941103     A                                      ------------------------------------
004200941103     A                                      ------***'
004300950707     A                                 11 59'*                                 -
004400941103     A                                                                         -
004500941103     A                                              *'
004600950707     A                                 12 59'*                      LISTA PARAM-
004700941103     A                                      ETRI DI ELABORAZIONE               -
004800941103     A                                              *'
004900950707     A                                 13 59'*                                 -
005000941103     A                                                                         -
005100941103     A                                              *'
005200950707     A                                 14 59'*                                 -
005300941103     A                                                                         -
005400941103     A                                              *'
005500950707     A                                 15 59'*                                 -
005600941103     A                                                                         -
005700941103     A                                              *'
005800950707     A                                 16 59'*'
005900151028     A                                 16 64'Parzializzazione per (1/2/3/4/5/6)-
006000151028     A                                      :'
006100151028     A            S42SEL         1     16101
006200950707     A                                 16136'*'
006300950707     A                                 17 59'*                                 -
006400941103     A                                                                         -
006500941103     A                                              *'
006600950707     A                                 18 59'*                                 -
006700941103     A                                                                         -
006800941103     A                                              *'
006900950707     A                                 19 59'*'
007000950707     A                                 19136'*'
007100151028     A                                 19 64'1) Spedizione:     Anno spedizione-
007200151028     A                                      :'
007300151028     A            S42AAS         4  0  19101
007400151026     A                                      EDTCDE(4)
007500950707     A                                 20 59'*'
007600950707     A                                 20136'*'
007700151028     A                                 20 64'   Linea di partenza..............-
007800151028     A                                      :'
007900151028     A            S42LNP         3  0  20101EDTCDE(4)
008000151028     A            S42NSP         7  0  21101EDTCDE(4)
008100950707     A                                 21 59'*'
008200950707     A                                 21136'*'
008300151028     A                                 21 64'   Numero di spedizione...........-
008400151028     A                                      :'
008500950707     A                                 22 59'*'
008600950707     A                                 22136'*'
008700151028     A                                 22 64'   Numero di serie................-
008800151028     A                                      :'
008900151028     A            S42NRS         2  0  22101EDTCDE(4)
009000950707     A                                 23 59'*'
009100950707     A                                 23136'*'
009200950707     A                                 24 59'*'
009300950707     A                                 24136'*'
009400151028     A*//                              24 59'*'
009500151028     A*//                              24136'*'
009600151028     A                                 24 64'2) Numero riferimento mittente....-
009700151028     A                                      :'
009800151028     A            S42NRM        15  0  24101
009900151026     A                                      EDTCDE(4)
010000950707     A                                 25 59'*'
010100950707     A                                 25136'*'
010200151028     A                                 25 64'   date di spedizione: dal........-
010300151028     A                                      :'
010400151028     A            S42SD1         8  0  25101
010500151026     A                                      EDTWRD('  /  /    ')
010600950707     A                                 25113'al'
010700151026     A            S42SA1         8  0  25116
010800151026     A                                      EDTWRD('  /  /    ')
010900950707     A                                 26 59'*'
011000950707     A                                 26136'*'
011100151028     A                                 26 64'   linea di partenza..............-
011200151028     A                                      :'
011300151028     A            S42LP1         3  0  26101EDTCDE(4)
011400950707     A                                 27 59'*                                 -
011500941103     A                                                                         -
011600941103     A                                              *'
011700950707     A                                 28 59'*'
011800950707     A                                 28136'*'
011900151028     A                                 28 64'3) Date di spedizione: dal........-
012000151028     A                                      :'
012100151028     A            S42SDD         8  0  28101
012200151026     A                                      EDTWRD('  /  /    ')
012300950707     A                                 28113'al'
012400151026     A            S42SDA         8  0  28116
012500151026     A                                      EDTWRD('  /  /    ')
012600950707     A                                 29 59'*'
012700950707     A                                 29136'*'
012800151028     A                                 29 64'   codice cliente.................-
012900151028     A                                      :'
013000151028     A            S42SCD         7  0  29101EDTCDE(4)
013100950707     A                                 30 59'*'
013200950707     A                                 30136'*'
013300950707     A                                 31 59'*'
013400950707     A                                 31136'*'
013500151028     A                                 31 64'4) Date di pagamento:  dal........-
013600151028     A                                      :'
013700151028     A            S42PDD         8  0  31101
013800151026     A                                      EDTWRD('  /  /    ')
013900950707     A                                 31113'al'
014000151026     A            S42PDA         8  0  31116
014100151026     A                                      EDTWRD('  /  /    ')
014200950707     A                                 32 59'*'
014300950707     A                                 32136'*'
014400151028     A                                 32 64'   Numero del documento...........-
014500151028     A                                      :'
014600151028     A            S42PND         7  0  32101EDTCDE(4)
014700950707     A                                 33 59'*'
014800950707     A                                 33136'*'
014900151028     A                                 33 64'   Tipo di intestazione...........-
015000151028     A                                      :'
015100151028     A            S42PTI         1     33101
015200950707     A                                 34 59'*'
015300950707     A                                 34136'*'
015400151028     A                                 34 64'   Codice cliente.................-
015500151028     A                                      :'
015600151028     A            S42PCD         7  0  34101EDTCDE(4)
015700950707     A                                 35 59'*'
015800950707     A                                 35136'*'
015900950707     A                                 36 59'*'
016000950707     A                                 36136'*'
016100151028     A                                 36 64'5) Date distinta..................-
016200151028     A                                      :'
016300151028     A            S42DDC         8  0  36101EDTCDE(8)
016400950707     A                                 37 59'*'
016500950707     A                                 37136'*'
016600151028     A                                 37 64'   Numero distinta................-
016700151028     A                                      :'
016800151028     A            S42NDT         7  0  37101EDTCDE(4)
016900950707     A                                 38 59'*'
017000950707     A                                 38136'*'
017100151028     A                                 38 64'   Raggruppamento.................-
017200151028     A                                      :'
017300151028     A            S42RGP         3  0  38101EDTCDE(4)
017400151026     A                                 39 59'*'
017500151026     A                                 39136'*'
017600151026     A                                 40 59'*'
017700151026     A                                 40136'*'
017800151028     A                                 40 64'6) ID bonifico....................-
017900151028     A                                      :'
018000151028     A            S42NBN        15  0  40101EDTCDE(4)
018100151026     A                                 41 59'*                                 -
018200941103     A                                                                         -
018300941103     A                                              *'
018400151026     A                                 42 59'*                                 -
018500941103     A                                                                         -
018600941103     A                                              *'
018700151026     A                                 43 59'* ---------------------------------
018800941103     A                                      ------------------------------------
018900941103     A                                      ------- *'
019000151026     A                                 44 59'*'
019100151026     A                                 44136'*'
019200151026     A                                 45 59'*'
019300151026     A                                 45136'*'
019400151026     A                                 45 64'PARZIALIZZAZIONI:'
019500151026     A                                 46 59'*'
019600151026     A                                 46136'*'
019700151026     A                                 47 59'*'
019800151026     A                                 47136'*'
019900151026     A*//                              47136'*'
020000151028     A                                 47 83'Cod. ABI.......:'
020100151028     A            S42ABI         5  0  47101EDTCDE(4)
020200151026     A                                 48 59'*'
020300151026     A                                 48136'*'
020400151028     A                                 48 83'Cod. CAB.......:'
020500151028     A            S42CAB         5  0  48101EDTCDE(4)
020600151026     A                                 49 59'*'
020700151026     A                                 49136'*'
020800151028     A                                 49 83'Numero Assegno.:'
020900151028     A            S42NRA         4     49101
021000151026     A                                 50 59'*'
021100151026     A                                 50136'*'
021200151028     A                                 50 83'Importo Assegno:'
021300151028     A            S42IMP        13  3  50101EDTCDE(2)
021400151026     A                                 51 59'*'
021500151026     A                                 51136'*'
021600151028     A                                 51 83'Stato C/Assegni:'
021700151028     A            S42TCA         1     51101
021800151028     A            S42DCA        15       + 1
021900151026     A                                 52 59'*                                 -
022000941103     A                                                                         -
022100941103     A                                              *'
022200151026     A                                 53 59'*                                 -
022300941103     A                                                                         -
022400941103     A                                              *'
022500151026     A                                 54 59'*                                 -
022600941103     A                                                                         -
022700941103     A                                              *'
022800151026     A                                 55 59'***--------------------------------
022900941103     A                                      ------------------------------------
023000941103     A                                      ------***'
023100931012     A          R TES00
023200931012     A*__________________________________________________________
023300931012     A* Intestazione Testata Generale
023400931012     A*__________________________________________________________
023500950710     A            RSUT          20      1  1
023600950710     A  02                              1 23'                                **-
023700950710     A                                        STAMPA BOLLE CONTRASSEGNI PER RIF-
023800950710     A                                      ERIM. MITTENTE NUMERICO/DATA SPEDIZ-
023900950710     A                                      IONE  **                           -
024000950710     A                                              '
024100950710     A  03                              1 23'                                  -
024200950710     A                                          **  STAMPA BOLLE CONTRASSEGNI P-
024300950710     A                                      ER DATA SPEDIZIONE/CODICE CLIENTE  -
024400950710     A                                      **                                 -
024500950710     A                                              '
024600950710     A  04                              1 23'                                  -
024700950710     A                                            **  STAMPA BOLLE CONTRASSEGNI-
024800950710     A                                       PER DATA/NUM. DOCUM. PAGAMENTO ** -
024900950710     A                                                                         -
025000950710     A                                              '
025100151026     A  05                              1 23'                                  -
025200151026     A                                                     **  STAMPA BOLLE CON-
025300151026     A                                      TRASSEGNI PER ID BONIFICO  **      -
025400151026     A                                                                         -
025500151026     A                                              '
025600950710     A                                  1156'Pgm:'
025700950710     A            NOMPGM        11      1161
025800950710     A                                  1173'Data :'
025900950710     A                                  1180DATE
026000950710     A                                      EDTWRD('  /  /  ')
026100950710     A                                  1190'Pag:'
026200950710     A            PAGE           4  0   1195
026300950710     A                                      EDTCDE(4)
026400950710     A            KNSIF         10      2  1
026500950710     A            KNMUS         10      2 12
026600950710     A                                  2180TIME
026700950710     A            CM1198       198      4  1
026800931014     A                                      HIGHLIGHT
026900950710     A                                  5  4'Dati  di  Spedizione'
027000931013     A                                      HIGHLIGHT
027100950710     A                                  5 34'Importo'
027200931013     A                                      HIGHLIGHT
027300950710     A                                  5 54'Ass. Incasso'
027400931013     A                                      HIGHLIGHT
027500950710     A                                  5 70'Banca '
027600931013     A                                      HIGHLIGHT
027700950710     A                                  5 82'Tp. '
027800931013     A                                      HIGHLIGHT
027900950710     A                                  5 98'D a t i     C l i e n t e'
028000931013     A                                      HIGHLIGHT
028100950710     A                                  5127'Destinatario'
028200931013     A                                      HIGHLIGHT
028300950710     A                                  5147'D a t i    P a g a m e n t o'
028400931013     A                                      HIGHLIGHT
028500950710     A                                  5180' G i a c e n z a'
028600931013     A                                      HIGHLIGHT
028700950710     A                                  6  1'Lna'
028800941103     A                                      HIGHLIGHT
028900950710     A                                  6  5'Lnp'
029000931013     A                                      HIGHLIGHT
029100950710     A                                  6  9'AA'
029200931013     A                                      HIGHLIGHT
029300950710     A                                  6 12'Nrs'
029400931013     A                                      HIGHLIGHT
029500950710     A                                  6 16'Numero'
029600931013     A                                      HIGHLIGHT
029700950710     A                                  6 23'Data'
029800931013     A                                      HIGHLIGHT
029900950710     A                                  6 32'Contrassegno'
030000931013     A                                      HIGHLIGHT
030100950710     A                                  6 46'Div'
030200941103     A                                      HIGHLIGHT
030300950710     A                                  6 50'Numero'
030400931013     A                                      HIGHLIGHT
030500950710     A                                  6 63'Data'
030600931013     A                                      HIGHLIGHT
030700950710     A                                  6 70'Incasso'
030800931013     A                                      HIGHLIGHT
030900950710     A                                  6 82'Ass.'
031000931013     A                                      HIGHLIGHT
031100950710     A                                  6 88'Rif. Numerico'
031200931013     A                                      HIGHLIGHT
031300950710     A                                  6102' Codice'
031400931013     A                                      HIGHLIGHT
031500950710     A                                  6110'Ragione sociale'
031600931013     A                                      HIGHLIGHT
031700950710     A                                  6127'Ragione sociale'
031800931013     A                                      HIGHLIGHT
031900950710     A                                  6144'Doc.'
032000931013     A                                      HIGHLIGHT
032100950710     A                                  6149' Numero'
032200931013     A                                      HIGHLIGHT
032300950710     A                                  6159'Data'
032400941103     A                                      HIGHLIGHT
032500950710     A                                  6166'Banca'
032600931013     A                                      HIGHLIGHT
032700950710     A                                  6181'Data'
032800931013     A                                      HIGHLIGHT
032900961023     A                                  6188'P.O.'
033000950710     A                                      HIGHLIGHT
033100950710     A                                  6192'Numero'
033200931013     A                                      HIGHLIGHT
033300950710     A            CMP198       198      7  1
033400931013     A                                      HIGHLIGHT
033500950710     A                                  8  1' '
033600931012     A          R DET00
033700931012     A*__________________________________________________________
033800931012     A* DETTAGLIO
033900931012     A*__________________________________________________________
034000120215     A N44        LNA            3  0      1EDTCDE(4)
034100120215     A N44        LNP            3  0      5EDTCDE(4)
034200120215     A N44        AAS            2  0      9EDTCDE(4)
034300120215     A N44        NRS            2  0     12EDTCDE(4)
034400120215     A N44        NSP            7  0     15EDTCDE(4)
034500120215     A N44        DSP            4  0     23EDTWRD('  /  ')
034600120215     A N44        IMP           13  3     29EDTWRD('    .   .   ,   ')
034700120215     A N44        VCA            3        46
034800120215     A            NDC           10        50
034900120215     A            DDC            6  0     61EDTWRD('  /  /  ')
035000120215     A            BAI           12        70
035100120215     A            ASS            2        83
035200120215     A N44        RMN           15  0     86EDTCDE(4)
035300120215     A N44        CDM            7  0    102EDTCDE(4)
035400120215     A N44        RGM           16       110
035500120215     A N44        RGD           16       127
035600120215     A N44        DOC            4       144
035700120215     A N44        NDP            7  0    149EDTCDE(4)
035800120215     A N44        DDP            6  0    157EDTWRD('  /  /  ')
035900120215     A N44        BAP           12       166
036000120215     A N44        DGC            6  0    179EDTWRD('  /  /  ')
036100120215     A N44        FGC            3  0    188EDTCDE(4)
036200120215     A N44        NGC            7  0    192EDTCDE(4)
036300120215     A                                      SPACEA(1)
036400120215     A          R TOT00                     HIGHLIGHT
036500931012     A*__________________________________________________________
036600931012     A* TOTALE
036700931012     A*__________________________________________________________
036800000107     A            CMP198       198         1
036900120215     A                                      SPACEB(1)
037000000107     A                                     1'Totale Contrassegni in'
037100120215     A                                      SPACEB(1)
037200000107     A            DIVCOR         3        25
037300000107     A                                    28':'
037400000107     A            TOT           14  3     28EDTWRD('     .   .   ,   ')
037500000107     A          R TOTE0                     HIGHLIGHT
037600000107     A*__________________________________________________________
037700000107     A* TOTALE
037800000107     A*__________________________________________________________
037900000107     A            CMP198       198         1SPACEB(1)
038000000107     A                                     1'Totale Contrassegni in'
038100000107     A                                      SPACEB(1)
038200000107     A            DIVALT         3        25
038300000107     A                                    28':'
038400000107     A            TOTE          14  3     28EDTWRD('     .   .   ,   ')
038500941103     A          R TOTV0                     HIGHLIGHT
038600941103     A*__________________________________________________________
038700941103     A* TOTALE
038800941103     A*__________________________________________________________
038900000107     A            CMP198       198         1SPACEB(1)
039000941103     A                                     1'Tot. in lire C/A in valuta.:'
039100941103     A                                      SPACEB(1)
039200950710     A            TOTV          14  3     28EDTWRD('     .   .   ,   ')
