000100871021     A*--------------------------------------------------------------*
000200940722     A*  DIZIONARIO  BARTOLINI - NUOVO -                             *
000300840614     A*--------------------------------------------------------------*
000400840614     A          R RECDIZ                    TEXT('DIZIONARIO NOMI CAMPI')
000500890908     A*
000600890908     A*--------------------------------------------------------------*
000700890908     A*§§§ CAMPI BASE §§§                                            *
000800890908     A*--------------------------------------------------------------*
000900940530     A            $AAA           4P 0       TEXT('ANNO')
001000990728     A                                      COLHDG('AA')
001100990728     A                                      EDTCDE(Z)
001200940722     A            $AA4      R               REFFLD($AAA)
001300940722     A                                      COLHDG('ANNO')
001400990728     A                                      EDTCDE(Z)
001500141009     A            $ACM           3          TEXT('FASE CAMPAGNA')
001600141009     A                                      COLHDG('FASE' 'CAMPAGNA')
001700990602     A            $DIV           3A         TEXT('DIVISA')
001800990602     A                                      COLHDG('DIVISA')
001900990427     A            $FIL           3P 0       TEXT('PUNTO OPERATIVO')
002000990427     A                                      COLHDG('P.O.')
002100990728     A                                      EDTCDE(Z)
002200890908     A            $FLA           1A         TEXT('FLAG ALFANUMERICO')
002300890908     A                                      COLHDG('FL.' 'AL.')
002400890908     A            $FLAG          1A         TEXT('FLAG VALIDITA -b/*-')
002500890908     A                                      COLHDG('F')
002600890908     A            $FLN           1P 0       TEXT('FLAG NUMERICO')
002700890908     A                                      COLHDG('FL.' 'NU.')
002800990728     A                                      EDTCDE(Z)
002900940427     A            $GGG           2P 0       TEXT('GIORNO')
003000890908     A                                      COLHDG('GG')
003100990728     A                                      EDTCDE(Z)
003200940629     A            $DAT           6P 0       TEXT('DATA')
003300890908     A                                      COLHDG('DATA')
003400990728     A                                      EDTWRD('  /  /  ')
003500940629     A            $DA8           8P 0       TEXT('DATA')
003600990728     A                                      EDTWRD('    /  /  ')
003700940629     A                                      COLHDG('DATA')
003800910802     A            $HM            4P 0       TEXT('ORE MINUTI')
003900011025     A                                      EDTWRD('  :  ')
004000910802     A                                      COLHDG('ORE' 'MIN')
004100070110     A            $HMD           6P 0       TEXT('ORE MINUTI SECONDI')
004200070110     A                                      EDTWRD('  :  :  ')
004300070110     A                                      COLHDG('ORE' 'MIN' 'SEC')
004400011025     A            $HLV           2P 0       TEXT('ORE LAVORATE NELLA GIORNATA')
004500011025     A                                      EDTCDE(Z)
004600011025     A                                      COLHDG('ORE' 'LAV')
004700910617     A            $IMP           9P 0       TEXT('IMPORTO VALORE')
004800910617     A                                      COLHDG('IMPORTO' 'VAL.')
004900990728     A                                      EDTCDE(K)
005000890908     A            $ISP           5P 0       TEXT('IMPORTO SPESE')
005100890908     A                                      COLHDG('IMPORTO' 'SPESE')
005200990728     A                                      EDTCDE(K)
005300890908     A            $KCC           4P 0       TEXT('CAPO CONTO')
005400890908     A                                      COLHDG('CAPO' 'CONTO')
005500990728     A                                      EDTCDE(Z)
005600890908     A            $KSC           7P 0       TEXT('CODICE SOTTOCONTO')
005700890908     A                                      COLHDG('SOTTO' 'CONTO')
005800990728     A                                      EDTCDE(Z)
005900070109     A            $MIS           3P 0       TEXT('MILLESECONDI IMMISSIONE SPUNT-
006000070109     A                                      A')
006100070109     A                                      COLHDG('MILLES.' 'IMM.' 'SPUNTA')
006200070109     A                                      EDTCDE(Z)
006300890908     A            $MMM           2P 0       TEXT('MESE')
006400890908     A                                      COLHDG('MM')
006500990728     A                                      EDTCDE(Z)
006600890908     A            $NRP           7P 0       TEXT('NUMERO PROTOCOLLO')
006700890908     A                                      COLHDG('NR.PROT.')
006800990728     A                                      EDTCDE(Z)
006900070125     A            $ORA           6P 0       TEXT('ORA')
007000070125     A                                      COLHDG('ORA')
007100070125     A                                      EDTWRD('  :  :  ')
007200940519     A            $PKL           7P 1       TEXT('PESO IN KG')
007300940519     A                                      COLHDG('PESO KG')
007400990728     A                                      EDTCDE(K)
007500080911     A            $MCP           7P 1       TEXT('MASSA COMPLESSIVA KG X AUT/-
007600080911     A                                      AFF/DEF')
007700080911     A                                      COLHDG('MASSA COMP.')
007800080911     A                                      EDTCDE(K)
007900940517     A            $RSC          35A         TEXT('RAGIONE SOCIALE')
008000940517     A                                      COLHDG('RAG.SOCIALE')
008100940720     A            $VLT           3A         TEXT('DIVISA')
008200940720     A                                      COLHDG('DIVISA')
008300940519     A            $VLU           5P 3       TEXT('VOLUME')
008400940519     A                                      COLHDG('VOLUME')
008500990728     A                                      EDTCDE(K)
008600090109     A            $CCKM         11P 5       TEXT('COSTO CARBURANTE AL KM')
008700090109     A                                      COLHDG('C.CARB.KM')
008800090109     A                                      EDTCDE(K)
008900090109     A            $PCAR         11P 5       TEXT('PREZZO CARBURANTE AL LT')
009000090109     A                                      COLHDG('P.CARB.LT')
009100090109     A                                      EDTCDE(K)
009200890908     A*
009300890908     A*---- A ----*
009400130118     A            $AAR      R               TEXT('ANNO RICHIESTA')
009500130118     A                                      COLHDG('ANNO' 'SPED')
009600130118     A                                      REFFLD($AAA)
009700890908     A            $AAS      R               TEXT('ANNO SPEDIZIONE')
009800990728     A                                      COLHDG('ANNO' 'SPED')
009900890908     A                                      REFFLD($AAA)
010000011025     A            $ABA           5          TEXT('COD. ABI ALFA')
010100011025     A                                      COLHDG('ABI')
010200891005     A            $ABI           5P 0       TEXT('COD. ABI ')
010300891005     A                                      COLHDG('ABI')
010400990728     A                                      EDTCDE(Z)
010500940617     A            $ABN      R               TEXT('FLAG ABBINAMENTO')
010600940617     A                                      COLHDG('FLG' 'ABBINAM')
010700940617     A                                      REFFLD($FLA *SRC)
010800990728     A***         $ADG           7P 0       TEXT('ADDIZIONALE GESTIONE')
010900990728     A***                                   COLHDG('ADDIZ.' 'GEST.')
011000990728     A***                                   EDTCDE(K)
011100940629     A            $AED      R               REFFLD($DA8 *SRC)
011200910802     A                                      TEXT('ARRIVO: EFFETTIVA DATA')
011300990728     A                                      COLHDG('ARRIVO EFF' 'DATA')
011400910802     A            $AEH      R               REFFLD($HM  *SRC)
011500910802     A                                      TEXT('ARRIVO: EFFETTIVA ORA')
011600910802     A                                      COLHDG('AR.EFF' 'ORA')
011700940427     A*
011800940427     A* $AFA ---> USATO SOLO NELLE TARIFFE PADRONCINI
011900930916     A            $AFA           5P 0       TEXT('ARROT. FINO A ')
012000930916     A                                      COLHDG('ARR' 'FINO' 'A')
012100990728     A                                      EDTCDE(Z)
012200080205     A            $AFAZ          4P 0       TEXT('ANNO FATTURATO AZIENDA')
012300080205     A                                      COLHDG('ANNOFAT' 'AZIENDA')
012400950130     A            $AGB           2A         TEXT('CAUSALE AGGIORNAMENTO BOLLE')
012500970307     A                                      COLHDG('CAUSA' 'AGG.BOLLE')
012600940427     A*
012700890908     A            $AGE           7P 0       TEXT('CODICE AGENTE')
012800890908     A                                      COLHDG('CODICE AGENTE')
012900990728     A                                      EDTCDE(Z)
013000910930     A            $AIE           1A         TEXT('ANOMALIA INTERNA ESTERNA I/E')
013100910911     A                                      COLHDG('ANOM' 'INT/EST')
013200920513     A            $AIN           1A         TEXT('APPLICAZIONE TARIFFA INOLTRO')
013300920513     A                                      COLHDG('APPL' 'TAR' 'INL')
013400070110     A            $ALFA2         2A         TEXT('ALFANUMERICO 2 BYTE')
013500070110     A                                      COLHDG('ALFA2')
013600070110     A            $ALFA14       14A         TEXT('ALFANUMERICO 14 BYTE')
013700070110     A                                      COLHDG('ALFA14')
013800080305     A            $ALFA17       17A         TEXT('ALFANUMERICO 17 BYTE')
013900080305     A                                      COLHDG('ALFA17')
014000070115     A            $ALFA35       35A         TEXT('ALFANUMERICO 35 BYTE')
014100070115     A                                      COLHDG('ALFA35')
014200070110     A            $ALFA100     100A         TEXT('ALFANUMERICO 100 BYTE')
014300070110     A                                      COLHDG('ALFA100')
014400900327     A            $ALI           3P 1       TEXT('ALIQUOTA IVA')
014500890908     A                                      COLHDG('AL.' 'IVA')
014600990830     A                                      EDTCDE(K)
014700990728     A***         $AN            9P 0       TEXT('ANTICIPATE')
014800990728     A***                                   COLHDG('ANTICIPATE')
014900990728     A***                                   EDTCDE(K)
015000990728     A***         $ANP           7P 0       TEXT('ANTEPORTO')
015100990728     A***                                   COLHDG('ANTEPORTO')
015200990728     A***                                   EDTCDE(K)
015300940427     A*
015400940427     A* $AOL ---> USATO SOLO NELLE TARIFFE PADRONCINI
015500930916     A            $AOL           5P 0       TEXT('ARROT. OLTRE')
015600930916     A                                      COLHDG('ARR' 'OLTRE')
015700990728     A                                      EDTCDE(Z)
015800940427     A*
015900910612     A            $APC      R               REFFLD($FLA *SRC)
016000910612     A                                      TEXT('ADDEBITO PROVV. C/A S/N')
016100910612     A                                      COLHDG('PR.C/A' 'S/N')
016200920520     A            $APL      R               REFFLD($FLA *SRC)
016300920520     A                                      TEXT('CODICE APPLICAZIONE')
016400920520     A                                      COLHDG('COD' 'APPL')
016500990427     A            $APP      R               TEXT('P.O. APPARTENENZA')
016600990427     A                                      COLHDG('P.O.' 'APPART')
016700931007     A                                      REFFLD($FIL *SRC)
016800940427     A*
016900940427     A* $ARA ---> USATO SOLO NELLE TARIFFE PADRONCINI
017000930916     A            $ARA           5P 0       TEXT('ARROT. A')
017100990728     A                                      COLHDG('ARROT' 'A')
017200990728     A                                      EDTCDE(Z)
017300940427     A* $ARF/$ARL/$ARO ---> USATI SOLO NELLE TARIFFE CLIENTI
017400011025     A*    NON È VERO  ---> USATI ANCHE NEI CONTEGGI PADRONCINI
017500990427     A            $ARF          13P 3       TEXT('ARROT. FINO AL LIMITE')
017600990728     A                                      COLHDG('ARROT' 'FINO' 'LIMITE')
017700990728     A                                      EDTCDE(K)
017800990427     A            $ARL          13P 3       TEXT('ARROT. LIMITE')
017900990728     A                                      COLHDG('ARROT' 'LIMITE')
018000990728     A                                      EDTCDE(K)
018100990427     A            $ARO          13P 3       TEXT('ARROT. OLTRE LIMITE')
018200940517     A                                      COLHDG('ARR' 'OLTRE' 'LIMITE')
018300990728     A                                      EDTCDE(K)
018400940517     A*
018500940517     A            $ARS           5P 0       TEXT('ARROT.SCONTO TARIFFA')
018600990728     A                                      COLHDG('ARR' 'SCON' 'TAR')
018700990728     A                                      EDTCDE(Z)
018800931006     A*
018900910612     A            $ASG      R               REFFLD($FLA *SRC)
019000910612     A                                      TEXT('ADDEBITO SPESE GIAC.S/N')
019100910612     A                                      COLHDG('SP.GIAC' 'S/N')
019200990728     A***         $ASS           9P 0       TEXT('CONTRASSEGNO')
019300990728     A***                                   COLHDG('CONTRASS.')
019400990728     A***                                   EDTCDE(K)
019500940517     A            $ATA          13P 3       TEXT('APPLICAZ. TARIFFA FINITA')
019600940517     A                                      COLHDG('APPL' 'TAR' 'FINITA')
019700990728     A                                      EDTCDE(K)
019800940701     A            $ATB           1A         TEXT('FLAG ANNULLAMENTO')
019900940701     A                                      COLHDG('FLG' 'ANN')
020000940517     A* ATF NEI PADRONCINI--> SARA' DA ELIMINARE
020100930810     A            $ATF           5P 0       TEXT('APPLICAZ. TARIFFA FINITA')
020200930810     A                                      COLHDG('APPL' 'TAR' 'FINITA')
020300090514     A            $ATN          11P 0       TEXT('NUM. ATTIVITA')
020400090514     A                                      EDTCDE(K)
020500090514     A                                      COLHDG('NUMERO' 'ATTIVITA')
020600090514     A            $ATNP          3P 0       TEXT('PROGRESSIVO ATTIVITA')
020700090514     A                                      EDTCDE(K)
020800090514     A                                      COLHDG('PROGRESSIVO' 'ATTIVITA')
020900940707     A            $ATR           1A         TEXT('FLAG TRANSITO')
021000940707     A                                      COLHDG('FLG' 'TRANSITO')
021100890908     A*---- B ----*
021200891005     A            $BAB          36A         TEXT('BANCA APPOGGIO BONIFICO C/ASS-
021300891005     A                                      EGNO')
021400891005     A                                      COLHDG('BANCA' 'C/ASS.')
021500970123     A            $BAM           1A         TEXT('FLAG ALLEGA BAM')
021600970123     A                                      COLHDG('FLAG' 'ALL.BAM')
021700940428     A            $BAP      R               TEXT('FLAG BLOC/ARR/PART')
021800941031     A                                      COLHDG('FL' 'BLOC/ARR/PART')
021900940428     A                                      REFFLD($FLA *SRC)
022000120618     A            $BGA      R               TEXT('S=BOLLA GESTIBILE IN ARRIVO -
022100120618     A                                      A=PRESENTE SOLO IN ARR')
022200090213     A                                      COLHDG('GESTIONE' 'IN ARR')
022300090213     A                                      REFFLD($FLA *SRC)
022400890908     A            $BNA           7P 0       TEXT('BANCA ASSEGNO')
022500890908     A                                      COLHDG('BANCA' 'ASSEGNO')
022600890908     A            $BO            9P 0       TEXT('BOLLI')
022700170914     A            $BUCN          3S 0       TEXT('BU CODE NUMERICO')
022800170914     A                                      COLHDG('BU CODE' 'NUM')
022900990728     A***         $BOL           5P 0       TEXT('BOLLO')
023000990728     A***                                   COLHDG('BOLLO')
023100890908     A*---- C ----*
023200911011     A            $CAA           3P 0       TEXT('CAUSALE ANOMALIA')
023300990728     A                                      COLHDG('CAU' 'ANOM')
023400990728     A                                      EDTCDE(Z)
023500891005     A            $CAB           5P 0       TEXT('COD. CAB ')
023600891005     A                                      COLHDG('CAB')
023700990728     A                                      EDTCDE(Z)
023800090514     A            $CAC           2A         TEXT('CAUSALE')
023900090514     A                                      COLHDG('CAUSALE')
024000940517     A            $CAD           9A         TEXT('CAP DESTINATARIO')
024100890908     A                                      COLHDG('CAP' 'DEST')
024200011025     A            $CAF           5          TEXT('COD. CAB ALFA')
024300011025     A                                      COLHDG('CAB')
024400940517     A            $CAM           9A         TEXT('CAP MITTENTE')
024500890908     A                                      COLHDG('CAP' 'MITT')
024600970821     A            $CAN           1A         TEXT('CODICE ANOMALIA SEGNACOLLO')
024700970821     A                                      COLHDG('COD ANOM.' 'SEGNACOLLO')
024800931123     A            $CAP           5P 0       TEXT('CAP')
024900931123     A                                      COLHDG('CAP')
025000970905     A            $CAR           3S 0       TEXT('CODICE AREA')
025100970904     A                                      COLHDG('COD.' 'AREA')
025200990728     A                                      EDTCDE(Z)
025300940520     A            $CAS          13P 3       TEXT('CONTRASSEGNO')
025400940520     A                                      COLHDG('C/ASSEGNO')
025500990728     A                                      EDTCDE(K)
025600910517     A            $CAV           4          TEXT('CAUS.VARIAZ.')
025700910517     A                                      COLHDG('CAUS' 'VAR.')
025800940517     A            $CBO           2A         TEXT('CODICE BOLLA')
025900990728     A                                      COLHDG('COD' 'BOLLA')
026000980507     A            $CBC           3A         TEXT('CAUS. BLOCCO CLIENTE')
026100980507     A                                      COLHDG('CAUS' 'BLOC' 'CLI.')
026200921214     A            $CCA           1A         TEXT('CODICE CONSEGNA ANOMALA')
026300921214     A                                      COLHDG('COD' 'CONS' 'ANOMAL')
026400891005     A            $CCB          16A         TEXT('C/C BONIFICO CONTRASSEGNO')
026500891005     A                                      COLHDG('C/C' 'BONIF.C/ASS')
026600000920     A            $CCC           4P 0       TEXT('COD.CLIENTE CALL CENTER')
026700000920     A                                      COLHDG('CLI.' 'CALL' 'CENT.')
026800990602     A            $CCD      R               REFFLD($KSC *SRC)
026900990602     A                                      TEXT('COD.CLIENTE DESTINATARIO')
027000990602     A                                      COLHDG('COD.' 'CLI.' 'DEST.')
027100910911     A            $CCH           2A         TEXT('CAUSALE CHIUSURA')
027200910911     A                                      COLHDG('CAU' 'CHIUS')
027300891213     A            $CCM      R               REFFLD($KSC *SRC)
027400891213     A                                      TEXT('COD.CLIENTE MITTENTE')
027500891213     A                                      COLHDG('COD.' 'CLI.' 'MITT.')
027600940906     A            $CCN      R               REFFLD($KSC *SRC)
027700940906     A                                      TEXT('COD.CONDUCENTE')
027800940906     A                                      COLHDG('COD' 'CONDUCENTE')
027900990625     A            $CCP           1A         TEXT('CODICE CONSEGNA PARTICOLARE')
028000990625     A                                      COLHDG('COD' 'CONS' 'PARTIC')
028100900331     A            $CCR           3P 0       TEXT('CODICE CORRISPONDENTE')
028200900331     A                                      COLHDG('COD' 'CORR.')
028300990728     A                                      EDTCDE(Z)
028400890919     A            $CDC      R               REFFLD($KSC *SRC)
028500890919     A                                      TEXT('SOTTOCONTO CENTRO DI COSTO')
028600890919     A                                      COLHDG('CENTRO' 'DI' 'COSTO')
028700970821     A            $CDD           2A         TEXT('CODICE DOCUMENTO')
028800970821     A                                      COLHDG('COD.' 'DOCUM.')
028900890908     A            $CDP           3P 0       TEXT('CONDIZIONI PAGAMENTO')
029000890908     A                                      COLHDG('COND.' 'PAG.')
029100910617     A            $CDR           2A         TEXT('CAUSALE RIMBORSO')
029200910617     A                                      COLHDG('CAU' 'RIMB.')
029300031205     A            $CDT           3A         TEXT('CODICE CHIUSURA')
029400031205     A                                      COLHDG('COD' 'CHIUS')
029500900328     A            $CDU           3P 0       TEXT('CODICE UTENTE VIDEO')
029600900328     A                                      COLHDG('COD' 'UT.' 'VID')
029700990728     A                                      EDTCDE(Z)
029800890908     A            $CEI           1A         TEXT('CODICE ESENZIONE IVA')
029900890908     A                                      COLHDG('ES.' 'IVA')
030000930419     A            $CEV           3A         TEXT('CAUSALE EVENTO')
030100930419     A                                      COLHDG('CAUS.' 'EVENTO')
030200900404     A            $CFG           3A         TEXT('CODICE FINE GIACENZA')
030300900404     A                                      COLHDG('COD' 'FINE' 'GIAC.')
030400070123     A            $CGI          10A         TEXT('CODICE GIRO TELLUS')
030500070123     A                                      COLHDG('COD.' 'GIRO')
030600120402     A            $FGM           1A         TEXT('FLAG GIRO MICRO')
030700120402     A                                      COLHDG('FLG' 'GIRO' 'MICRO')
030800890908     A            $CID          15A         TEXT('CITTA'' DESTINATARIO')
030900890908     A                                      COLHDG('CITTA'' DESTIN.')
031000890908     A            $CIF           3P 0       TEXT('COD.ISTITUTO FACTORING')
031100890908     A                                      COLHDG('IST' 'FACT')
031200890908     A            $CIM          15A         TEXT('CITTA'' MITTENTE')
031300890908     A                                      COLHDG('CITTA'' MITT.')
031400940923     A            $CLA           7P 0       TEXT('TOT. COLLI')
031500940923     A                                      COLHDG('TOT' 'COLLI')
031600990728     A                                      EDTCDE(Z)
031700890908     A            $CLV           1A         TEXT('COD.IMPORTANZA CLIENTE')
031800890908     A                                      COLHDG('CD.' 'IMP.' 'CLI')
031900940720     A            $CMB           9  4       TEXT('CAMBIO DIVISA IN LIRE')
032000940720     A                                      COLHDG('CAMBIO')
032100990728     A                                      EDTCDE(K)
032200900330     A            $CMC           3A         TEXT('COD.GIACENZA/MANCATA CONS.')
032300900330     A                                      COLHDG('CD.' 'GIAC')
032400090220     A            $CMD          25A         TEXT('DECODIFICA COMMERCIALE')
032500090211     A                                      COLHDG('DECOD.' 'COMMERC.')
032600890915     A            $CMM      R               TEXT('CODICE COMMERCIALE')
032700890915     A                                      COLHDG('CODICE' 'COMM.LE')
032800890915     A                                      REFFLD($KSC *SRC)
032900940420     A            $CMN           1A         TEXT('CODICE MOTIVO NOTA ACCR.')
033000940209     A                                      COLHDG('CODICE' 'MOTIVO' 'NOTA')
033100940627     A            $CMP           3  0       TEXT('CODICE COMPETENZA')
033200990728     A                                      COLHDG('COD' 'COMP')
033300001019     A            $CMR           2A         TEXT('CAUSALE MANCATO RITIRO')
033400001019     A                                      COLHDG('CAU' 'NON RITIRO')
033500900323     A            $CNU           3P 0       TEXT('CODICE NUMERATORE')
033600900323     A                                      COLHDG('COD' 'NUM')
033700990728     A                                      EDTCDE(Z)
033800900322     A            $CNW           1A         TEXT('COD CLIENTE NUOVO')
033900900322     A                                      COLHDG('CLI' 'NEW')
034000900322     A            $CN1           2A         TEXT('COD NOTE 1')
034100900322     A                                      COLHDG('COD' 'NOT1')
034200900322     A            $CN2           2A         TEXT('COD NOTE 2')
034300900322     A                                      COLHDG('COD' 'NOT2')
034400890908     A            $CON           3A         TEXT('COD.REGIONE')
034500890908     A                                      COLHDG('CD.' 'REG')
034600890915     A            $COP           4A         TEXT('CAUSALE OPERATIVA CONTAB.')
034700890915     A                                      COLHDG('CAU' 'OP.')
034800001019     A            $CPA          15P 3       TEXT('COSTO PATTUITO AUTOTRASPOR.')
034900001019     A                                      COLHDG('COSTO' 'PATTUITO' -
035000001019     A                                      'AUTOTRASPOSRTATORE')
035100001019     A                                      EDTCDE(K)
035200930201     A            $CPI          16A         TEXT('CODICE PARTITA IVA EUROPEA')
035300930201     A                                      COLHDG('PARTITA' 'IVA' 'EUROPEA')
035400920414     A            $CPO          11P 0       TEXT('COD.OPERATORE SEAT (3+8) +
035500920414     A                                      (CODICE POTENZIALE)')
035600990728     A                                      EDTCDE(Z)
035700920414     A                                      COLHDG('COD.' 'OPER.' 'SEAT')
035800921214     A            $CRC           1A         TEXT('COD RISERVA CONSEGNA')
035900921214     A                                      COLHDG('COD.' 'RIS.' 'CONS.')
036000020307     A            $CRE           3A         TEXT('COD RETTIFICA CONT.PADR.')
036100020307     A                                      COLHDG('COD.' 'RETT' 'CONT')
036200000918     A            $CRO          10P 0       TEXT('CODICE CLIENTE RITIRO-
036300000918     A                                      /ORDINANTE')
036400000918     A                                      COLHDG('COD.' 'CLIENTE' 'RITIRO')
036500890908     A            $CSC      R               TEXT('CODICE CLIENTE')
036600890908     A                                      COLHDG('CODICE' 'CLIENTE')
036700890908     A                                      REFFLD($KSC *SRC)
036800940617     A            $CSF           3A         TEXT('CODICE SISTEMA INFORMATIVO')
036900940617     A                                      COLHDG('COD' 'SIST' 'INFORMAT')
037000920514     A            $CTA           1A         TEXT('COD.TIPO AZIONE')
037100920514     A                                      COLHDG('COD' 'TIPO' 'AZIONE')
037200011024     A            $CTD           3A         TEXT('COD.TARIFFE DI DETTAGLIO')
037300011024     A                                      COLHDG('COD' 'TAR.' 'DETT.')
037400011025     A            $CTG           2A         TEXT('CATEGORIA AUTOTRASPORTATORE')
037500011025     A                                      COLHDG('CAT' 'AUT.')
037600900303     A            $CTM           2A         TEXT('COD.TRATTAMENTO MERCE')
037700900303     A                                      COLHDG('COD' 'TRAT.' 'MERCE')
037800890908     A            $CTR           3P 0       TEXT('CODICE TARIFFA')
037900890908     A                                      COLHDG('COD' 'TAR')
038000990830     A                                      EDTWRD('0   ')
038100010201     A            $CTRA          3A         TEXT('CODICE TARIFFA ALFA.')
038200010201     A                                      COLHDG('COD' 'TAR' 'ALFA')
038300890908     A            $CTS           2A         TEXT('CODICE TASSAZIONE')
038400890908     A                                      COLHDG('COD' 'TAS')
038500940720     A            $CVB           2A         TEXT('CAUS.VARIAZ.BOLLE')
038600940720     A                                      COLHDG('CAU' 'VARIAZ' 'BOLLE')
038700890908     A*---- D ----*
038800940617     A            $DAB      R               TEXT('S=DISABILITATO')
038900940617     A                                      COLHDG('S=' 'DISABILITATO')
039000940617     A                                      REFFLD($FLA *SRC)
039100011123     A            $DAC      R               TEXT('DATA CREAZIONE')
039200011123     A                                      COLHDG('DATA' 'CREAZIONE')
039300011123     A                                      REFFLD($DA8 *SRC)
039400011123     A                                      EDTWRD('    /  /  ')
039500090210     A            $DAD      R               TEXT('DATA DA CONTATTARE')
039600090210     A                                      COLHDG('DATA DA' 'CONTATTARE')
039700090210     A                                      REFFLD($DA8 *SRC)
039800090210     A                                      EDTWRD('    /  /  ')
039900090216     A            $DAFP     R               TEXT('DATA AFFIDAMENTO PRESUNTO')
040000090216     A                                      COLHDG('DTA AFFID' 'MERCI' 'PRESUN')
040100090216     A                                      REFFLD($DA8 *SRC)
040200090216     A                                      EDTWRD('    /  /  ')
040300090216     A            $DAFR     R               TEXT('DATA AFFIDAMENTO MERCI REALE')
040400090216     A                                      COLHDG('DTA AFFID.' 'MERCI' 'REALE')
040500090216     A                                      REFFLD($DA8 *SRC)
040600090216     A                                      EDTWRD('    /  /  ')
040700970820     A            $DAP      R               TEXT('DATA APERTURA')
040800970820     A                                      COLHDG('DATA' 'APERTURA')
040900970820     A                                      REFFLD($DA8 *SRC)
041000990830     A                                      EDTWRD('    /  /  ')
041100120615     A            $DAM      R               TEXT('DATA ARRIVO MERCE TERMINAL -
041200910911     A                                      ARRIVO')
041300120615     A                                      COLHDG('ARR.MERCE' 'TERM.ARR')
041400940629     A                                      REFFLD($DA8 *SRC)
041500990830     A                                      EDTWRD('    /  /  ')
041600890908     A            $DAN      R               TEXT('DATA ANNULLAMENTO')
041700890908     A                                      COLHDG('DATA' 'ANN.TO')
041800940707     A                                      REFFLD($DA8 *SRC)
041900990830     A                                      EDTWRD('    /  /  ')
042000910911     A            $DAO      R               TEXT('DATA ANOMALIA')
042100910911     A                                      COLHDG('DATA' 'ANOMALIA')
042200990427     A                                      REFFLD($DA8 *SRC)
042300990830     A                                      EDTWRD('    /  /  ')
042400090211     A            $DAS          10A         TEXT('DESCRIZ. AGGIUNTIVA STATO')
042500090211     A                                      COLHDG('DES' 'AGG.' 'STATO')
042600900912     A            $DAR          25A         TEXT('DESCRIZIONE ARTICOLO')
042700900912     A                                      COLHDG('DES' 'ART')
042800940909     A            $DBG      R               TEXT('P: DATA BOLLA GIAC. - A: DATA-
042900940909     A                                       ESEC.DISP.')
043000940721     A                                      COLHDG('P:BOLLA' 'A:ESEC.')
043100940721     A                                      REFFLD($DA8 *SRC)
043200990830     A                                      EDTWRD('    /  /  ')
043300910109     A            $DBR      R               TEXT('DATA BORDERO'' (PART.DOCUM.)')
043400900327     A                                      COLHDG('DATA' 'BORD.')
043500940629     A                                      REFFLD($DA8 *SRC)
043600990830     A                                      EDTWRD('    /  /  ')
043700970820     A            $DCC      R               TEXT('DATA CHIUSURA CA')
043800970820     A                                      COLHDG('DATA' 'CHIUSURA' 'CA')
043900970820     A                                      REFFLD($DA8 *SRC)
044000990830     A                                      EDTWRD('    /  /  ')
044100940520     A            $DCE      R               TEXT('DATA CONSEGNA PREVISTA CLIENT+
044200940520     A                                      E')
044300940520     A                                      COLHDG('DATA' 'CONS' 'PREV.CLI')
044400940629     A                                      REFFLD($DA8 *SRC)
044500990830     A                                      EDTWRD('    /  /  ')
044600940520     A            $DCI      R               TEXT('DATA CONSEGNA PREVISTA INTERN+
044700940520     A                                      A')
044800940520     A                                      COLHDG('DATA' 'CONS' 'PREV.INT')
044900940629     A                                      REFFLD($DA8 *SRC)
045000990830     A                                      EDTWRD('    /  /  ')
045100940721     A            $DCG      R               TEXT('DATA CHIUSURA GIACENZA IN +
045200940721     A                                      ARRIVO')
045300900330     A                                      COLHDG('DATA' 'CHIUS' 'GIAC.')
045400940629     A                                      REFFLD($DA8 *SRC)
045500990830     A                                      EDTWRD('    /  /  ')
045600970820     A            $DCH      R               TEXT('DATA CHIUSURA')
045700970820     A                                      COLHDG('DT.CHIUSURA')
045800970820     A                                      REFFLD($DA8 *SRC)
045900990830     A                                      EDTWRD('    /  /  ')
046000940616     A            $DCM      R               TEXT('DATA CONSEGNA MERCE REALE')
046100940616     A                                      COLHDG('DATA' 'CONS' 'MERCE' )
046200940629     A                                      REFFLD($DA8 *SRC)
046300990830     A                                      EDTWRD('    /  /  ')
046400011024     A            $DCN      R               TEXT('DATA CONVALIDA TARIFFA')
046500011024     A                                      COLHDG('DATA' 'CONV' 'TARIF' )
046600011024     A                                      REFFLD($DA8 *SRC)
046700011024     A                                      EDTWRD('    /  /  ')
046800921214     A            $DCP      R               TEXT('DATA 1A CONSEGNA PARZIALE')
046900921214     A                                      COLHDG('DATA' 'CONS.' 'PARZ.')
047000940629     A                                      REFFLD($DA8 *SRC)
047100990830     A                                      EDTWRD('    /  /  ')
047200090211     A            $DCO      R               TEXT('DATA CONTATTO')
047300090211     A                                      COLHDG('DATA ' 'CONTATTO')
047400090211     A                                      REFFLD($DA8 *SRC)
047500090211     A                                      EDTWRD('    /  /  ')
047600921215     A            $DCR      R               COLHDG('DATA' 'CONS.RICH')
047700921215     A                                      TEXT('DATA CONSEGNA RICHIESTA')
047800940629     A                                      REFFLD($DA8 *SRC)
047900990830     A                                      EDTWRD('    /  /  ')
048000940616     A            $DCS      R               TEXT('DATA CARICAMENTO SPUNTA')
048100940616     A                                      COLHDG('DATA' 'CARIC' 'SPUNTA')
048200940629     A                                      REFFLD($DA8 *SRC)
048300990830     A                                      EDTWRD('    /  /  ')
048400921214     A            $DCV      R               TEXT('DATA CONFERMA VISITA')
048500921214     A                                      COLHDG('DT.CON.' 'VIS.')
048600940629     A                                      REFFLD($DA8 *SRC)
048700990830     A                                      EDTWRD('    /  /  ')
048800970820     A            $DDC      R               TEXT('DATA DOCUMENTO')
048900970820     A                                      COLHDG('DATA' 'DOCUMENTO')
049000940629     A                                      REFFLD($DA8 *SRC)
049100990830     A                                      EDTWRD('    /  /  ')
049200990918     A            $DDE      R               TEXT('DATA DECORRENZA')
049300990918     A                                      COLHDG('DATA' 'DECORRENZA')
049400990918     A                                      REFFLD($DA8 *SRC)
049500990918     A                                      EDTWRD('    /  /  ')
049600900330     A            $DDM      R               TEXT('DATA DISPOSIZIONI MITTENTE')
049700900330     A                                      COLHDG('DATA' 'DISP.' 'MITT.')
049800940721     A                                      REFFLD($DA8 *SRC)
049900990830     A                                      EDTWRD('    /  /  ')
050000910911     A            $DDP      R               TEXT('DATA PAGAMENTO C/ASSEGNO')
050100910911     A                                      COLHDG('DT.PAG.' 'C/ASS.')
050200940913     A                                      REFFLD($DA8 *SRC)
050300990830     A                                      EDTWRD('    /  /  ')
050400940621     A            $DDT      R               TEXT('DATA DECORRENZA TARIFFA')
050500890908     A                                      COLHDG('DATA' 'DECOR.' 'TAR.')
050600940629     A                                      REFFLD($DA8 *SRC)
050700940621     A            $DDS      R               TEXT('DATA DI STAMPA')
050800940621     A                                      COLHDG('DATA' 'STAMPA')
050900940629     A                                      REFFLD($DA8 *SRC)
051000990830     A                                      EDTWRD('    /  /  ')
051100981019     A            $DDR      R               TEXT('DATA DI RISTAMPA')
051200981019     A                                      COLHDG('DATA' 'RISTAMPA')
051300981019     A                                      REFFLD($DA8 *SRC)
051400990830     A                                      EDTWRD('    /  /  ')
051500940909     A            $DED      R               TEXT('DATA ESEGUIBILITA DISPOS. +
051600940909     A                                      GIAC.')
051700940901     A                                      COLHDG('DATA' 'DISP.' 'ESEGUIB')
051800940901     A                                      REFFLD($DA8 *SRC)
051900990830     A                                      EDTWRD('    /  /  ')
052000921215     A            $DET      R               TEXT('DATA ENTRATA AL TRANSITO')
052100921215     A                                      COLHDG('DATA' 'ENTRATA' 'TRANS')
052200940629     A                                      REFFLD($DA8 *SRC)
052300990830     A                                      EDTWRD('    /  /  ')
052400930419     A            $DEV      R               TEXT('DATA EVENTO')
052500930419     A                                      COLHDG('DATA' 'EVENTO')
052600990830     A                                      REFFLD($DA8 *SRC)
052700990830     A                                      EDTWRD('    /  /  ')
052800970821     A            $DFC      R               TEXT('DATA FASE CA')
052900970821     A                                      COLHDG('DATA' 'FASE CA')
053000970821     A                                      REFFLD($DA8 *SRC)
053100990830     A                                      EDTWRD('    /  /  ')
053200890908     A            $DFT      R               TEXT('DATA FATTURA')
053300990728     A                                      COLHDG('DATA' 'FATTURA')
053400990728     A                                      EDTWRD('    /  /  ')
053500940629     A                                      REFFLD($DA8 *SRC)
053600970821     A            $DFV      R               TEXT('DATA FOGLIO')
053700940906     A                                      COLHDG('DATA' 'FOGLIO')
053800940629     A                                      REFFLD($DA8 *SRC)
053900990830     A                                      EDTWRD('    /  /  ')
054000170913     A            $DGS      R               TEXT('DATA GESTIONE SOLO IN SED')
054100170913     A                                      COLHDG('DATA' 'GEST.' 'SEDE')
054200170913     A                                      REFFLD($DA8 *SRC)
054300170913     A                                      EDTWRD('    /  /  ')
054400160916     A            $DIA      R               TEXT('DATA IMMISS.SPUNTA ARRIVO')
054500160916     A                                      COLHDG('DATA' 'IMMIS' 'SPU.ARRIVO')
054600160916     A                                      REFFLD($DA8 *SRC)
054700160916     A                                      EDTWRD('    /  /  ')
054800160916     A            $DIE      R               TEXT('DATA IMMISS.SPUNTA ENTRATA')
054900160916     A                                      COLHDG('DATA' 'IMMIS' 'SPU.ENTRATA')
055000160916     A                                      REFFLD($DA8 *SRC)
055100160916     A                                      EDTWRD('    /  /  ')
055200940209     A            $DIN      R               TEXT('DATA IMMISSIONE NOTA ACCR.')
055300940209     A                                      COLHDG('DATA' 'IMM.' 'NOTA')
055400980527     A                                      REFFLD($DA8 *SRC)
055500990830     A                                      EDTWRD('    /  /  ')
055600940706     A            $DIM      R               TEXT('DATA IMMISSIONE')
055700940706     A                                      COLHDG('DATA' 'IMMISS')
055800940706     A                                      REFFLD($DA8 *SRC)
055900990830     A                                      EDTWRD('    /  /  ')
056000940901     A            $DIS           1A         TEXT('DISPOSIZIONI GIAC. R/C/D')
056100990830     A                                      COLHDG('DISP.' 'GIAC.')
056200970904     A            $DIT           1A         TEXT('DISTRETTO')
056300970904     A                                      COLHDG('DISTRETTO')
056400940927     A*
056500921214     A            $DLA      R               TEXT('DATA LASCIATO AVVISO')
056600921214     A                                      COLHDG('DAT' 'LASC.' 'AVV')
056700940629     A                                      REFFLD($DA8 *SRC)
056800990830     A                                      EDTWRD('    /  /  ')
056900940721     A            $DLD      R               TEXT('DATA TRASM. DISPOS. +
057000900404     A                                      FIL.ARRIVO')
057100940721     A                                      COLHDG('DT.TR' 'DISP.' 'FIL.ARR.')
057200940721     A                                      REFFLD($DA8 *SRC)
057300990830Ù    A                                      EDTWRD('    /  /  ')
057400940721     A            $DLM      R               TEXT('P: ST.LETT.CHIUS.- A: ST. X+
057500940909     A                                       MAGAZ.GIAC.')
057600940721     A                                      COLHDG('P:ST.CHIU' 'A:ST.MAG.')
057700940721     A                                      REFFLD($DA8 *SRC)
057800990830     A                                      EDTWRD('    /  /  ')
057900090213     A            $DMF      R               TEXT('DATA MANIFEST')
058000090213     A                                      COLHDG('DATA' 'MANIFEST')
058100090213     A                                      REFFLD($DA8 *SRC)
058200090213     A                                      EDTWRD('    /  /  ')
058300940629     A            $DMI      R               TEXT('DATA MANDATO INTROITO') +
058400940629     A                                      COLHDG('DATA' 'MANDATO' 'INTROITO')
058500940629     A                                      REFFLD($DA8 *SRC)
058600990830     A                                      EDTWRD('    /  /  ')
058700900330     A            $DMM      R               TEXT('DATA ST.MODULO MITTENTE +
058800900330     A                                      GIACENZA')
058900900330     A                                      COLHDG('DATA' 'ST.LETT' 'CH.GIAC')
059000940721     A                                      REFFLD($DA8 *SRC)
059100990830     A                                      EDTWRD('    /  /  ')
059200980907     A            $DNE      R               TEXT('DATA FURTO/SMARRIMENTO')
059300980907     A                                      COLHDG('DTA' 'FURTO' 'SMARR')
059400980907     A                                      REFFLD($DA8 *SRC)
059500990830     A                                      EDTWRD('    /  /  ')
059600890919     A            $DPA      R               TEXT('DATA RIF.PARTITA')
059700890919     A                                      COLHDG('DATA' 'RIF.' 'PART.')
059800890919     A                                      REFFLD($DAT *SRC)
059900170914     A            $DPE           3          TEXT('VERSIONE ETICHETTA DPD')
060000170914     A                                      COLHDG('VERSIONE' 'ETICH' 'DPD')
060100940621     A            $DPC      R               TEXT('DATA PARTENZA PRIMO COLLO')
060200940621     A                                      COLHDG('PART' 'PRIMO' 'COLLO')
060300940629     A                                      REFFLD($DA8 *SRC)
060400990830     A                                      EDTWRD('    /  /  ')
060500981019     A            $DPL      R               TEXT('DATA ACCETTAZIONE PROGETTO -
060600970820                                            LIQUIDAZIONE')
060700981019     A                                      COLHDG('DATA' 'ACCETTAZ.' 'LIQUID.')
060800970820     A                                      REFFLD($DA8 *SRC)
060900990830     A                                      EDTWRD('    /  /  ')
061000920514     A            $DPO      R               TEXT('DATA PRESENTAZIONE OFFERTA')
061100920514     A                                      COLHDG('DATA' 'PRES' 'OFF')
061200940804     A                                      REFFLD($DA8 *SRC)
061300990830     A                                      EDTWRD('    /  /  ')
061400890908     A            $DPR      R               TEXT('DATA PROTOCOLLO CLIENTE')
061500890908     A                                      COLHDG('DT.PROT.CLI.')
061600890908     A                                      REFFLD($DAT *SRC)
061700890908     A            $DPS      R               TEXT('DATA PRIMA SPEDIZ.FATT.')
061800890908     A                                      COLHDG('DT.PRIMA' 'SPED.FT.')
061900890908     A                                      REFFLD($DAT *SRC)
062000951006     A            $DRA      R               TEXT('DATA REALE ARRIVO')
062100951006     A                                      COLHDG('DATA' 'REALE.ARR')
062200951006     A                                      REFFLD($DA8 *SRC)
062300990830     A                                      EDTWRD('    /  /  ')
062400921214     A            $DRC      R               TEXT('DATA RISERVA CONSEGNA')
062500910617     A                                      COLHDG('DATA' 'RISERVA' 'CONS.')
062600910617     A                                      REFFLD($DAT *SRC)
062700940909     A            $DRE      R               TEXT('DATA REGISTRAZIONE')
062800940909     A                                      COLHDG('DATA' 'REG.')
062900940909     A                                      REFFLD($DA8 *SRC)
063000990830     A                                      EDTWRD('    /  /  ')
063100890919     A            $DRG      R               TEXT('DATA REGISTRAZIONE')
063200890919     A                                      COLHDG('DATA' 'REG.')
063300890919     A                                      REFFLD($DAT *SRC)
063400951006     A            $DRP      R               TEXT('DATA REALE PARTENZA')
063500951006     A                                      COLHDG('DATA' 'REALE.PART')
063600951006     A                                      REFFLD($DA8 *SRC)
063700990830     A                                      EDTWRD('    /  /  ')
063800921215     A            $DRT      R               TEXT('DATA RITIRO MERCE')
063900900327     A                                      COLHDG('DATA' 'RIT.' 'MERCE')
064000940629     A                                      REFFLD($DA8 *SRC)
064100990830     A                                      EDTWRD('    /  /  ')
064200970821     A            $DRZ      R               TEXT('DATA RICEZIONE')
064300970821     A                                      COLHDG('DATA' 'RICEZ')
064400970821     A                                      REFFLD($DA8 *SRC)
064500990830     A                                      EDTWRD('    /  /  ')
064600900331     A            $DSA      R               TEXT('DATA SOSTA -AL-')
064700900331     A                                      COLHDG('DATA' 'SOSTA' '-AL-')
064800940721     A                                      REFFLD($DA8 *SRC)
064900990830     A                                      EDTWRD('    /  /  ')
065000890919     A            $DSC      R               TEXT('DATA SCADENZA')
065100890919     A                                      COLHDG('DATA' 'SCAD.')
065200890919     A                                      REFFLD($DAT *SRC)
065300070119     A            $DSCAD    R               TEXT('DATA SCADENZA')
065400070119     A                                      COLHDG('DATA' 'SCADENZA')
065500070119     A                                      REFFLD($DA8 *SRC)
065600070119     A                                      EDTWRD('    /  /  ')
065700900331     A            $DSD      R               TEXT('DATA SOSTA -DAL-')
065800900331     A                                      COLHDG('DATA' 'SOSTA' '-DAL-')
065900990830     A                                      REFFLD($DA8 *SRC)
066000990830     A                                      EDTWRD('    /  /  ')
066100910911     A            $DSE      R               TEXT('DATA SPUNTA ENTRATA')
066200910911     A                                      COLHDG('DATA' 'SPUNTA' 'ENTRATA')
066300940629     A                                      REFFLD($DA8 *SRC)
066400990830     A                                      EDTWRD('    /  /  ')
066500940621     A            $DSF          35A         TEXT('DESCRIZIONE FOGLIO')
066600940621     A                                      COLHDG('DESCR' 'FOGLIO')
066700890908     A            $DSP      R               TEXT('DATA SPEDIZIONE')
066800890908     A                                      COLHDG('DATA' 'SPED')
066900890908     A                                      REFFLD($DAT *SRC)
067000940621     A            $DST      R               TEXT('DATA SCADENZA TARIFFA')
067100890908     A                                      COLHDG('DATA' 'SCAD.' 'TAR.')
067200940629     A                                      REFFLD($DA8 *SRC)
067300990830     A                                      EDTWRD('    /  /  ')
067400940721     A            $DSZ          50A         TEXT('DISPOSIZIONI ')
067500900331     A                                      COLHDG('DISPOSIZIONI')
067600940913     A            $DTA      R               TEXT('DATA ARRIVO DIST. C/ASS.')
067700940913     A                                      COLHDG('D.ARR.' 'DIS.C/A')
067800940913     A                                      REFFLD($DA8 *SRC)
067900990830     A                                      EDTWRD('    /  /  ')
068000090213     A            $DTC      R               TEXT('DATA TRASMISSIONE AL CLIENTE')
068100090213     A                                      COLHDG('DATA' 'TRASM.''CLI')
068200090213     A                                      REFFLD($DA8 *SRC)
068300090213     A                                      EDTWRD('    /  /  ')
068400890908     A            $DTE      R               TEXT('DATA EMISSIONE ASSEGNO')
068500890908     A                                      COLHDG('DATA' 'EMIS.' 'ASS.')
068600940909     A                                      REFFLD($DA8 *SRC)
068700990830     A                                      EDTWRD('    /  /  ')
068800930407     A            $DTI      R               TEXT('DATA ARRIVO DELLA TRAZIONE')
068900940520     A                                      COLHDG('DATA' 'ARRIVO' 'TRAZ')
069000940629     A                                      REFFLD($DA8 *SRC)
069100990830     A                                      EDTWRD('    /  /  ')
069200951006     A            $DTN      R               TEXT('DATA TRAINO')
069300951006     A                                      COLHDG('DATA' 'TRAINO')
069400951006     A                                      REFFLD($DA8 *SRC)
069500990830     A                                      EDTWRD('    /  /  ')
069600951006     A            $DTP      R               TEXT('DATA TEORICA PARTENZA')
069700951006     A                                      COLHDG('DATA' 'TEOR.PART')
069800940906     A                                      REFFLD($DA8 *SRC)
069900990830     A                                      EDTWRD('    /  /  ')
070000090213     A            $DTR      R               TEXT('DATA TRASMISSIONE')
070100090213     A                                      COLHDG('DATA' 'TRASM.')
070200940629     A                                      REFFLD($DA8 *SRC)
070300990830     A                                      EDTWRD('    /  /  ')
070400011024     A            $DTS      R               TEXT('DATA STAMPA TARIFFA')
070500011024     A                                      COLHDG('DATA' 'ST.TAR.')
070600011024     A                                      REFFLD($DA8 *SRC)
070700011024     A                                      EDTWRD('    /  /  ')
070800951023     A            $DTT      R               TEXT('DATA TRATTA')
070900951023     A                                      COLHDG('DATA' 'TRATTA')
071000951023     A                                      REFFLD($DA8 *SRC)
071100990830     A                                      EDTWRD('    /  /  ')
071200940720     A            $DTV      R               TEXT('DATA VARIAZIONE')
071300910517     A                                      COLHDG('DATA' 'VARIAZ.')
071400940630     A                                      REFFLD($DA8 *SRC)
071500990830     A                                      EDTWRD('    /  /  ')
071600070125     A            $DTVDIS   R               TEXT('DATA AGGIORNAMENTO DISTINTA')
071700070125     A                                      COLHDG('DATA AGG.' 'DISTINTA')
071800070125     A                                      REFFLD($DA8 *SRC)
071900070125     A            $DTVTEL   R               TEXT('DATA AGGIORNAMENTO TELLUS')
072000070125     A                                      COLHDG('DATA AGG.' 'TELLUS')
072100070125     A                                      REFFLD($DA8 *SRC)
072200940621     A            $DUC      R               TEXT('DATA PARTENZA ULTIMO COLLO')
072300940621     A                                      COLHDG('PART' 'ULTIMO' 'COLLO')
072400940629     A                                      REFFLD($DA8 *SRC)
072500990830     A                                      EDTWRD('    /  /  ')
072600990427     A            $DUE      R               TEXT('DATA ULTIMA ELABORAZIONE')
072700990427     A                                      COLHDG('DATA' 'ULTIMA' 'ELAB.')
072800990427     A                                      REFFLD($DA8 *SRC)
072900990830     A                                      EDTWRD('    /  /  ')
073000080205     A            $DUNS          9A         TEXT('CODICE DUNS')
073100080205     A                                      COLHDG('DUNS')
073200940909     A            $DUR      R               TEXT('DATA ULTIMA RIAPERT.GIAC.')
073300940909     A                                      COLHDG('DATA' 'RIAP.' 'GIAC.')
073400940909     A                                      REFFLD($DA8 *SRC)
073500990830     A                                      EDTWRD('    /  /  ')
073600890908     A            $DUS      R               TEXT('DATA ULTIMA SPEDIZ.FATT.')
073700890908     A                                      COLHDG('DT.ULT.' 'SPED.FT.')
073800890908     A                                      REFFLD($DAT *SRC)
073900921215     A            $DUT      R               TEXT('DATA USCITA DAL TRANSITO')
074000921215     A                                      COLHDG('DATA' 'USCITA' 'TRANS')
074100940629     A                                      REFFLD($DA8 *SRC)
074200990830     A                                      EDTWRD('    /  /  ')
074300990623     A            $DFS      R               TEXT('DATA SPUNTA FISICA')
074400990623     A                                      COLHDG('DATA' 'SPUNTA' 'FISICA')
074500990623     A                                      REFFLD($DA8 *SRC)
074600990830     A                                      EDTWRD('    /  /  ')
074700990728     A            $DUV      R               TEXT('DATA ULTIMA VARIAZIONE')
074800890908     A                                      COLHDG('DATA' 'ULT.' 'VAR.')
074900990728     A                                      REFFLD($DA8 *SRC)
075000990830     A                                      EDTWRD('    /  /  ')
075100940804     A* DVI --> LUNGA 6,0  UTILIZZATA IN TFCPO00F
075200900322     A            $DVI      R               TEXT('DATA VISITA')
075300900322     A                                      COLHDG('DATA' 'VIS.')
075400981119     A                                      REFFLD($DA8 *SRC)
075500900404     A            $DXD      R               TEXT('DATA COMUNIC.INTERNA GIAC.+
075600900404     A                                      FIL.ARR.')
075700900404     A                                      COLHDG('DATA' 'COM.INT' 'FIL.ARR.')
075800940721     A                                      REFFLD($DA8 *SRC)
075900890908     A*-----E-----*
076000940804     A            $EDS           1A         TEXT('ECC/DIFETTO ARR. SCONTO')
076100900419     A                                      COLHDG('E/D' 'ARR' 'SCONTO')
076200890908     A            $EID           5P 0       TEXT(' LIMITE IVA DIFETTO')
076300890908     A                                      COLHDG('LIM' 'IVA' 'DIFETTO')
076400890908     A            $EIE           5P 0       TEXT('LIMITE IVA ECCESSO')
076500890908     A                                      COLHDG('LIM' 'IVA' 'ECC')
076600980928     A            $ESI           1A         TEXT('ESITO')
076700980928     A                                      COLHDG('ESITO')
076800890908     A            $ETE           5P 0       TEXT('LIMITE ERRORE TOT.ESIGERE')
076900890908     A                                      COLHDG('LIM' 'ERR' 'T.ES.')
077000890908     A*---- F ----*
077100890908     A            $FAB      R               TEXT('FLAG BOLLO R.B.')
077200890908     A                                      COLHDG('F' 'B')
077300890908     A                                      REFFLD($FLN *SRC)
077400890908     A            $FAC      R               TEXT('FL.ASSICUR.X CONTO  ADDEB. IN+
077500890908     A                                      FATT. S/N')
077600890908     A                                      COLHDG('FLAG ASS.' 'X CONTO')
077700890908     A                                      REFFLD($FLA *SRC)
077800940802     A            $FAF      R               TEXT('FLAG APPLICAZIONE FRANCHIGIA')
077900940802     A                                      COLHDG('F' 'APPLIC' 'FRANCH')
078000940802     A                                      REFFLD($FLA *SRC)
078100890908     A            $FAG      R               TEXT('FLAG A.GESTIONE')
078200890908     A                                      COLHDG('F' 'AG')
078300890908     A                                      REFFLD($FLA *SRC)
078400911011     A            $FAN      R               TEXT('FASE ANOMALIA')
078500911011     A                                      COLHDG('FAS' 'ANOM')
078600911011     A                                      REFFLD($FLA *SRC)
078700940927     A            $FAP      R               TEXT('FL.ANTEPORTO')
078800940927     A                                      COLHDG('FLG' 'ANTEPORTO')
078900891213     A                                      REFFLD($FLA *SRC)
079000970820     A            $FAS           3P 0       TEXT('FASE')
079100970820     A                                      COLHDG('FASE')
079200990728     A                                      EDTCDE(Z)
079300070119     A            $FASD          3A         TEXT('FASE DISTINTA')
079400070119     A                                      COLHDG('FASE DIST.')
079500090213     A            $FAR           2A         TEXT('FASE AVANZAMENTO RECLAMI')
079600040119     A                                      COLHDG('FASE')
079700911008     A            $FBR      R               TEXT('S=BOLLA RIENTRO')
079800911008     A                                      COLHDG('BOL' 'RIEN')
079900911030     A                                      REFFLD($FLA *SRC)
080000070119     A            $FCA      R               TEXT('FLAG CARICO S/N')
080100070119     A                                      COLHDG('FLG' 'CARICO')
080200900331     A                                      REFFLD($FLA *SRC)
080300070119     A            $FCF      R               TEXT('FLAG CHIUSURA FOGLIO')
080400070119     A                                      COLHDG('FLG' 'CHIUS' 'FOGLIO')
080500070119     A                                      REFFLD($FLA *SRC)
080600910802     A            $FCI      R               TEXT('FLAG CONTROLLO INVENTARIO')
080700910802     A                                      COLHDG('F' 'CONT' 'IDA')
080800910802     A                                      REFFLD($FLA *SRC)
080900940617     A* FLC DA ANNULLARE
081000890908     A            $FCL      R               TEXT('TIPO CLIENTE')
081100890908     A                                      COLHDG('TIPO' 'CLI')
081200890908     A                                      REFFLD($FLN *SRC)
081300000810     A            $FCM      R               TEXT('S=MERCE PORTATA A MAGAZZINO D-
081400000810     A                                      AL CLIENTE')
081500000810     A                                      COLHDG('F' 'MER' 'MAG')
081600000810     A                                      REFFLD($FLA *SRC)
081700990427     A            $FCP      R               TEXT('P.O.COMPETENTE PAGAMENTO')
081800990427     A                                      COLHDG('P.O.' 'COMP' 'PAG')
081900900331     A                                      REFFLD($FIL *SRC)
082000990602     A            $FDA      R               TEXT('S=ESISTE PRATICA DI DANNO')
082100990602     A                                      COLHDG('ESISTE' 'C.A')
082200990602     A                                      REFFLD($FLA *SRC)
082300941122     A            $FDN      R               TEXT('S= MERCE PORTATA A MAGAZZINO')
082400990602     A                                      COLHDG('MERCE' 'A MAG')
082500940718     A                                      REFFLD($FLA *SRC)
082600990427     A            $FEA      R               TEXT('ELABORATORE ARRIVO')
082700990427     A                                      COLHDG('ELAB.' 'ARR.')
082800910109     A                                      REFFLD($FIL *SRC)
082900890908     A            $FEI      R               TEXT('FLAG ESENZIONE IVA')
083000890908     A                                      COLHDG('E' 'I')
083100890908     A                                      REFFLD($FLA *SRC)
083200970821     A            $FEV      R               TEXT('P.O. CHE ESEGUE VARIAZ.')
083300970821     A                                      COLHDG('P.O.' 'ESEG.' 'VAR.')
083400910517     A                                      REFFLD($FIL *SRC)
083500080205     A            $FFAZ          1A         TEXT('FLAG FATTURATO AZIENDA:S-STIM-
083600080205                                            ATO D-DICHIARATO')
083700080205     A                                      COLHDG('FLAGFAT' 'STI/DIC')
083800051108     A            $FFD      R               TEXT('FERMO DEPOSITO')
083900900327     A                                      COLHDG('F' 'F' 'D')
084000900327     A                                      REFFLD($FLA *SRC)
084100890908     A            $FFT      R               TEXT('FREQ.FATT. 0=GIORN,1=SE-
084200890908     A                                      TT,2=DECAD,3=QUIND,4=MENS')
084300890908     A                                      COLHDG('FREQ.FT.')
084400890908     A                                      REFFLD($FLN *SRC)
084500980831     A            $FFZ      R               TEXT('S=FITTIZIO')
084600980831     A                                      COLHDG('FL' 'FITTIZIO')
084700980831     A                                      REFFLD($FLA *SRC)
084800911030     A            $FGC           1A         TEXT('S=HA AVUTO GIACENZA')
084900911030     A                                      COLHDG('S=' 'GIAC.')
085000080205     A            $FGIU          3A         TEXT('FORMA GIURIDICA')
085100080205     A                                      COLHDG('FORMA IAC.')
085200931011     A            $FGR      R               TEXT('FLAG GIORNATA')
085300931011     A                                      COLHDG('FLG' 'GIORNATA')
085400931011     A                                      REFFLD($FLA *SRC)
085500990427     A            $FGS      R               TEXT('P.O. GESTIONE')
085600990427     A                                      COLHDG('P.O' 'GESTIONE')
085700940616     A                                      REFFLD($FIL *SRC)
085800931005     A            $FIA      R               TEXT('FLAG IMPORTO TASSAZ. +
085900931005     A                                      ACCESSORI')
086000931005     A                                      COLHDG('F' 'TASSAZ' 'ACCESS')
086100890908     A                                      REFFLD($FLA *SRC)
086200890908     A            $FIC      R               TEXT('FLAG INPUTAZIONE CONTABILE')
086300890908     A                                      COLHDG('F' 'I' 'C')
086400890908     A                                      REFFLD($FLA *SRC)
086500940428     A            $FIE      R               TEXT('FLAG ITALIA/ESTERO')
086600940517     A                                      COLHDG('FL' 'ITA/EST')
086700940428     A                                      REFFLD($FLA *SRC)
086800940927     A            $FIN      R               TEXT('FL.INOLTRO')
086900940927     A                                      COLHDG('FLF' 'INOLTRO')
087000890908     A                                      REFFLD($FLA *SRC)
087100911001     A            $FIP      R               TEXT('FL.INC.PARZ.: A=ABB./C=N.C. +
087200911001     A                                      I=INCASSO N=NULLA')
087300911001     A                                      COLHDG('FL.' 'IN.' 'PARZ.')
087400911001     A                                      REFFLD($FLA *SRC)
087500940517     A            $FIS      R               TEXT('FLAG IMPORTO DA ASSICURARE')
087600940517     A                                      COLHDG('FL' 'IMP' 'DA ASSIC')
087700940517     A                                      REFFLD($FLA *SRC)
087800931005     A            $FIT      R               TEXT('FLAG IMPORTO TASSAZ. +
087900931005     A                                      TARIFFA')
088000931005     A                                      COLHDG('F' 'TASSAZ' 'TAR')
088100890908     A                                      REFFLD($FLA *SRC)
088200990427     A            $FIV      R               TEXT('P.O. IVA')
088300990427     A                                      COLHDG('P.O.' 'IVA')
088400890913     A                                      REFFLD($FIL *SRC)
088500990427     A            $FLB      R               TEXT('P.O. BOLLETTAZIONE')
088600990427     A                                      COLHDG('P.O.' 'BOLLET.')
088700930201     A                                      REFFLD($FIL *SRC)
088800070110     A            $FLE      R               TEXT('TERMINAL PARTENZA')
088900070110     A                                      COLHDG('TERM' 'PART.')
089000890908     A                                      REFFLD($FIL *SRC)
089100890908     A            $FLI      R               TEXT('FLAG ISTAT')
089200890908     A                                      COLHDG('FL' 'ISTAT')
089300890908     A                                      REFFLD($FLN *SRC)
089400160916     A            $FLNAP    R               TEXT('FIL. SPUNTA ARRIVO')
089500160916     A                                      COLHDG('FIL.' 'SPUNTA ARR')
089600160916     A                                      REFFLD($FIL *SRC)
089700970123     A            $FLO          10A         TEXT('FLAG OPERATIVI')
089800970123     A                                      COLHDG('FLAG OPERAT.')
089900160916     A            $FLP      R               TEXT('FIL. TRANSITO')
090000160916     A                                      COLHDG('FIL.' 'TRANSITO')
090100890908     A                                      REFFLD($FIL *SRC)
090200120615     A            $FLS      R               TEXT('FIL. SEGNACOLLO')
090300120615     A                                      COLHDG('FIL' 'SEGNACOLLO')
090400900328     A                                      REFFLD($FIL *SRC)
090500990427     A            $FLT      R               TEXT('P.O. TRASMISSIONE DATI')
090600990427     A                                      COLHDG('P.O TRASM.')
090700890908     A                                      REFFLD($FIL *SRC)
090800001019     A            $FLV          20A         TEXT('FLAG OPERATIVI')
090900001019     A                                      COLHDG('FLAG OPERAT.')
091000890908     A            $FMP      R               TEXT('FLAG TCP')
091100890908     A                                      COLHDG('F' 'TCP')
091200890908     A                                      REFFLD($FLA *SRC)
091300911008     A            $FNC      R               TEXT('S=EMESSA NOTA CREDITO')
091400911008     A                                      COLHDG('S/N' 'N.CRED')
091500911008     A                                      REFFLD($FLA *SRC)
091600990602     A            $FNS      R               TEXT('S=SEGNACOLLI NON SEQUENZIALI')
091700990602     A                                      COLHDG('SEGN' 'NO SEQ')
091800990602     A                                      REFFLD($FLA *SRC)
091900970306     A            $FOA      R               TEXT('P.O. ORIGINE/RILEVAZIONE ANOM-
092000970306                                            ALIA')
092100970306     A                                      COLHDG('PO' 'ANOMALIA')
092200970306     A                                      REFFLD($FIL *SRC)
092300990602     A            $FPB      R               TEXT('FLAG PESO BOLLETTATO')
092400990602     A                                      COLHDG('FLAG' 'PESO' 'BOLLETT')
092500990602     A                                      REFFLD($FLA *SRC)
092600070109     A            $FPC      R               TEXT('FLAG PESO DA IMPIANTO')
092700070109     A                                      COLHDG('FLAG' 'PESO' 'IMP.')
092800940707     A                                      REFFLD($FLA *SRC)
092900930921     A            $FPE           2A         TEXT('FASCIA DI PESO')
093000930921     A                                      COLHDG('FASCIA' 'PESO')
093100990602     A            $FPF      R               TEXT('FLAG PESO DA FATTURARE')
093200990602     A                                      COLHDG('FLAG' 'PESO' 'FATTUR')
093300990602     A                                      REFFLD($FLA *SRC)
093400990427     A            $FPN      R               TEXT('P.O P.NOTA')
093500990427     A                                      COLHDG('P.O.' 'P.NOTA')
093600890918     A                                      REFFLD($FIL *SRC)
093700940616     A            $FPP      R               TEXT('FLAG PRESTAZIONE PADR.:M-MAT-
093800940616     A                                      TINO  P-POMERIGGIO')
093900940616     A                                      COLHDG('M/P' 'RITIRO' 'MERCE')
094000940616     A                                      REFFLD($FLA *SRC)
094100990728     A****        $FP1           5P 1       TEXT('TCP FINO A KG')
094200990728     A***                                   COLHDG('TCP' 'FINO' 'A KG')
094300990728     A***         $FP2           5P 1       TEXT('TCP FINO A KG')
094400990728     A***                                   COLHDG('TCP' 'FINO' 'A KG')
094500970821     A            $FRD      R               TEXT('P.O. RESPONSABILITA'' DANNO')
094600970821     A                                      COLHDG('P.O. RESPONS.' 'DANNO')
094700970821     A                                      REFFLD($FIL *SRC)
094800990624     A            $FRG           2P 0       TEXT('NR. PROGR. RIAPERTURA GIAC.')
094900940721     A                                      COLHDG('NR.' 'RIAP.' 'GIAC.')
095000931029     A            $FRM      R               TEXT('S=RIMBORSO')
095100931029     A                                      COLHDG('S=' 'RIMBORSO')
095200931029     A                                      REFFLD($FLA *SRC)
095300940906     A            $FRQ           1A         TEXT('FREQUENZA')
095400940906     A                                      COLHDG('FREQUENZA')
095500080205     A            $FSF      R               TEXT('FLAG SEDE/FILIALE')
095600080205     A                                      COLHDG('SEDE' 'FIL')
095700080205     A                                      REFFLD($FLA *SRC)
095800910627     A            $FST      R               TEXT('FLAG STAMPA')
095900910627     A                                      COLHDG('F' 'STAMP')
096000910627     A                                      REFFLD($FLA *SRC)
096100900627     A            $FSV      R               TEXT('FLAG STATO VISITA')
096200900627     A                                      COLHDG('F' 'ST.VI')
096300900627     A                                      REFFLD($FLA *SRC)
096400911016     A            $FTA      R               TEXT('FLAG TIPO ANOMALIA')
096500911016     A                                      COLHDG('TIP' 'ANOM')
096600911016     A                                      REFFLD($FLA *SRC)
096700080205     A            $FTAZ         11P 0       TEXT('FATTURATO AZIENDA')
096800080205     A                                      COLHDG('FATTUR' 'AZIENDA')
096900990625     A* NELLE BOLLE IL CAMPO CONSEGNA PARTICOLARE RIMANE LUNGO 1
097000990625     A* POSSIBILMENTE USARE IL CAMPO $CCP COD.CONSEGNA PARTICOLARE
097100990625     A* NELLE TARIFFE IL CAMPO E' LUNGO 2 PER ORA USARE $FTC2
097200990625     A            $FTC           1A         TEXT('CODICE TARIFFA PARTICOLARE')
097300990625     A                                      COLHDG('COD' 'TAR' 'PARTIC')
097400990625     A            $FTC2          2A         TEXT('CODICE TARIFFA PARTICOLARE')
097500990625     A                                      COLHDG('COD' 'TAR' 'PARTIC')
097600940530     A            $FTP      R               TEXT('FLAG TARIFFA PREFERENZIALE')
097700900316     A                                      COLHDG('FL.' 'TAR.' 'PREF')
097800900316     A                                      REFFLD($FLA *SRC)
097900890913     A            $FTR      R               TEXT('FLAG TRASMISS.:" "=DA TRASM.+
098000890913     A                                      "R"=RICEV. "T"=TRASM.')
098100890913     A                                      COLHDG('FL' 'TRM')
098200890913     A                                      REFFLD($FLA *SRC)
098300890908     A            $FTS      R               TEXT('FLAG TASSAZIONE')
098400890908     A                                      COLHDG('FL' 'TAS')
098500890908     A                                      REFFLD($FLA *SRC)
098600900314     A            $FTM      R               TEXT('FLAG TASSAZIONE C/TARIFFA +
098700900314     A                                      MITTENTE')
098800900314     A                                      COLHDG('FL.' 'TAS' 'MITT.')
098900900314     A                                      REFFLD($FLA *SRC)
099000890908     A            $FTT      R               TEXT('FL.TIPO TRASM. BLK=NO 1=+
099100890906     A                                      TUTTI,2=UNA FIL.,3=FIL+MOV')
099200890908     A                                      COLHDG('FL.TP.' ' TRASM.')
099300890906     A                                      REFFLD($FLA *SRC)
099400890908     A            $FUN           3A         TEXT('COD. CAPO AREA')
099500890908     A                                      COLHDG('COD.' 'CAPO' 'AREA')
099600940530     A            $FVB      R               TEXT('FLAG VOLUME BOLLETTATO')
099700940530     A                                      COLHDG('FLAG' 'VOL' 'BOLLETT')
099800940530     A                                      REFFLD($FLA *SRC)
099900070109     A            $FVC      R               TEXT('FLAG VOLUME DA IMPIANTO')
100000070109     A                                      COLHDG('FLAG' 'VOL' 'IMP.')
100100940707     A                                      REFFLD($FLA *SRC)
100200941027     A            $FVD      R               TEXT('FLAG QUANTITA'' DA FATTURARE')
100300941027     A                                      COLHDG('FL' 'Q.TA''' 'DA FATT')
100400940803     A                                      REFFLD($FLA *SRC)
100500900314     A            $FVE      R               TEXT('FLAG VALORE ASS. ECCEDENTE')
100600900314     A                                      COLHDG('FLAG' 'V.A.E.')
100700900314     A                                      REFFLD($FLA *SRC)
100800940530     A            $FVF      R               TEXT('FLAG VOLUME DA FATTURARE')
100900940530     A                                      COLHDG('FLAG' 'VOL' 'DA FATT')
101000940530     A                                      REFFLD($FLA *SRC)
101100931007     A            $FVL      R               TEXT('FLAG VALORIZZAZIONE')
101200931007     A                                      COLHDG('F' 'VALORIZ')
101300931007     A                                      REFFLD($FLA *SRC)
101400920513     A            $FVM      R               TEXT('FLAG VALORE MERCE')
101500920513     A                                      COLHDG('FLAG' 'VAL.MER')
101600920513     A                                      REFFLD($FLA *SRC)
101700940707     A* FVS DA ELIMINARE
101800921230     A            $FVS      R               TEXT('C=FLAG VOLUME DA MAC.SMISTAC')
101900921230     A                                      COLHDG('FLAG' 'VOL.' 'SMIST')
102000921230     A                                      REFFLD($FLA *SRC)
102100900301     A*---- G ----*
102200940530     A            $GCA           2A         TEXT('GESTIONE PARTICOLARITA'' C/A')
102300940520     A                                      COLHDG('GEST' 'PARTIC' 'C/A')
102400940927     A            $GC1           2A         TEXT('1° GG.CHIUSURA DESTINATARIO')
102500900301     A                                      COLHDG('1°GG' 'CHIUS.')
102600940927     A            $GC2           2A         TEXT('2° GG.CHIUSURA DESTINATARIO')
102700900301     A                                      COLHDG('2°GG' 'CHIUS.')
102800930201     A            $GDC           3P 0       TEXT('ORE DELTA CONSEGNA')
102900930201     A                                      COLHDG('ORE' 'DELTA' 'CONS.')
103000990728     A                                      EDTCDE(K)
103100930407     A            $GDT           3P 0       TEXT('ORE DELTA TRAZIONE')
103200930407     A                                      COLHDG('ORE' 'DELTA' 'TRAZ.')
103300990728     A                                      EDTCDE(K)
103400970820     A            $GFC           3P 0       TEXT('GESTIONE FASE CA: 46=SEDE P.O-
103500970820                                            .PART P.O.ARR')
103600970820     A                                      COLHDG('GESTIONE' 'FASE')
103700990728     A                                      EDTCDE(Z)
103800940802     A            $GGA           2A         TEXT('GESTIONE PARTICOLARITA'' GIAC-
103900940802     A                                      ENZA')
104000940802     A                                      COLHDG('GEST' ' PARTIC' 'GIAC')
104100940802     A            $GGR           2P 0       TEXT('GIORNI RIENTRO')
104200990728     A                                      COLHDG('GIORNI' 'RIENTRO')
104300990728     A                                      EDTCDE(Z)
104400990602     A            $GGS           3P 0       TEXT('GIORNI SOSTA GIACENZA')
104500940802     A                                      COLHDG('GIORNI' 'SOSTA')
104600990728     A                                      EDTCDE(Z)
104700940530     A            $GMA           2A         TEXT('GESTIONE PARTICOLARITA'' CONS-
104800940520     A                                      EGNA')
104900940520     A                                      COLHDG('GEST' 'PARTIC' 'CONS')
105000990602     A            $GUF           1S 0       TEXT('CONTATORE PER ATTIVAZIONE"GUF-
105100990602     A                                      O"')
105200990602     A                                      COLHDG('CONTATORE' 'X GUFO')
105300990728     A                                      EDTCDE(Z)
105400940530     A            $GVA           2A         TEXT('GESTIONE PARTICOLARITA'' VA-
105500940530     A                                      RIE')
105600940520     A                                      COLHDG('GEST' ' PARTIC' 'VARIE')
105700891009     A*---- H ----*
105800120615     A            $HAM      R               TEXT('ORA ARRIVO MERCE TERMINAL -
105900120615     A                                      ARRIVO')
106000120615     A                                      COLHDG('ORA' 'ARR.MERCE' 'TERM.ARR')
106100120615     A                                      REFFLD($HM *SRC)
106200940520     A            $HCE      R               TEXT('ORA PREVISTA CONSEGNA CLIENT')
106300940520     A                                      COLHDG('ORA' 'CONS' 'PREV.CLI')
106400921215     A                                      REFFLD($HM *SRC)
106500940520     A            $HCI      R               TEXT('ORA PREVISTA CONSEGNA INTERN')
106600940520     A                                      COLHDG('ORA' 'CONS' 'PREV.INT')
106700921215     A                                      REFFLD($HM *SRC)
106800120615     A            $HCM      R               TEXT('ORA CONSEGNA MERCE')
106900120615     A                                      COLHDG('ORA' 'CONS' 'MERCE')
107000120615     A                                      REFFLD($HM *SRC)
107100921215     A            $HCR      R               COLHDG('ORA' 'CONS.RICH')
107200921215     A                                      TEXT('ORA CONSEGNA RICHIESTA')
107300921215     A                                      REFFLD($HM *SRC)
107400940616     A            $HCS      R               TEXT('ORA CARICAMENTO SPUNTA')
107500940630     A                                      COLHDG('ORA' 'CARIC' 'SPUNTA')
107600940616     A                                      REFFLD($HM *SRC)
107700070110     A            $HCS6     R               TEXT('ORA CARICAMENTO SPUNTA')
107800070110     A                                      COLHDG('ORA' 'CARIC' 'SPUNTA')
107900070110     A                                      REFFLD($HMD *SRC)
108000930419     A            $HEV      R               COLHDG('ORA' 'EVENTO')
108100930419     A                                      TEXT('ORA EVENTO')
108200930419     A                                      REFFLD($HM *SRC)
108300970821     A            $HFC      R               COLHDG('ORA FASE' 'CA')
108400970821     A                                      TEXT('ORA FASE CA')
108500970821     A                                      REFFLD($HM *SRC)
108600980527     A            $HIM      R               COLHDG('ORA IMMISSIONE')
108700980527     A                                      TEXT('ORA IMMISSIONE')
108800980527     A                                      REFFLD($HM *SRC)
108900940616     A            $HMC      R               TEXT('ORA CONSEGNA REALE HHMM')
109000940616     A                                      COLHDG('HH.MM' 'CONS')
109100910802     A                                      REFFLD($HM *SRC)
109200910802     A            $HMF      R               TEXT('ORA CHIUSURA HHMM')
109300900627     A                                      COLHDG('HH.MM' 'CHIUS')
109400910802     A                                      REFFLD($HM *SRC)
109500910802     A            $HMM      R               TEXT('ORA PART. MAPPA HHMM')
109600900627     A                                      COLHDG('HM' 'PAR.MAPPA')
109700910802     A                                      REFFLD($HM *SRC)
109800910802     A            $HMP      R               TEXT('ORA PARTENZA HHMM')
109900900331     A                                      COLHDG('HH.MM' 'PART.')
110000990604     A                                      REFFLD($HM *SRC)
110100910802     A            $HMV      R               TEXT('ORA VISITA HHMM')
110200900331     A                                      COLHDG('HH.MM' 'VIS.')
110300910802     A                                      REFFLD($HM *SRC)
110400980907     A            $HNE      R               COLHDG('ORA FURTO/SMARRIM.')
110500980907     A                                      TEXT('ORA FURTO/SMARR')
110600980907     A                                      REFFLD($HM *SRC)
110700951006     A            $HRA      R               TEXT('ORA REALE ARRIVO')
110800951006     A                                      COLHDG('ORA' 'REALE.ARR')
110900951006     A                                      REFFLD($HM *SRC)
111000951006     A            $HRP      R               TEXT('ORA REALE PARTENZA')
111100951006     A                                      COLHDG('ORA' 'REALE.PART')
111200951006     A                                      REFFLD($HM *SRC)
111300120615     A            $HSE      R               TEXT('ORA SPUNTA ENTRATA')
111400120615     A                                      COLHDG('ORA' 'SPU' 'ENTRATA')
111500120615     A                                      REFFLD($HM *SRC)
111600990604     A            $HRT      R               TEXT('ORA RITIRO MERCE')
111700990604     A                                      COLHDG('HH.MM' 'RITIRO')
111800990604     A                                      REFFLD($HM *SRC)
111900951006     A            $HTA      R               TEXT('ORA TEORICA ARRIVO')
112000951006     A                                      COLHDG('ORA' 'TEOR.ARR')
112100951006     A                                      REFFLD($HM *SRC)
112200930416     A            $HTI      R               TEXT('ORA ARRIVO TRAZIONE')
112300930407     A                                      COLHDG('ORA' 'ARRIVO' 'TRAZ.')
112400921215     A                                      REFFLD($HM *SRC)
112500951006     A            $HTP      R               TEXT('ORA TEORICA PARTENZA')
112600951006     A                                      COLHDG('ORA' 'TEOR.PART')
112700951006     A                                      REFFLD($HM *SRC)
112800991222     A            $HTR      R               TEXT('ORA TRASMISSIONE')
112900991222     A                                      COLHDG('ORA' 'TRASMISSIONE')
113000991222     A                                      REFFLD($HM *SRC)
113100990623     A            $HMS      R               TEXT('ORA SPUNTA FISICA')
113200990623     A                                      COLHDG('ORA' 'SP. FISICA')
113300990623     A                                      REFFLD($HM *SRC)
113400070110     A            $HMS6     R               TEXT('ORA SPUNTA FISICA')
113500070110     A                                      COLHDG('ORA' 'SP. FISICA')
113600070110     A                                      REFFLD($HMD *SRC)
113700070125     A            $HVDIS    R               TEXT('ORA AGGIORNAMENTO DISTINTA')
113800070125     A                                      COLHDG('ORA AGG.' 'DISTINTA')
113900070125     A                                      REFFLD($ORA *SRC)
114000070125     A            $HVTEL    R               TEXT('ORA AGGIORNAMENTO TELLUS')
114100070125     A                                      COLHDG('ORA AGG.' 'TELLUS')
114200070125     A                                      REFFLD($ORA *SRC)
114300890908     A*---- I ----*
114400990728     A            $IAC           7P 0       TEXT('ISTAT')
114500890908     A                                      COLHDG('ISTAT')
114600990728     A                                      EDTCDE(K)
114700011024     A            $IAD          10P 3       TEXT('IMPORTO ADDIZIONALE PER +
114800940517     A                                      TARIFFE PADRONCINI A PRESTAZIONE')
114900940517     A                                      COLHDG('IMPORTO' 'ADDIZIONALE')
115000011025     A                                      EDTCDE(K)
115100940517     A            $IAS          13P 3       TEXT('IMPORTO DA ASSICURARE')
115200940517     A                                      COLHDG('IMP' 'DA ASSIC')
115300990728     A                                      EDTCDE(K)
115400890908     A            $IBL           5P 0       TEXT('IMPORTO BOLLO')
115500990728A    A                                      COLHDG('IMPORTO' 'BOLLO')
115600990728     A                                      EDTCDE(K)
115700940627     A            $ICM           9  0       TEXT('IMPORTO COMPETENZA')
115800940627     A                                      COLHDG('IMP' 'COMP')
115900990728     A                                      EDTCDE(K)
116000010724     A            $ICO          13P 3       TEXT('IMPORTO CONFERMATO')
116100010724     A                                      COLHDG('IMPORTO' 'CONFERMATO')
116200010724     A                                      EDTCDE(K)
116300170914     A            $IDA           4A         TEXT('DEPOT DI ARRIVO')
116400170914     A                                      COLHDG('DEPOT' 'ARRIVO')
116500170920     A            $IDA7          7A         TEXT('B.U. E DEPOT DI ARRIVO')
116600170920     A                                      COLHDG('BU+DEPOT' 'ARRIVO')
116700970820     A            $IDC          15P 3       TEXT('IMPORTO DOCUMENTO')
116800990915     A                                      COLHDG('IMPORTO' 'DOCUMENTO')
116900990728     A                                      EDTCDE(K)
117000070117     A            $IDDOC        16A         TEXT('ID DOCUMENTO PDA')
117100070117     A                                      COLHDG('ID' 'DOCUMENTO' 'PDA')
117200130301     A            $IDZ           2A         TEXT('COD.IDENTIFICATIVO AZIONE')
117300130301     A                                      COLHDG('ID.' 'AZIONE')
117400000414     A            $IES          13P 3       TEXT('IMPORTO ESPOSTO')
117500000414     A                                      COLHDG('IMPORTO' 'ESPOSTO')
117600000414     A                                      EDTCDE(K)
117700990830     A            $IFT          13P 3       TEXT('IMPORTO FATTURA')
117800900327     A                                      COLHDG('IMP.FATTURA')
117900990728     A                                      EDTCDE(K)
118000010724     A            $ILI          13P 3       TEXT('IMPORTO DI LISTINO')
118100010724     A                                      COLHDG('IMPORTO' 'LISTINO')
118200010724     A                                      EDTCDE(K)
118300990604     A            $IM           13P 3       TEXT('IMPONIBILE IVA')
118400890908     A                                      COLHDG('IMPONIBILE IVA')
118500990728     A                                      EDTCDE(K)
118600940517     A            $IMB           7P 0       TEXT('IMPONIBILE BOLLO')
118700940517     A                                      COLHDG('IMPONIBILE' 'BOLLO')
118800990728     A                                      EDTCDE(K)
118900940517     A            $IM1           9P 0       TEXT('IMPORTO RATA')
119000940517     A                                      COLHDG('IMPORTO' 'RATA')
119100990728     A                                      EDTCDE(K)
119200940520     A            $IND          35A         TEXT('INDIRIZZO DESTINATARIO')
119300940520     A                                      COLHDG('INDIRIZZO' 'DEST')
119400940517     A            $INM          35A         TEXT('INDIRIZZO MITTENTE')
119500940517     A                                      COLHDG('INDIRIZZO MITT')
119600940520     A            $IMR           9P 0       TEXT('IMPORTO RIMBORSO')
119700940520     A                                      COLHDG('IMPORTO' 'RIMBOR')
119800990728     A                                      EDTCDE(K)
119900990604     A            $IMV          13P 3       TEXT('IMPONIBILE IVA')
120000990604     A                                      COLHDG('IMPONIBILE IVA')
120100990728     A                                      EDTCDE(K)
120200170913     A            $IPN          14A         TEXT('NUMERO PARCEL DPD')
120300170913     A                                      COLHDG('PARCEL' 'DPD')
120400940427     A*
120500940427     A* $INO ---> USATO SOLO NEL DETTAGLIO TARIFFE CLIENTI
120600940427     A            $INO          11P 3       TEXT('TARIFFA INOLTRO')
120700890908     A                                      COLHDG('TARIFFA' 'INOLTRO')
120800990728     A                                      EDTCDE(K)
120900940427     A*
121000981016     A            $IPL          15P 3       TEXT('IMPORTO LIQUIDATO')
121100981016     A                                      COLHDG('IMP.LIQUIDATO')
121200990728     A                                      EDTCDE(K)
121300990915     A            $IPP          13P 3       TEXT('IMPORTO PROGRESSIVO PARZIALE +
121400921215     A                                      INCASSATO')
121500921215     A                                      COLHDG('IMPORTO' 'PROGR' 'PARZ.INC')
121600990728     A                                      EDTCDE(K)
121700000427     A            $IPT          13P 3       TEXT('IMPORTO PATTUITO')
121800940906     A                                      COLHDG('IMPORTO' 'PATTUITO')
121900990728     A                                      EDTCDE(K)
122000981016     A            $IPV          15P 3       TEXT('IMPORTO PREVISTO')
122100981016     A                                      COLHDG('IMPORTO' 'PREVISTO')
122200990728     A                                      EDTCDE(K)
122300990728     A**          $IP1           7P 0       TEXT('IMPORTO TCP 1')
122400990728     A**                                    COLHDG('IMPORTO' 'TCP 1')
122500990728     A**          $IP2           7P 0       TEXT('IMPORTO TCP 2')
122600990728     A**                                    COLHDG('IMPORTO' 'TCP 2')
122700170914     A            $ISC           3A         TEXT('SERVICE CODE')
122800170914     A                                      COLHDG('SERVICE' 'CODE')
122900150205     A            $ISTAT         5P 2       TEXT('% ISTAT')
123000150205     A                                      COLHDG('% ISTAT')
123100150205     A                                      EDTCDE(K)
123200011025     A            $ITA          10P 3       TEXT('IMPORTO TASSAZIONE DA +
123300931006     A                                       ACCESSORI')
123400990728     A                                      EDTCDE(K)
123500931005     A                                      COLHDG('IMPORTO' 'TASSAZ' 'ACCESS')
123600920513     A            $ITP           9P 2       TEXT('IMPORTO TARIFFA PARTICOLARE')
123700920513     A                                      COLHDG('IMPOR' 'TAR' 'PART')
123800990728     A                                      EDTCDE(K)
123900940427     A*
124000940427     A* $ITR ---> USATO SOLO NELLE TARIFFE CLIENTI
124100170914     A            $ITR          11P 3       TEXT('IMPORTO TARIFFA')
124200170914     A                                      COLHDG('IMPORTO' 'TARIFFA')
124300170914     A                                      EDTCDE(K)
124400940427     A*
124500011025     A            $ITT          10P 3       TEXT('IMPORTO TASSAZIONE DA +
124600931006     A                                       TARIFFA')
124700990728     A                                      EDTCDE(K)
124800931005     A                                      COLHDG('IMPORTO' 'TASSAZ' 'TAR')
124900890908     A            $IV            9P 0       TEXT('IMPONIBILE IVA')
125000890908     A                                      COLHDG('IVA')
125100990728     A                                      EDTCDE(K)
125200990602     A            $IVA          11P 3       TEXT('I.V.A.')
125300890908     A                                      COLHDG('I.V.A.')
125400990728     A                                      EDTCDE(K)
125500890908     A            $I1T           5P 1       TEXT('PUNTI ISTAT 1 TRIM')
125600890908     A                                      COLHDG('PUNTI' 'ISTAT' '1 TRIM')
125700990728     A                                      EDTCDE(K)
125800890908     A            $I2T           5P 1       TEXT('PUNTI ISTAT 2 TRIM.')
125900890908     A                                      COLHDG('PUNTI' 'ISTAT' '2 TRIM.')
126000990728     A                                      EDTCDE(K)
126100890908     A            $I3T           5P 1       TEXT('PUNTI ISTAT 3 TRIM..')
126200890908     A                                      COLHDG('PUNTI' 'ISTAT' '3 TRIM.')
126300990728     A                                      EDTCDE(K)
126400890908     A            $I4T           5P 1       TEXT('PUNTI ISTAT 4 TRIM.')
126500990728     A                                      EDTCDE(K)
126600890908     A                                      COLHDG('PUNTI' 'ISTAT' '4 TRIM.')
126700890908     A*---- K ----*
126800940923     A            $KFA           8P 1       TEXT('TOT. PESO FINO A 35 Q.LI')
126900940923     A                                      COLHDG('PESO' 'FINO  35Q')
127000990728     A                                      EDTCDE(K)
127100940923     A            $KOA           8P 1       TEXT('TOT. PESO OLTRE  35 Q.LI')
127200930713     A                                      COLHDG('PESO' 'OLTRE 35Q' 'DI AREA')
127300990728     A                                      EDTCDE(K)
127400890908     A            $KUT           1P 0       TEXT('CODICE UTENTE')
127500890908     A                                      COLHDG('UT')
127600900320     A            $KPM           5P 1       TEXT('KG. PER METRO CUBO')
127700900320     A                                      COLHDG('KG' 'X' 'MC')
127800990728     A                                      EDTCDE(K)
127900890908     A*---- L ----*
128000890908     A            $LAS           7P 0       TEXT('LIMITE RISARC.SPED.')
128100890908     A                                      COLHDG('LIMITE' 'RIS.' 'SPED.')
128200990728     A                                      EDTCDE(K)
128300890915     A            $LBI      R               TEXT('LIBRO IVA')
128400890915     A                                      COLHDG('LIBRO IVA')
128500890915     A                                      REFFLD($FIL *SRC)
128600970821     A            $LET      R               TEXT('CODICE TESTO LETTERA')
128700970821     A                                      COLHDG('COD.TESTO' 'LETTERA')
128800980505     A                                      REFFLD($VLT *SRC)
128900910930     A            $LID           1P 0       TEXT('LIVELLO IDD')
129000910930     A                                      COLHDG('LIV.' 'IDD')
129100120615     A            $LNA      R               TEXT('FIL. ARRIVO')
129200120615     A                                      COLHDG('FIL' 'ARR')
129300890908     A                                      REFFLD($FIL *SRC)
129400120615     A            $LNP      R               TEXT('FIL. PARTENZA')
129500120615     A                                      COLHDG('FIL' 'PARTENZA')
129600990728     A                                      EDTCDE(Z)
129700890908     A                                      REFFLD($FIL *SRC)
129800990602     A            $LOC          35A         TEXT('LOCALITA''')
129900900323     A                                      COLHDG('LOCALITA''')
130000940517     A            $LOD          35A         TEXT('LOCALITA'' DESTINATARIO')
130100940517     A                                      COLHDG('LOCALITA' 'DEST')
130200940517     A            $LOM          35A         TEXT('LOCALITA'' MITTENTE')
130300940517     A                                      COLHDG('LOCALITA' 'MITT')
130400890908     A            $LRC           7P 0       TEXT('LIMITE RISARCIBILE COLLI')
130500890908     A                                      COLHDG('LIMITE' 'RISARC.' 'COLLI')
130600990728     A                                      EDTCDE(K)
130700891005     A            $LSF           3A         TEXT('COD.LUOGO SPEDIZIONE FATTURA')
130800891005     A                                      COLHDG('LUOGO' 'SPED.' 'FATT.')
130900011025     A            $LVL           1A         TEXT('LIVELLO TESTATA TASSAZIONE +
131000011025     A                                      AUTOTRASP.')
131100011025     A                                      COLHDG('LIV')
131200890908     A*---- M ----*
131300031205     A            $MAD           3A         TEXT('MOTIVO APERTURA DETTAGLIO')
131400031205     A                                      COLHDG('MOTIVO' 'APERT.' 'DETT.')
131500000920     A            $MAI          50A         TEXT('INDIRIZZO E-MAIL')
131600000920     A                                      COLHDG('INDIRIZZO' 'E-MAIL')
131700940428     A* $MAX ---> USATO SOLO NELLE TARIFFE CLIENTI
131800011024     A* $MAX ---> ERA USATO ANCHE NELLE TARIFFE PDRONCINI   !!
131900990427     A            $MAX          11P 3       TEXT('MASSIMO')
132000940428     A                                      COLHDG('MASSIMO')
132100990728     A                                      EDTCDE(K)
132200940428     A*
132300930924     A            $MER           1A         TEXT('COD.MERCATO')
132400930924     A                                      COLHDG('CD.' 'MER' 'CATO')
132500910617     A            $MIC           1A         TEXT('TP.INC.: " "=CONT.,C=CIRC,+
132600910617     A                                      B=BANC.,V=VAGL,P=ASS.POST')
132700910617     A                                      COLHDG('TP.' 'INC')
132800940428     A*
132900940428     A* $MIN ---> USATO SOLO NELLE TARIFFE CLIENTI
133000011024     A* $MIN ---> ERA USATO ANCHE NELLE TARIFFE PDRONCINI !!
133100990427     A            $MIN          11P 3       TEXT('MINIMO')
133200940428     A                                      COLHDG('MINIMO')
133300990728     A                                      EDTCDE(K)
133400940428     A*
133500930924     A            $MMG           4P 0       TEXT('MESE/GIORNO')
133600930924     A                                      COLHDG('MM.' 'GG.')
133700990729     A                                      EDTWRD('  /  ')
133800011024     A            $MNT          10P 3       TEXT('IMPORTO MINIMO TARIFFA')
133900990728     A                                      COLHDG('IMP' 'MIN' 'TAR')
134000990728     A                                      EDTCDE(K)
134100890908     A            $MP            9P 0       TEXT('MONOPOLIO POSTALE')
134200890908     A                                      COLHDG('MON' 'POST')
134300990728     A                                      EDTCDE(K)
134400990728     A***         $MPA           5P 0       TEXT('MINIMO PROVV. ASSEGNO')
134500990728     A****                                  COLHDG('MIN' 'PROVV.' 'ASS.')
134600930924     A            $MXT           7P 0       TEXT('IMPORTO MASSIMO TARIFFA')
134700930924     A                                      COLHDG('IMP' 'MAX' 'TAR')
134800990728     A                                      EDTCDE(K)
134900890908     A*---- N ----*
135000921215     A            $NAP           2P 0       TEXT('NUMERO PISTOLA ARRIVO')
135100921215     A                                      COLHDG('N.PIST' 'ARR')
135200990728     A                                      EDTCDE(Z)
135300890908     A            $NAR           3A         TEXT('COD.NAZIONE')
135400890908     A                                      COLHDG('COD.' 'NAZ')
135500890908     A            $NAT          10A         TEXT('NATURA MERCE')
135600890908     A                                      COLHDG('NAT.MERCE')
135700990602     A            $NAS          15A         TEXT('NATURA MERCE MITTENTE')
135800940530     A                                      COLHDG('NAT.MERCE' 'MITT')
135900001019     A            $NAU           5P 0       TEXT('NUMERO AUTOTRENI')
136000001019     A                                      COLHDG('NR.' 'AUTOTRENI')
136100001019     A                                      EDTCDE(Z)
136200990427     A            $NAZ           3A         TEXT('COD.NAZIONE')
136300990427     A                                      COLHDG('COD.' 'NAZ')
136400021213     A            $NBA           2S 0       TEXT('NUMERO BANCALI')
136500021209     A                                      COLHDG('NUMERO' 'BANCALI')
136600940627     A            $NBC           5P 0       TEXT('NUMERO BLOCCO COMPETENZA')
136700940627     A                                      COLHDG('NR.' 'BLOCCO')
136800990728     A                                      EDTCDE(Z)
136900001019     A            $NBI           5P 0       TEXT('NUMERO BILICI')
137000001019     A                                      COLHDG('NR.' 'BILICI')
137100001019     A                                      EDTCDE(Z)
137200950515     A            $NBL           5P 0       TEXT('NUMERO BOLLE')
137300950515     A                                      COLHDG('NR.' 'BOLLE')
137400990728     A                                      EDTCDE(Z)
137500950522     A            $NBN           5P 0       TEXT('NUMERO BANCALI')
137600950522     A                                      COLHDG('NR.' 'BANCALI')
137700990728     A                                      EDTCDE(Z)
137800890908     A            $NBR           5P 0       TEXT('NUMERO BORDERO')
137900890908     A                                      COLHDG('NR.' 'BORD')
138000990728     A                                      EDTCDE(Z)
138100970820     A            $NCA           7P 0       TEXT('NUMERO CA')
138200970820     A                                      COLHDG('NUM' 'CA')
138300990728     A                                      EDTCDE(Z)
138400990604     A            $NCI           3P 0       TEXT('NON CONFORMITA CONSEGNA')
138500990604     A                                      COLHDG('DELTA' 'CONSEGNA')
138600990728     A                                      EDTCDE(K)
138700890908     A            $NCL           5P 0       TEXT('NUMERO COLLI')
138800890908     A                                      COLHDG('COLLI')
138900990728     A                                      EDTCDE(Z)
139000141009     A            $NCM           7P 0       TEXT('NUMERO CAMPAGNA')
139100141009     A                                      COLHDG('NUM' 'CAMPAGNA')
139200141009     A                                      EDTCDE(Z)
139300070109     A            $NCP           5P 0       TEXT('COLLI RILEVATI PER PESO DA IM-
139400070109                                            PIANTO')
139500940519     A                                      COLHDG('COLLI' 'RILEV' 'PESO')
139600990728     A                                      EDTCDE(Z)
139700070109     A            $NCR           5P 0       TEXT('COLLI RILEVATI PER VOLUME DA -
139800070109     A                                      IMPIANTO')
139900990728     A                                      EDTCDE(Z)
140000940519     A                                      COLHDG('COLLI' 'RILEV' 'VOL')
140100890908     A            $NDC           7P 0       TEXT('NUMERO DOCUMENTO')
140200890908     A                                      COLHDG('NUM' 'DOCUM')
140300990728     A                                      EDTCDE(Z)
140400990728     A            $NDE           7P 0       TEXT('NUMERO DENUNCIA')
140500990728     A                                      COLHDG('NUM' 'DENUNCIA')
140600990728     A                                      EDTCDE(Z)
140700910516     A            $NDP           7P 0       TEXT('NR. DOCUM.PAGAM. C/ASSEGNO')
140800910516     A                                      COLHDG('N.DOC' 'PAG.C/A')
140900990728     A                                      EDTCDE(Z)
141000910516     A            $NDT           7P 0       TEXT('NR. DISTINTA C/ASSEGNO')
141100910516     A                                      COLHDG('N.DIST' 'C/ASS.')
141200990728     A                                      EDTCDE(Z)
141300970820     A            $NEV           7P 0       TEXT('NUMERO EVENTO')
141400970820     A                                      COLHDG('NUM' 'EVENTO')
141500990728     A                                      EDTCDE(Z)
141600010724     A            $NFE           3P 0       TEXT('NR.FERMATA CHE ESPONE IMPORTO-
141700010724     A                                       SUL F.V.')
141800010724     A                                      COLHDG('NUM.' 'FERM.')
141900010724     A                                      EDTCDE(Z)
142000011025     A            $NFF           9P 0       TEXT('NUMERO FATTURA FORNITORE')
142100011025     A                                      COLHDG('NR.FATT.' 'FORNIT.')
142200011025     A                                      EDTCDE(Z)
142300940909     A            $NFT           6P 0       TEXT('NUMERO FATTURA')
142400890908     A                                      COLHDG('NUM.' 'FATT.')
142500990728     A                                      EDTCDE(Z)
142600070119     A            $NFTL          5P 0       TEXT('NR.FERMATE X TELLUS')
142700070119     A                                      COLHDG('FERMATE' 'TELLUS')
142800070119     A                                      EDTCDE(Z)
142900990427     A            $NFV           6P 0       TEXT('NUMERO FOGLIO')
143000940615     A                                      COLHDG('NUM.' 'FOGLIO')
143100990728     A                                      EDTCDE(Z)
143200900331     A            $NGC           7P 0       TEXT('NUMERO GIACENZA')
143300900331     A                                      COLHDG('NUM.' 'GIAC.')
143400990728     A                                      EDTCDE(Z)
143500911001     A            $NGD           3P 0       TEXT('NUMERO GIRO IN DISTINTA +
143600911001     A                                      CONSEGNA')
143700990728
143800911001     A                                      COLHDG('NUM.' 'GIRO' 'CONS.')
143900971008     A            $NK1          11A         TEXT('CHIAVE 1 NOTE')
144000920522     A                                      COLHDG('KEY1' 'NOTE')
144100920522     A            $NK2           4A         TEXT('CHIAVE 2 NOTE')
144200920522     A                                      COLHDG('KEY2' 'NOTE')
144300971008     A            $NK3          14A         TEXT('CHIAVE 3 NOTE')
144400971008     A                                      COLHDG('KEY3' 'NOTE')
144500980527     A            $NK4           7A         TEXT('CHIAVE 4 NOTE')
144600980527     A                                      COLHDG('KEY4' 'NOTE')
144700030519     A            $NOJ          10A         TEXT('NOME JOB')
144800030519     A                                      COLHDG('NOME'  'JOB')
144900940629     A            $NMI      R               TEXT('NUMERO MANDATO INTROITO')
145000940629     A                                      COLHDG('NUM' 'MANDATO' 'INTROITO')
145100940629     A                                      REFFLD($NDC *SRC)
145200981022     A            $NMA          10A         TEXT('NUMERO MANDATO ASSICURATIVO')
145300981022     A                                      COLHDG('NUM' 'MANDATO' 'ASSICUR.')
145400001019     A            $NMO           5P 0       TEXT('NUMERO MOTRICI')
145500001019     A                                      COLHDG('NR.' 'MOTRICI')
145600001019     A                                      EDTCDE(Z)
145700070112     A            $NOMIN        35A         TEXT('NOMINATIVO')
145800070112     A                                      COLHDG('NOMINATIVO')
145900070306     A            $NOB          70A         TEXT('NOTE BOLLA')
146000070306     A                                      COLHDG('NOTE BOLLA')
146100090210     A            $NOC          70A         TEXT('NOTE CONTATTO')
146200090210     A                                      COLHDG('NOTE CONTATTO')
146300931008     A            $NOT          35A         TEXT('NOTE')
146400931008     A                                      COLHDG('NOTE')
146500090611     A            $NOT90        90A         TEXT('NOTE')
146600090402     A                                      COLHDG('NOTE')
146700890919     A            $NPA           6P 0       TEXT('NUMERO RIFERIM.PARTITA')
146800890919     A                                      COLHDG('NUM.' 'RIF.' 'PART.')
146900990728     A                                      EDTCDE(Z)
147000910612     A            $NPC      R               TEXT('NUOVO PORTO CONSEGNA')
147100910612     A                                      COLHDG('NUOVO' 'PORTO')
147200910612     A                                      REFFLD($FLA *SRC)
147300160920     A            $NPDMF         2P 0       TEXT('PISTOLA SPUNTA MANIFEST')
147400160920     A                                      COLHDG('N.PIST' 'MANIFEST')
147500160920     A                                      EDTCDE(Z)
147600921215     A            $NPE           2P 0       TEXT('NUMERO PISTOLA ENTRATA')
147700921215     A                                      COLHDG('N.PIST' 'ENTR')
147800990728     A                                      EDTCDE(Z)
147900930519     A            $NPG           1S 0       TEXT('CATEGORIA FOGLIO')
148000930519     A                                      COLHDG('CATEG' 'FOGLIO')
148100990728     A                                      EDTCDE(Z)
148200990604     A            $NPI           3P 0       TEXT('NON CONFORMITA PARTENZA')
148300940711     A                                      COLHDG('DELTA' 'PARTENZA')
148400990728     A                                      EDTCDE(K)
148500890908     A            $NPN      R               TEXT('NUMERO PROTOCOLLLO INTERNO')
148600890908     A                                      COLHDG('N.PROT.' 'INT.')
148700890908     A                                      REFFLD($NRP *SRC)
148800921215     A            $NPP           2P 0       TEXT('NUMERO PISTOLA PARTENZA')
148900921215     A                                      COLHDG('N.PIST' 'PART')
149000990728     A                                      EDTCDE(Z)
149100900331     A            $NPS           2P 0       TEXT('NUMERO PISTOLA SPUNTA-COLLI')
149200900331     A                                      COLHDG('NUM.' 'PIST')
149300990728     A                                      EDTCDE(Z)
149400900331     A            $NPR      R               TEXT('NUMERO PROTOCOLLLO CLIENTE')
149500890908     A                                      COLHDG('N.PROT.' 'CLI.')
149600890908     A                                      REFFLD($NRP *SRC)
149700970820     A            $NPZ           5P 0       TEXT('NUMERO PEZZI')
149800970820     A                                      COLHDG('NUM.' 'PEZZI')
149900910516     A            $NRA          10          TEXT('NUMERO RIF. ASSEGNO')
150000910516     A                                      COLHDG('N.RIF.' 'ASSEGNO')
150100070119     A            $NRAS          9P 0       TEXT('NUMERO ASSOLUTO')
150200070119     A                                      COLHDG('NR.' 'ASSOLUTO')
150300990604     A            $NRC           3P 0       TEXT('NON CONFORMITA CLIENTE')
150400990604     A                                      COLHDG('DELTA' 'CLIENTE')
150500990728     A                                      EDTCDE(K)
150600940909     A            $NRG           6P 0       TEXT('NUMERO REGISTRAZIONE CONTAB.')
150700940909     A                                      COLHDG('N.REG.')
150800990728     A                                      EDTCDE(Z)
150900001019     A            $NRI           7P 0       TEXT('NUMERO RITIRO')
151000001019     A                                      COLHDG('NR.RITIRO')
151100001019     A                                      EDTCDE(Z)
151200940209     A            $NRN           3P 0       TEXT('NUMERO RIGA N.ACCR.')
151300990728     A                                      COLHDG('NUM' 'RIGA' 'N.ACCR.')
151400990728     A                                      EDTCDE(Z)
151500940615     A            $NRS           2P 0       TEXT('NUMERO SERIE')
151600940615     A                                      COLHDG('NUM' 'SERIE')
151700990728     A                                      EDTCDE(Z)
151800940616     A            $NRT           1P 0       TEXT('NUMERO RITIRO')
151900940616     A                                      COLHDG('NUMERO' 'RITIRO')
152000990728     A                                      EDTCDE(Z)
152100890908     A            $NRJ           9P 0       TEXT('NUM.ATTIVITA''D.B.A.')
152200890908     A                                      COLHDG('NUMERO' 'ATTIV.' 'D.B.A.')
152300990728     A                                      EDTCDE(Z)
152400900323     A            $NRV           7P 0       TEXT('NUMERO VISITA')
152500900323     A                                      COLHDG('NR.VIS.')
152600990728     A                                      EDTCDE(Z)
152700090216     A            $NSA           7P 0       TEXT('NUMERO SPEDIZIONI PRESUNTO +
152800090216     A                                      AFFIDATECI')
152900090216     A                                      COLHDG('NUM.SPED.' 'PRES' 'AFFIDAT')
153000090216     A                                      EDTCDE(Z)
153100940615     A            $NSC           7P 0       TEXT('NUMERO SEGNACOLLO')
153200940630     A                                      COLHDG('NUM.' 'SEGNACOLLO')
153300990728     A                                      EDTCDE(Z)
153400890908     A            $NSP           7P 0       TEXT('NUMERO SPEDIZIONE')
153500890908     A                                      COLHDG('NUM.' 'SPED.')
153600990728     A                                      EDTCDE(K)
153700911001     A            $NSS           3P 0       TEXT('NUMERO SEGUENZA STAMPA +
153800911001     A                                      DIST.CONSEGNA')
153900990728     A                                      EDTCDE(Z)
154000911001     A                                      COLHDG('NUM.' 'SEQ.' 'ST.')
154100090210     A            $NTC           7P 0       TEXT('NUMERO TRATTATIVA COMM.')
154200090210     A                                      COLHDG('NR.TRAT' 'COMM.')
154300090210     A                                      EDTCDE(Z)
154400940520     A            $NTI           3P 0       TEXT('NON CONFORMITA TRAZIONE INTER+
154500940520     A                                      NA')
154600990728     A                                      EDTCDE(K)
154700940906     A                                      COLHDG('DELTA' 'TRAZ' 'INTERNO')
154800000920     A            $NTM          35A         TEXT('DESCRIZIONE NATURA MERCE')
154900000920     A                                      COLHDG('DESCRIZ.' 'NATURA' 'MERCE')
155000130118     A            $NUR           9P 0       TEXT('NUMERO RICHIESTA')
155100130118     A                                      COLHDG('NUM' 'TELEFONATA')
155200130118     A                                      EDTCDE(Z)
155300040421     A            $NUT           9P 0       TEXT('NUMERO TELEFONATA')
155400031204     A                                      COLHDG('NUM' 'TELEFONATA')
155500031204     A                                      EDTCDE(Z)
155600001019     A            $NVI           2P 0       TEXT('NUMERO VIAGGIO')
155700001019     A                                      COLHDG('NUM' 'VIAGGIO')
155800001019     A                                      EDTCDE(Z)
155900070110     A            $NVL           1A         TEXT('FLAG NON VALIDITA''')
156000070110     A                                      COLHDG('NON' 'VALID.')
156100940530     A            $NZD      R               TEXT('NAZIONE DESTINATARIO')
156200940530     A                                      COLHDG('NAZIONE' 'DEST')
156300940530     A                                      REFFLD($NAR *SRC)
156400940530     A            $NZM      R               TEXT('NAZIONE MITTENTE')
156500940530     A                                      COLHDG('NAZIONE' 'MITT')
156600940530     A                                      REFFLD($NAR *SRC)
156700910517     A*---- O ----*
156800031205     A            $OCD           6P 0       TEXT('ORA CHIUSURA DETTAGLIO')
156900031205     A                                      COLHDG('ORA' 'CREAZIONE')
157000031205     A                                      EDTWRD('  :  :  ')
157100040119     A            $OGG          20A         TEXT('OGGETTO RECLAMO')
157200040119     A                                      COLHDG('OGGETTO' 'RECLAMO')
157300021125     A            $ORC           6P 0       TEXT('ORA CREAZIONE')
157400021125     A                                      COLHDG('ORA' 'CREAZIONE')
157500021125     A                                      EDTWRD('  :  :  ')
157600940720     A            $ORV           6P 0       TEXT('ORA VARIAZIONE')
157700910517     A                                      COLHDG('ORA' 'VARIAZ')
157800990728     A                                      EDTWRD('  :  :  ')
157900031204     A            $ORZ           6P 0       TEXT('ORA RICEZIONE')
158000031204     A                                      COLHDG('ORA' 'RICEZIONE')
158100031204     A                                      EDTWRD('  :  :  ')
158200990427     A            $ORP           5A         TEXT('ORDINAMENTO REGIONE/PROV.')
158300940427     A                                      COLHDG('ORDIN' 'REG/PROV')
158400910517     A*---- P ----*
158500930810     A            $PAB           3P 0       TEXT('PERC. PER APPLICAZ. BONUS')
158600930810     A                                      COLHDG('PERC.' 'APPL' 'BONUS')
158700990728     A                                      EDTCDE(Z)
158800890908     A            $PAG           5P 2       TEXT('PERC.ADDIZIONALE GESTIONE')
158900890908     A                                      COLHDG('PERC.' 'ADDIZ.' 'GEST.')
159000990728     A                                      EDTCDE(K)
159100990728     A**          $PAR           7A         TEXT('PAESE ARRIVO')
159200990728     A**                                    COLHDG('PAESE' 'ARRIVO')
159300070119     A            $PDA      R               TEXT('FLAG PDA S/N')
159400070119     A                                      COLHDG('PDA')
159500070119     A                                      REFFLD($FLA *SRC)
159600141010     A            $PDE           4P 1       TEXT('PERCENTUALE DELTA')
159700141010     A                                      COLHDG('PERC' 'DELTA')
159800940617     A            $PDD           1A         TEXT('S=PADRONCINO DIPENDENTE')
159900940617     A                                      COLHDG('PADR' 'DIPEND')
160000990427     A            $PDR           7P 0       TEXT('CODICE AUTRASPORTATORE')
160100990427     A                                      COLHDG('COD' 'AUTOTRAS')
160200990728     A                                      EDTCDE(Z)
160300031205     A            $PDT           3P 0       TEXT('PRG.DETTAGLIO')
160400031205     A                                      COLHDG('PRG' 'DET')
160500031205     A                                      EDTCDE(Z)
160600940616     A            $PEP      R               TEXT('PAGAMENTO TARIFFA ETICHETT/-
160700940616     A                                      PIKING')
160800940616     A                                      COLHDG('PAGAM' 'ETICH' 'PIKING')
160900940616     A                                      REFFLD($FLA *SRC)
161000900219     A            $PER           5P 2       TEXT('% = PERCENTUALE 3+2')
161100900219     A                                      COLHDG('PERC.' '  %   ')
161200990728     A                                      EDTCDE(K)
161300921215     A            $PET      R               TEXT('NUM.PISTOLA ENTRATA AL TRANSI+
161400921215     A                                      TO')
161500921215     A                                      COLHDG('N.PIST' 'ENTR' 'TRANS')
161600921215     A                                      REFFLD($NPS *SRC)
161700990728     A                                      EDTCDE(Z)
161800080205     A            $PEXP          3P 0       TEXT('PERCENTUALE EXPORT')
161900080205     A                                      COLHDG('%' 'EXPORT')
162000981009     A            $PFT          15P 3       TEXT('PRESUNTO FATTURATO TRASPORTI')
162100981009     A                                      COLHDG('PRES' 'FATTURATO')
162200990728     A                                      EDTCDE(K)
162300970820     A            $PGD           1A         TEXT('PAGAMENTO DANNO: B=BARTOLINI -
162400970820                                            O=CONSOLINDUSTRIA')
162500970820     A                                      COLHDG('PAGAM' 'DANNO')
162600980505     A            $PGM          10A         TEXT('NOME PROGRAMMA')
162700980505     A                                      COLHDG('NOME' 'PGM')
162800990728     A**          $PIP          11P         TEXT('PARTITA IVA')
162900990728     A**                                    COLHDG('PARTITA IVA')
163000940519     A            $PKB      R               TEXT('PESO KG BOLLETTATO')
163100940519     A                                      COLHDG('PESO' 'KG' 'BOLLET')
163200940519     A                                      REFFLD($PKL *SRC)
163300070109     A            $PKC      R               TEXT('PESO KG DA IMPIANTO')
163400070109     A                                      COLHDG('KG' 'DA' 'IMP.')
163500940519     A                                      REFFLD($PKL *SRC)
163600940519     A            $PKF      R               TEXT('PESO KG DA FATTURARE')
163700940519     A                                      COLHDG('PESO' 'KG' 'DA FATT')
163800940519     A                                      REFFLD($PKL *SRC)
163900940906     A            $PMB          48A         TEXT('DESCRIZIONE PIOMBI')
164000940906     A                                      COLHDG('PIOMBI')
164100930810     A            $PMD           1A         TEXT('PIU'' O MENO DI')
164200930810     A                                      COLHDG('PIU''' 'O MENO' 'DI')
164300970821     A            $PNO           3P 0       TEXT('PROGRESSIVO NOTE')
164400970821     A                                      COLHDG('PROGR.' 'NOTE')
164500990728     A                                      EDTCDE(Z)
164600990602     A            $POR          11P 3       TEXT('PORTO')
164700890908     A                                      COLHDG('PORTO')
164800990728     A                                      EDTCDE(K)
164900011123     A            $PO1           3P 0       TEXT('PRIMO P.O.')
165000011123     A                                      COLHDG('PRIMO P.O.')
165100011123     A                                      EDTCDE(Z)
165200011123     A            $PO2           3P 0       TEXT('SECONDO P.O.')
165300011123     A                                      COLHDG('SECONDO P.O.')
165400011123     A                                      EDTCDE(Z)
165500991222     A            $PES           3P 0       TEXT('P.O. ESECUZIONE SPUNTA')
165600991222     A                                      COLHDG('P.O.' 'ESEC.' 'SPUNTA')
165700991222     A                                      EDTCDE(Z)
165800890908     A            $PPA           5P 2       TEXT('% PROVVIGIONE ASSEGNO')
165900890908     A                                      COLHDG('PERC.' 'PROVV.' 'ASS.')
166000990728     A                                      EDTCDE(K)
166100910612     A            $PPC      R               REFFLD($FLA *SRC)
166200910612     A                                      TEXT('PAGAM.PROVV.C/ASS.M=MITT.+
166300910612     A                                      D=DESTIN.')
166400910612     A                                      COLHDG('P.C/A' 'M/D')
166500970821     A            $PRC           3P 0       TEXT('PERCENTUALE')
166600970821     A                                      COLHDG('% PERC.')
166700990728     A                                      EDTCDE(Z)
166800940520     A            $PRD           2A         TEXT('PROVINCIA DESTINATARIO')
166900940520     A                                      COLHDG('PROVICIA' 'DEST')
167000930812     A            $PRG           3P 0       TEXT('PRG.TARIFFA')
167100930812     A                                      COLHDG('PRG' 'TAR')
167200990728     A                                      EDTCDE(Z)
167300070119     A            $PRGG          2P 0       TEXT('PRG.GIRO TELLUS')
167400070119     A                                      COLHDG('PRG' 'GIRO')
167500070119     A                                      EDTCDE(Z)
167600090223     A            $PRGO          1          TEXT('PROGRESSIVO OFFERTA')
167700090223     A                                      COLHDG('PRG' 'OFFERTA')
167800090223     A            $PRGOT         1S 0       TEXT('PROGRES. OFFERTA TRATTATIVA')
167900090223     A                                      COLHDG('PRG' 'OFFERTA' 'TRATTATIVA')
168000940630     A            $PRI           5P 2       TEXT('PERC. ADDEBITO ISTAT')
168100940630     A                                      COLHDG('PERC.' 'ADDEB.' 'ISTAT')
168200990728     A                                      EDTCDE(K)
168300940520     A            $PRM           2A         TEXT('PROVINCIA MITTENTE')
168400940520     A                                      COLHDG('PROVICIA' 'MITT')
168500990728     A            $PRN           7P 0       TEXT('NUMERO PRATICA ASSICURATIVA')
168600990728     A                                      COLHDG('NUM' 'PRAT.ASSIC')
168700990728     A                                      EDTCDE(Z)
168800940520     A            $PRO           2A         TEXT('PROVINCIA')
168900940520     A                                      COLHDG('PROVICIA')
169000900331     A            $PRT           9P 2       TEXT('PORTATA')
169100900331     A                                      COLHDG('PORTATA')
169200990728     A                                      EDTCDE(Z)
169300040519     A            $PRR           4S 0       TEXT('PROGRESSIVO RIGA DDT CLIENTE')
169400040519     A                                      COLHDG('PROG. RIGA' 'DDT CLIENTE')
169500040519     A                                      EDTCDE(Z)
169600940630     A            $PRU          10A         TEXT('PROFILO UTENTE')
169700940630     A                                      COLHDG('PROFILO' 'UTENTE')
169800110422     A            $PSC          10A         TEXT('PUNTO DI SCAMBIO')
169900110422     A                                      COLHDG('PUNTO' 'SCAMBIO')
170000910612     A            $PSG      R               REFFLD($FLA *SRC)
170100910612     A                                      TEXT('PAGAM.SPESE GIAC. M=MITT.+
170200910612     A                                      D=DESTIN.')
170300910612     A                                      COLHDG('SP.G.' 'M/D')
170400070109     A            $PUC           7P 3       TEXT('PESO UNITARIO DA IMPIANTO')
170500120618     A                                      COLHDG('PESO' 'UNIT' 'VDL')
170600990728     A                                      EDTCDE(K)
170700921215     A            $PUT      R               TEXT('NUM.PISTOLA USCITA DAL TRANSI+
170800921215     A                                      TO')
170900921215     A                                      COLHDG('N.PIST' 'USC' 'TRANS')
171000921215     A                                      REFFLD($NPS *SRC)
171100890908     A            $PVL           5P 0       TEXT('PESO RAPPORTO VOLUME')
171200890908     A                                      COLHDG('PESO' 'RAPP.' 'VOL.')
171300900912     A*---- Q ----*
171400900912     A            $QTA           7P 0       TEXT('QUANTITA')
171500990728     A                                      COLHDG('QTA')
171600990728     A                                      EDTCDE(Z)
171700940519     A            $QFT          13P 3       TEXT('QUANTITA DA FATTURARE')
171800940519     A                                      COLHDG('QTA' 'DA FATT')
171900990728     A                                      EDTCDE(K)
172000890908     A*---- R ----*
172100900330     A            $RAM           9A         TEXT('RIFERIM.ALLEGATI MITTENTE')
172200900330     A                                      COLHDG('RIFER.' 'ALLEG.' 'MITT.')
172300930810     A            $RAP           7P 0       TEXT('RIFERIM. ALTRA TARIFFA: +
172400990427     A                                      COD. AUTOTRASP')
172500990728     A                                      EDTCDE(Z)
172600930810     A                                      COLHDG('RIFER.' 'A TAR' 'PADR.' )
172700890908     A            $RAS           7P 0       TEXT('RIVALSA ASSICURATIVA')
172800890908     A                                      COLHDG('RIVALSA' 'ASSIC.')
172900990728     A                                      EDTCDE(Z)
173000890908     A            $RAT           7P 0       TEXT('KSC ALTRA TARIFFA')
173100890908     A                                      COLHDG('CODICE' 'RIFER.' 'A TAR')
173200990728     A                                      EDTCDE(Z)
173300951006     A            $RBL           1A         TEXT('RAGGRUPP. BOLLE: +
173400951006     A                                      N=NORMALI +
173500000303     A                                      C=C/S R=RECUPERO S=SPEDIZIONI')
173600951006     A                                      COLHDG('RAGGR.' 'BOLLE')
173700930810     A            $RCT           3P 0       TEXT('RIFERIM. ALTRA TARIFFA: +
173800930810     A                                      COD. TARIFFA')
173900930810     A                                      COLHDG('RIFER.' 'A COD' 'TAR')
174000990427     A            $RGF      R               TEXT('RAGGR.P.O. LINEA ARRIVO')
174100990427     A                                      COLHDG('RAGG.P.O.' 'L.ARR.')
174200890908     A                                      REFFLD($FIL *SRC)
174300940627     A            $RIC           2          TEXT('RIFERIM. C.COSTO: LNP,TFA,SED-
174400940627     A                                      E,ECC.(TAB.2T)')
174500940627     A                                      COLHDG('FIL' 'RIF')
174600890908     A            $RIG           5P 0       TEXT('PROGRESSIVO RIGA')
174700890908     A                                      COLHDG('PRG' 'RIG')
174800990728     A                                      EDTCDE(Z)
174900040119     A            $RIF          50A         TEXT('RIFERIM. RECLAMO')
175000040119     A                                      COLHDG('RIF' 'RECLAMO')
175100940627     A            $RIT           2          TEXT('RIFERIM. TARIFFA: (LNP,TFA,TR-
175200940627     A                                      ANS.,ECC.(TAB.2Q)')
175300940627     A                                      COLHDG('TIP' 'TAR')
175400890908     A            $RFA           7P 0       TEXT('RIFERIMENTO ASSEGNO')
175500890908     A                                      COLHDG('RIF' 'ASS')
175600990728     A                                      EDTCDE(Z)
175700011123     A            $RFI          15P 0       TEXT('FINE RANGE')
175800011123     A                                      COLHDG('FINE' 'RANGE')
175900011123     A                                      EDTCDE(Z)
176000011123     A            $RIN          15P 0       TEXT('INIZIO RANGE')
176100011123     A                                      COLHDG('INIZIO' 'RANGE')
176200011123     A                                      EDTCDE(Z)
176300940921     A            $RMA          15A         TEXT('RIFERIM.MITTENTE ALFABETICO')
176400940520     A                                      COLHDG('RIFER' 'MITT' 'ALFAB')
176500930201     A            $RMD          10A         TEXT('RIF.MITTENTE ORIGINALE SEDE')
176600930201     A                                      COLHDG('RIFER.' 'MITT.' 'ORIG.SEDE')
176700940921     A            $RMN          15P 0       TEXT('RIFERIM.MITTENTE NUMERICO')
176800940520     A                                      COLHDG('RIFER' 'MITT' 'NUMER')
176900990728     A                                      EDTCDE(Z)
177000940420     A            $RNA           1A         TEXT('REPARTO RESPONS. NOTA ACCRE.')
177100940209     A                                      COLHDG('REPARTO' 'N.ACCR.')
177200920520     A            $RNT          60A         TEXT('RIGA NOTA')
177300920520     A                                      COLHDG('RIGA' 'NOTA')
177400040319     A            $RPG          10A         TEXT('UTENTE  GESTIONE')
177500040319     A                                      COLHDG('UTENTE' 'GESTIONE')
177600890908     A            $RPV           3P 1       TEXT('RAPPORTO PESO VOLUME')
177700890908     A                                      COLHDG('RAPP.' 'PESO' 'VOL')
177800900323     A            $RSB          25A         TEXT('RAGIONE SOCIALE SU BOLLE')
177900900323     A                                      COLHDG('RAG.SOC.SU BOLLE')
178000940517     A            $RSD      R               TEXT('RAGIONE SOCIALE DESTINATARIO')
178100900323     A                                      COLHDG('RAG.SOC.DESTINATARIO')
178200940517     A                                      REFFLD($RSC *SRC)
178300130116     A            $RSM      R               TEXT('RAG.SOCIALE MITTENTE')
178400130116     A                                      COLHDG('RAG.SOC.MITTENTE')
178500940614     A                                      REFFLD($RSC *SRC)
178600940721     A            $RS2      R               TEXT('RAG.SOCIALE MITTENTE 2')
178700940721     A                                      COLHDG('RAG.SOC.MITTENTE 2')
178800940721     A                                      REFFLD($RSC *SRC)
178900920414     A            $RST          30A         TEXT('RESPONSABILE TRASPORTI')
179000920414     A                                      COLHDG('RAG.SOCIALE MITTENTE')
179100951006     A            $RTC           1A         TEXT('CAUSALE RITARDO')
179200951006     A                                      COLHDG('CAUSALE' 'RITARDO')
179300951006     A            $RTD          35A         TEXT('DESCRIZIOJNE RITARDO')
179400951006     A                                      COLHDG('DESCRIZ' 'RITARDO')
179500890908     A*---- S ----*
179600930810     A            $SAB           3P 0       TEXT('SPEDIZ. PER APPLICAZ. BONUS')
179700930810     A                                      COLHDG('SPED' 'APPL' 'BONUS')
179800990728     A                                      EDTCDE(Z)
179900910930     A            $SAN           1A         TEXT('SOGG.ANOMALIA: S=SEGNACOLLO -
180000910930     A                                      B=BOLLA D=')
180100910930     A                                      COLHDG('SOGG' 'ANOM')
180200890908     A            $SBL      R               TEXT('FLAG SPESE BOLLO ')
180300890908     A                                      COLHDG('FLAG' 'SP.BOLLO')
180400890908     A                                      REFFLD($FLA *SRC)
180500070119     A            $SCF      R               TEXT('SOTTOCONTO INTESTAZ. FATTURA')
180600070119     A                                      COLHDG('SOTTOCONTO' 'INT.FATT')
180700070119     A                                      REFFLD($KSC *SRC)
180800940721     A            $SCM      R               TEXT('CODICE CLIENTE GIACENZA')
180900940721     A                                      COLHDG('CLIENTE' 'GIACENZA')
181000940721     A                                      REFFLD($KSC *SRC)
181100940427     A*
181200940427     A* $SCG ---> USATO SOLO NEL DETTAGLIO TARIFFE PADRONCINI
181300930812     A            $SCG           5P 0       TEXT('SCAGLIONE TARIFFA')
181400930812     A                                      COLHDG('SCAGL' 'TAR.')
181500990728     A                                      EDTCDE(Z)
181600940427     A*
181700890908     A            $SCI      R               TEXT('CODICE SOTTOCONTO IVA')
181800890908     A                                      COLHDG('COD.S/CONTO' 'I.V.A.')
181900890908     A                                      REFFLD($KSC *SRC)
182000111130     A            $DFA      R               TEXT('DATA FIRMA ACCETTAZIONE')
182100111130     A                                      COLHDG('DATA' 'FIR.ACC.')
182200111130     A                                      REFFLD($DA8 *SRC)
182300111130     A            $UNODC    R               TEXT('PRIMA DATA CERTA ')
182400111130     A                                      COLHDG('DATA' 'CERTA')
182500111130     A                                      REFFLD($DA8 *SRC)
182600940615     C* SCN --> DA ELIMINARE
182700910104     A            $SCN           7P 0       TEXT('NUMERO SEGNACOLLO (NUOVO)')
182800910104     A                                      COLHDG('NUM.' 'SEGNA' 'COLLO')
182900990728     A                                      EDTCDE(Z)
183000940427     A*
183100940427     A* $SCP ---> USATO SOLO NEL DETTAGLIO TARIFFE PARTICOLARI PADRONCINI
183200920513     A            $SCP           9P 0       TEXT('SCAGLIONE TARIFFA PARTICOL')
183300920513     A                                      COLHDG('SCAGL' 'TAR' 'PART')
183400990728     A                                      EDTCDE(Z)
183500940427     A*
183600920414     A            $SCT           5P 0       TEXT('CODICE CATEGORIA SEAT')
183700920414     A                                      COLHDG('COD' 'CAT.' 'SEAT')
183800990728     A                                      EDTCDE(Z)
183900890908     A            $SC1           6P 0       TEXT('DATA SCADENZA PAG.')
184000890908     A                                      COLHDG('DATA' 'SCAD' 'PAG')
184100930924     A            $SDT      R               TEXT('FL.SOSTITUZIONE DETT.TARIFFA')
184200930924     A                                      COLHDG('FL.SOST.' 'TARIFFA')
184300930924     A                                      REFFLD($FLA *SRC)
184400950117     A            $SET           7P 0       TEXT('TOT.SPEDIZ.DISTINTA RITIRAR-
184500950117     A                                      E/CONSEGNATE')
184600990728     A                                      EDTCDE(Z)
184700950117     A                                      COLHDG('SPED' 'DISTINTA' 'RIT/CONS')
184800970821     A            $SFS           1A         TEXT('SOGG.FASE: M=MERCE C=CA')
184900970821     A                                      COLHDG('SOGG' 'FASE')
185000890925     A            $SFT           1A         TEXT('SEP.FATTURA X TARIFFA BLK=NO+
185100890908     A                                       1=SI')
185200890908     A                                      COLHDG('SEP.FT.' 'X TARIF.')
185300990624     A            $SGA          11P 3       TEXT('SPESE AGGIUNTIVE GIACENZA')
185400910612     A                                      COLHDG('SPESE' 'AGGIUNT' 'GIACENZA')
185500990728     A                                      EDTCDE(K)
185600920414     A            $SGC           4A         TEXT('CODICE GRUPPO-CATEGORIA SEAT')
185700920414     A                                      COLHDG('COD' 'GRU.' 'SEAT')
185800990609     A            $SGD          11P 3       TEXT('SPESE DOSSIER GIACENZA')
185900900330     A                                      COLHDG('SPESE' 'DOSSIER' 'GIACENZA')
186000990728     A                                      EDTCDE(K)
186100940802     A            $SGF           3P 0       TEXT('GIORNI SOSTA FRANCHIGIA')
186200940802     A                                      COLHDG('GIORNI' 'SOSTA' 'FRANCH')
186300990728     A                                      EDTCDE(Z)
186400940427     A*
186500940427     A* $SGL ---> USATO SOLO NELLE TARIFFE CLIENTI
186600940427     A            $SGL          13P 3       TEXT('SCAGLIONE TARIFFA')
186700940427     A                                      COLHDG('SCAGL' 'TARIF')
186800990728     A                                      EDTCDE(K)
186900940427     A*
187000990609     A            $SGP          11P 3       TEXT('SPESE RICONSEGNA PROVINCIA')
187100940802     A                                      COLHDG('SPESE' 'RICONS' 'PROVINC')
187200990728     A                                      EDTCDE(K)
187300990609     A            $SGR          11P 3       TEXT('SPESE RICONS./VARIE GIACENZA')
187400990728A    A                                      COLHDG('SPESE' 'RICONS.' 'GIACENZA')
187500990728     A                                      EDTCDE(K)
187600990609     A            $SGS          11P 3       TEXT('SPESE SOSTA GIACENZA')
187700900330     A                                      COLHDG('SPESE' 'SOSTA' 'GIACENZA')
187800990728     A                                      EDTCDE(K)
187900990609     A            $SGV          11P 3       TEXT('SPESE VARIE GIACENZA')
188000940802     A                                      COLHDG('SPESE' 'VARIE' 'GIACENZA')
188100990728     A                                      EDTCDE(K)
188200931026     A            $SIC      R               TEXT('S=SOLO INCASSO')
188300931026     A                                      COLHDG('SOLO' 'INCAS')
188400931026     A                                      REFFLD($FLA *SRC)
188500971016     A            $SIF          10A         TEXT('NOME SISTEMA INFORMATIVO')
188600971016     A                                      COLHDG('SISTEMA' 'INFORMATIVO')
188700890908     A            $SIN      R               TEXT('IMPORTO SPESE INCASSO')
188800890908     A                                      COLHDG('IMP.SPESE' 'INCASSO')
188900890908     A                                      REFFLD($ISP *SRC)
189000940517     A            $SIS      R               TEXT('STAMPA (SI/NO) IMPORTO DA AS+
189100940517     A                                      SIC.IN BOLLA')
189200940517     A                                      COLHDG('STAMPA' 'IMP' 'DA SSIC')
189300940517     A                                      REFFLD($FLA *SRC)
189400070125     A            $SLB           4P 0       TEXT('SEQUEN.LETTURA BOLLA TELLUS')
189500070125     A                                      COLHDG('SEQ.BOLLA' 'TELLUS')
189600070125     A                                      EDTCDE(Z)
189700920414     A            $SMC           4A         TEXT('CODICE MACRO-CATEGORIA SEAT')
189800920414     A                                      COLHDG('COD' 'MACR.' 'SEAT')
189900890908     A            $SME           3  0       TEXT('SETTORE MERCEOLOGICO')
190000890908     A                                      COLHDG('SETT.' 'MERC.')
190100990728     A                                      EDTCDE(Z)
190200931011     A            $SML      R               TEXT('FL.SIMULAZIONE TARIFFA')
190300931011     A                                      COLHDG('FL.SIMULAZ.' 'TARIFFA')
190400931011     A                                      REFFLD($FLA *SRC)
190500940926     A            $SNA           7P 0       TEXT('TOT. SPEDIZIONI')
190600940926     A                                      COLHDG('TOT' 'SPEDIZ.')
190700990728     A                                      EDTCDE(Z)
190800940209     A            $SNC      R               TEXT('S=STAMPATA N.ACCR. X CLIENTE')
190900940209     A                                      COLHDG('ST.' 'NOTA' 'CLIENTE')
191000940209     A                                      REFFLD($FLA *SRC)
191100950117     A            $SNE           7P 0       TEXT('TOT.SPEDIZ.NON CONS.E NON PAG-
191200950117                                            ATE')
191300990728     A                                      EDTCDE(Z)
191400950117     A                                      COLHDG('SPED' 'NO CONS E PAG')
191500940209     A            $SNI      R               TEXT('S=STAMPATA N.ACCR. COPIA IVA')
191600940209     A                                      COLHDG('ST.N.' 'COPIA' 'IVA')
191700940209     A                                      REFFLD($FLA *SRC)
191800931202     A            $SNP           7P 0       TEXT('TOT.SPEDIZIONI NON PAGATE')
191900931202     A                                      COLHDG('SPED' 'NON' 'PAGATE')
192000990728     A                                      EDTCDE(Z)
192100900628     A            $SNS           1A         TEXT('FLAG SI NO STAMPA')
192200900628     A                                      COLHDG('S/N' 'STAMPA')
192300950117     A            $SNT           7P 0       TEXT('TOT.SPEDIZ.NON CONSEGNATE')
192400940923     A                                      COLHDG('SPED' 'NON' 'CONSEGNATE')
192500990728     A                                      EDTCDE(Z)
192600940617     A            $SNU           1A         TEXT('FLAG SI NO UTILIZZO')
192700940617     A                                      COLHDG('S/N' 'UTILIZZO')
192800011025     A            $SOC           3A         TEXT('CODICE SOCIETA')
192900011025     A                                      COLHDG('SOCIETA')
193000890908     A            $SOL      R               TEXT('FL. SOLLECITO CLIENTE S/N')
193100890908     A                                      COLHDG('FL.SOLL.' 'CLIENTE')
193200890908     A                                      REFFLD($FLA *SRC)
193300900328     A            $SOP           1A         TEXT('SIGLA OPERATORE VIDEO')
193400900328     A                                      COLHDG('S' 'O' 'V')
193500890908     A            $SPI           5P 0       TEXT('SPESE INCASSO')
193600890908     A                                      COLHDG('SPESE' 'INCASSO')
193700990728     A                                      EDTCDE(K)
193800080630     A            $SPF           4A         TEXT('SOTTOTIPO INFO COMM')
193900080630     A                                      COLHDG('SOTTOTIP' 'INFO' 'COMM')
194000940701     A            $SPG      R               TEXT('SOTTOSPECIE CAT.FOGLIO')
194100940701     A                                      COLHDG('SOTTOSP' 'CAT.FOGLIO')
194200910802     A                                      REFFLD($FLA *SRC)
194300900627     A            $SPN          20A         TEXT('SPUNTATORE')
194400900627     A                                      COLHDG('SPUNT.')
194500931202     A            $SPP           7P 0       TEXT('TOT.SPEDIZIONI PAGATE')
194600931202     A                                      COLHDG('SPED' 'PAGATE')
194700990728     A                                      EDTCDE(Z)
194800940627     A            $SPT           1          TEXT('SVILUPPO PESO TASSABILE')
194900940627     A                                      COLHDG('SVIL' 'PESO'' TASS')
195000070125     A            $SQL           4P 0       TEXT('SEQUENZA LETTURA GIRO TELLUS')
195100070119     A                                      COLHDG('SEQ.' 'GIRO')
195200070119     A                                      EDTCDE(Z)
195300930713     A            $SST           7P 0       TEXT('TOT. SPEDIZ. C/S DI TRANSITI')
195400930713     A                                      COLHDG('SPED' 'C/S' 'DI TRANS')
195500990728     A                                      EDTCDE(Z)
195600890908     A            $STA           1P 0       TEXT('STATO CONTRASSEGNO')
195700890908     A                                      COLHDG('STATO')
195800990728     A                                      EDTCDE(Z)
195900980512     A            $STG           1A         TEXT('CODICE STAGIONALITA')
196000980512     A                                      COLHDG('STAG' 'ION.')
196100970821     A            $STD      R               TEXT('SOTTOTIPO DESCRIZIONE')
196200970821     A                                      COLHDG('SOTTOTIPO' 'DESCRIZIONE')
196300970821     A                                      REFFLD($FLA *SRC)
196400920414     A            $STL           1A         TEXT('CODICE TIPOLOGIA CLI. SEAT')
196500920414     A                                      COLHDG('COD' 'TIP.' 'SEAT')
196600990609     A            $STM          11P 3       TEXT('SOSTA TARIFFA MINIMA')
196700940802     A                                      COLHDG('SOSTA' 'TARIFFA' 'MINIMA')
196800990728     A                                      EDTCDE(K)
196900001129     A            $STO           3P 0       TEXT('STATO PRIORITA')
197000001129     A                                      COLHDG('ST' 'PR')
197100001129     A                                      EDTCDE(Z)
197200990728     A            $STP           5P 0       TEXT('NR.STOP IN DISTINTA +
197300911001     A                                      CONSEGNA')
197400910617     A                                      COLHDG('STOP')
197500990728     A                                      EDTCDE(Z)
197600900627     A            $STV          20A         TEXT('STIVATORE')
197700900627     A                                      COLHDG('STIV')
197800890908     A            $SV1           1A         TEXT('SIGLA VARIE 1')
197900990830     A                                      COLHDG('SIGLA' 'VARIA 1')
198000890908     A            $SV2           1A         TEXT('SIGLA VARIE 2')
198100990830     A                                      COLHDG('SIGLA' 'VARIA 2')
198200930201     A            $SV3           1A         TEXT('SIGLA VARIE 3')
198300990830     A                                      COLHDG('SIGLA' 'VARIA 3')
198400990830     A            $SVN           1A         TEXT('SIGLA ULTERIORE VARIA')
198500990830     A                                      COLHDG('SIGLA' 'VARIA N')
198600060428     A            $SVT           1A         TEXT('SIGLA VARIA TASSATA')
198700060428     A                                      COLHDG('SIGLA' 'VARIA TAS.')
198800890908     A*---- T ----*
198900890908     A            $TAC           5P 2       TEXT('% TASSO ASS.NE X CONTO')
199000890908     A                                      COLHDG('%TASSO' 'ASS.NE' 'X CON')
199100990728     A                                      EDTCDE(K)
199200970820     A            $TAD           2A         TEXT('TIPO ANOMALIA DANNI')
199300970820     A                                      COLHDG('TIPO' 'ANOM' 'DANNI')
199400910930     A            $TAN           1A         TEXT('TIPO ANOMALIA: M=MANCA -
199500910930     A                                      D=DISGUIDO F=FUORI POSTO')
199600910930     A                                      COLHDG('TIPO' 'ANOM')
199700070109     A            $TAP           1A         TEXT('TIPO APPARATO SPUNTA')
199800070109     A                                      COLHDG('TIPO' 'APPAR.' 'SPUNTA')
199900930810     A            $TAT           1A         TEXT('TIPO APPLICAZ. TARIFFA')
200000930810     A                                      COLHDG('TIPO' 'APPL' 'TAR')
200100980513     A            $TBC           1A         TEXT('TIPO BLOCCO CLIENTE')
200200980513     A                                      COLHDG('B' 'C')
200300890913     A            $TBL           2A         TEXT('TIPO BOLLA')
200400890908     A                                      COLHDG('TIP.' 'BOL.')
200500021209     A            $TBA           2S 0       TEXT('TIPO BANCALE')
200600021209     A                                      COLHDG('TIPO' 'BANCALE')
200700011024     A            $TBN          10P 3       TEXT('BONUS')
200800930810     A                                      COLHDG('BONUS')
200900011025     A                                      EDTCDE(K)
201000931008     A            $TBS           5P 0       TEXT('TOTALE BUSTE')
201100931008     A                                      COLHDG('TOT' 'BUSTE')
201200990728     A                                      EDTCDE(Z)
201300940721     A            $TCM           1A         TEXT('TIPO COMUNIC. MITTENTE')
201400940721     A                                      COLHDG('TIPO' 'COMUNIC.' 'MITT.')
201500890908     A            $TCV           2P 0       TEXT('TARIFFA CARTELLO IN VIGORE')
201600890908     A                                      COLHDG('PRG' 'TAR' 'CART')
201700990728     A                                      EDTCDE(Z)
201800910109     A            $TCR           1A         TEXT('TIPO DT.CONSEGNA:" "= IL +
201900910109     A                                      D= DOPO IL/ P= PRIMA DEL')
202000910109     A                                      COLHDG('TP' 'DT.' 'CONS.')
202100021209     A            $TC1      R               TEXT('1 CONSEGNA PARTICOLARE')
202200021209     A                                      COLHDG('1 CONS' 'PARTIC')
202300021209     A                                      REFFLD($FTC *SRC)
202400021209     A            $TDF           1A         TEXT('TIPO DATA FATTURA')
202500021209     A                                      COLHDG('TIPO' 'DATA' 'FATT')
202600980702     A            $TDT      R               TEXT('REPERIMENTO DDT: P=PARTENZA A-
202700980702     A                                       =ARRIVO " "=NESSUNO')
202800980702     A                                      COLHDG('REPERIMENTO' 'DDT')
202900940519     A                                      REFFLD($FTC *SRC)
203000990427     A            $TFA      R               TEXT('TERMINAL ARRIVO')
203100990427     A                                      COLHDG('TERM' 'ARR')
203200910109     A                                      REFFLD($FIL *SRC)
203300940802     A            $TFG      R               TEXT('TIPO COMUNIC.FINE GIACENZA')
203400940802     A                                      COLHDG('TIPO COM' 'FINE' 'GIAC')
203500940802     A                                      REFFLD($FLA *SRC)
203600990427     A            $TFP      R               TEXT('TERMINAL PARTENZA')
203700990427     A                                      COLHDG('TERM' 'PAR')
203800910109     A                                      REFFLD($FIL *SRC)
203900890908     A            $TFT      R               TEXT('TIPO FATTURA  0=SI FATT.,+
204000890908     A                                      1=AUTOFATT.,9=NO FATT.')
204100890908     A                                      COLHDG('TIPO' 'FATT.')
204200890908     A                                      REFFLD($FLN *SRC)
204300931007     A            $TIA      R               TEXT('TOTALE IMPORTI ACCESSORI')
204400931007     A                                      COLHDG('TOTALE' 'ACCESS')
204500931007     A                                      REFFLD($IMP *SRC)
204600900303     A            $TIC           2A         TEXT('TIPO INCASSO CONTRASS.')
204700900303     A                                      COLHDG('TIPO' 'INC.' 'C/A')
204800011024     A            $TIG          10P 3       TEXT('TARIFFA INTERA GIORNATA')
204900930810     A                                      COLHDG('TAR' 'INTERA' 'GG')
205000990728     A                                      EDTCDE(K)
205100011025     A            $TIM          10P 3       TEXT('TOT. IMPORTI AGGIUNTI MANUAL+
205200931012                                            MENTE')
205300931007     A                                      COLHDG('TOTALE' 'AGG.MANO')
205400011025     A                                      EDTCDE(K)
205500890908     A            $TIN           1A         TEXT('TIPO INOLTRO')
205600890908     A                                      COLHDG('TIPO' 'IN.')
205700890908     A            $TIP           2A         TEXT('TIPO DOCUMENTO')
205800890908     A                                      COLHDG('TIPO' 'DOC')
205900070119     A            $TIPA     R               TEXT('TIPO ANAGRAFICA')
206000070119     A                                      COLHDG('TIPO' 'ANAGRAFICA')
206100070119     A                                      REFFLD($FLA *SRC)
206200931007     A            $TIT      R               TEXT('TOTALE IMPORTI TAR.BASE')
206300931007     A                                      COLHDG('TOTALE' 'TAR.BASE')
206400931007     A                                      REFFLD($IMP *SRC)
206500940627     A            $TIV           2          TEXT('TIPO IMPONIB.VOCE: IR=IMP.REA-
206600940627     A                                      LE,CO=CONTR.(TAB.2P)')
206700940627     A                                      COLHDG('TIPO' 'IMP.' 'VOCE')
206800990427     A            $TMA           1A         TEXT('TIPO MANDATO ASSICURATIVO')
206900990427     A                                      COLHDG('TIPO' 'MANDATO' 'ASS')
207000921214     A            $TMC           1A         TEXT('TIPO MANCATA CONSEGNA')
207100911001     A                                      COLHDG('TIPO' 'MANC.' 'CONS')
207200040519     A            $TMD           4A         TEXT('TIPO MODULO DDT CLIENTE TABEL-
207300040519                                            LA -AR8-')
207400040519     A                                      COLHDG('MODULO DDT CLIENTE' 'TABELL-
207500040519                                            A -AR8-')
207600011024     A            $TMG          10P 3       TEXT('TARIFFA MEZZA GIORNATA')
207700930810     A                                      COLHDG('TAR' 'MEZZA' 'GG')
207800990728     A                                      EDTCDE(K)
207900990728     A**          $TMP           5P 0       TEXT('T.C.P.')
208000990728     A**                                    COLHDG('T.C.P.')
208100951002     A            $TMZ           2A         TEXT('TIPO AUTOMEZZO')
208200940906     A                                      COLHDG('TIPO' 'MEZZO')
208300090217     A            $TNC           3A         TEXT('TIPO NOTA CLIENTI/POTENZIALI')
208400090217     A                                      COLHDG('TIPO' 'NOTA')
208500940209     A            $TNR           1A         TEXT('TIPO N.ACCR.RICHIESTA +
208600940209     A                                      S=PAG.SEDE,B=BLOC.,I=INTERNO')
208700940209     A                                      COLHDG('TIPO' 'NOTA' 'RICH.')
208800920520     A            $TNT           2A         TEXT('TIPO NOTA')
208900920520     A                                      COLHDG('TIPO' 'NOTA')
209000040119     A            $TOR           1A         TEXT('TIPO OGGETTO RECLAMO')
209100040119     A                                      COLHDG('TIPO' 'OGGETTO' 'RECLAMO')
209200910619     A            $TPA           1A         TEXT('TIPO ASSEGNO: C=CIRC,B=BANC,+
209300910619     A                                      V=VAGL,P=ASS.POST')
209400910619     A                                      COLHDG('TIPO' 'ASS.')
209500940804     A            $TPB      R               TEXT('TIPO PAGAMENTO BONUS')
209600940804     A                                      COLHDG('TIPO' 'PAGAM' 'BONUS')
209700940804     A                                      REFFLD($FLA *SRC)
209800980507     A            $TPC           1A         TEXT('TIPO PAGAM. CONTRASSEGNI')
209900980507     A                                      COLHDG('TIPO' 'PAG.' 'C/AS')
210000970821     A            $TPD      R               TEXT('TIPO DESCRIZIONE')
210100970821     A                                      COLHDG('TIPO' 'DESCR')
210200970821     A                                      REFFLD($FLA *SRC)
210300011024     A            $TPE          10P 3       TEXT('TARIFFA PER PIKING O +
210400930810     A                                      ETICHETTATURA')
210500990728     A                                      EDTCDE(K)
210600930810     A                                      COLHDG('TAR' 'PIK/ETICH.')
210700080630     A            $TPF           3A         TEXT('TIPO INFO COMM')
210800080630     A                                      COLHDG('INFO' 'COMM')
210900910619     A            $TPI           1A         TEXT('TIPO INTEST. ASS. M=MITTENTE')
211000910619     A                                      COLHDG('INT.' 'M=MIT')
211100070119     A            $TPM      R               TEXT('BLANKS=PARCEL/M=MESSAGERIE')
211200070119     A                                      COLHDG('PAR./MES.')
211300070119     A                                      REFFLD($FLA *SRC)
211400940721     A            $TPN           1A         TEXT('TIPO NOTA GIAC. BLK/I, I=INT+
211500940721     A                                      ERNA')
211600940721     A                                      COLHDG('TIPO' 'ASS.')
211700890915     A            $TPG           1P 0       TEXT('TIPO PAGAMENTO')
211800890915     A                                      COLHDG('TIP' 'PAG')
211900990728     A                                      EDTCDE(Z)
212000930921     A            $TPO           1A         TEXT('TIPO PORTO (F=FRANCO,A=ASS.)')
212100930921     A                                      COLHDG('TIPO' 'PORTO')
212200940804     A            $TPP      R               TEXT('TIPO PAGAMENTO PIKING')
212300940804     A                                      COLHDG('TIPO' 'PAGAM' 'PIKING')
212400940804     A                                      REFFLD($FLA *SRC)
212500970123     A            $TPR           2A         TEXT('TIPO PRODOTTO')
212600930924     A                                      COLHDG('TIPO' 'PRODOTTO')
212700900322     A            $TPV           1A         TEXT('TIPO VISITA')
212800900322     A                                      COLHDG('TIP' 'VIS')
212900890908     A            $TRB           3A         TEXT('TIPO RECORD D.B.A.')
213000890908     A                                      COLHDG('T' 'R')
213100900809     A            $TRC           1A         TEXT('TIPO RECORD ')
213200990830     A                                      COLHDG('TIPO' 'RECORD')
213300021125     A            $TRD           3A         TEXT('TIPO RECORD')
213400021125     A                                      COLHDG('TIPO' 'RECORD')
213500900331     A            $TRG          10A         TEXT('TARGA MEZZO')
213600900331     A                                      COLHDG('TARGA')
213700040519     A            $TRK           2A         TEXT('TIPO RECORD DDT CLIENTE')
213800040519     A                                      COLHDG('TIPO RECORD' 'DDT CLIENTE')
213900040119     A            $TRI           1A         TEXT('TIPO RIFERIMENTO RECLAMO')
214000040119     A                                      COLHDG('TIPO' 'RIFER.' 'RECLAMO')
214100940906     A            $TRN           7P 0       TEXT('NUMERO TRAINO ')
214200940906     A                                      COLHDG('NUM' 'TRAINO')
214300990728     A                                      EDTCDE(Z)
214400930810     A            $TSM           1A         TEXT('TIPO SOMMA')
214500930810     A                                      COLHDG('TIPO' 'SOMMA')
214600931007     A            $TSP           1A         TEXT('TIPO SERVIZIO BOLLE')
214700931007     A                                      COLHDG('TIPO' 'SERV' 'BOL')
214800931104     A            $TSR           1A         TEXT('TIPO PRESTAZIONE PADRONCINI')
214900931104     A                                      COLHDG('TIPO' 'PREST' 'PADR')
215000011024     A            $TST          10P 3       TEXT('TARIFFA A STOP')
215100990728A    A                                      COLHDG('TAR' 'STOP')
215200990728     A                                      EDTCDE(K)
215300070109     A            $TSU           1A         TEXT('TIPO SPUNTA:D=DISGUIDO')
215400070109     A                                      COLHDG('TIPO' 'SPUNTA')
215500970509     A            $TTC           5  0       TEXT('TIPO TEMPO CONSEGNA')
215600970509     A                                      COLHDG('TIPO' 'TEMPO' 'CONS.')
215700990728     A                                      EDTCDE(Z)
215800940906     A            $TTR           1A         TEXT('TIPO TRAINO')
215900940906     A                                      COLHDG('TIPO' 'TRAINO')
216000940627     A            $TTV           1          TEXT('TIPO TARIFFA: K=CLIEN,F=FIL,C-
216100940627     A                                      =CART,ECC.(TAB.2S)')
216200940627     A                                      COLHDG('TIP' 'TAR')
216300970522     A            $VER           5  0       TEXT('VERSIONE CAPPARIO')
216400970522     A                                      COLHDG('VERS' 'CAP')
216500990728     A                                      EDTCDE(Z)
216600940627     A            $TVO           1          TEXT('TIPO VOCE: V=VOCE, M=MAGGIORA-
216700940627     A                                      ZIONE')
216800940627     A                                      COLHDG('TIPO' 'VOCE')
216900950104     A            $TVU           9P 3       TEXT('TOTALE VOLUME')
217000950104     A                                      COLHDG('TOT' 'VOLUME')
217100990728     A                                      EDTCDE(K)
217200910612     A*---- U ----*
217300910612     A            $UBI           4A         TEXT('COD.UBICAZ.MERCE')
217400910612     A                                      COLHDG('UBIC.')
217500011123     A            $UNP          15P 0       TEXT('ULTIMO NUMERO PRELEVATO')
217600011123     A                                      COLHDG('ULTIMO N.' 'PRELEVATO')
217700011123     A                                      EDTCDE(Z)
217800130927     A            $UNI         200A         TEXT('DATI. PER DS VEDI TABELLA')
217900130927     A                                      COLHDG('DATI')
218000130927     A            $UNI70        70A         TEXT('DATI. PER DS VEDI TABELLA')
218100130927     A                                      COLHDG('DATI')
218200910612     A*---- V ----*
218300940720     A            $VAD      R               TEXT('DIVISA VAL.MERCE DICHIARATO')
218400940720     A                                      COLHDG('DIVISA' 'VAL' 'MERCE')
218500940519     A                                      REFFLD($VLT *SRC)
218600990602     A            $VAN          11P 3       TEXT('VARIE N')
218700990728     A                                      EDTCDE(K)
218800940701     A                                      COLHDG('VARIE N')
218900940720     A            $VAS      R               TEXT('DIVISA IMPORTO DA ASSICURARE')
219000940720     A                                      COLHDG('DIVISA' 'IMP' 'ASSIC')
219100940519     A                                      REFFLD($VLT *SRC)
219200060428     A            $VAT          11P 3       TEXT('VALORE TASSATO')
219300060428     A                                      EDTCDE(K)
219400060428     A                                      COLHDG('VAL' 'TASSATO')
219500990602     A            $VA1          11P 3       TEXT('VARIE 1')
219600890908     A                                      COLHDG('VARIE 1')
219700990728     A                                      EDTCDE(K)
219800990602     A            $VA2          11P 3       TEXT('VARIE 2')
219900890908     A                                      COLHDG('VARIE 2')
220000990728     A                                      EDTCDE(K)
220100990602     A            $VA3          11P 3       TEXT('VARIE 3')
220200930201     A                                      COLHDG('VARIE 3')
220300990728     A                                      EDTCDE(K)
220400940720     A            $VCA      R               TEXT('DIVISA IMPORTO C/ASSEGNO')
220500940720     A                                      COLHDG('DIVISA' 'C/A')
220600940519     A                                      REFFLD($VLT *SRC)
220700910612     A            $VCS      R               TEXT('VARIAZ.IMPORTO C/ASS -S/N')
220800910612     A                                      COLHDG('VAR.' 'IM.C/A')
220900910612     A                                      REFFLD($FLA *SRC)
221000000414     A            $VIE      R               TEXT('DIVISA IMPORTO DA ESPORRE')
221100000414     A                                      COLHDG('DIVISA' 'IMP' 'ESPORRE')
221200000414     A                                      REFFLD($VLT *SRC)
221300000414     A            $VIP      R               TEXT('DIVISA IMPORTO PATTUITO')
221400000414     A                                      COLHDG('DIVISA' 'IMP' 'PATTUITO')
221500000414     A                                      REFFLD($VLT *SRC)
221600940519     A            $VLB      R               TEXT('VOLUME BOLLETTATO')
221700940519     A                                      COLHDG('VOL' 'BOLLET')
221800940519     A                                      REFFLD($VLU *SRC)
221900070109     A            $VLC      R               TEXT('VOLUME DA IMPIANTO')
222000070109     A                                      COLHDG('VOL' 'DA' 'IMP.')
222100940519     A                                      REFFLD($VLU *SRC)
222200940519     A            $VLF      R               TEXT('VOLUME DA FATTURARE')
222300940519     A                                      COLHDG('VOL' 'DA FATT')
222400940519     A                                      REFFLD($VLU *SRC)
222500990427     A            $VLM          13P 3       TEXT('VALORE MERCE AL KG/COLLO/-
222600940519     A                                      SPED')
222700940519     A                                      COLHDG('VAL' 'MERCE')
222800990728     A                                      EDTCDE(K)
222900940923     A            $VLN           9P 4       TEXT('TOTALE VOLUME')
223000940923     A                                      COLHDG('TOT' 'VOLUME')
223100990728     A                                      EDTCDE(K)
223200981016     A            $VLP      R               REFFLD($DA8 *SRC)
223300981016     A                                      COLHDG('VALUTA PAGAMENTO')
223400981016                                            TEXT('VALUTA PAGAMENTO')
223500940519     A            $VMD          13P 3       TEXT('VALORE MERCE DICHIARATO')
223600940519     A                                      COLHDG('VAL.MER' 'DICHIARATO')
223700990728     A                                      EDTCDE(K)
223800940627     A            $VOC           3  0       TEXT('CODICE VOCE')
223900940627     A                                      COLHDG('COD' 'VOCE')
224000990728     A                                      EDTCDE(K)
224100990427     A            $VVM      R               TEXT('DIVISA VAL.MERCE ASSICURATO')
224200990427     A                                      COLHDG('DIVISA' 'VAL' 'MERCE')
224300990427     A                                      REFFLD($VLT *SRC)
224400940627     A*
224500940627     A* VOL DA ELIMINARE
224600890913     A            $VOL           5P 2       TEXT('VOLUME IN MC.')
224700890908     A                                      COLHDG('VOLUME')
224800990728     A                                      EDTCDE(K)
224900940627     A            $VRV           2          TEXT('TIPO RIFERIM.VOCE: 00=Q.LI,01-
225000940627     A                                      =COLLI,ECC.(TAB.2R)')
225100940627     A                                      COLHDG('TIPO' 'RIF.' 'VOCE')
225200070109     A            $VUC           7P 6       TEXT('VOLUME UNITARIO DA IMPIANTO')
225300120618     A                                      COLHDG('VOL' 'UNIT' 'VDL')
225400990728     A                                      EDTCDE(K)
225500900328     A*---- X ----*
225600900328     A            $XCO           1A         TEXT('X= CUMULATIVO COLLI')
225700900328     A                                      COLHDG('X=' 'CUM.' 'COLLI')
225800890908     A*---- Z ----*
225900900327     A            $ZON           3A         TEXT('COD.ZONA GEOGRAFICA')
226000900327     A                                      COLHDG('COD.' 'ZONA' 'GEOG.')
226100990906     A            $ZNC           2P 0       TEXT('ZONA')
226200940615     A                                      COLHDG('ZONA')
226300990728     A                                      EDTCDE(K)
226400000920     A            $ZNR           2A         TEXT('ZONA RITIRO')
226500000920     A                                      COLHDG('ZONA' 'RIT.')
226600910104     A            $ZSC           2  0       TEXT('ZONA SEGNACOLLO')
226700940630     A                                      COLHDG('ZONA' 'SEGNACOLLO')
226800990728     A                                      EDTCDE(K)
226900940701     A            $ZNP          20A         TEXT('ZONE PADRONCINO')
227000940630     A                                      COLHDG('ZONE' 'PADRONC')
227100890906     A*--------------------------------------------------------------*
227200890908     A*-- §§§ FINE BARTOLINI §§§ ------------------------------------*
227300890908     A*--------------------------------------------------------------*
227400890908     A*
227500890908     A*--------------------------------------------------------------*
227600890906     A*  DIZIONARIO  CONTABILITA'        SIA402                      *
227700890906     A*--------------------------------------------------------------*
227800840614     A            $AVERE        15P 0
227900840614     A                                      TEXT('--AVERE--')
228000840614     A                                      COLHDG('--AVERE--')
228100840614     A            $ANNO          2P 0       TEXT('ANNO')
228200840614     A                                      COLHDG('AA')
228300840614     A            $ATB02         1A         TEXT('COD.ATTIVITA''REC. D.B.A.')
228400840614     A                                      COLHDG('CD' 'ATT' 'DBA')
228500840614     A            $BANCAAPP     36A         TEXT('BANCA APPOGGIO')
228600840614     A                                      COLHDG('BANCA APP.')
228700840614     A            $BANCACOR      7P 0       TEXT('NOSTRA BNC.CORRISP.BNA APPOG')
228800840614     A                                      COLHDG('BNA' 'CORR')
228900840614     A            $CDANOPE       2A         TEXT('CODICE TIPO DI ANAOPE')
229000840614     A                                      COLHDG('CD' 'TP' 'OP')
229100840614     A            $CDUTENT       1P 0       TEXT('CODICE UTENTE CONTI')
229200840614     A                                      COLHDG('U' 'T' 'E')
229300840614     A                                      RANGE(1 9)
229400840614     A            $CDCAPOC       4P 0       TEXT('CODICE CAPOCONTO')
229500840614     A                                      COLHDG('C/CN')
229600840614     A            $CDTRE         3P 0       TEXT('CODICE 3 NUMERICO')
229700840614     A                                      COLHDG('COD')
229800840614     A            $CDSOTTC       7P 0       TEXT('CODICE SOTTOCONTO')
229900840614     A                                      COLHDG('S/CN')
230000840614     A            $CDCONPAG      6A         TEXT('CODICE CONDIZIONE PAGAMENTO')
230100840614     A                                      COLHDG('CON' 'PAG')
230200840614     A            $CDAVPOST      5P 0       TEXT('---CAP---')
230300840614     A                                      COLHDG('CAP')
230400011025     A            $CDF           8A         TEXT('CODICE FORNIT.CONTABIL+
230500011025     A                                      ITA')
230600011025     A                                      COLHDG('COD.' 'FORNIT.')
230700840614     A            $CDFISCAL     16A         TEXT('CODICE FISCALE')
230800840614     A                                      COLHDG('COD. FIS.')
230900840614     A            $CDIVA        16A         TEXT('CODICE PARTITA IVA')
231000840614     A                                      COLHDG('COD. IVA ')
231100840614     A            $CDLINGUA      1A         TEXT('CODICE LINGUA')
231200840614     A                                      COLHDG('L' 'I' 'N')
231300840614     A            $CDOPERAZ      4A         TEXT('CODICE OPERAZIONE ')
231400840614     A                                      COLHDG('COD.' 'OPER')
231500840614     A            $COD1P         1P 0       TEXT('CODICE GENERICO')
231600840614     A                                      COLHDG('COD')
231700840614     A            $DATAAMG       6P 0       TEXT('DATA PACKED IN AAMMGG')
231800840614     A                                      COLHDG('DATA' 'AAMMGG')
231900840614     A                                      EDTCDE(Y)
232000840614     A            $DATAGMA       6  0       TEXT('DATA PACKED EST GGMMAA')
232100840614     A                                      COLHDG('DATA' 'GGMMAA')
232200840614     A                                      EDTCDE(2)
232300840614     A            $DATACOM       6  0       TEXT('DATA COMPETENZA AAMM00')
232400840614     A                                      COLHDG('DATA' 'COMP' 'AAMM00')
232500840614     A                                      EDTCDE(Y)
232600840614     A            $DARE         15P 0
232700840614     A                                      TEXT('---DARE---')
232800840614     A                                      COLHDG('---DARE---')
232900840614     A            $DAREAVERE     1A         TEXT('DARE / AVERE')
233000840614     A                                      COLHDG('D' 'A')
233100840614     A            $DES6          6A         TEXT('DESCRIZ. 6 CARATTERI')
233200840614     A                                      COLHDG('DESC 6')
233300900316     A            $DES10        10A         TEXT('DESCRIZIONE DI 10 CARAT.')
233400900316     A                                      COLHDG('DESCRIZ.')
233500900316     A            $DES15        15A         TEXT('DESCRIZIONE DI 15 CARAT.')
233600900316     A                                      COLHDG('DESCRIZ.')
233700840614     A            $DES16        16A         TEXT('DESCRIZIONE DI 16 CARAT.')
233800840614     A                                      COLHDG('DESCRIZ.')
233900840614     A            $DES30        30A         TEXT('DESCRIZ. 30 CARATTERI')
234000840614     A                                      COLHDG('DESC 30')
234100141009     A            $DES40        40A         TEXT('DESCRIZ. 40 CARATTERI')
234200141009     A                                      COLHDG('DESC 40')
234300840614     A            $DIVISA        4A         TEXT('DIVISA')
234400840614     A                                      COLHDG('DIV')
234500840614     A            $FILL2         2A         TEXT('2 BYTE EXA')
234600840614     A                                      COLHDG('FILL2')
234700840614     A            $FILL4         4A         TEXT('4 BYTE EXA')
234800840614     A                                      COLHDG('FILL4')
234900840614     A            $FILL5         5A         TEXT('5 BYTE EXA')
235000840614     A                                      COLHDG('FILL5')
235100840614     A            $FILL6         6A         TEXT('6 BYTE EXA')
235200840614     A                                      COLHDG('FILL6')
235300840614     A            $FILL8         8A         TEXT('8 BYTE  EXA')
235400840614     A                                      COLHDG('FILL8')
235500840614     A            $FIL10        10A         TEXT('10 BYTES EXA')
235600840614     A                                      COLHDG('FIL10')
235700840614     A            $FIL12        12A         TEXT('12 BYTES EXA')
235800840614     A                                      COLHDG('FIL12')
235900840614     A            $IMPORTO5      5P 0       TEXT('IMPORTO --5--CIFRE')
236000840614     A                                      COLHDG('IMP.')
236100840614     A                                      EDTCDE(2)
236200840614     A            $IMPORTO15    15P 0       TEXT('IMPORTO --15--CIFRE')
236300840614     A                                      COLHDG('IMP.')
236400840614     A                                      EDTCDE(2)
236500840614     A            $LOCALIT1     30A         TEXT('VIA ')
236600840614     A                                      COLHDG('VIA')
236700840614     A            $LOCALIT2     30A         TEXT('CITTA"')
236800840614     A                                      COLHDG('CITTA"')
236900840614     A            $GIORNO        2P 0       TEXT('GIORNO')
237000840614     A                                      COLHDG('GG')
237100840614     A            $MESE          2P 0       TEXT('MESE')
237200840614     A                                      COLHDG('MM')
237300840614     A            $MESENOPAG     2P 0       TEXT('MESE ESCLUSO DAL PAGAMENTO')
237400840614     A                                      COLHDG('MM' 'NO' 'PG')
237500840614     A            $NRJOB         9P 0       TEXT('NUMERO JOB D.B.A.')
237600840614     A                                      COLHDG('NUM' 'JOB' 'DBA')
237700840614     A            $NUMER15      15P 0       TEXT('15 PACKED SEGNATO')
237800840614     A                                      COLHDG('NUM15')
237900840614     A            $NUMER6        6P 0       TEXT('6 PACKED')
238000840614     A                                      COLHDG('NUM6')
238100840911     A            $OPZIO        10A         TEXT('FLAG ANAGRAFICI')
238200840911     A                                      COLHDG('FLAG' 'ANAG')
238300840614     A            $PROVINCIA     2A         TEXT('PROVINCIA')
238400840614     A                                      COLHDG('PR' 'OV')
238500840614     A            $PARAMUT       4P 0       TEXT('PARAMETRO RECORD UTENTE')
238600840614     A                                      COLHDG('PAR.' 'UTEN.')
238700840614     A            $RAGSOC       48A         TEXT('DESCRIZIONE CONTO')
238800840614     A                                      COLHDG('DESCR.CONTO')
238900840614     A            $RAGGRX        2P 0       TEXT('PRIMI  DUE BYTE DEL RAGGRUP.')
239000840614     A                                      COLHDG('  ' 'XX')
239100840614     A            $RAGGRY        2P 0       TEXT('SECON. DUE BYTE DEL RAGGRUP.')
239200840614     A                                      COLHDG('  ' 'YY')
239300840614     A            $RAGGRZ        2P 0       TEXT('TERZI  DUE BYTE DEL RAGGRUP.')
239400840614     A            $RIFMSG        1A         TEXT('CAMPO DUMMY PER ERRMSG')
239500840614     A                                      COLHDG('DY' 'ERR')
239600840614     A            $SCONTO        3P 1       TEXT('SCONTO')
239700840614     A                                      COLHDG('SCO' 'NTO')
239800840614     A            $STATO         4A         TEXT('SIGLA STATO')
239900840614     A                                      COLHDG('NAZ.')
240000840614     A            $SWDESCR       3P 0       TEXT('SWITCH DESCRIZ.AGGIUNTIVA')
240100840614     A                                      COLHDG('SWD')
240200840614     A            $TIPO          1A         TEXT('TIPO RECORD')
240300840911     A            $TIPOCON       2A         TEXT('TIPO CONTO CG/CF/CR.....')
240400840614     A                                      COLHDG('TP.' 'CN')
240500840614     A            $TIPOREC       2P 0       TEXT('TIPO RECORD')
240600840614     A                                      COLHDG('TP.' 'RE')
240700840614     A            $TELE         16A         TEXT('TELEFONO')
240800840614     A                                      COLHDG('TELEFONO')
240900840614     A            $TRB02         3A         TEXT('TIPO RECORD D.B.A.')
241000840614     A                                      COLHDG('TP''REC' 'DBA')
241100840614     A*--------------------------------------------------------------*
241200840614     A*  CONTABILITA/38   FILE PARAMETRICO UTENTE     CNPAR00F       *
241300840614     A*--------------------------------------------------------------*
241400840614     A            PARFLG    R               REFFLD($FLAG *SRC)
241500840614     A            PARKUT    R               REFFLD($CDUTENT *SRC)
241600840614     A                                      RANGE(0 9)
241700840614     A            PARTIP    R               REFFLD($TIPOREC *SRC)
241800840614     A            PAR1      R               REFFLD($FILL6 *SRC)
241900840614     A            PAR2      R               REFFLD($FILL6 *SRC)
242000840614     A            PAR3      R               REFFLD($FILL6 *SRC)
242100840614     A            PAR4      R               REFFLD($FILL6 *SRC)
242200840614     A            PAR5      R               REFFLD($FILL6 *SRC)
242300840614     A            PAR6      R               REFFLD($FILL6 *SRC)
242400840614     A            PAR7      R               REFFLD($FILL6 *SRC)
242500840614     A            PAR8      R               REFFLD($FILL6 *SRC)
242600840614     A            PAR9      R               REFFLD($FILL6 *SRC)
242700840614     A            PAR10     R               REFFLD($FILL6 *SRC)
242800840614     A            PAR11     R               REFFLD($FILL6 *SRC)
242900840614     A            PAR12     R               REFFLD($FILL6 *SRC)
243000840614     A            PAR13     R               REFFLD($FILL6 *SRC)
243100840614     A            PAR14     R               REFFLD($FILL6 *SRC)
243200840614     A            PAR15     R               REFFLD($FILL6 *SRC)
243300840614     A            PAR16     R               REFFLD($FILL6 *SRC)
243400840614     A            PAR17     R               REFFLD($FILL6 *SRC)
243500840614     A            PAR18     R               REFFLD($FILL6 *SRC)
243600840614     A            PAR19     R               REFFLD($FILL6 *SRC)
243700840614     A            PAR20     R               REFFLD($FILL6 *SRC)
243800840614     A            PAR21     R               REFFLD($FILL6 *SRC)
243900840614     A            PAR22     R               REFFLD($FILL6 *SRC)
244000840614     A            PAR23     R               REFFLD($FILL6 *SRC)
244100840614     A            PAR24     R               REFFLD($FILL6 *SRC)
244200840614     A            PAR25     R               REFFLD($FILL6 *SRC)
244300840614     A*--------------------------------------------------------------*
244400840614     A** CONTABILITA/38   FILE ANAGRAFICO CONTI       CNAC00F      **
244500840614     A*--------------------------------------------------------------*
244600840614     A            ACOFLG    R               REFFLD($FLAG *SRC)
244700840614     A            ACOKUT    R               REFFLD($CDUTENT *SRC)
244800840614     A            ACOKCC    R               REFFLD($CDCAPOC *SRC)
244900840614     A            ACOKSC    R               REFFLD($CDSOTTC *SRC)
245000840614     A            ACORAG    R               REFFLD($RAGSOC *SRC)
245100840614     A            ACOOPZ    R               REFFLD($OPZIO *SRC)
245200840911     A                                      COLHDG('FLAG' 'OPER')
245300840911     A                                      TEXT('FLAG OPERATIVI=AL CAPO CONTO')
245400840614     A            ACORX1    R               REFFLD($RAGGRX *SRC)
245500840614     A                                      COLHDG('R1' 'X')
245600840614     A            ACORY1    R               REFFLD($RAGGRY *SRC)
245700840614     A                                      COLHDG('R1' 'Y')
245800840614     A            ACORZ1    R               REFFLD($RAGGRZ *SRC)
245900840614     A                                      COLHDG('R1' 'Z')
246000840614     A            ACORX2    R               REFFLD($RAGGRX *SRC)
246100840614     A                                      COLHDG('R2' 'X')
246200840614     A            ACORY2    R               REFFLD($RAGGRY *SRC)
246300840614     A                                      COLHDG('R2' 'Y')
246400840614     A            ACORZ2    R               REFFLD($RAGGRZ *SRC)
246500840614     A                                      COLHDG('R2' 'Z')
246600840614     A            ACORX3    R               REFFLD($RAGGRX *SRC)
246700840614     A                                      COLHDG('R3' 'X')
246800840614     A            ACORY3    R               REFFLD($RAGGRY *SRC)
246900840614     A                                      COLHDG('R3' 'Y')
247000840614     A            ACORZ3    R               REFFLD($RAGGRZ *SRC)
247100840614     A                                      COLHDG('R3' 'Z')
247200840614     A            ACORX4    R               REFFLD($RAGGRX *SRC)
247300840614     A                                      COLHDG('R4' 'X')
247400840614     A            ACORY4    R               REFFLD($RAGGRY *SRC)
247500840614     A                                      COLHDG('R4' 'Y')
247600840614     A            ACORZ4    R               REFFLD($RAGGRZ *SRC)
247700840614     A                                      COLHDG('R4' 'Z')
247800840614     A            ACOTIC    R               REFFLD($TIPOCON *SRC)
247900840614     A            ACODUV    R               REFFLD($DATAAMG *SRC)
248000840614     A                                      TEXT('DATA ULT.VARIAZ.ANAGRAFICA')
248100840614     A                                      COLHDG('ULT' 'VAR')
248200840614     A            ACOFID    R               REFFLD($IMPORTO5 *SRC)
248300840911     A                                      TEXT('FIDO MAX IN MIL.-non usato-')
248400840614     A                                      COLHDG('FIDO' 'MAX' 'MIL.')
248500840614     A            ACOABL    R               REFFLD($FLAG *SRC)
248600840911     A                                      TEXT('BLOCCO CLIENTE')
248700840911     A                                      COLHDG('B' 'C')
248800840614     A            ACOMEP    R               REFFLD($MESENOPAG *SRC)
248900840911     A                                      TEXT('ALLEGATO IVA')
249000840614     A*--         ACOCDP    R               REFFLD($CDCONPAG *SRC)
249100840614     A*--         ACOLIN    R               REFFLD($CDLINGUA *SRC)
249200840614     A            ACODIV    R               REFFLD($DIVISA *SRC)
249300840614     A            ACOFDO    R               REFFLD($IMPORTO5 *SRC)
249400840912     A                                      TEXT('FIDO SIAC X 100000')
249500840911     A                                      COLHDG('FIDO' 'SIAC' 'MIL')
249600840614     A*--------------------------------------------------------------*
249700840614     A** CONTABILITA/38   FILE ANAGRAFICO INDIR       CNIND00F      **
249800840614     A*--------------------------------------------------------------*
249900840614     A            INDFLG    R               REFFLD($FLAG *SRC)
250000840614     A            INDKUT    R               REFFLD($CDUTENT *SRC)
250100840614     A            INDKCC    R               REFFLD($CDCAPOC *SRC)
250200840614     A            INDKSC    R               REFFLD($CDSOTTC *SRC)
250300840614     A            INDVIA    R               REFFLD($LOCALIT1 *SRC)
250400840911     A                                      TEXT('INDIRIZZO')
250500840614     A            INDCIT    R               REFFLD($LOCALIT2 *SRC)
250600920414     A                                      TEXT('LOCALITA          ')
250700840614     A            INDCAP    R               REFFLD($CDAVPOST *SRC)
250800840911     A                                      TEXT('C.A.P.')
250900840614     A            INDPRV    R               REFFLD($PROVINCIA *SRC)
251000840614     A            INDSTA    R               REFFLD($STATO *SRC)
251100840614     A            INDTLX    R               REFFLD($TELE *SRC)
251200840614     A                                      TEXT('TELEX')
251300840614     A                                      COLHDG('TELEX')
251400840614     A            INDTEL    R               REFFLD($TELE *SRC)
251500840614     A            INDBNA    R               REFFLD($BANCAAPP *SRC)
251600840614     A            INDBNN    R               REFFLD($BANCACOR *SRC)
251700840614     A            INDCDF    R               REFFLD($CDFISCAL *SRC)
251800840614     A            INDIVA    R               REFFLD($CDIVA    *SRC)
251900080205     A                                      TEXT('CODICE PARTITA IVA  -lg.16-')
252000840614     A*---
252100840614     A            INDCDP    R               REFFLD($CDCONPAG *SRC)
252200840911     A                                      TEXT('COD.CONDIZIONE PAG. -lg.3-')
252300840614     A            INDLIN    R               REFFLD($CDLINGUA *SRC)
252400840614     A            INDSC1    R               REFFLD($SCONTO *SRC)
252500840911     A                                      TEXT('SCONTO PAGAMENTO')
252600840614     A            INDSC2    R               REFFLD($SCONTO *SRC)
252700840911     A                                      TEXT('2° SC.PAG.-non usato')
252800840614     A            INDME1    R               REFFLD($MESENOPAG *SRC)
252900840614     A            INDTE1    R               REFFLD($FILL2 *SRC)
253000840614     A                                      TEXT('TIPO ESCLUS.PAG')
253100840614     A                                      COLHDG('TP' 'NO' 'PG')
253200840614     A            INDME2    R               REFFLD($MESENOPAG *SRC)
253300840614     A            INDTE2    R               REFFLD($FILL2 *SRC)
253400840614     A                                      TEXT('TIPO ESCLUS.PAG')
253500840614     A                                      COLHDG('TP' 'NO' 'PG')
253600840614     A            INDIP1    R               REFFLD($GIORNO *SRC)
253700840614     A                                      TEXT('GG.INIZIO PAGAM.1')
253800840614     A                                      COLHDG('GG' 'IN' 'PG')
253900840614     A            INDIP2    R               REFFLD($GIORNO *SRC)
254000840614     A                                      TEXT('GG.INIZIO PAGAM.2')
254100840614     A                                      COLHDG('GG' 'IN' 'PG')
254200840614     A            INDOPZ    R               REFFLD($OPZIO *SRC)
254300840911     A                                      TEXT('OPZIONI')
254400840614     A*--------------------------------------------------------------*
254500840614     A** CONTABILITA/38   FILE ANAGRAFICO FATTURAZIONE CNAFA00F     **
254600840614     A** NON UTILIZZATO
254700840614     A*--------------------------------------------------------------*
254800840614     A            AFAFLG    R               REFFLD($FLAG *SRC)
254900840614     A            AFAKUT    R               REFFLD($CDUTENT *SRC)
255000840614     A            AFAKCC    R               REFFLD($CDCAPOC *SRC)
255100840614     A            AFAKSC    R               REFFLD($CDSOTTC *SRC)
255200840614     A            AFASC1    R               REFFLD($SCONTO *SRC)
255300840614     A            AFASC2    R               REFFLD($SCONTO *SRC)
255400840614     A            AFAME1    R               REFFLD($MESENOPAG *SRC)
255500840614     A            AFATE1    R               REFFLD($FILL2 *SRC)
255600840614     A                                      TEXT('TIPO ESCLUS.PAG')
255700840614     A                                      COLHDG('TP' 'NO' 'PG')
255800840614     A            AFAME2    R               REFFLD($MESENOPAG *SRC)
255900840614     A            AFATE2    R               REFFLD($FILL2 *SRC)
256000840614     A                                      TEXT('TIPO ESCLUS.PAG')
256100840614     A                                      COLHDG('TP' 'NO' 'PG')
256200840614     A            AFAIP1    R               REFFLD($GIORNO *SRC)
256300840614     A                                      TEXT('GG.INIZIO PAGAM.1')
256400840614     A                                      COLHDG('GG' 'IN' 'PG')
256500840614     A            AFAIP2    R               REFFLD($GIORNO *SRC)
256600840614     A                                      TEXT('GG.INIZIO PAGAM.2')
256700840614     A                                      COLHDG('GG' 'IN' 'PG')
256800840614     A            AFACDP    R               REFFLD($CDTRE *SRC)
256900840614     A                                      TEXT('COD. PORTO')
257000840614     A                                      COLHDG('COD' 'P.TO')
257100840614     A            AFACDI    R               REFFLD($CDTRE *SRC)
257200840614     A                                      TEXT('COD. IMBALLO')
257300840614     A                                      COLHDG('COD' 'IMB.' 'LLO')
257400840614     A            AFACDS    R               REFFLD($CDTRE *SRC)
257500840614     A                                      TEXT('COD. SPEDIZIONE')
257600840614     A                                      COLHDG('COD' 'SPE.' 'ONE')
257700840614     A            AFASCF    R               REFFLD($CDSOTTC *SRC)
257800840614     A                                      TEXT('S.CNT.A CUI FATTUR.')
257900840614     A                                      COLHDG('S.CNT' 'A CUI' 'AFAT.')
258000840614     A            AFACD4    R               REFFLD($CDTRE *SRC)
258100840614     A                                      TEXT('COD. LIBERO    ')
258200840614     A                                      COLHDG('COD' 'LIB' 'ERO')
258300840614     A            AFACD5    R               REFFLD($CDTRE *SRC)
258400840614     A                                      TEXT('COD. LIBERO')
258500840614     A                                      COLHDG('COD' 'LIB' 'ERO')
258600840614     A            AFASCI    R               REFFLD($CDSOTTC *SRC)
258700840614     A                                      TEXT('ALIQUOTA/ESENZ. IVA')
258800840614     A                                      COLHDG('IVA')
258900840614     A            AFAOPZ    R               REFFLD($OPZIO *SRC)
259000840614     A            AFAFAB    R               REFFLD($FLAG *SRC)
259100840614     A                                      TEXT('SPESE BOLLO SU RICB S/N')
259200840614     A                                      COLHDG('S' 'B')
259300840614     A            AFASPI    R               REFFLD($IMPORTO5 *SRC)
259400840614     A                                      TEXT('SPESE INCASSO')
259500840614     A                                      COLHDG('SPESE' 'INCAS')
259600840614     A*--------------------------------------------------------------*
259700840614     A** CONTABILITA/38   FILE ANAGRAFICO CLIENTI-AGENTE-LINEA.PROD- *
259800840614     A*--------------------------------------------------------------*
259900840614     A            AALFLG    R               REFFLD($FLAG *SRC)
260000840614     A            AALKUT    R               REFFLD($CDUTENT *SRC)
260100840614     A            AALKCC    R               REFFLD($CDCAPOC *SRC)
260200840614     A            AALKSC    R               REFFLD($CDSOTTC *SRC)
260300840614     A            AALLIN    R               REFFLD($FILL2 *SRC)
260400840614     A                                      TEXT('LINEA PRODOTTO')
260500840614     A                                      COLHDG('LIN' 'PRO')
260600840614     A            AALCAG    R               REFFLD($CDCAPOC *SRC)
260700840614     A                                      TEXT('C/CN AGENTE')
260800840614     A                                      COLHDG('C/CN' 'AGE')
260900840614     A            AALSAG    R               REFFLD($CDSOTTC *SRC)
261000840614     A                                      TEXT('S/CN AGENTE')
261100840614     A                                      COLHDG('S/CN' 'AGE')
261200840614     A*--------------------------------------------------------------*
261300840614     A** CONTABILITA/38   FILE ANAGRAFICO SALDI       CNSAL00F     **
261400840614     A*--------------------------------------------------------------*
261500840614     A            SALFLG    R               REFFLD($FLAG *SRC)
261600840614     A            SALKUT    R               REFFLD($CDUTENT *SRC)
261700840614     A            SALKCC    R               REFFLD($CDCAPOC *SRC)
261800840614     A            SALKSC    R               REFFLD($CDSOTTC *SRC)
261900840614     A            SALANN    R               REFFLD($ANNO *SRC)
262000840614     A                                      TEXT('ANNO DEL SALDO')
262100840614     A                                      COLHDG('AA'   'SL')
262200840614     A            SALDAR    R               REFFLD($IMPORTO15 *SRC)
262300840614     A                                      TEXT('SALDO DARE')
262400840614     A                                      COLHDG('SALDO' 'DARE')
262500840614     A            SALAVR    R               REFFLD($IMPORTO15 *SRC)
262600840614     A                                      TEXT('SALDO AVERE')
262700840614     A                                      COLHDG('SALDO' 'AVERE')
262800840614     A*--------------------------------------------------------------*
262900840614     A** CONTABILITA/38 FILE ANAGRAFICO OPERAZIONI ** CNOPE00F **   **
263000840614     A*--------------------------------------------------------------*
263100840614     A            OPEFLG    R               REFFLD($FLAG *SRC)
263200840614     A            OPECD1    R               REFFLD($CDANOPE *SRC)
263300840614     A            OPECOD    R               REFFLD($CDOPERAZ *SRC)
263400840614     A            OPEDES    R               REFFLD($DES16 *SRC)
263500840614     A            OPEP0     R               REFFLD($FIL10 *SRC)
263600840614     A            OPEP1     R               REFFLD($FIL10 *SRC)
263700840614     A            OPEP2     R               REFFLD($FIL10 *SRC)
263800840614     A            OPEP3     R               REFFLD($FIL10 *SRC)
263900840614     A            OPEP4     R               REFFLD($FIL10 *SRC)
264000840614     A            OPEP5     R               REFFLD($FIL10 *SRC)
264100840614     A            OPEP6     R               REFFLD($FIL10 *SRC)
264200840614     A            OPEP7     R               REFFLD($FIL10 *SRC)
264300840614     A            OPEP8     R               REFFLD($FIL10 *SRC)
264400840614     A*----------------------------------------------------------------*
264500840614     A** CONTABILITA/38  FILE MOVIMENTI CONTABILI    ** CNMOV00F **   **
264600840614     A*----------------------------------------------------------------*
264700840614     A            MOVFLG    R               REFFLD($FLAG *SRC)
264800840614     A            MOVKUT    R               REFFLD($CDUTENT *SRC)
264900840614     A            MOVKCC    R               REFFLD($CDCAPOC *SRC)
265000840614     A            MOVKSC    R               REFFLD($CDSOTTC *SRC)
265100840614     A            MOVDRG    R               REFFLD($DATAAMG *SRC)
265200840614     A                                      TEXT('DATA   REGISTRAZIONE')
265300840614     A                                      COLHDG('D.REG.')
265400840614     A            MOVNRG    R               REFFLD($NUMER6 *SRC)
265500840614     A                                      TEXT('NUMERO REGISTRAZIONE')
265600840614     A                                      COLHDG('N.REG.')
265700840614     A            MOVCOD    R               REFFLD($CDOPERAZ *SRC)
265800840614     A            MOVIMP    R               REFFLD($IMPORTO15 *SRC)
265900840614     A            MOVDA     R               REFFLD($DAREAVERE *SRC)
266000840614     A            MOVIM2    R               REFFLD($IMPORTO15 *SRC)
266100840614     A                                      TEXT('IMPORTO2')
266200840614     A                                      COLHDG('IMP2.')
266300840614     A            MOVDIV    R               REFFLD($DIVISA *SRC)
266400840614     A            MOVCDC    R               REFFLD($CDSOTTC *SRC)
266500840614     A                                      TEXT('SOTTOCONTO CENTRO DI COSTO')
266600840614     A                                      COLHDG('CENT.' 'DI' 'COSTO')
266700840614     A            MOVCCP    R               REFFLD($CDCAPOC *SRC)
266800840614     A                                      TEXT('CONTROPARTITA CAPOCONTO')
266900840614     A                                      COLHDG('CPAR' 'C.CN')
267000840614     A            MOVSCP    R               REFFLD($CDSOTTC *SRC)
267100840614     A                                      TEXT('CONTROPARTITA SOTTOCONTO')
267200840614     A                                      COLHDG('CPAR' 'S.CN')
267300840614     A            MOVDDC    R               REFFLD($DATAAMG *SRC)
267400840614     A                                      TEXT('DATA DOCUMENTO')
267500840614     A                                      COLHDG('D.DOC')
267600840614     A            MOVNDC    R               REFFLD($NUMER6 *SRC)
267700840614     A                                      TEXT('NUMERO DOCUMENTO')
267800840614     A                                      COLHDG('N.DOC.')
267900840614     A            MOVDRP    R               REFFLD($DATAAMG *SRC)
268000840614     A                                      TEXT('DATA   RIFERIMENTO PARTITA')
268100840614     A                                      COLHDG('D.RIF' 'PART.')
268200840614     A            MOVNRP    R               REFFLD($NUMER6 *SRC)
268300840614     A                                      TEXT('NUMERO RIFERIMENTO PARTITA')
268400840614     A                                      COLHDG('M.RIF' 'PART.')
268500840614     A            MOVDSC    R               REFFLD($DATAAMG *SRC)
268600840614     A                                      TEXT('DATA SCADENZA')
268700840614     A                                      COLHDG('D.SCAD')
268800840614     A            MOVCDP    R               REFFLD($DATACOM *SRC)
268900840614     A            MOVDES    R               REFFLD($DES16 *SRC)
269000840614     A            MOVSWD    R               REFFLD($SWDESCR *SRC)
269100840614     A            MOVDLG    R               REFFLD($DATAAMG *SRC)
269200840614     A                                      TEXT('DATA STAMPA LIBRO GIORNALE')
269300840614     A                                      COLHDG('DATA' 'GIORN')
269400840614     A            MOVAGE    R               REFFLD($CDSOTTC *SRC)
269500840614     A                                      TEXT('SOTTOTCONTO AGENTE')
269600840614     A                                      COLHDG('S.CN' 'AGEN')
269700840614     A*----------------------------------------------------------------*
269800840614     A** CONTABILITA/38  FILE DESCRIZIONI AGGIUNTIVE ** CNDES00F **   **
269900840614     A*----------------------------------------------------------------*
270000840614     A            DESFLG    R               REFFLD($FLAG *SRC)
270100840614     A            DESKUT    R               REFFLD($CDUTENT *SRC)
270200840614     A            DESKCC    R               REFFLD($CDCAPOC *SRC)
270300840614     A            DESKSC    R               REFFLD($CDSOTTC *SRC)
270400840614     A            DESDRG    R               REFFLD($DATAAMG *SRC)
270500840614     A                                      TEXT('DATA   REGISTRAZIONE')
270600840614     A                                      COLHDG('D.REG.')
270700840614     A            DESNRG    R               REFFLD($NUMER6 *SRC)
270800840614     A                                      TEXT('NUMERO REGISTRAZIONE')
270900840614     A                                      COLHDG('N.REG.')
271000840614     A            DESCOD    R               REFFLD($CDOPERAZ *SRC)
271100840614     A            DESSWD    R               REFFLD($SWDESCR *SRC)
271200840614     A            DESDES    R               REFFLD($DES16 *SRC)
271300840614     A*--------------------------------------------------------------*
271400840614     A** CONTABILITA/38  FILE PER TABULATI BILANCIO ** CNBIL00F **  **
271500840614     A*--------------------------------------------------------------*
271600840614     A            BILFLG    R               REFFLD($FLAG *SRC)
271700840614     A            BILKUT    R               REFFLD($CDUTENT *SRC)
271800840614     A            BILKCC    R               REFFLD($CDCAPOC *SRC)
271900840614     A            BILKSC    R               REFFLD($CDSOTTC *SRC)
272000840614     A            BILRX1    R               REFFLD(ACORX1   *SRC)
272100840614     A            BILRY1    R               REFFLD(ACORY1   *SRC)
272200840614     A            BILRZ1    R               REFFLD(ACORZ1   *SRC)
272300840614     A            BILRX2    R               REFFLD(ACORX2   *SRC)
272400840614     A            BILRY2    R               REFFLD(ACORY2   *SRC)
272500840614     A            BILRZ2    R               REFFLD(ACORZ2   *SRC)
272600840614     A            BILRX3    R               REFFLD(ACORX3   *SRC)
272700840614     A            BILRY3    R               REFFLD(ACORY3   *SRC)
272800840614     A            BILRZ3    R               REFFLD(ACORZ3   *SRC)
272900840614     A            BILRX4    R               REFFLD(ACORX4   *SRC)
273000840614     A            BILRY4    R               REFFLD(ACORY4   *SRC)
273100840614     A            BILRZ4    R               REFFLD(ACORZ4   *SRC)
273200840614     A            BILDPR    R               REFFLD($IMPORTO15 *SRC)
273300840614     A                                      TEXT('IMP.DARE PRECEDENTE')
273400840614     A                                      COLHDG('DARE' 'PREC')
273500840614     A            BILAPR    R               REFFLD($IMPORTO15 *SRC)
273600840614     A                                      TEXT('IMP.AVERE PRECEDENTE')
273700840614     A                                      COLHDG('AVERE' 'PREC.')
273800840614     A            BILDPE    R               REFFLD($IMPORTO15 *SRC)
273900840614     A                                      TEXT('IMP.DARE PERIODO')
274000840614     A                                      COLHDG('DARE' 'PERIODO')
274100840614     A            BILAPE    R               REFFLD($IMPORTO15 *SRC)
274200840614     A                                      TEXT('IMP.AVERE PERIODO')
274300840614     A                                      COLHDG('AVERE' 'PERIODO')
274400840614     A*----------------------------------------------------------------*
274500840614     A** CONTABILITA/38  FILE MOVIMENTI EXTRACONTABILI  CNEFF00F      **
274600840614     A*----------------------------------------------------------------*
274700840614     A            EFFFLG    R               REFFLD($FLAG *SRC)
274800840614     A            EFFKUT    R               REFFLD($CDUTENT *SRC)
274900840614     A            EFFTIP    R               REFFLD($TIPO *SRC)
275000840614     A                                      TEXT('TP.ATTIV/PASSIV 1/2')
275100840614     A                                      COLHDG('A/P' '1/2')
275200840614     A            EFFDEF    R               REFFLD($DATAAMG *SRC)
275300840614     A                                      TEXT('DATA   EFFETTO')
275400840614     A                                      COLHDG('D.EFF.')
275500840614     A            EFFNEF    R               REFFLD($NUMER6 *SRC)
275600840614     A                                      TEXT('NUMERO EFFETTO')
275700840614     A                                      COLHDG('N.EFF.')
275800840614     A            EFFCOD    R               REFFLD($CDOPERAZ *SRC)
275900840614     A            EFFDRG    R               REFFLD($DATAAMG *SRC)
276000840614     A                                      TEXT('DATA   REGISTRAZIONE')
276100840614     A                                      COLHDG('D.REG.')
276200840614     A            EFFNRG    R               REFFLD($NUMER6 *SRC)
276300840614     A                                      TEXT('NUMERO REGISTRAZIONE')
276400840614     A                                      COLHDG('N.REG.')
276500840614     A            EFFDRP    R               REFFLD($DATAAMG *SRC)
276600840614     A                                      TEXT('DATA   RIFERIMENTO PARTITA')
276700840614     A                                      COLHDG('D.RIF' 'PART.')
276800840614     A            EFFNRP    R               REFFLD($NUMER6 *SRC)
276900840614     A                                      TEXT('NUMERO RIFERIMENTO PARTITA')
277000840614     A                                      COLHDG('M.RIF' 'PART.')
277100840614     A            EFFDSC    R               REFFLD($DATAAMG *SRC)
277200840614     A                                      TEXT('DATA SCADENZA')
277300840614     A                                      COLHDG('D.SCAD')
277400840614     A            EFFDDT    R               REFFLD($DATAAMG *SRC)
277500840614     A                                      TEXT('DATA DISTINTA')
277600840614     A                                      COLHDG('D.DIST')
277700840614     A            EFFNDT    R               REFFLD($NUMER6 *SRC)
277800840614     A                                      TEXT('NUMERO DISTINTA')
277900840614     A                                      COLHDG('N.DIST')
278000840614     A            EFFIMP    R               REFFLD($IMPORTO15 *SRC)
278100840614     A            EFFIM2    R               REFFLD($IMPORTO15 *SRC)
278200840614     A                                      TEXT('IMPORTO BOLLO')
278300840614     A                                      COLHDG('IMP.VAL.')
278400840614     A            EFFDIV    R               REFFLD($DIVISA *SRC)
278500840614     A            EFFCCD    R               REFFLD($CDCAPOC *SRC)
278600840614     A                                      TEXT('C/CN CEDENTE(CLIEN)')
278700840614     A                                      COLHDG('C/CN' 'CEDE')
278800840614     A            EFFSCD    R               REFFLD($CDSOTTC *SRC)
278900840614     A                                      TEXT('S/CN CEDENTE(CLIEN)')
279000840614     A                                      COLHDG('S/CN' 'CEDE')
279100840614     A            EFFCCS    R               REFFLD($CDCAPOC *SRC)
279200840614     A                                      TEXT('C/CN CESSION(BANCA)')
279300840614     A                                      COLHDG('C/CN' 'CESS')
279400840614     A            EFFSCS    R               REFFLD($CDSOTTC *SRC)
279500840614     A                                      TEXT('S/CN CESSION(BANCA)')
279600840614     A                                      COLHDG('S/CN' 'CESS')
279700840614     A            EFFDEB    R               REFFLD($DES16 *SRC)
279800840614     A                                      TEXT('DESCRIZ. DEBITORE')
279900840614     A                                      COLHDG('DESCRIZ.DEBITORE')
280000840614     A            EFFPZZ    R               REFFLD($DES16 *SRC)
280100840614     A                                      TEXT('PIAZZA DEBITORE')
280200840614     A                                      COLHDG('PIAZZA')
280300840614     A            EFFNTR    R               REFFLD($CDTRE *SRC)
280400840614     A                                      TEXT('NUMERO TOT. RATE')
280500840614     A                                      COLHDG('NR' 'TT' 'RT')
280600840614     A            EFFNUR    R               REFFLD($CDTRE *SRC)
280700840614     A                                      TEXT('NUMERO PROGR. RATA')
280800840614     A                                      COLHDG('NR' 'RT')
280900840614     A            EFFNR1    R               REFFLD($NUMER6 *SRC)
281000840614     A                                      TEXT('NUMERO CONTRATTO')
281100840614     A                                      COLHDG('NR' 'EFF' 'CUMUL')
281200840614     A            EFFDA1    R               REFFLD($DATAAMG *SRC)
281300840614     A                                      TEXT('DATA EFF.CUMULATIVO')
281400840614     A                                      COLHDG('DATA' 'EFF' 'CUMU')
281500840614     A            EFFBEN    R               REFFLD($FIL12 *SRC)
281600840614     A                                      TEXT('BENESTARE BANCARIO')
281700840614     A                                      COLHDG('BENESTARE')
281800840614     A            EFFTDS    R               REFFLD($CDOPERAZ *SRC)
281900840614     A                                      TEXT('TIPO DISTINTA')
282000840614     A                                      COLHDG('TIPO' 'DIST')
282100840614     A            EFFSTA    R               REFFLD($COD1P *SRC)
282200840614     A                                      TEXT('STATO:')
282300840614     A                                      COLHDG('ST' 'AT' 'O ')
282400840614     A            EFFCLS    R               REFFLD($COD1P *SRC)
282500840614     A                                      TEXT('CLASSE')
282600840614     A                                      COLHDG('CL' 'AS' 'SE')
282700840614     A            EFFTIF    R               REFFLD($COD1P *SRC)
282800840614     A                                      TEXT('TIPO EFFETTO')
282900840614     A                                      COLHDG('TI' 'PO')
283000840723     A            EFFFIL         2  0
283100990427     A                                      TEXT('P.O.')
283200990427     A                                      COLHDG('P.O')
283300840723     A            EFFDBE         6  0
283400840723     A                                      TEXT('DATA BENESTARE BANC')
283500840723     A                                      COLHDG('DATA' 'BEN.')
283600840723     A            EFFBBE        10
283700840723     A                                      TEXT('SIGLA BANCA BENEST.')
283800840723     A                                      COLHDG('SIGLA' 'BANCA' 'BENESTARE')
283900840723     A            EFFFAT        15  0
284000840723     A                                      TEXT('IMPORTO FATTURA')
284100840723     A                                      COLHDG('IMPORTO' 'FATTURA')
284200090914     A*--------------------------------------------------------------*
284300090914     A** VAS                                          CNIND00F      **
284400090914     A*--------------------------------------------------------------*
284500090914     A            $KSU           8A
284600090914     A                                      TEXT('CLIENTE UNIFICANTE')
284700090914     A                                      COLHDG('CLIENTE UNIFICANTE')
284800090914     A            $SUN           9A
284900090914     A                                      TEXT('STRATEGI USER NUMBER')
285000090914     A                                      COLHDG('SGI USER NBR')
285100090914     A            $ISV           2A
285200090914     A                                      TEXT('TIPO SERVIZIO')
285300090914     A                                      COLHDG('TIPO SERVIZIO')
285400100714     A            $CHI          35A
285500100714     A                                      TEXT('CHI SONO - SEGNACOLLO')
285600100714     A                                      COLHDG('CHI SONO_SEGNACOLLO')
285700130301     A            $PDFN         33A
285800130306     A                                      TEXT('NOME PDF')
285900130306     A                                      COLHDG('NOME PDF')
286000130306     A            $PDFP          7A
286100130306     A                                      TEXT('CARTELLA CLIENTE PDF')
286200130306     A                                      COLHDG('CARTELLA CLIENTE PDF')
