000100970723     A*------------------------------------------------------------------------*
000200970723     A* TABELLA DATE AVANZAMENTO TRASFERIMENTO BOLLE E SALDI                   *
000300970723     A*------------------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500970723     A          R DS§$3                     TEXT('DATE TRASFERIM.BOLLE/SALDI')
000600970724     A            §$3D00    R     S         REFFLD($DA8)
000700970723     A                                      TEXT('DATA ULTIMA 00 > 10')
000800970723     A                                      COLHDG('ULT 00>10')
000900970724     A            §$3M10    R     S         REFFLD($MMM)
001000970723     A                                      TEXT('MESI IN TAS10')
001100970723     A                                      COLHDG('MESI 10')
001200970724     A            §$3D10    R     S         REFFLD($DA8)
001300970723     A                                      TEXT('DATA ULTIMA 10 > P')
001400970723     A                                      COLHDG('ULT 10>P')
001500970724     A            §$3MP0    R     S         REFFLD($MMM)
001600970723     A                                      TEXT('MESI IN TASP')
001700970723     A                                      COLHDG('MESI P')
001800970724     A            §$3DP0    R     S         REFFLD($DA8)
001900970723     A                                      TEXT('DATA ULTIMA P > CASSETTA')
002000970723     A                                      COLHDG('ULT P>TAPE')
002100020701     A            §$3DS0         6S 0       TEXT('LIBERO')
002200000406     A            §$3GEM         2S 0       TEXT('GIORNI PULIZIA EVENTI MIC')
002300000406     A                                      COLHDG('GG.PUL.''EVE.MIC')
002400020219     A            §$3MPP    R     S         REFFLD($MMM)
002500020219     A                                      TEXT('MESI BOLLE PT')
002600020219     A                                      COLHDG('MESI POSTE')
002700020219     A            §$3DPP    R     S         REFFLD($DA8)
002800020219     A                                      TEXT('DATA ULTIMA PT > CASSETTA')
002900020219     A                                      COLHDG('ULT PT>TAPE')
