000100890918     A*--------------------------------------------------------------*
000200951107     A*  TABELLA   $4 KG E MC DEFAULT STATISTICA ZONE/CAP
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500951107     A          R DS§$4                     TEXT('KG E MC STAT.ZONE/CAP')
000600951107     A            §$4KG1         3S 0       TEXT('KG 1')
000700981019     A            §$4MC1         3S 2       TEXT('MC 1')
000800951107     A            §$4KG2         3S 0       TEXT('KG 2')
000900981019     A            §$4MC2         3S 2       TEXT('MC 2')
001000951107     A            §$4KG3         3S 0       TEXT('KG 3')
001100981019     A            §$4MC3         3S 2       TEXT('MC 3')
001200951107     A            §$4KG4         3S 0       TEXT('KG 4')
001300981019     A            §$4MC4         3S 2       TEXT('MC 4')
