000100890918     A*--------------------------------------------------------------*
000200890920     A*  TABELLA   12  MERCATI                                       *
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500890920     A          R DS§12                     TEXT('MERCATI ')
000600891128     A            §12DES        25A         TEXT('DESCRIZIONE ')
