000100890918     A*--------------------------------------------------------------*
000200981012     A*  TABELLA   1E  ESITI VISITA
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500981012     A          R DS§1E                     TEXT('TIPI VISITA')
000600981012     A            §1EDES        25A         TEXT('DESCRIZIONE')
000700981012     A            §1ERCN         1A         TEXT('S=RICHIEDERE LA CAUSALE NON +
000800981012                                            CONTATTO SE VISITA CON POTENZIALE')
