000100890918     A*--------------------------------------------------------------*
000200960625     A*  TABELLA   1R  CAUS.NON CONTATTO CLIENTI POTENZIALI
000300890918     A*--------------------------------------------------------------*
000400960625     A          R DS§1R                     TEXT('CAUS.NON CONTATTO CLIENTI -
000500960625     A                                      POTENZIALI')
000600960625     A            §1RDES        25A         TEXT('DESCRIZIONE')
000700981014     A            §1RS01         2A         TEXT('STATO CLIENTE')
000800981014     A            §1RS02         2A         TEXT('STATO CLIENTE')
000900981014     A            §1RS03         2A         TEXT('STATO CLIENTE')
001000981014     A            §1RS04         2A         TEXT('STATO CLIENTE')
001100981014     A            §1RS05         2A         TEXT('STATO CLIENTE')
001200981014     A            §1RS06         2A         TEXT('STATO CLIENTE')
001300981014     A            §1RS07         2A         TEXT('STATO CLIENTE')
001400981014     A            §1RS08         2A         TEXT('STATO CLIENTE')
001500981014     A            §1RS09         2A         TEXT('STATO CLIENTE')
001600981014     A            §1RS10         2A         TEXT('STATO CLIENTE')
001700981014     A            §1RS11         2A         TEXT('STATO CLIENTE')
001800981014     A            §1RS12         2A         TEXT('STATO CLIENTE')
001900981014     A            §1RS13         2A         TEXT('STATO CLIENTE')
002000981014     A            §1RS14         2A         TEXT('STATO CLIENTE')
002100981014     A            §1RS15         2A         TEXT('STATO CLIENTE')
