000100890918     A*--------------------------------------------------------------*
000200920521     A*  TABELLA   1T - TIPI NOTE
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500920521     A          R DS§1T                     TEXT('TIPI NOTE')
000600920521     A            §1TDES        25A         TEXT('DESCRIZIONE')
000700920521     A            §1TRIG         3S 0       TEXT('NUMERO RIGHE')
000800030115     A            §1TDUP         1A         TEXT('S=DUPLICA IN CONVALIDA OFFERT-
000900030115                                            E')
001000920522     A            §1TTDP         1A         TEXT('TIPO DUPLICA A=ADD R=REPLACE')
001100001121     A            §1TEML         1A         TEXT('S=DATI E-MAIL DA CONTROLLARE')
001200020905     A            §1TPRO         1A         TEXT('S=DA PROTEGGERE SEMPRE IN GES-
001300020905                                            TIONE NOTE')
001400030213     A            §1TPOT         1A         TEXT('S=DA COPIARE X NUOVA VISITA D-
001500030213                                            A POTENZIALE')
001600040729     A            §1TLEG         1A         TEXT('TIPO LEGAME NOTE T=TARIFFA C=-
001700040729                                            CLIENTE " "=TARIFFA E CLIENTE')
001800051201     A            §1TRICH        1A         TEXT('TIPO RICHIAMO C=CONTATTI N=NO-
001900051201                                            TE " "=NESSUN RICHIAMO')
