000100890918     A*--------------------------------------------------------------*
000200931104     A*  TABELLA   1Z TIPO PRESTAZIONE TARIFFA
000300890918     A*--------------------------------------------------------------*
000400930928     A                                      REF(CNDIZION)
000500931104     A          R DS§1Z                     TEXT('TIPO PRESTAZIONE TARIFFA')
000600930928     A            §1ZDES        25A         TEXT('DESCRIZIONE')
000700930928     A            §1ZCTR         3A         TEXT('CODICE TARIFFA DEL TIPO +
000800931104     A                                      PRESTAZIONE')
000900931021     A            §1ZUPD         1A         TEXT('S=UTILIZZO NEI PROGRAMMI +
001000931021     A                                      TASSAZ.PADRONCINI')
001100021209     A            §1ZFAC         1A         TEXT('A=UTILIZZO NEI PROGRAMMI +   -
001200021209     A                                      X AUTOTRAS. "C" = UTILIZ. X COOP')
