000100890918     A*--------------------------------------------------------------*
000200960131     A*  TABELLA   2H TIPI COMUNICAZIONE FINE GIACENZA
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500960131     A          R DS§2H                     TEXT('DEFAULT PGM GIACENZE')
000600960131     A            §2HDES        20A         TEXT('DESCR. TIPO COMUNICAZIONE')
000700960201     A            §2HTPM         1A         TEXT('TIPO COMUNIAZIONE: D=DETTAGLI-
000800960201     A                                      O/R=RIEPILOGO/N=NO STAMPA')
000900041026     A            §2HFAX         1A         TEXT('F=CONTROLLO FAX/BLANK=NO/-
001000041026     A                                      M=E-MAIL')
001100000913     A            §2HVAG         1A         TEXT('N=NO SCRITTURA FNVAG IN PGM -
001200000913     A                                           FNLG17R/75R')
