000100980128     A*------------------------------------------------------------------------*
000200010410     A* DATI VARI PER CONTO ECONOMICO -NON DI GRUPPO-                          *
000300980128     A* NB:  TRASMETTERE ALLE FILIALI                                          *
000400980128     A*------------------------------------------------------------------------*
000500980128     A                                      REF(CNDIZION)
000600980128     A          R DS§2K                     TEXT('DATI VARI PER SALDI E C/E')
000700980128     A            §2KNBC         5S 0       TEXT('NUMERO BLOCCO COMPETENZE')
000800980128     A            §2KUBC    R               REFFLD($FLA)
000900980128     A                                      TEXT('N° BLOCCO UTILIZZATO (S/N)')
