000100000000     A*------------------------------------------------------------------------*
000200000000     A* TABELLA 2T - RIFERIMENTI CENTRI DI COSTO
000300000000     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500000000     A          R DS§2T                     TEXT('RIFERIMENTI CENTRI DI COSTO')
000600000000     A            §2TDES        25A         TEXT('DESCRIZIONE RIFERIMENTI CDC')
