000100890918     A*--------------------------------------------------------------*
000200940901     A*  TABELLA   2Z CONTINUAZ. TAB. 2A CAUSALI EVENTI
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500940901     A          R DS§2Z                     TEXT('CODICI EVENTI CONTINUZ.')
000600940906     A            §2ZUTP         1A         TEXT('UTIL.SE PREVISTO IN TAB.PART+
000700940906     A                                      . CONS.=S, SEMPRE=BLK')
000800940902     A            §2ZTIC         1A         TEXT('TIPOLOGIA COD.GIAC.X APERT.GI+
000900940902     A                                      AC. DOPO N.TENT. V.7R')
001000940902     A            §2ZTIG         1A         TEXT('TIPOLOGIA COD.GIAC.X NO APERT+
001100940902     A                                      . GIAC. MA REND. V.7Q')
001200040920     A            §2ZTRE         1A         TEXT('LIBERO:EX EVE. DA TRASM. SEPA+
001300040920     A                                      RATAM. CON CDAZ=LR9§ SCHEDULATA')
001400981008     A            §2ZEFS         1A         TEXT('S=EVENTO FASULLO-DA NON CONSI+
001500981027     A                                      DERARE AI FINI DELLA PULIZIA SPUNTE+
001600981027                                            ')
001700991214     A            §2ZEVD         3A         TEXT('TIPO SCAN DPD')
001800991214     A            §2ZCED         6A         TEXT('CODICE EVENTO DPD')
001900000524     A            §2ZCCA    R    1A         REFFLD($CCA)
002000000524     A                                      TEXT('COD.CONS.ANOMALA DA PROPORRE +
002100000524     A                                      IN CHIUS.DIST.SDA')
002200000623     A            §2ZTPP    R    1A         REFFLD($FTC)
002300000623     A                                      TEXT('COD.CONS.PARTICOLARE DA USARE+
002400000623     A                                       IN TASSAZIONE PADRONC.POSTE')
002500040114     A            §2ZDCR         1A
002600070302     A                                      TEXT('X ANALISI DATA CONS. RICH. -
002700070302     A                                      X APERTURA GIACENZA 72 ORE')
002800040212     A            §2ZMDR         3A
002900070302     A                                      TEXT('MOTIVO FORZ. X ANALISI DATA-
003000070302     A                                      CONS.RICHIESTA ')
003100050125     A            §2ZNSR         1A
003200050125     A                                      TEXT('SPESE DI RICONSEGNA N= NO SPE-
003300050125     A                                      SE X IL MOTIVO DI GIACENZA')
003400060112     A            §2ZTEL         1A
003500060112     A                                      TEXT('S=LASCIATO AVVISO CHE PREVEDE-
003600060112                                            TELEFONATA')
003700060315     A            §2ZCEP         1A
003800060315     A                                      TEXT('EVENTO X CALENDARIO E.PARTIC:-
003900060315                                            N=NON INSERIBILE IN CHIUSURA DIST. -
004000060315                                            S=INSERIBILE SE EVENTO IN CALENDAR.-
004100060315                                            P=INSERIBILE ANCHE SE NON PRESENTE -
004200060315                                            IN CALENDARIO')
004300060315     A            §2ZNEP         2S 0
004400060315     A                                      TEXT('NUMERO EVENTI INSERIBILE NELL-
004500060315                                            ''ANNO 1-98; 99-INFINITI')
004600060315     A            §2ZDEP         1A         TEXT('EVENTO DUPLICABILE A NUOVO -
004700060315                                            ANNO')
004800060331     A            §2ZFEP         1A         TEXT('TIPO CALCOLO AFFIDABILITÀ: -
004900060331                                            G=GIUSTIFICA A=ALLUNGA')
005000070416     A            §2ZADR         1A         TEXT('S=ABILITA MANUT. DATA -
005100090526                                            CONS. RICH. DA TELEFONATA SEMPRE -
005200090526                                            C=MANUTENZIONE SOLO SE LR48 RICHIA-
005300090526     A                                      MATO')
005400070309     A            §2ZEV2         1A         TEXT('S=ABILITA SCRITTURA ESTENSIO-
005500070309                                            NE EVENTI')
005600070406     A            §2ZSOS         1A         TEXT('S=SOSPENDE LA BOLLA DALLA CO-
005700070406                                            NSEGNA CON REK SU FIAR4(L)')
005800080214     A            §2ZPDA         1A         TEXT('FLAG INVIO A PDA N= NO')
005900080228     A            §2ZINFPDA      1A         TEXT('S=RITORNO INFO PDA SUBITO/" "-
006000080228     A                                      NO RITORNO SUBITO')
