000100890918     A*--------------------------------------------------------------*
000200951009     A*  TABELLA   3B ESTENSIONE DESCRIZIONI FOGLI VIAGGIO
000300951009     A*               FILE FNFV400F
000400890918     A*--------------------------------------------------------------*
000500890918     A                                      REF(CNDIZION)
000600951009     A          R DS§3B                     TEXT('ESTENSIONI DESCRIZIONI FV')
000700951009     A            §3BDES        25A         TEXT('DESCRIZIONE')
000800951009     A            §3BMNC         3S 0       TEXT('NUMERO MINIMO DI CARATTERI -
000900940919     A                                      PER SCRIVERE L''ESTENSIONE')
001000951009     A            §3BRIG         3S 0       TEXT('NUMERO RIGHE')
001100951031     A            §3BTRS         1A         TEXT('S=TRASMISSIONE IN SEDE')
001200960124     A            §3BTRF         1A         TEXT('S=TRASMISSIONE IN FILIALE')
