000100921019     A*--------------------------------------------------------------*
000200921019     A*  TABELLA   3T TABELLA TIPO SCARICO DATI PER CLIENTE          *
000300921019     A*--------------------------------------------------------------*
000400921019     A                                      REF(CNDIZION)
000500921019     A          R DS§3T                     TEXT('TIPO SCARICO')
000600921019     A            §3TDES        20A         TEXT('DESC.TIPO SCARICO DATI')
000700941105     A            §3TSCA         1A         TEXT('RAGGRUPP.: A= DEVICE AS +
000800941105     A                                      X=PROC.PART. P=P.C.(TOCLI)')
