000100950524     A*--------------------------------------------------------------*
000200950524     A*  TABELLA   4H ANOMALIE PREPARAZIONE DISTINTA DA SPUNTE
000300950524     A*--------------------------------------------------------------*
000400950524     A                                      REF(CNDIZION)
000500950524     A          R DS§4N                     TEXT('ANOMALIE PREP.DIST.DA SPUNTE')
000600950526     A            §4HTPB         1          TEXT('ANOMALIA BLOCCANTE: B=SI')
000700950526     A            §4HDES        70          TEXT('DESCRIZIONE ANOMALIA')
000800950907     A            §4HSTP         1          TEXT('STAMPA ANOMALIA S/N')
