000100890918     A*--------------------------------------------------------------*
000200940228     A*  TABELLA   4I CONTROLLO PARTITA I.V.A. EUROPEA
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500940228     A          R DS§4I                     TEXT('CONTROLLO P.IVA EUROPEA')
000600940228     A            §4IDES        30          TEXT('DESCRIZIONE STATO')
000700040630     A            §4ICHR         2S 0       TEXT('NUMERO CARATTERI P.IVA 1')
000800941121     A            §4IITA         1A         TEXT('I=NAZIONE ITALIA')
000900040630     A            §4ICH2         2S 0       TEXT('NUMERO CARATTERI P.IVA 2')
001000040630     A            §4ICH3         2S 0       TEXT('NUMERO CARATTERI P.IVA 3')
001100080421      * IL SEGUENTE CAMPO INDICA LA STRUTTURA DELLA PARTITA IVA CIOÈ DA
001200080421      *  QUALI CARATTERI DEVE ESSERE COMPOSTO DOPO IL CODICE ISO.
001300080421      * CAMPO NON OBLBIGATORIO. INDICARE:
001400080421      *  "N" - SOLO NUMERI
001500080421      *  "L" - SOLO LETTERE
001600080421      *  "A" - CAMPO ALFANUMERICO      (NUMERI LETTERE)
001700080421      *  " " - CAMPO DA NON IMMETTERE
001800080421      *  "O" - OPZIONALE ALFANUMERICO  (NUMERI LETTERE E BLANK)
001900080421      *  "Q" - OPZIONALE SOLO LETTERE  (       LETTERE E BLANK)
002000080421      *  "0" - OPZIONALE NUMERICO      (NUMERI         E BLANK)
002100080421     A            §4IPAR        14          TEXT('STRUTTURA DELLA PARTITA IVA-
002200080421                                            DOPO IL CODICE ISO')
002300100118     A* CODICE ISO DELLA UNIONE EUROPEA
002400100118     A            §4IUE          1A         TEXT('S=COD.ISO DELLA UNIONE EUROPE-
002500100118                                            A')
002600100407     A            §4ICHMI        2S 0       TEXT('NUMERO CARATTERI P.IVA -
002700100407     A                                      MINIMO')
002800100407     A            §4ICHMAX       2S 0       TEXT('NUMERO CARATTERI P.IVA -
002900100407     A                                      MASSIMO')
