000100101206      */*PRM mbr(*none) size(1 0 0)
000200101206      */*END
000300010515      *--------------------------------------------------------------*
000400000629      *  TABELLA:  5A GIORNI/ANNI PULIZIA PER SEDE (1)               *
000500000629      *--------------------------------------------------------------*
000600000629     A          R DS§5AS                    TEXT('GIORNI/ANNI PULIZIA SEDE1')
000700150213      *
000800000629     A            §5AS11         3S 0       TEXT('GG PULIZIA FNANM00F PER +
000900000629     A                                      DATA CHIUSURA ANOMALIA')
001000000629      *--------------------------------------------------------------*
001100000629      *                                                              *
001200000629      *  NB:       A N N I   D I   P U L I Z I A                     *
001300000629      *            =============================                     *
001400000629      *                                                              *
001500000629      *            VIENE PULITO TUTTO CIO' CHE E' INFERIORE A        *
001600000629      *            "ANNO CORRENTE" MENO "ANNI DI PULIZIA"            *
001700000629      *            ESEMPIO:                                          *
001800000629      *            *YEAR (ANNO CORRENTE) = 2000                      *
001900000629      *            ANNI DI PULIZIA       = 01                        *
002000000629      *            2000 - 01 = 1999                                  *
002100000629      *            (NEL NOSTRO CASO L'ULTIMO ANNO ATTIVO SAREBBE IL  *
002200000629      *            1999 E VERREBBERO PULITI IL 1998, 1997, 1996 ..)  *
002300000629      *                                                              *
002400000629      *--------------------------------------------------------------*
002500000629     A            §5AS12         2S 0       TEXT('ANNI PULIZIA TFSAC00F')
002600131202     A            §5ASVRB        2S 0       TEXT('MESI PULIZIA TIVRB00F')
002700000911     A            §5ASTS         3S 0       TEXT('GG PULIZIA  STATISTICHE -
002800000911                                                  DI FILIALE IN SEDE')
002900010515     A            §5AORS         3S 0       TEXT('GG DI PULIZIA ORM PER SEDE')
003000011105     A            §5AORI         3S 0       TEXT('GG DI PULIZIA FILE TIORI00F')
003100020220     A            §5ARIG         3S 0       TEXT('GG DI PULIZIA FILE FIRIG00R')
003200150213     A            §5AS1IDS       3S 0       TEXT('MESI  PULIZIA FILE TIIDS00F')
003300040302     A            §5ASTB         3S 0       TEXT('GG DI PULIZIA FILE TISTB00F')
003400060908     A            §5AS1RFT       3S 0       TEXT('GG DI PULIZIA FILE WFRFT00F')
003500040906     A            §5AMALL        3S 0       TEXT('GG DI PULIZIA BARTMAIL - LOG')
003600040906     A            §5AMALI        3S 0       TEXT('GG DI PULIZIA BARTMAIL - IFS')
003700040915     A            §5APOT         3S 0       TEXT('PULIZIA POTENZALI ANNULLATI D-
003800040915     A                                      ALLA DATA ANNULL.')
003900040915     A            §5ATAR         3S 0       TEXT('PULIZIA TARIFFE ANNULLATE DAL-
004000040915     A                                      LA DATA ANNULL.')
004100040921     A            §5AACR         3S 0       TEXT('PULIZIA ANAGRAFICHE ORM ANNUL-
004200040921     A                                      LATI DALLA DATA ANNULL.')
004300150213     A            §5AS1PDL       2S 0       TEXT('MESI PULIZIA TIPDL00F')
004400050401     A            §5AS1RCQ       2S 0       TEXT('MESI PULIZIA WFRCQ10F')
004500050401     A            §5AS1LAC       3S 0       TEXT('GG DI PULIZIA TILAC00F')
004600050401     A            §5AS1LAO       3S 0       TEXT('GG DI PULIZIA TILAO00F')
004700061019     A            §5AS1ATB       3S 0       TEXT('GG ANN. TARIFFE  CLIENTI BLOC-
004800061019     A                                      CATI')
004900070111     A            §5AS1LAD       3S 0       TEXT('GG DI PULIZIA TILAD00F')
005000090403     A            §5AS1PSW       3S 0       TEXT('GG DI PULIZIA FILE LOG MOD. -
005100090403     A                                      PASSWORD UTENTI DI RETE')
005200101022     A            §5AS1VABWK     3S 0       TEXT('GG DI PULIZIA FIVABWKF')
005300160920     A            §5AS1VAR       2S 0       TEXT('MESI PULIZIA VAR.BOLLE UNICA')
005400170123     A            §5AS1FTGIO     2S 0       TEXT('MESI PULIZIA FATTURATO GIORNA-
005500170123     A                                      LIERO TFFGC/TFFGK')
005600170510     A            §5AS1CAA       3S 0       TEXT('GG DI PULIZIA FILE -
005700170510     A                                      CTRL ACCESSI ALL''AS/400')
005800170726     A*// SOSP.:  §5AS1TASS      2S 0       TEXT('ANNI PULIZIA STORICO BOLLE FA-
005900170726     A*//                                   TTURATE (TITASS0F)')
