000100000000     A*--------------------------------------------------------------*
000200000000     A*  TABELLA   5C TRASMISSIONE ARCHIVILE DI FILIALE
000300000000     A*--------------------------------------------------------------*
000400000000     A          R DS§5C                     TEXT('TRASMISSIONE ARCHIVI')
000500041005     A            §5C$1          5A         TEXT('VUOTO')
000600940324     A            §5CGCE         1A         TEXT('GIACENZE X CONTO ECONOMICO')
000700940324     A            §5CGST         1A         TEXT('STATISTICHE GIACENZE')
