000100890918     A*--------------------------------------------------------------*
000200911014     A*  TABELLA   7C ANOMALIE IDD
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500911014     A          R DS§7C                     TEXT('ANOMALIE IDD')
000600911016     A            §7CDES        25A         TEXT('DESCRIZIONE ANOMALIA')
000700911017     A            §7CTAN         1A         TEXT('TP.ANOM: M=MANCA D=DISGUIDO-
000800911017     A                                       F=FUORI POSTO E=ECCEDE S=SEGNAL.')
000900911016     A            §7CSAN         1A         TEXT('SOGGETTO ANOMALIA: S=SEGNACOL-
001000911016     A                                      LO B=BOLLA')
001100911016     A            §7CAIE         1A         TEXT('ANOMALIA INTERNA/ESTERNA')
001200911016     A            §7CLID         1S 0       TEXT('LIVELLO IDD')
001300911016     A            §7CCHA         1A         TEXT('CHIUSURA AUTOMATICA S/N')
001400911105     A            §7CFFI         1A         TEXT('FIL.INVIO P=PARTENZA I=INVIO -
001500911105     A                                      E=ENTRAMBE')
001600960326     A            §7CIDD         1A         TEXT('S=ANOMALIA ESTERNA IDD')
001700960326     A            §7CSTA         1A         TEXT('S=DA STAMPARE NELLA LISTA ANO-
001800960402                                            MALIE')
001900960506     A*
002000960326     A            §7CGES         1A         TEXT('S=ANOMALIA GESTIBILE INSERIM/-
002100960402     A                                      VARIAZ')
002200960418     A            §7CANN         1A         TEXT('ANNUL/RIPR.DA PART.:" "=No,S=-
002300960418     A                                      Sempre,P=PrimaTrasm,D=DopoTrasm')
002400960401     A            §7CKEY         1A         TEXT('KEY PRINCIPALE ANOMALIA: B=BO-
002500960402     A                                      LLA S=SEGNACOLLO')
002600960506     A*
002700961017     A            §7CUEA         1A         TEXT('S=UTILIZZA FIL.EMITT. INVECE -
002800961017     A                                      DELLA LNA IN ARR,E=UTILIZZA ENTRAMB-
002900961017     A                                      E (LNA E FLE)')
003000961017     A            §7CUEP         1A         TEXT('S=UTILIZZA FIL.EMITT. INVECE -
003100970829     A                                      DELLA LNP IN PAR,E=UTILIZZA ENTRAMB-
003200970829     A                                      E (LNP E FLE)')
003300960418     A            §7CANA         1A         TEXT('ANNUL/RIPR.DA ARR.:" "=No,S=S-
003400960418     A                                      empre,P=PrimaTrasm,D=DopoTrasm')
003500960506     A*
003600960506     A            §7CPAR         1A         TEXT('P=PARTENZA  A=ARRIVO PER ANOM-
003700960506     A                                      ALIE INTERNE')
003800961106     A            §7CCHS         1A         TEXT('S=DATA CHIUSURA PUO''ESSERE <-
003900961106     A                                       DATA APERTURA')
004000041124     A**          §7CTRA         1A         TEXT('N=NON TRASMETT. A P.O. DELL''-
004100041124     A**                                    AREA SU ALTRO AS (LR76)')
004200041124     A            §7CL1          1A         TEXT('LIBERO')
004300041124     A            §7CDAN         1A         TEXT('S=ANOMALIA IDD PER PROC.DANNI-
004400990305                                            ')
004500001102     A** §7CINV= DA INVIARE CON PGM SCHEDULATO: NON VIENE PIÙ UTILIZZAT
004600001102     A** FNLRF5R ED AL SUO POSTO È STATO AGGIUNTO NELL'FNLR35R UN GIRO
004700001102     A** DI LETTURA A PARTE PROPRIO PER L'INVIO SCHEDULATO PER RENDERE
004800001102     A** L'ELABORAZIONE PIU' VELOCE
004900000317     A            §7CINV         1A         TEXT('S=DA INVIARE CON PGM SCHEDULA-
005000000317                                            TO-FNLRF5R')
005100000512     A            §7CCPT         1A         TEXT('S=DA CREARE PER LE BOLLE POST-
005200000512                                            E')
005300000512     A            §7CSPT         1A         TEXT('S=DA STAMPARE IMA/IMG PER BOL-
005400000512                                            LE POSTE')
005500001109     A            §7CCCG         1A         TEXT('S=DA CREARE/CHIUD.ANCHE CON C-
005600001109                                            AT.SPUNTA GENERICA')
005700110929     A            §7CKTR         1A         TEXT('S=TRASMISSIONE AL CLIENT')
