000100000911     A*--------------------------------------------------------------*
000200000911     A*  TABELLA   7H - TIPI RECORD ESTENSIONE SEGNACOLLI
000300000911     A*--------------------------------------------------------------*
000400000911     A                                      REF(CNDIZION)
000500000911     A          R DS§7H                     TEXT('TIPI REC. EST. SEGNAC.')
000600120618     A            §7HDEL        25A         TEXT('DESCRIZIONE LUNGA 25 CAR')
000700120618     A            §7HDEB        11A         TEXT('DESCRIZIONE BREVE 11 CAR')
000800000911     A            §7HFLT         1A         TEXT('S=DA TRASMETTERE IN SEDE')
000900120620     A            §7HDEB6        6A         TEXT('DESCRIZIONE BREVE  6 CAR')
