000100890918     A*--------------------------------------------------------------*
000200070116     A*  TABELLA   7V NOTE PARTICOLARITA
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500070116     A          R DS7V                      TEXT('NOTE PARTIC.')
000600070116     A            §7VNOT        88A         TEXT('NOTA')
000700070116     A            §7VPDA         1A         TEXT('FLAG INVIO A PDA N= NO')
