000100890918     A*--------------------------------------------------------------*
000200030122     A*  TABELLA   8D COMPETENZE C/E
000300890918     A*--------------------------------------------------------------*
000400930927     A                                      REF(CNDIZION)
000500030122     A          R DS§8D                     TEXT('COMPETENZE C/E')
000600030122     A            §8DDES        25A         TEXT('DESCRIZIONE')
000700030122     A            §8DPA          1A         TEXT('P=PARTENZE A=ARRIVI')
