000100991203      *--------------------------------------------------------------*
000200141103      *  D.E. SOTTODEFINIZIONE AR4NOT TIPO RECORD 'Y'                *
000300991203      *--------------------------------------------------------------*
000400970929     A                                      REF(CNDIZION)
000500141103     A          R DSBL4Y                    TEXT('DS PER AR4NOT TIPO REC."-
000600141103     A                                      Y"')
000700991203      *
000800141103     A            §B4PCD        15A         TEXT('PIN CODE')
000900991203
