000100890918     A*--------------------------------------------------------------*
000200971210     A*  D.E. SOTTODEFINIZIONE AR4NOT/BL4NOT TIPO RECORD 'E'         *
000300890918     A*--------------------------------------------------------------*
000400970929     A                                      REF(CNDIZION)
000500000518     A          R DSBL4W                    TEXT('DS PER AR4NOT/BL4NOT TIP-
000600000518     A                                      O REC."W"')
000700900511     A*
000800000518     A            §B4DAT         8S 0       TEXT('DATA TRASMISSIONE VAB')
