000100890918     A*--------------------------------------------------------------*
000200941121     A*  TABELLA   CC ELEMENTI TASSAZIONE BOLLE                      *
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500941121     A          R DS低C                     TEXT('ELEMENTI TASSAZIONE BOLLE')
000600891024     A            低CDES        20A         TEXT('DESCRIZIONE')
000700891025     A            低CFLI         1S 0       TEXT('1=SI/0=NO: PARTECIPA IMPON. +
000800891025     A                                      X CALCOLO ISTAT')
000900981014     A            低CJEI         3A         TEXT('PJ COD.ESENZIONE IVA')
001000981014     A            低CJCI         6A         TEXT('PJ CAPOCONTO ITALIA')
001100981014     A            低CJSI         8A         TEXT('PJ SOTTOCONTO ITALIA')
001200981014     A            低CJVI         8A         TEXT('PJ VOCE ITALIA')
001300981014     A            低CJCE         6A         TEXT('PJ CAPOCONTO ESTERO')
001400981014     A            低CJSE         8A         TEXT('PJ SOTTOCONTO ESTERO')
001500981014     A            低CJVE         8A         TEXT('PJ VOCE ESTERO')
001600981014     A            低CJXX         4A         TEXT('FILLER              ')
001700891025     A            低CFLP         1S 0       TEXT('1=SI/0=NO: COMBINAZIONE +
001800891025     A                                      CONTI CON FIL.PARTENZA')
001900921217     A            低CCEI         1A         TEXT('CODICE ESENZIONE IVA COLLEGA-
002000921217     A                                      TO AL SOTTOCNTO')
002100931111     A            低CFL1         1A         TEXT('DA CONSIDERARE PER RICAVI ? -
002200931111     A                                      (S/N)')
002300931103     A            低CFL2         1A         TEXT('DA CONSIDERARE PER DELTA ? (-
002400931103     A                                      S/N)')
002500931111     A            低CFL3         1A         TEXT('DA CONSIDERARE PER CLIENTE ?-
002600931111     A                                       (S/N)')
002700940527     A            低CFL4         1A         TEXT('DA CONSIDERARE PER DELTA NUO-
002800940527     A                                      VO ? (S/N)')
002900940728     A            低CFL5         1A         TEXT('DA CONSIDERARE PER IL XXXXXX-
003000940728     A                                      XXXXXXXXX ? (S/N)')
003100940623     A            低CFL6         1A         TEXT('DA CONSIDERARE PER L''IMPONIB-
003200940623     A                                      ILE REALE ? (S/N)')
003300941122     A            低CCMP         3S 0       TEXT('COD.COMPETENZA DI C.ECON.')
003400970129     A            低CRDL         3S 0       TEXT('RAGGR.DELTA X TARIFFE DA C.E')
003500990706     A            低CUTI         1A         TEXT('S=COD VARIA UTILIZZABILE IN -
003600990706                                            TASSAZIONE')
003700020320      *  GEST. DESCRIZIONE PER FEDEX : GUIDA PER RECUPERARE LA DESCRIZIONE
003800020320      *                                DA TABELLA CB
003900020320     A            低CDFE         1A         TEXT('S=RECUPERO DESCRIZIONE FEDEX -
004000020320                                            DA TABELLA "CB"')
