000100000000     A*------------------------------------------------------------------------*
000200991116     A* DS DATI SIMULAZIONE CONTO ECONOMICO                                    *
000300000000     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500000000     A          R DSD$G                     TEXT('DS CAMPO D$GXXX DELLA DS$ECO')
000600000000     A            D$GASI         4          TEXT('ANNO SIMULAZIONE C/E')
000700000000     A                                      COLHDG('ANNO SIMULAZIONE')
000800000000     A            D$GFSI         1          TEXT('FLAG SIMULAZIONE C/E (S/N)')
000900000000     A                                      COLHDG('FLAG SIMULAZIONE')
001000121120     A            D$GFSF         1          TEXT('FLAG PER SCRITTURA FILE ESVOC-
001001121120     A                                      * S=SI/" "=NO')
001100121120     A                                      COLHDG('AGG.ESVOC*')
