000100890918     A*--------------------------------------------------------------*
000200891010     A*  TABELLA  -IV- LIBRO IVA                                     *
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500891010     A          R DS§IV                     TEXT('LIBRI IVA PER FILIALE')
000600891011     A            §IVLVF         3S 0       TEXT('LIBRO VENDITE (FT) (FILIALE)')
000700891010     A            §IVLAQ         3S 0       TEXT('LIBRO ACQUISTI')
000800891010     A            §IVLCO         3S 0       TEXT('LIBRO CORRISPETTIVI')
000900891011     A            §IVLVN         3S 0       TEXT('LIBRO VENDITE (RETTIFICHE)')
001000891011     A            §IVLAN         3S 0       TEXT('LIBRO ACQUISTI (RETTIFICHE)')
