000100890918     A*--------------------------------------------------------------*
000200940610     A*  TABELLA   -PR- PROVINCE                                     *
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500890919     A          R DS§PR                     TEXT('PROVINCE')
000600890919     A            §PRDES        20A         TEXT('DESCRIZIONE ')
000700890919     A            §PRCTS    R               REFFLD($CTS)
000800940610     A            §PRCTE    R               REFFLD($CTS)
000900940610     A                                      TEXT('COD.TASSAZIONE X ESTERO')
001000051116     A            §PRFCR         1          TEXT('FLAG R=CAPOLUOGO DI REGIONE-
001100051116     A                                       BLK=NO')
001200060713     A            §PRNEW         2          TEXT('NUOVA PROVINCIA')
001300091214     A            §PRCRE         3          TEXT('CODICE REGIONE (TAB.14)')
