000100890918     A*--------------------------------------------------------------*
000200890919     A*  TABELLA   TB TIPI BOLLA                                     *
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500890919     A          R DS§TB                     TEXT('TIPI BOLLA ')
000600890919     A            §TBDES        20A         TEXT('DESCRIZIONE ')
000700890919     A            §TBFST         1A         TEXT('FLAG STATISTICA')
000800890919     A            §TBFCB         1A         TEXT('FLAG CTB')
000900890919     A            §TBFCT         1A         TEXT('FLAG CONTRASS.')
001000890919     A            §TBFAS         1A         TEXT('FLAG ASS. PER CONTO')
001100931103     A            §TBTPO         1A         TEXT('TIPO PORTO (F/A)')
001200931103     A            §TBRBL         1A         TEXT('RAGGRUPP. BOLLE (N/C/R)')
001300940808     A            §TBCSF         1A         TEXT('CALC.COMP.SE FIGLIA ? S/N')
001400940930     A            §TBCCS         1A         TEXT('COMP.DA CALC. SEMPRE ? S/N')
001500940808     A            §TBDBO         1A         TEXT('DATI VARI DA BOLLA ORIG? S/N')
