000100890918     A*--------------------------------------------------------------*
000200010524     A*  RIDEFINZOINE CAMPO VLRFL3 - FLAG OPERATIVI                  *
000300890918     A*--------------------------------------------------------------*
000400010524     A          R DSVLR3                    TEXT('FLAG OPERATIVI UPLOAD')
000500010524     A            §VLR31         1          TEXT('1=RIESECUZIONE DA LOG')
000600010524     A            §VLR32         1          TEXT('S=RICALCOLA NOME MEMBRO')
000700021118     A            §VLR33         1          TEXT('S=STORICIZZATO')
000800040305     A            §VLR345        2          TEXT('ID PROCESSO')
000900040305     A            §VLR3X         5          TEXT('LIBERI')
