000100890918     A*--------------------------------------------------------------*
000200170721     A*  RIDEFINZOINE CAMPO VLRPTH - FLAG VARI                       *
000300890918     A*--------------------------------------------------------------*
000400170721     A          R DSVLRPTH                  TEXT('FLAG VARI UPLOAD')
000500170721     A            §PTHVPCO       3          TEXT('COD. OPZIONE "VPC"')
000600170721     A            §PTHVOID      82          TEXT('<LIBERO>')
000700170721     A            §PTHDAOR      15          TEXT('DATA-ORA ELABORAZIONE')
