000100890918     A*--------------------------------------------------------------*
000200890919     A*  TABELLA   XD ASSICURAZIONE                                  *
000300890918     A*--------------------------------------------------------------*
000400890919     A          R DS§XD                     TEXT('ASSICURAZIONE GEST.AUT.')
000500891128     A            §XDDES        25A         TEXT('DESCRIZIONE ')
000600020111     A            §XDASS         1A         TEXT('NO ASSICURAZIONE')
