000100890918     A*--------------------------------------------------------------*
000200890919     A*  TABELLA   XF STATO                                          *
000300890918     A*--------------------------------------------------------------*
000400890919     A          R DS§XF                     TEXT('STATO GEST.AUT.')
000500891128     A            §XFDES        25A         TEXT('DESCRIZIONE ')
