000100890918     A*--------------------------------------------------------------*
000200890920     A*  TABELLA   XM MANUTENZIONE ORDINARIA PICCOLE MANUTENZIONI    *
000300890918     A*--------------------------------------------------------------*
000400890920     A          R DS§XM                     TEXT('MANUT.ORD.GEST.AUT.')
000500891128     A            §XMDES        25A         TEXT('DESCRIZIONE ')
000600020703     A            §XMTIP         1A         TEXT('BLANK=NIENTE/KM              -
000700020703     A                                            1    =KM+QTA                 -
000800020703     A                                            2    =QTA       ')
