000100890918     A*--------------------------------------------------------------*
000200890920     A*  TABELLA   XN AUTISTI                                        *
000300890918     A*--------------------------------------------------------------*
000400890920     A          R DS§XN                     TEXT('AUTISTI GEST.AUT.')
000500891128     A            §XNDES        25A         TEXT('DESCRIZIONE ')
000600011220     A            §XNMED         4S 1       TEXT('NON USATO')
000700011211     A            §XNPER         1          TEXT('G=PERSONA GENERICA')
000800050216     A            §XNFUN         5          TEXT('FUNZIONE')
