000100890918     A*--------------------------------------------------------------*
000200890920     A*  TABELLA   XO OFFICINA                                       *
000300890918     A*--------------------------------------------------------------*
000400890920     A          R DS§XO                     TEXT('OFFICINA GEST.AUT.')
000500891128     A            §XODES        25A         TEXT('DESCRIZIONE ')
