000100890918     A*--------------------------------------------------------------*
000200031126     A*  TABELLA   XU TIPO EQUIPAGGIAMENTO                           *
000300890918     A*--------------------------------------------------------------*
000400031126     A          R DS§XU                     TEXT('TIPO EQUIPAGGIAMENTO')
000500031126     A            §XUDES        30A
