000100020121      *--------------------------------------------------------------*
000200991116      *  TABELLA   OG143 DESCRIZIONE 143 DELL'ORGANIGRAMMA           *
000300991116      *--------------------------------------------------------------*
000400991116     A          R DSO143                    TEXT('143 DESCRIZIONE DELL''ORGANIG-
000500991116     A                                      RAMMA')
000600991116     A            別GDPD         1          TEXT('P.O. DPD. S=SI')
000700131017     A            別GLNARES      3          TEXT('LINEA FORZATURA X RESO')
000800150430     A            別GLNPB        3          TEXT('FIL.VALIDA COME LNP BOLLA')
000900071015     A            別GIIP         3          TEXT('CODICE INDIRIZZO IP')
001000020201     A            別GNTW         3          TEXT('NETWORK')
001100020213     A            別GAS          3S 0       TEXT('AS/S.I. DI APPARTENENZA')
001200060413     A            別GHB1         4          TEXT('HUB DPD DI 4 CHAR')
001300060413     A            別GDP1         4          TEXT('DEPOT DPD DI 4 CHAR')
001400000414     A            別GPT          1          TEXT('P.O. POSTE S=SI')
