000100890918     A*--------------------------------------------------------------*
000200020916     A*  TABELLA   OG142 DESCRIZIONE 142 DELL'ORGANIGRAMMA           *
000300890918     A*--------------------------------------------------------------*
000400020916     A          R DSO142                    TEXT('142A DESCRIZIONE DELL''ORG+
000500950412     A                                      ANIGRAMMA')
002300020916     A            §OGFXI        10A         TEXT('OUTQ FAXIN DEL TERMINAL:+
002301020916     A                                      FAX DA INVIARE')
002400020916     A            §OGFXO        10A         TEXT('OUTQ FAXOUT DEL TERMINAL:+
002500020916     A                                      FAX INVIATI')
