000100890918     A*--------------------------------------------------------------*
000200020614     A*  TABELLA   OG146 DESCRIZIONE 146 DELL'ORGANIGRAMMA           *
000300890918     A*--------------------------------------------------------------*
000400020614     A          R DSO146                    TEXT('146A DESCRIZIONE DELL''ORG+
000500950412     A                                      ANIGRAMMA')
000600020614     A            別GFRR         1A         TEXT('FRAME RELAY: -
000700020614     A                                      A= ATTIVA; -
000800020614     A                                      S= E-MAIL; BLANK= NIENTE')
000900040217     A            別GDSD         8A         TEXT('DATA INIZIO SCANNERIZ. LDV +
000901040217     A                                      DPD - AAAAMMGG')
000902040217     A            別GDSE         8A         TEXT('DATA INIZIO SCANNERIZZ. LDV +
001000040217     A                                      EUROEXPRESS - AAAAMMGG')
001100060925     A            別GDDA         8A         TEXT('DATA INIZIO DISTINTE DI CONS+
001200060925     A                                      .AUTOMATICHE-AAAAMMGG')
