000100170321     /*PRM mbr(*none) size(1 0 0)
000200170321     /*END
000300890918     A*--------------------------------------------------------------*
000400990917     A*  TABELLA   OG150 DESCRIZIONE 150 DELL'ORGANIGRAMMA           *
000500890918     A*--------------------------------------------------------------*
000600990917     A          R DSO150                    TEXT('150 DESCRIZIONE DELL''ORG+
000700950412     A                                      ANIGRAMMA')
000800000320     A            別GDKC         1A         TEXT('S=ABILITATO AL DISK "C"')
000900030925     A            別GPCK         1A         TEXT('S=ABILITATO AL PICKING')
001000120612     A****        別GPKD         1A         TEXT('S=NON STAMPA ''DDT SI'' PER P+
001100120612     A****                                  ICKING')
001200160531     A            別GAGSPUS      1A         TEXT('S=AUTOGENERAZ. SPUNTE USCITA')
001300040517     A            別GSEA         1A         TEXT('S=STAMPA SEGNACOLLO ESTERO SO-
001400041213     A                                      LO IN ARRIVO')
001500120925     A****        別GSPV         1A         TEXT('S=UTILIZZA VOLUME SPUNTA')
001600120925     A****        別GSPP         1A         TEXT('S=UTILIZZA PESO   SPUNTA')
001700170321     A*//         別G150L3       1A         TEXT('LIBERO')
001800170321     A            別GESBLDI      1A         TEXT('S=FIL.ESENTE BLOCCO-
001900170321     A                                       DIROTTAMENTO')
002000170227     A            別GDKCDIR      1A         TEXT('S=DIROTT/RESI IN MODALITA''+
002100170227     A                                      DISK "C"')
002200990917     A            別GVOL         6A         TEXT('DATA MACCHINONE PER VOLUME')
002300990917     A            別GPES         6A         TEXT('DATA MACCHINONE PER PESO')
002400120612     A*****       別GSDA         1A         TEXT('S=STAMPA DDT SI IN ARRIVO')
002500160420     A            別GTURNO       1A         TEXT('S=TURNO PICKING CONSEGNA')
002600041213     A            別GTIS         1A         TEXT('TIPO IMPIANTO SMISTACOLLI IN -
002700041213     A                                      DOTAZIONE')
002800050506     A            別GPKM         1A         TEXT('S=PICKING MESSAGGERIE')
002900101215     A            別GIMAA        1A         TEXT('S=IMA SOLO COLLI SPUNTATI A -
003000101215     A                                      ARRIVO FINALE')
