000100890918     A*--------------------------------------------------------------*
000200990917     A*  TABELLA   OG150 DESCRIZIONE 150 DELL'ORGANIGRAMMA           *
000300890918     A*--------------------------------------------------------------*
000400990917     A          R DSO150                    TEXT('150 DESCRIZIONE DELL''ORG+
000500950412     A                                      ANIGRAMMA')
000600000320     A            別GDKC         1A         TEXT('S=ABILITATO AL DISK "C"')
000700030925     A            別GPCK         1A         TEXT('S=ABILITATO AL PICKING')
000800120612     A****        別GPKD         1A         TEXT('S=NON STAMPA ''DDT SI'' PER P+
000900120612     A****                                  ICKING')
001000160531     A            別GAGSPUS      1A         TEXT('S=AUTOGENERAZ. SPUNTE USCITA')
001100040517     A            別GSEA         1A         TEXT('S=STAMPA SEGNACOLLO ESTERO SO-
001200041213     A                                      LO IN ARRIVO')
001300120925     A****        別GSPV         1A         TEXT('S=UTILIZZA VOLUME SPUNTA')
001400120925     A****        別GSPP         1A         TEXT('S=UTILIZZA PESO   SPUNTA')
001500170227     A            別G150L3       1A         TEXT('LIBERO')
001501170227     A            別GDKCDIR      1A         TEXT('S=DIROTT/RESI IN MODALITA''+
001502170227     A                                      DISK "C"')
001600990917     A            別GVOL         6A         TEXT('DATA MACCHINONE PER VOLUME')
001700990917     A            別GPES         6A         TEXT('DATA MACCHINONE PER PESO')
001800120612     A*****       別GSDA         1A         TEXT('S=STAMPA DDT SI IN ARRIVO')
001900160420     A            別GTURNO       1A         TEXT('S=TURNO PICKING CONSEGNA')
002000041213     A            別GTIS         1A         TEXT('TIPO IMPIANTO SMISTACOLLI IN -
002100041213     A                                      DOTAZIONE')
002200050506     A            別GPKM         1A         TEXT('S=PICKING MESSAGGERIE')
002300101215     A            別GIMAA        1A         TEXT('S=IMA SOLO COLLI SPUNTATI A -
002400101215     A                                      ARRIVO FINALE')
