000100110330       // -?Dimensioni base per il simil-logo Bartolini?
000200110415     d c_1_Spessore    c                   const(0.035)
000300110415     d c_1_DeltaSpig   c                   const(0.010)
000400110415     d c_1_LunghMaxV   c                   const(0.182)
000500110415     d c_1_LunghV      c                   const(0.076)
000600110415     d c_1_LunghO      c                   const(0.048)
000700110415     d c_1_XspaceX     c                   const(0.013)
000800110415     d c_1_BOXspace    c                   const(0.038)
