000100040401     A                                      DSPSIZ(24 80 *DS3)
000200040401     A          R SIGNON
000300040401     A                                      CLEAR
000400040401     A                                      BLINK
000500040401     A            SYSNAME        8A  O  1  3
000600040401     A                                  1 28' C O L L E G A M E N T O '
000700040401     A                                      DSPATR(RI)
000800040401     A                                  1 69TIME
000900040401     A            SBSNAME       10A  O  4 67
001000040401     A            DEVNAME       10A  O  5 67
001100040401     A                                  4  7'Utente..........:'
001200040401     A            USERID        10A  B  4 27
001300040401     A  01                              5  7'Parola d''Ordine :'
001400040401     A  01        PASSWRD       10A  I  5 27DSPATR(ND)
001500110527     A                                  6  2'Programma.......['
001600110520     A                                      DSPATR(ND)
001700110527     A            PROGRAM       10A  B  7  2CHECK(LC)
001800110520     A                                      DSPATR(ND)
001900040401     A                                      DSPATR(PR)
002000110527     A                                  8  2'Menù............['
002100110520     A                                      DSPATR(ND)
002200110527     A            MENU          10A  B  9  2CHECK(LC)
002300110520     A                                      DSPATR(PR)
002400040401     A                                      DSPATR(ND)
002500110527     A                                 10  2'Libreria........['
002600110520     A                                      DSPATR(ND)
002700110527     A            CURLIB        10A  B 11  2CHECK(LC)
002800110520     A                                      DSPATR(ND)
002900040401     A                                      DSPATR(PR)
003000040401     A  02        QSNERROR      80A  O 24  1DSPATR(HI)
003100110527     A            COPYRIGHT     40A  O 20 20DSPATR(ND)
003200040401     A            UBUFFER      128A  H
003300040401      *
003400111220     A                                  7 60'®'
003500040401      * Bordo superiore
003600120530     A                                  7 22'|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯+
003700120530     A                                      ¯|'
003800120530     A                                      DSPATR(HI)
003900120416     A***                                   COLOR(RED)
004000040401      * Bordo sinistro
004100120530     A                                  8 22'|'
004200120530     A                                      DSPATR(HI)
004300120416     A***                                   COLOR(RED)
004400120530     A                                  9 22'|'
004500120530     A                                      DSPATR(HI)
004600120416     A***                                   COLOR(RED)
004700120530     A                                 10 22'|'
004800120530     A                                      DSPATR(HI)
004900120416     A***                                   COLOR(RED)
005000120530     A                                 11 22'|'
005100120530     A                                      DSPATR(HI)
005200120416     A***                                   COLOR(RED)
005300120530     A                                 12 22'|'
005400120530     A                                      DSPATR(HI)
005500120416     A***                                   COLOR(RED)
005600120530     A                                 13 22'|'
005700120530     A                                      DSPATR(HI)
005800120416     A***                                   COLOR(RED)
005900120530     A                                 14 22'|'
006000120530     A                                      DSPATR(HI)
006100120416     A***                                   COLOR(RED)
006200120530     A                                 15 22'|'
006300120530     A                                      DSPATR(HI)
006400120416     A***                                   COLOR(RED)
006500120530     A                                 16 22'|'
006600120530     A                                      DSPATR(HI)
006700120416     A***                                   COLOR(RED)
006800120530     A                                 17 22'|'
006900120530     A                                      DSPATR(HI)
007000120416     A***                                   COLOR(RED)
007100120530     A                                 18 22'|'
007200120530     A                                      DSPATR(HI)
007300120416     A***                                   COLOR(RED)
007400040401      * Bordo destro
007500120530     A                                  8 57'|'
007600120530     A                                      DSPATR(HI)
007700120416     A***                                   COLOR(RED)
007800120530     A                                  9 57'|'
007900120530     A                                      DSPATR(HI)
008000120416     A***                                   COLOR(RED)
008100120530     A                                 10 57'|'
008200120530     A                                      DSPATR(HI)
008300120416     A***                                   COLOR(RED)
008400120530     A                                 11 57'|'
008500120530     A                                      DSPATR(HI)
008600120416     A***                                   COLOR(RED)
008700120530     A                                 12 57'|'
008800120530     A                                      DSPATR(HI)
008900120416     A***                                   COLOR(RED)
009000120530     A                                 13 57'|'
009100120530     A                                      DSPATR(HI)
009200120416     A***                                   COLOR(RED)
009300120530     A                                 14 57'|'
009400120530     A                                      DSPATR(HI)
009500120416     A***                                   COLOR(RED)
009600120530     A                                 15 57'|'
009700120530     A                                      DSPATR(HI)
009800120416     A***                                   COLOR(RED)
009900120530     A                                 16 57'|'
010000120530     A                                      DSPATR(HI)
010100120416     A***                                   COLOR(RED)
010200120530     A                                 17 57'|'
010300120530     A                                      DSPATR(HI)
010400120416     A***                                   COLOR(RED)
010500120530     A                                 18 57'|'
010600120530     A                                      DSPATR(HI)
010700120416     A***                                   COLOR(RED)
010800110509      * Lettere
010900040401      * - B
011000120530     A                                 10 26'      '
011100120416     A                                      DSPATR(RI)
011200120416     A***                                   COLOR(RED)
011300120530     A                                 11 26'  '
011400120416     A                                      DSPATR(RI)
011500120416     A***                                   COLOR(RED)
011600120530     A                                 11 31'  '
011700120416     A                                      DSPATR(RI)
011800120416     A***                                   COLOR(RED)
011900120530     A                                 12 26'  '
012000120416     A                                      DSPATR(RI)
012100120416     A***                                   COLOR(RED)
012200120530     A                                 12 31'  '
012300120416     A                                      DSPATR(RI)
012400120416     A***                                   COLOR(RED)
012500120530     A                                 13 26'      '
012600120416     A                                      DSPATR(RI)
012700120416     A***                                   COLOR(RED)
012800120530     A                                 14 26'  '
012900120416     A                                      DSPATR(RI)
013000120416     A***                                   COLOR(RED)
013100120530     A                                 14 31'  '
013200120416     A                                      DSPATR(RI)
013300120416     A***                                   COLOR(RED)
013400120530     A                                 15 26'  '
013500120416     A                                      DSPATR(RI)
013600120416     A***                                   COLOR(RED)
013700120530     A                                 15 31'  '
013800120416     A                                      DSPATR(RI)
013900120416     A***                                   COLOR(RED)
014000120530     A                                 16 26'      '
014100120416     A                                      DSPATR(RI)
014200120416     A***                                   COLOR(RED)
014300040401      * - R
014400110520     A                                 10 36'      '
014500120416     A                                      DSPATR(RI)
014600120416     A***                                   COLOR(RED)
014700110520     A                                 11 36'  '
014800120416     A                                      DSPATR(RI)
014900120416     A***                                   COLOR(RED)
015000110520     A                                 11 41'  '
015100120416     A                                      DSPATR(RI)
015200120416     A***                                   COLOR(RED)
015300110520     A                                 12 36'  '
015400120416     A                                      DSPATR(RI)
015500120416     A***                                   COLOR(RED)
015600110520     A                                 12 41'  '
015700120416     A                                      DSPATR(RI)
015800120416     A***                                   COLOR(RED)
015900110520     A                                 13 36'      '
016000120416     A                                      DSPATR(RI)
016100120416     A***                                   COLOR(RED)
016200110520     A                                 14 36'  '
016300120416     A                                      DSPATR(RI)
016400120416     A***                                   COLOR(RED)
016500110520     A                                 14 41'  '
016600120416     A                                      DSPATR(RI)
016700120416     A***                                   COLOR(RED)
016800110520     A                                 15 36'  '
016900120416     A                                      DSPATR(RI)
017000120416     A***                                   COLOR(RED)
017100110520     A                                 15 41'  '
017200120416     A                                      DSPATR(RI)
017300120416     A***                                   COLOR(RED)
017400110520     A                                 16 36'  '
017500120416     A                                      DSPATR(RI)
017600120416     A***                                   COLOR(RED)
017700110520     A                                 16 41'  '
017800120416     A                                      DSPATR(RI)
017900120416     A***                                   COLOR(RED)
018000040401      * - T
018100120530     A                                 10 46'        '
018200120416     A                                      DSPATR(RI)
018300120416     A***                                   COLOR(RED)
018400120530     A                                 11 49'  '
018500120416     A                                      DSPATR(RI)
018600120416     A***                                   COLOR(RED)
018700120530     A                                 12 49'  '
018800120416     A                                      DSPATR(RI)
018900120416     A***                                   COLOR(RED)
019000120530     A                                 13 49'  '
019100120416     A                                      DSPATR(RI)
019200120416     A***                                   COLOR(RED)
019300120530     A                                 14 49'  '
019400120416     A                                      DSPATR(RI)
019500120416     A***                                   COLOR(RED)
019600120530     A                                 15 49'  '
019700120416     A                                      DSPATR(RI)
019800120416     A***                                   COLOR(RED)
019900120530     A                                 16 49'  '
020000120416     A                                      DSPATR(RI)
020100120416     A***                                   COLOR(RED)
020200040401      * Bordo inferiore
020300120530     A                                 19 22'|_________________________________-
020400120530     A                                      _|'
020500120530     A                                      DSPATR(HI)
020600120416     A***                                   COLOR(RED)
020700040401      * Parte inferiore
020800120530     A                                 21 22'C    O    R    R    I    E    R   -
020900120530     A                                       E'
021000120416     A***                                   COLOR(RED)
021100110506      *
021200120530     A                                 22 22'E    S    P    R    E    S    S   -
021300120530     A                                       O'
021400120416     A***                                   COLOR(RED)
021500040401      * Bordo inferiore
021600120530     A                                 23 22'__________________________________-
021700120530     A                                      __'
021800040401     A                                      DSPATR(UL)
021900120530     A                                      DSPATR(HI)
022000120416     A***                                   COLOR(RED)
