000100941214 TNSY83C:    PGM        PARM(&KPJBA)
000200891006             DCL        VAR(&KPJBA)    TYPE(*CHAR)  LEN(502)
000300900407             DCL        VAR(&SATELL) TYPE(*CHAR) LEN(10)
000400920430             DCLF       FILE(QSYS/QAFDPHY)
000500910314
000600910314
000700920506             CHGVAR     VAR(&SATELL) VALUE(%SUBSTRING(&KPJBA 247 10))
000800891128
000900891216/* RICERCA TUTTI I FILES FISICI DELLA LIBRERIA    */
001000891128
001100920430             DSPFD      FILE(&SATELL/*ALL) TYPE(*ATR) +
001200920430                          OUTPUT(*OUTFILE) FILEATR(*PF) +
001300920430                          OUTFILE(QTEMP/§FPH)
001400900407
001500920430             OVRDBF     FILE(QAFDPHY) TOFILE(QTEMP/§FPH)
001600891216READ:
001700891216             RCVF
001800891216             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDF))
001900891216
002000910322/* ESEGUE TERMINAZIONE GIORNALE  */
002100891216
002200920507             IF         COND(&PHJRNM *NE '          ') THEN(DO)
002300920507             ENDJRNPF   FILE(&SATELL/&PHFILE) JRN(&PHJRLB/&PHJRNM)
002400940418             MONMSG     MSGID(CPF0000)
002500920507             ENDDO
002600891216
002700891216             GOTO       CMDLBL(READ)
002800891216
002900910314ENDF:
003000910314FINE:        ENDPGM
