000100941201 TNSY82C:    PGM        PARM(&KPJBA)
000200891006             DCL        VAR(&KPJBA)    TYPE(*CHAR)  LEN(502)
000300900407             DCL        VAR(&SATELL) TYPE(*CHAR) LEN(10)
000400990211             DCL        VAR(&SATEL2) TYPE(*CHAR) LEN(10)
000500991130             DCL        VAR(&SATAUR) TYPE(*CHAR) LEN(5)
000600941201             DCL        VAR(&LIBJ) TYPE(*CHAR) LEN(10)
000700940129             DCL        VAR(&LIBNOJ) TYPE(*CHAR) LEN(10)
000800910314             DCL        VAR(&SYSNAME) TYPE(*CHAR) LEN(8)
000801021113             DCL        VAR(&SYS5) TYPE(*CHAR) LEN(5)
000900910314             DCL        VAR(&TIPO) TYPE(*CHAR) LEN(2)
001000920915             DCL        VAR(&TIP3) TYPE(*CHAR) LEN(3)
001100921209             DCL        VAR(&TIP5) TYPE(*CHAR) LEN(5)
001200930421             DCL        VAR(&TIP4) TYPE(*CHAR) LEN(4)
001300920915             DCL        VAR(&TIP1) TYPE(*CHAR) LEN(1)
001400910314             DCL        VAR(&SYS) TYPE(*CHAR) LEN(3)
001500910314             DCL        VAR(&JRS) TYPE(*CHAR) LEN(6) VALUE('JRSxxx')
001600910314             DCL        VAR(&RCS) TYPE(*CHAR) LEN(10) +
001700910314                          VALUE('RCSxxx0001')
001800921209             DCLF       FILE(QSYS/QAFDPHY)
001900910314
002000910314             RTVNETA    SYSNAME(&SYSNAME)
002001021113             CHGVAR     VAR(&SYS5) VALUE(%SST(&SYSNAME 1 5))
002400910314
002500920506             CHGVAR     VAR(&SYS) VALUE(%SUBSTRING(&KPJBA 257 3))
002600920506             CHGVAR     VAR(&SATELL) VALUE(%SUBSTRING(&KPJBA 247 10))
002700990211             CHGVAR     VAR(&SATEL2) VALUE(%SUBSTRING(&KPJBA 247 10))
002800941201             CHGVAR     VAR(&LIBJ) VALUE(%SUBSTRING(&KPJBA 260 10))
002900991130             CHGVAR     VAR(&SATAUR) VALUE(%SUBSTRING(&KPJBA 247 5))
003000891013
003100910314             CHGVAR     VAR(%SUBSTRING(&JRS 4 3)) VALUE(&SYS)
003200910314             CHGVAR     VAR(%SUBSTRING(&RCS 4 3)) VALUE(&SYS)
003300990211             CHGVAR     VAR(%SUBSTRING(&SATEL2 6 3)) VALUE('SOC')
003400910314
003500971230
003600990211/* IN CASO DI PJBARGRU IL NOME RICEVITORE E' DIVERSO                */
003700990211             IF         COND(&SATELL *EQ 'PJBARGRU ') THEN(DO)
003800990211             CHGVAR     VAR(&JRS) VALUE('PJJRN ')
003900990211             CHGVAR     VAR(&RCS) VALUE('PJBA000001')
004000990211             ENDDO
004100991130/* IN CASO DI AURIG IL NOME RICEVITORE E JOURNAL E' DIVERSO  */
004200991130             IF         COND(&SATAUR *EQ 'AURIG') THEN(DO)
004300991130             CHGVAR     VAR(%SUBSTRING(&RCS 1 3)) VALUE('RCU')
004400991130             CHGVAR     VAR(%SUBSTRING(&JRS 1 3)) VALUE('JRU')
004500991130             ENDDO
004600971230
004700940129/* LA LIBRERIA DEI FILES DA NON METTERE SOTTO GIORNALE  */
004800940129/* PER LA GAITRAPRD VALE QUELLA X FILIALE               */
004900971108             IF         COND((&SATELL *EQ 'GAITRAPRD') *OR (&SATELL +
005000971108                          *EQ 'SDITRAPRD')) THEN(CHGVAR +
005100971108                          VAR(&LIBNOJ) VALUE('LIBNOJRNFI'))
005200971108             IF         COND((&SATELL *NE 'GAITRAPRD') *AND (&SATELL +
005300971108                          *NE 'SDITRAPRD')) THEN(CHGVAR +
005400971108                          VAR(&LIBNOJ) VALUE('LIBNOJRN  '))
005500910314
005600910314/* SE NON ESISTE IL JOURNAL LO CREO  */
005700910315
005800941201             CHKOBJ     OBJ(&LIBJ/&JRS) OBJTYPE(*JRN)
005900910314             MONMSG     MSGID(CPF9801) EXEC(DO)
006000971230             CRTJRNRCV  JRNRCV(RCVLIB/&RCS) THRESHOLD(51200) +
006100971230                          TEXT('Ricevitore Files "SEDE"')
006200941201             CRTJRN     JRN(&LIBJ/&JRS) JRNRCV(RCVLIB/&RCS) +
006300941201                          MSGQ(&LIBJ/&JRS)
006400910314             ENDDO
006500891128
006600891216/* RICERCA TUTTI I FILES FISICI DELLA LIBRERIA    */
006700891128
006800921209             DSPFD      FILE(&SATELL/*ALL) TYPE(*ATR) +
006900900407                          OUTPUT(*OUTFILE) FILEATR(*PF) +
007000900407                          OUTFILE(QTEMP/§FPH)
007100990211             IF         COND(&SATELL *EQ 'PJBARGRU ') THEN(DO)
007200990211             DSPFD      FILE(&SATEL2/*ALL) TYPE(*ATR) +
007300990211                          OUTPUT(*OUTFILE) FILEATR(*PF) +
007400990211                          OUTFILE(QTEMP/§FPH) OUTMBR(*FIRST *ADD)
007500990211             MONMSG     MSGID(CPF0000)
007600990211             ENDDO
007700990211             IF         COND(&SATELL *EQ 'PJPRVGRU ') THEN(DO)
007800990211             DSPFD      FILE(&SATEL2/*ALL) TYPE(*ATR) +
007900990211                          OUTPUT(*OUTFILE) FILEATR(*PF) +
008000990211                          OUTFILE(QTEMP/§FPH) OUTMBR(*FIRST *ADD)
008100990211             MONMSG     MSGID(CPF0000)
008200990211             ENDDO
008300900407
008400921209             OVRDBF     FILE(QAFDPHY) TOFILE(QTEMP/§FPH)
008500891216READ:
008600891216             RCVF
008700891216             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDF))
008800891216
008900930709             CHGVAR     VAR(&TIPO) VALUE(%SUBSTRING(&PHFILE 1 2))
009000930709             CHGVAR     VAR(&TIP1) VALUE(%SUBSTRING(&PHFILE 1 1))
009100930709             CHGVAR     VAR(&TIP3) VALUE(%SUBSTRING(&PHFILE 1 3))
009200930709             CHGVAR     VAR(&TIP5) VALUE(%SUBSTRING(&PHFILE 1 5))
009300930709             CHGVAR     VAR(&TIP4) VALUE(%SUBSTRING(&PHFILE 1 4))
009400930709
009500930709/* NON METTE SOTTO JOURNAL O STACCO SE E' PRESENTE  */
009600930709/* SECONDO ALCUNE PARZIALIZZAZIONI   */
009700930709/* OPPURE SE IL FILE E' PRESENTE NELLA LIBRERIA LIBNOJRN */
009800930709
009900930709             IF         COND(&TIP5 *EQ 'CNIVA' *OR &TIP5 *EQ +
010000930709                          'FLFAP') THEN(GOTO CMDLBL(NOJRN))
010100930712             IF         COND(&TIP4 *EQ 'FLBA') THEN(GOTO CMDLBL(NOJRN))
010200950118             IF         COND(&TIP4 *EQ 'FNBA') THEN(GOTO CMDLBL(NOJRN))
010300020708             IF         COND(&TIP4 *EQ 'FLTR') THEN(GOTO CMDLBL(NOJRN))
010400930712             IF         COND(&TIPO *EQ 'EX') THEN(GOTO CMDLBL(NOJRN))
010500981222             IF         COND(&TIP1 *EQ 'Q' *OR &TIP1 *EQ 'W' *OR +
010600981222                          &TIP1 *EQ '§') THEN(GOTO CMDLBL(NOJRN))
010700930712             IF         COND(&TIP3 *EQ 'CMZ' *OR &TIP3 *EQ 'SNA' *OR +
010800930712                          &TIP3 *EQ 'SRC' *OR &TIP3 *EQ 'TAA') +
010900930712                          THEN(GOTO CMDLBL(NOJRN))
011000930709
011100940129             CHKOBJ     OBJ(&LIBNOJ/&PHFILE) OBJTYPE(*FILE)
011200930709             MONMSG     MSGID(CPF9801) EXEC(GOTO CMDLBL(JRN))
011300930709
011400930709NOJRN:
011500930709/* ESEGUE CHIUSURA GIORNALE  */
011600930709             IF         COND(&PHJRNM *NE '          ') THEN(DO)
011700930709             ENDJRNPF   FILE(&SATELL/&PHFILE) JRN(&PHJRLB/&PHJRNM)
011800930709             MONMSG     MSGID(CPF0000)
011900990211             ENDJRNPF   FILE(&SATEL2/&PHFILE) JRN(&PHJRLB/&PHJRNM)
012000990211             MONMSG     MSGID(CPF0000)
012100930709             ENDDO
012200930709             GOTO       CMDLBL(READ)
012300930709
012400930709JRN:
012500930709/* ESEGUE AVVIO SU GIORNALE  */
012600930709
012700941201             STRJRNPF   FILE(&SATELL/&PHFILE) JRN(&LIBJ/&JRS) +
012800941201                          OMTJRNE(*OPNCLO)
012900990211             MONMSG     MSGID(CPF7030 CPF9803 CPF9812) /* già +
013000990211                          presente - non allocabile - non presente */
013100990211             STRJRNPF   FILE(&SATEL2/&PHFILE) JRN(&LIBJ/&JRS) +
013200990211                          OMTJRNE(*OPNCLO)
013300990301             MONMSG     MSGID(CPF0000)
013400930709
013500930709             GOTO       CMDLBL(READ)
013600930709
013700930709ENDF:
014200910314FINE:        ENDPGM
