000100121231 TNSY79C1:   PGM        PARM(&LIBMX &FILMX)
000200930625             DCL        VAR(&SYSNAME) TYPE(*CHAR) LEN(8)
000300121231             DCL        VAR(&LIBMX) TYPE(*CHAR) LEN(10)
000400121231             DCL        VAR(&FILMX) TYPE(*CHAR) LEN(10)
000500121231             DCLF       FILE(MIMIX/MXCMPFILA)
000600121231
000700121231  /*       MIMIX_0/FILA192681    */
000800121231
000900911230
001000121231             OVRDBF     FILE(MXCMPFILA) TOFILE(&LIBMX/&FILMX)
001100000000READ:
001200911230             RCVF
001300911230             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDF))
001400911230
001500121231             OPNDBF     FILE(&SYS2LIB/&SYS2OBJ) OPTION(*ALL) +
001600121231                          MBR(*FIRST)
001700940416             MONMSG     MSGID(CPF0000)
001800121231             CLOF       OPNID(&SYS2OBJ)
001900940416             MONMSG     MSGID(CPF0000)
002000940416
002100911230             GOTO       CMDLBL(READ)
002200911230
002300930701 ENDF:
002400930701             ENDPGM
