000100941119 TNSY91C:    PGM
000200920320
000300920326             DCL        VAR(&JOB) TYPE(*CHAR) LEN(10)
000400920326
000500941119             RTVJOBA    JOB(&JOB)
000600920326
000700920326             SNDBRKMSG  MSG('Ti sei ricordato di eseguire la +
000800920326                          TRASMISSIONE delle giacenze ?') TOMSGQ(&JOB)
000900920326
001000900515ENDPGM:      ENDPGM
