000100070926 TNSYTEFAC: PGM
000201070926             DCL        VAR(&SYSNAME) TYPE(*CHAR) LEN(8)
000202070926             RTVNETA    SYSNAME(&SYSNAME)
000203070926             IF         COND(&SYSNAME *EQ 'SETRAS') THEN(DO)
000204070926             ADDTCPRTE  RTEDEST('10.146.0.3') SUBNETMASK(*HOST) +
000205070926                          NEXTHOP('10.46.0.245') BINDIFC('10.46.0.3')
000206070926                ENDDO
000207070926             IF         COND(&SYSNAME *EQ 'AS777') THEN(DO)
000209070926             ADDTCPRTE  RTEDEST('10.146.0.5') SUBNETMASK(*HOST) +
000210070926                          NEXTHOP('10.46.0.245') BINDIFC('10.46.0.5')
000211070926                ENDDO
000212070926
000213070926             IF         COND(&SYSNAME *EQ 'AS777MI') THEN(DO)
000215070926             ADDTCPRTE  RTEDEST('10.46.0.5') SUBNETMASK(*HOST) +
000216070926                          NEXTHOP('10.146.0.245') BINDIFC('10.146.0.5')
000217070926                ENDDO
000218070926             IF         COND(&SYSNAME *EQ 'SETRASMI') THEN(DO)
000219070926             ADDTCPRTE  RTEDEST('10.46.0.3') SUBNETMASK(*HOST) +
000220070926                          NEXTHOP('10.146.0.245') BINDIFC('10.146.0.3')
000222070926             ENDDO
001100070926ENDPGM
