000100171012TNSYSYSRC:   PGM
000200171012
000201171012             DCL        VAR(&USER) TYPE(*CHAR) LEN(10)
000202171012
000203171012             RTVJOBA    USER(&USER)
000204171012
000205171012             IF         COND(%SST(&USER 1 1) *EQ 'Q') THEN(TFRSECJOB)
000207171012
000208171012             ELSE       CMD(GOTO CMDLBL(FINE))
000209171012
002900931123
003000921113FINE:        ENDPGM
