000100020330 TNSYT0C:    PGM        PARM(&PIUMEN)
000200020330             DCL        VAR(&PIUMEN) TYPE(*CHAR) LEN(3)
000201020330             DCL        VAR(&VORA) TYPE(*CHAR) LEN(6)
000300990327             DCL        VAR(&NORA) TYPE(*CHAR) LEN(6)
000400990327             DCL        VAR(&VORAN) TYPE(*DEC) LEN(6 0) VALUE(0)
000500990327             DCL        VAR(&NORAN) TYPE(*DEC) LEN(6 0) VALUE(0)
000600990327             RTVSYSVAL  SYSVAL(QTIME) RTNVAR(&VORA)
000700990327             CHGVAR     VAR(&VORAN) VALUE(&VORA)
000702020330             IF         COND(&PIUMEN *EQ 'PIU') THEN(CHGVAR +
000800020330                          VAR(&NORAN) VALUE(&VORAN + 010000))
000801020330             IF         COND(&PIUMEN *EQ 'MEN') THEN(CHGVAR +
000802020330                          VAR(&NORAN) VALUE(&VORAN - 010000))
000900990327             CHGVAR     VAR(&NORA) VALUE(&NORAN)
001000990327             CHGSYSVAL  SYSVAL(QTIME) VALUE(&NORA)
001100920124 ENDF:       ENDPGM
