000010040611     A*%%TS  SD  20040611  221043  EDPLB       REL-V4R4M0  5769-PW1
000020040611     A*%%EC
000030040611     A                                      DSPSIZ(24 80 *DS3)
000040040611     A                                      CHGINPDFT
000050040611     A                                      MSGLOC(24)
000060040611     A                                      PRINT
000070040611     A                                      CF03(12 'FINE LAVORO')
000080040611     A          R TNSYD01
000090040611     A*%%TS  SD  20040611  221043  EDPLB       REL-V4R4M0  5769-PW1
000100040611     A                                  1 19'                                  -
000110040611     A                                           '
000120040611     A                                      DSPATR(UL)
000130040611     A                                  2 19'** UTILY QUERY                    -
000140040611     A                                         **'
000150040611     A                                      DSPATR(UL)
000160040611     A                                      DSPATR(RI)
000170040611     A                                  2 61'TNSYQQ99C'
000180040611     A                                  2 72DATE
000190040611     A                                      EDTCDE(Y)
000200040611     A                                  4  2'« 1»'
000210040611     A                                      DSPATR(HI)
000220040611     A            DES1          74A  O  4  7DSPATR(UL)
000230040611     A                                  5  2'« 2»'
000240040611     A                                      DSPATR(HI)
000250040611     A            DES2          74A  O  5  7DSPATR(UL)
000260040611     A                                  6  2'« 3»'
000270040611     A                                      DSPATR(HI)
000280040611     A            DES3          74A  O  6  7DSPATR(UL)
000290040611     A                                  7  2'« 4»'
000300040611     A                                      DSPATR(HI)
000310040611     A            DES4          74A  O  7  7DSPATR(UL)
000320040611     A                                  8  2'« 5»'
000330040611     A                                      DSPATR(HI)
000340040611     A            DES5          74A  O  8  7DSPATR(UL)
000350040611     A                                  9  2'« 6»'
000360040611     A                                      DSPATR(HI)
000370040611     A            DES6          74A  O  9  7DSPATR(UL)
000380040611     A                                 10  2'« 7»'
000390040611     A                                      DSPATR(HI)
000400040611     A            DES7          74A  O 10  7DSPATR(UL)
000410040611     A                                 11  2'« 8»'
000420040611     A                                      DSPATR(HI)
000430040611     A            DES8          74A  O 11  7DSPATR(UL)
000440040611     A                                 12  2'« 9»'
000450040611     A                                      DSPATR(HI)
000460040611     A            DES9          74A  O 12  7DSPATR(UL)
000470040611     A                                 13  2'«10»'
000480040611     A                                      DSPATR(HI)
000490040611     A            DES10         74A  O 13  7DSPATR(UL)
000500040611     A                                 14  2'«11»'
000510040611     A                                      DSPATR(HI)
000520040611     A            DES11         74A  O 14  7DSPATR(UL)
000530040611     A                                 15  2'«12»'
000540040611     A                                      DSPATR(HI)
000550040611     A            DES12         74A  O 15  7DSPATR(UL)
000560040611     A                                 16  2'«13»'
000570040611     A                                      DSPATR(HI)
000580040611     A            DES13         74A  O 16  7DSPATR(UL)
000590040611     A                                 17  2'«14»'
000600040611     A                                      DSPATR(HI)
000610040611     A            DES14         74A  O 17  7DSPATR(UL)
000620040611     A                                 18  2'«15»'
000630040611     A                                      DSPATR(HI)
000640040611     A            DES15         74A  O 18  7DSPATR(UL)
000650040611     A                                 19  2'«16»'
000660040611     A                                      DSPATR(HI)
000670040611     A            DES16         74A  O 19  7DSPATR(UL)
000680040611     A                                 21  7'SCELTA'
000690040611     A            SCELTA         2Y 0B 21 14TEXT('Opzione')
000700040611     A                                      DSPATR(HI)
000710040611     A                                      DSPATR(CS)
000720040611     A                                      DSPATR(PC)
000730040611     A                                      CHECK(ER)
000740040611     A                                      CHECK(RZ)
000750040611     A                                      RANGE(1 16)
000760040611     A                                      EDTCDE(Z)
000770040611     A                                 22  2'                                  -
000780040611     A                                                                         -
000790040611     A                                               '
000800040611     A                                      DSPATR(UL)
000810040611     A                                 23 63'CMD03 Fine lavoro'
000820040611     A                                      DSPATR(HI)
000830040611     A            VERR          50A  O 21 23DSPATR(HI)
000840040611     A                                      DSPATR(BL)
