000010160804     A*%%TS  SD  20160804  144823  EDPMB       REL-V7R1M0  5770-WDS
000020160804     A*%%EC
000030160804     A                                      DSPSIZ(27 132 *DS4)
000040160804     A                                      CHGINPDFT(HI UL)
000050160804     A                                      INDARA
000060160804     A                                      PRINT
000070151210     A**-------------------------------------------------------------**
000080160302     A          R SM10T01
000090160302     A*%%TS  SD  20160302  101859  EDPMB       REL-V7R1M0  5770-WDS
000100160302     A            RSUT      R        O  1  2REFFLD(RSUT DDATIUTE)
000110160302     A                                  1 50'**  Controllo Tariffe Variate  **'
000120160302     A                                      DSPATR(RI)
000130160302     A                                      DSPATR(UL)
000140160302     A            V01PGM    R        O  1105REFFLD($PGM CNDIZION)
000150160302     A                                  1123DATE(*JOB *YY)
000160160302     A                                      EDTCDE(Y)
000170160302     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000180160302     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000190160302     A            V01DES        40A  O  2 48DSPATR(HI)
000200160302     A                                  2123TIME
000210151210     A**-------------------------------------------------------------**
000220160804     A          R SM10D02
000230160804     A*%%TS  SD  20160804  144823  EDPMB       REL-V7R1M0  5770-WDS
000240160804     A                                      CF02
000250160804     A                                      CF03
000260160804     A                                      OVERLAY
000270160804     A                                      RTNCSRLOC(&H2NMRC &H2NMFL &H2POSC)
000280160804     A            H2NMRC        10A  H      TEXT('Nome record')
000290160804     A            H2NMFL        10A  H      TEXT('Nome campo')
000300160804     A            H2POSC         4S 0H      TEXT('Posizione nel campo')
000310160804     A  28        V02MSG        78   M
000320160804     A  27                              5 31'Distretto .........?:'
000330160804     A  27        V02CDI         1A  B  5 54
000340160804     A  50                                  DSPATR(PC)
000350160804     A  27        V02CDID       25A  O  5 63COLOR(BLU)
000360160804     A  26                              6 31'Area ..............?:'
000370160804     A  26        V02CAR         3A  B  6 54CHECK(RB)
000380160804     A  51                                  DSPATR(PC)
000390160804     A  26        V02CARD       25A  O  6 63COLOR(BLU)
000400160804     A                                  7 31'Filiale ...........?:'
000410160804     A            V02FIL         3A  B  7 54
000420160804     A  52                                  DSPATR(PC)
000430160804     A                                      CHECK(RB)
000440160804     A            V02FILD       20A  O  7 63COLOR(BLU)
000450160804     A                                  9 31'Comm.le Unificante ?:'
000460160804     A            V02CMM         7A  B  9 54
000470160804     A  53                                  DSPATR(PC)
000480160804     A                                      CHECK(RB)
000490160804     A            V02CMMD       25A  O  9 63COLOR(BLU)
000500160804     A                                 11 31'Cliente ...........?:'
000510160804     A            V02KSC         7A  B 11 54
000520160804     A  54                                  DSPATR(PC)
000530160804     A                                      CHECK(RB)
000540160804     A            V02KSCD       48A  O 11 63COLOR(BLU)
000550160804     A                                 12 35'oppure'
000560160804     A                                 13 31'Cliente Unificante ?:'
000570160804     A            V02KSU         7A  B 13 54
000580160804     A  55                                  DSPATR(PC)
000590160804     A                                      CHECK(RB)
000600160804     A            V02KSUD       48A  O 13 63COLOR(BLU)
000610160804     A                                 15 31'Tariffe Inserite .. :'
000620160804     A                                 15 54'dal'
000630160804     A            V02DATI        8Y 0B 15 58CHECK(RZ)
000640160804     A  56                                  DSPATR(PC)
000650160804     A                                      EDTCDE(Y)
000660160804     A                                 15 70'al'
000670160804     A            V02DATF        8Y 0B 15 73CHECK(RZ)
000680160804     A  57                                  DSPATR(PC)
000690160804     A                                      EDTCDE(Y)
000700160804     A                                 17 31'Cod.Importanza Cli ?:'
000710160804     A            V02CLV1        1A  B 17 54
000720160804     A  59                                  DSPATR(PC)
000730160804     A            V02CLV2        1A  B 17 57
000740160804     A  60                                  DSPATR(PC)
000750160804     A            V02CLV3        1A  B 17 60
000760160804     A  61                                  DSPATR(PC)
000770160804     A            V02CLV4        1A  B 17 63
000780160804     A  62                                  DSPATR(PC)
000790160804     A            V02CLV5        1A  B 17 66
000800160804     A  63                                  DSPATR(PC)
000810160804     A                                 19 31'Scostamento ....... :'
000820160804     A                                 19 54'da'
000830160804     A            V02SCODAS      1A  B 19 58VALUES('+' '-')
000840160804     A            V02SCODA       5Y 2B 19 60EDTCDE(2)
000850160804     A  58                                  DSPATR(PC)
000860160804     A                                      CHECK(RZ)
000870160804     A                                 19 67'%'
000880160804     A                                      COLOR(BLU)
000890160804     A                                 19 70'a'
000900160804     A            V02SCOAS       1A  B 19 73VALUES('+' '-')
000910160804     A            V02SCOA        5Y 2B 19 75EDTCDE(2)
000920160804     A                                      CHECK(RZ)
000930160804     A                                 19 82'%'
000940160804     A                                      COLOR(BLU)
000950160804     A                                 21 31'Escludi ............:'
000960160804     A            V02ESCO        1A  B 21 54VALUES(' ' 'S')
000970160804     A                                 21 65'(S=Sì)'
000980160804     A                                      COLOR(BLU)
000990160804     A                                 21 72'Nessuna differenza di imponibile'
001000160804     A  69                                  DSPATR(PC)
001010160804     A                                      COLOR(BLU)
001020160804     A            V02MCT1        1A  B 22 54
001030160804     A  64                                  DSPATR(PC)
001040160804     A            V02MCT2        1A  B 22 56
001050160804     A  65                                  DSPATR(PC)
001060160804     A            V02MCT3        1A  B 22 58
001070160804     A  66                                  DSPATR(PC)
001080160804     A            V02MCT4        1A  B 22 60
001090160804     A  67                                  DSPATR(PC)
001100160804     A            V02MCT5        1A  B 22 62
001110160804     A  68                                  DSPATR(PC)
001120160804     A                                 22 65'(F2)'
001130160804     A                                      COLOR(BLU)
001140160804     A                                 22 70'Motivi Non Ricalcolo'
001150160804     A                                      COLOR(BLU)
001160160804     A                                 24 31'Variazioni in MAI VDL:'
001170160804     A            V02MVDL        1   B 24 54VALUES(' ' 'S')
001180160804     A                                 24 58'(S=Sì)'
001190160804     A                                      COLOR(BLU)
001200160804     A                                 27  4'F3=Fine'
001210160804     A                                      COLOR(BLU)
001220151210     A**-------------------------------------------------------------**
001230160701     A          R SM10S03                   SFL
001240160701     A*%%TS  SD  20160701  121453  EDPGA       REL-V7R1M0  5770-WDS
001250160701     A  32                                  SFLNXTCHG
001260160701     A            VH3CMM         7S 0H
001270160701     A            VH3KSU         7S 0H
001280160701     A            VH3DTE         8S 0H
001290160701     A            VH3RAG        48A  H
001300160701     A            VH3SCO         7S 3H
001310160701     A            VS3OPZ         1A  B  8  2
001320160701     A  70                                  DSPATR(PC)
001330160701     A  70                                  COLOR(RED)
001340160701     A            VS3CLV         1A  O  8  4
001350160701     A            VS3KSC         7S 0O  8  6
001360160701     A            VS3BLC         1A  O  8 14
001370160701     A            VS3KSCD       27A  O  8 16
001380160701     A            VS3CMMD       22A  O  8 44
001390160701     A            VS3CTR         3S 0O  8 69
001400160701     A            VS3PRG         3Y 0O  8 73EDTCDE(Z)
001410160701     A            VS3DDT         6Y 0O  8 77EDTCDE(Y)
001420160701     A            VS3DTE         6Y 0O  8 86EDTCDE(Y)
001430160701     A            VS3MCT         1A  O  8 95
001440160701     A            VS3IMVF        8Y 0O  8 98EDTCDE(2)
001450160701     A            VS3IMVR        8Y 0O  8112EDTCDE(2)
001460160701     A            VS3SCO         7A  O  8125
001470160701     A  40                                  COLOR(RED)
001480160701     A            VS3DSP        40A  O  9 14
001490160701     A            VS3NB         42A  O  9 56
001500160701     A            VS3DIFF       30A  O  9100
001510160701     A            VS3TAPM        1A  O  8 67
001520160701     A  41                                  COLOR(RED)
001530160701     A  41                                  DSPATR(BL)
001540160701     A            VH3LAMP        1   H
001550151210     A**-------------------------------------------------------------**
001560160701     A          R SM10C03                   SFLCTL(SM10S03)
001570160701     A*%%TS  SD  20160701  120244  EDPGA       REL-V7R1M0  5770-WDS
001580160701     A                                      SFLSIZ(9999)
001590160701     A                                      SFLPAG(0008)
001600160701     A                                      CF02
001610160701     A                                      CF03
001620160701     A                                      CF05
001630160701     A                                      CF08
001640160701     A                                      CF12
001650160701     A                                      CF04
001660160701     A                                      OVERLAY
001670160701     A N30                                  SFLDSP
001680160701     A N31                                  SFLDSPCTL
001690160701     A  30 31                               SFLCLR
001700160701     A  33                                  SFLEND(*MORE)
001710160701     A                                      SFLDROP(CF09)
001720160701     A            V03RCD         4S 0H      SFLRCDNBR(CURSOR)
001730160701     A            V03CSR         5S 0H
001740160701     A  28        V03MSG        78   M
001750160701     A                                  3  2'Parzializzato per:'
001760160701     A                                      DSPATR(UL)
001770160701     A                                      DSPATR(HI)
001780160701     A                                  3 21'F5=Parzializzazioni'
001790160701     A                                      COLOR(BLU)
001800160701     A                                  4  2'Opzioni:'
001810160701     A                                      DSPATR(HI)
001820160701     A                                      DSPATR(UL)
001830160701     A                                  4 11'5=Dettaglio; T=Int.Tariffa; P=Int.-
001840160701     A                                      Tariffa Precedente; I=Int.Clienti; -
001850160701     A                                      S=Statistica'
001860160701     A                                      COLOR(BLU)
001870160701     A                                  6  2'O|I|CLIENTE                       -
001880160701     A                                             |                      |T|  -
001890160701     A                                           |Decorr. |        |N|    I M P-
001900160701     A                                       O N I B I L E    |   %   '
001910160701     A                                      DSPATR(HI)
001920160701     A                                  7  2'P|C|        B=Bloccato            -
001930160701     A                                             |COMMERCIALE           |A|Ta-
001940160701     A                                      r Prg|Tariffa |Inserita|R|  Fattura-
001950160701     A                                      to   Ricalcolato  | Scost.'
001960160701     A                                      DSPATR(HI)
001970160701     A                                      DSPATR(UL)
001980151210     A**-------------------------------------------------------------**
001990160701     A          R SM10P03
002000160701     A*%%TS  SD  20160701  120244  EDPGA       REL-V7R1M0  5770-WDS
002010160701     A                                      OVERLAY
002020160701     A                                 25  2'                                  -
002030160701     A                                                                         -
002040160701     A                                                                         -
002050160701     A                                                                 '
002060160701     A                                      DSPATR(UL)
002070160701     A                                      DSPATR(HI)
002080160701     A                                 26  3'F2=Legenda NR'
002090160701     A                                      COLOR(BLU)
002100160701     A                                 27  3'F3=Fine'
002110160701     A                                      COLOR(BLU)
002120160701     A  37                             27 32'F8=Ord.Scostamento'
002130160701     A                                      COLOR(BLU)
002140160701     A  38                             27 32'F8=Ord.Comm/Cli/Tar'
002150160701     A                                      COLOR(BLU)
002160160701     A                                 27 73'F9=Altri Dati'
002170160701     A                                      COLOR(BLU)
002180160701     A                                 27121'F12=Ritorno'
002190160701     A                                      COLOR(BLU)
002200160701     A                                 26 32'F4=Legenda TA'
002210160701     A                                      COLOR(BLU)
002220151216     A**-------------------------------------------------------------**
002230160804     A          R SM10W04
002240160804     A*%%TS  SD  20160804  144823  EDPMB       REL-V7R1M0  5770-WDS
002250160804     A                                      WINDOW(6 15 16 89)
002260160804     A                                      CF02
002270160804     A                                      CF12
002280160804     A                                      RTNCSRLOC(&H2NMRC &H2NMFL &H2POSC)
002290160804     A            H2NMRC        10A  H      TEXT('Nome record')
002300160804     A            H2NMFL        10A  H      TEXT('Nome campo')
002310160804     A            H2POSC         4S 0H      TEXT('Posizione nel campo')
002320160804     A            VH4CAR         3S 0H
002330160804     A            VH4FIL         3S 0H
002340160804     A            VH4CMM         7S 0H
002350160804     A            VH4KSC         7S 0H
002360160804     A            VH4KSU         7S 0H
002370160804     A  28        V04MSG        78   M
002380160804     A                                  1 31'P A R Z I A L I Z Z A Z I O N I'
002390160804     A                                      DSPATR(HI)
002400160804     A                                      DSPATR(UL)
002410160804     A  27                              3  2'Distretto ..................?:'
002420160804     A  27        V04CDI         1A  B  3 33
002430160804     A  50                                  DSPATR(PC)
002440160804     A  27        V04CDID       25A  O  3 41COLOR(BLU)
002450160804     A  26                              4  2'Area .......................?:'
002460160804     A  26        V04CAR         3A  B  4 33
002470160804     A  51                                  DSPATR(PC)
002480160804     A                                      CHECK(RB)
002490160804     A  26        V04CARD       25A  O  4 41COLOR(BLU)
002500160804     A                                  5  2'Filiale ....................?:'
002510160804     A            V04FIL         3A  B  5 33
002520160804     A  52                                  DSPATR(PC)
002530160804     A                                      CHECK(RB)
002540160804     A            V04FILD       20A  O  5 41COLOR(BLU)
002550160804     A                                  6  2'Commerciale Unificante .....?:'
002560160804     A            V04CMM         7A  B  6 33
002570160804     A  53                                  DSPATR(PC)
002580160804     A                                      CHECK(RB)
002590160804     A            V04CMMD       25A  O  6 41COLOR(BLU)
002600160804     A                                  7  2'Cliente ....................?:'
002610160804     A            V04KSC         7A  B  7 33
002620160804     A  54                                  DSPATR(PC)
002630160804     A                                      CHECK(RB)
002640160804     A            V04KSCD       48A  O  7 41COLOR(BLU)
002650160804     A                                  8  2'Cliente Unificante .........?:'
002660160804     A            V04KSU         7A  B  8 33
002670160804     A  55                                  DSPATR(PC)
002680160804     A                                      CHECK(RB)
002690160804     A            V04KSUD       48A  O  8 41COLOR(BLU)
002700160804     A                                  9  2'Tariffe Inserite ............:'
002710160804     A                                  9 33'dal'
002720160804     A            V04DATI        8Y 0B  9 37CHECK(RZ)
002730160804     A  56                                  DSPATR(PC)
002740160804     A                                      EDTCDE(Y)
002750160804     A                                  9 48'al'
002760160804     A            V04DATF        8Y 0B  9 51CHECK(RZ)
002770160804     A  57                                  DSPATR(PC)
002780160804     A                                      EDTCDE(Y)
002790160804     A                                 10  2'Cod.Importanza Cliente .....?:'
002800160804     A            V04CLV1        1A  B 10 33
002810160804     A  59                                  DSPATR(PC)
002820160804     A            V04CLV2        1A  B 10 35
002830160804     A  60                                  DSPATR(PC)
002840160804     A            V04CLV3        1A  B 10 37
002850160804     A  61                                  DSPATR(PC)
002860160804     A            V04CLV4        1A  B 10 39
002870160804     A  62                                  DSPATR(PC)
002880160804     A            V04CLV5        1A  B 10 41
002890160804     A  63                                  DSPATR(PC)
002900160804     A                                 11  2'Scostamento .................:'
002910160804     A                                 11 33'da'
002920160804     A            V04SCODAS      1A  B 11 37VALUES('+' '-')
002930160804     A            V04SCODA       5Y 2B 11 39EDTCDE(2)
002940160804     A  58                                  DSPATR(PC)
002950160804     A                                      CHECK(RZ)
002960160804     A                                 11 46'%'
002970160804     A                                      COLOR(BLU)
002980160804     A                                 11 48'a'
002990160804     A            V04SCOAS       1A  B 11 51VALUES('+' '-')
003000160804     A            V04SCOA        5Y 2B 11 53EDTCDE(2)
003010160804     A                                      CHECK(RZ)
003020160804     A                                 11 60'%'
003030160804     A                                      COLOR(BLU)
003040160804     A                                 12  2'Escludi .....................:'
003050160804     A            V04ESCO        1A  B 12 33VALUES(' ' 'S')
003060160804     A                                 12 44'(S=Sì)'
003070160804     A                                      COLOR(BLU)
003080160804     A                                 12 51'Nessuna differenza di imponibile'
003090160804     A  69                                  DSPATR(PC)
003100160804     A                                      COLOR(BLU)
003110160804     A            V04MCT1        1A  B 13 33
003120160804     A  64                                  DSPATR(PC)
003130160804     A            V04MCT2        1A  B 13 35
003140160804     A  65                                  DSPATR(PC)
003150160804     A            V04MCT3        1A  B 13 37
003160160804     A  66                                  DSPATR(PC)
003170160804     A            V04MCT4        1A  B 13 39
003180160804     A  67                                  DSPATR(PC)
003190160804     A            V04MCT5        1A  B 13 41
003200160804     A  68                                  DSPATR(PC)
003210160804     A                                 13 44'(F2)'
003220160804     A                                      COLOR(BLU)
003230160804     A                                 13 49'Motivi Non Ricalcolo'
003240160804     A                                      COLOR(BLU)
003250160804     A                                 14  2'Variazioni in MAI VDL .......:'
003260160804     A            V04MVDL        1   B 14 33VALUES(' ' 'S')
003270160804     A                                 14 36'(S=Sì)'
003280160804     A                                      COLOR(BLU)
003290160804     A                                 15 77'F12=Ritorno'
003300160804     A                                      COLOR(BLU)
003310151218     A**-------------------------------------------------------------**
003320151218     A          R SM10D05
003330151218     A*%%TS  SD  20151218  104501  EDPMB       REL-V7R1M0  5770-WDS
003340151218     A                                      CF03
003350151218     A                                      CF05
003360151218     A                                      CF12
003370151218     A                                      OVERLAY
003380151218     A                                  3  2'Parzializzato per:'
003390151218     A                                      DSPATR(UL)
003400151218     A                                      DSPATR(HI)
003410151218     A                                  3 21'F5=Parzializzazioni'
003420151218     A                                      COLOR(BLU)
003430151218     A                                  4  2'Opzioni:'
003440151218     A                                      DSPATR(HI)
003450151218     A                                      DSPATR(UL)
003460151218     A                                  4 11'5=Dettaglio; T=Int.Tariffa Variata-
003470151218     A                                      ; P=Int.Tariffa Precedente; I=Int.C-
003480151218     A                                      lienti; S=Statistica'
003490151218     A                                      COLOR(BLU)
003500151218     A                                  6  2'O|I|CLIENTE                       -
003510151218     A                                             |                        |  -
003520151218     A                                           |Decorr. | Data   |N|    I M P-
003530151218     A                                       O N I B I L E    |   %   '
003540151218     A                                      DSPATR(HI)
003550151218     A                                  7  2'P|C|        B=Bloccato            -
003560151218     A                                             |COMMERCIALE             |Ta-
003570151218     A                                      r Prg|Tariffa |Modifica|C|  Fattura-
003580151218     A                                      to   Ricalcolato  | Scost.'
003590151218     A                                      DSPATR(HI)
003600151218     A                                      DSPATR(UL)
003610151218     A                                 16 34'Nr. MAX righe visualizzabili super-
003620151218     A                                      ato. Fare "F5=Parzializzazioni"'
003630151218     A                                      COLOR(RED)
003640151218     A                                 25  2'                                  -
003650151218     A                                                                         -
003660151218     A                                                                         -
003670151218     A                                                                 '
003680151218     A                                      DSPATR(UL)
003690151218     A                                      DSPATR(HI)
003700151218     A                                 27  3'F3=Fine'
003710151218     A                                      COLOR(BLU)
003720151218     A                                 27121'F12=Ritorno'
003730151218     A                                      COLOR(BLU)
003740160120     A**-------------------------------------------------------------**
003750160120     A          R SM10SW6                   SFL
003760160120     A*%%TS  SD  20160120  131953  EDPMB       REL-V7R1M0  5770-WDS
003770160120     A                                      SFLNXTCHG
003780160120     A            V06MCT         1A  H
003790160120     A            V06OPZ         1A  B  6  2VALUES('1' ' ')
003800160120     A            V06DES        61A  O  6  5
003810160120     A**-------------------------------------------------------------**
003820160120     A          R SM10CW6                   SFLCTL(SM10SW6)
003830160120     A*%%TS  SD  20160120  131953  EDPMB       REL-V7R1M0  5770-WDS
003840160120     A                                      OVERLAY
003850160120     A N30                                  SFLDSP
003860160120     A N31                                  SFLDSPCTL
003870160120     A  30 31                               SFLCLR
003880160120     A  33                                  SFLEND(*MORE)
003890160120     A                                      SFLSIZ(0005)
003900160120     A                                      SFLPAG(0005)
003910160120     A                                      WINDOW(5 55 12 65)
003920160120     A            V06RCD         4S 0H      SFLRCDNBR(CURSOR)
003930160120     A            V06CSR         5S 0H
003940160120     A  28        V06MSG        78   M
003950160120     A                                  1 13'Motivi No Ricalcolo'
003960160120     A                                      DSPATR(HI)
003970160120     A                                      DSPATR(UL)
003980160120     A                                  3  1'Opzioni: 1=Scelta'
003990160120     A                                      COLOR(BLU)
004000160120     A                                  5  1'Opz Motivo No Ricalcolo           -
004010160120     A                                                                     '
004020160120     A                                      DSPATR(UL)
004030160120     A                                      DSPATR(HI)
004040160120     A**-------------------------------------------------------------**
004050160120     A          R SM10W07
004060160120     A*%%TS  SD  20160120  131953  EDPMB       REL-V7R1M0  5770-WDS
004070160120     A                                      WINDOW(5 25 8 62)
004080160120     A                                      OVERLAY
004090160120     A                                  1 20'Motivi No Ricalcolo'
004100160120     A                                      DSPATR(HI)
004110160120     A                                      DSPATR(UL)
004120160120     A            V07DES1       61A  O  3  2
004130160120     A            V07DES2       61A  O  4  2
004140160120     A            V07DES3       61A  O  5  2
004150160120     A            V07DES4       61A  O  6  2
004160160120     A            V07DES5       61A  O  7  2
004170160701     A*         R SM10W07
004180160701     A          R SM10W08
004190160701     A*%%TS  SD  20160701  120324  EDPGA       REL-V7R1M0  5770-WDS
004200160701     A                                      WINDOW(5 25 8 62)
004210160701     A                                      OVERLAY
004220160701     A                                  1 20'Tipo Applicazione VDL'
004230160701     A                                      DSPATR(HI)
004240160701     A                                      DSPATR(UL)
004250160701     A                                  3  3'M'
004260160701     A                                  3  9'Tipo applicazione MAI VDL nella nu-
004270160701     A                                      ova tariffa ma'
004280160701     A                                  3  6'='
004290160701     A                                  6  3'M'
004300160701     A                                      DSPATR(BL)
004310160701     A                                      COLOR(RED)
004320160701     A                                  6  6'='
004330160701     A                                  4  9'presente anche nel Progressivo pre-
004340160701     A                                      cedente'
004350160701     A                                  6  9'Tipo applicazione MAI VDL presente-
004360160701     A                                       solo in questo'
004370160701     A                                  7  9'Progressivo'
