000100950522     A*---------------------------------------------------------------*
000200161019     A* DISTINTE AUT. "CONSEGNE/RITIRI" TESTATA VALORIZZAZIONI
000300950522     A*---------------------------------------------------------------*
000400950522     A                                      REF(CNDIZION)
000500161019     A          R BITVL000
000600161019     A                                      TEXT('TESTATA VALORIZZAZIONI')
000700161019     A            TVLFGS    R               REFFLD($FGS)
000800161017     A                                      TEXT('FILIALE GESTIONE')
000900161017     A                                      COLHDG('FILIALE' 'GESTIONE')
001000161019     A            TVLDFV    R               REFFLD($DFV)
001001161019     A                                      TEXT('DATA DISTINTA')
001002161019     A                                      COLHDG('DATA' 'DISTINTA')
001400161019     A            TVLPDR    R               REFFLD($PDR)
013200161019     A            TVLNOTAR       1          TEXT('N=TARIFFA NON TROVATA')
013300161017     A                                      COLHDG('TAR' 'NON' 'TROVATA')
013301161021     A            TVLTPTAR       1          TEXT('S=VALORIZZAZIONE A DETTAGLIO')
013302161019     A                                      COLHDG('VALORIZ.' 'A DETTAGLIO')
013303161021     A            TVLACBON       1          TEXT('S=ACCORDO BONUS FISSO')
013304161021     A                                      COLHDG('ACCORDO' 'BONUS' 'FISSO')
013305161021     A            TVLACBOI       1          TEXT('S=ACCORDO BONUS VARIABILE')
013306161021     A                                      COLHDG('ACCORDO' 'BONUS' 'VARIABILE-
013307161021     A                                      ')
013308161021     A            TVLACMGA       1          TEXT('S=ACCORDO MINIMO GARANTITO')
013309161021     A                                      COLHDG('ACCORDO' 'MINIMO' 'GARANTIT-
013310161021     A                                      O')
013311161025     A            TVLBONF       13S 5       TEXT('IMPORTO FISSO BONUS FILIALE')
013312161025     A                                      COLHDG('IMP.FISSO' 'BONUS FILIALE')
013400161019     A            TVLTMG        13S 5       TEXT('IMPORTO TARIFFA MEZZA -
013500161017     A                                      GIORNATA')
013600161025     A                                      COLHDG('IMP.TAR.' 'MEZZA GIORNATA')
013700161019     A            TVLTIG        13S 5       TEXT('IMPORTO TARIFFA INTERA -
013800161017     A                                      GIORNATA')
013900161025     A                                      COLHDG('IMP.TAR.' 'INTERA GIORNATA')
014000161019     A            TVLMGA        13S 5       TEXT('IMPORTO TARIFFA MINIMO -
014100161025     A                                      GARANTITO GIORNATA')
014200161025     A                                      COLHDG('IMP.TAR.' 'MIN.GARANTITO' -
014300161025     A                                      'GIORNATA')
014400161025     A            TVLBON        13S 5       TEXT('IMPORTO TARIFFA BONUS GIORN-
014401161025     A                                      ATA')
014500161025     A                                      COLHDG('IMP.TAR.' 'BONUS GIORNATA')
014504161025     A            TVLTBN        13S 5       TEXT('IMPORTO BONUS VALORIZZATO')
014505161025     A                                      COLHDG('IMPORTO' 'BONUS VALORIZZATO-
014506161025     A                                      ')
014507161025     A            TVLMNT        13S 5       TEXT('IMPORTO MINIMO GARANTITO VALO-
014508161025     A                                      RIZZATO')
014509161025     A                                      COLHDG('IMPORTO' 'MIN. GARANTITO' -
014510161025     A                                      'VALORIZZATO')
015000161027     A            TVLPKET       13S 5       TEXT('IMPORTO PICKING/ETICHETTATURA-
015001161027     A                                       VALORIZZATO')
015100161027     A                                      COLHDG('IMPORTO' 'PCK/ETI' -
015101161025     A                                      'VALORIZZATO')
015400161025     A            TVLITT        10S 3       TEXT('IMPORTO TASSAZIONE VALORIZZAT-
015401161025     A                                      O')
015500161017     A                                      COLHDG('IMPORTO' 'TASSAZIONE' -
015600161025     A                                      'VALORIZZATO')
015701161025     A            TVLITA        10S 3       TEXT('IMPORTO TASSAZIONE ACCESSORI -
015702161025     A                                      VALORIZZATO')
015703161025     A                                      COLHDG('IMP.TASSAZIONE' -
015900161025     A                                      'ACCESSORI' -
015901161025     A                                      'VALORIZZATO')
016000161025     A            TVLICE        10S 3       TEXT('COMPETENZE RITIRI/CONSEGNE')
016100161025     A                                      COLHDG('COMPETENZE' 'RITIRI' -
016101161025     A                                      'CONSEGNE')
016200161027     A            TVLICEA       10S 3       TEXT('COMPETENZE ACCESSORI RITIRI-
016201161027     A                                      /CONSEGNE')
016300161027     A                                      COLHDG('COMPETENZE' 'ACCESSORI' -
016301161027     A                                      'RIT./CON.')
016400161019     A            TVLDATORA R               REFFLD($ALFA17)
016500161019     A                                      TEXT('WRK-DATA/ORA PREP.DATI AAAAMM-
016600161025     A                                      GGHHMMSS')
016700161019     A                                      COLHDG('DATA/ORA' 'ELABORAZIONE')
