000010990616     A*%%TS  SD  19990616  084228  EDPRM       REL-V4R2M0  5769-PW1
000020000000     A*------------------------------------------------------------------------*
000030990616     A*%%EC
000040990616     A                                      DSPSIZ(24 80 *DS3)
000050990616     A                                      CHGINPDFT(HI UL)
000060990616     A                                      PRINT
000070990616     A                                      CA03
000080000000     A*------------------------------------------------------------------------*
000090990616     A          R SSL5D01
000100990616     A*%%TS  SD  19990616  084228  EDPRM       REL-V4R2M0  5769-PW1
000110990616     A                                      CF06
000120990616     A  28        V1ZMSG        78   M
000130990616     A            RSUT          20A  O  1  2
000140990616     A                                  1 26'** STATISTICA TEMPI DI CONSEGNA **'
000150990616     A                                      DSPATR(RI)
000160990616     A                                      DSPATR(UL)
000170990616     A                                  1 62'TNSSL5R'
000180990616     A                                  1 72DATE
000190990616     A                                      EDTCDE(Y)
000200990616     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000210990616     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000220990616     A                                  2 72TIME
000230990616     A                                  7  3'Data spedizione        dal'
000240990616     A            V1CDTI         8Y 0B  7 31EDTCDE(8)
000250990616     A  11                                  DSPATR(PC)
000260990616     A                                  7 43'al'
000270990616     A            V1CDTF         8Y 0B  7 48EDTCDE(8)
000280990616     A  12                                  DSPATR(PC)
000290990616     A                                  9  3'Codici cliente .......(?):'
000300990616     A            V1CKS0         7A  B  9 31
000310990616     A  01                                  DSPATR(PC)
000320990616     A            V1CKS1         7A  B 10 31
000330990616     A  02                                  DSPATR(PC)
000340990616     A            V1CKS6         7A  B 15 31
000350990616     A  07                                  DSPATR(PC)
000360990616     A            V1CKS7         7A  B 16 31
000370990616     A  08                                  DSPATR(PC)
000380990616     A            V1CKS2         7A  B 11 31
000390990616     A  03                                  DSPATR(PC)
000400990616     A            V1CKS3         7A  B 12 31
000410990616     A  04                                  DSPATR(PC)
000420990616     A            V1CKS4         7A  B 13 31
000430990616     A  05                                  DSPATR(PC)
000440990616     A            V1CKS5         7A  B 14 31
000450990616     A  06                                  DSPATR(PC)
000460990616     A            V1CKS8         7A  B 17 31
000470990616     A  09                                  DSPATR(PC)
000480990616     A            V1CKS9         7A  B 18 31
000490990616     A  10                                  DSPATR(PC)
000500990616     A                                 24  2'F3=fine'
000510990616     A                                 24 13'F6=Conferma'
000520990616     A            V1DKS0        20A  B  9 41DSPATR(PR)
000530990616     A            V1DKS1        20A  B 10 41DSPATR(PR)
000540990616     A            V1DKS2        20A  B 11 41DSPATR(PR)
000550990616     A            V1DKS3        20A  B 12 41DSPATR(PR)
000560990616     A            V1DKS4        20A  B 13 41DSPATR(PR)
000570990616     A            V1DKS5        20A  B 14 41DSPATR(PR)
000580990616     A            V1DKS6        20A  B 15 41DSPATR(PR)
000590990616     A            V1DKS7        20A  B 16 41DSPATR(PR)
000600990616     A            V1DKS8        20A  B 17 41DSPATR(PR)
000610990616     A            V1DKS9        20A  B 18 41DSPATR(PR)
