000010970828     A*%%TS  SD  19970828  091138  EDPRN       REL-V3R6M0  5716-PW1
000020000000     A*------------------------------------------------------------------------*
000030970828     A*%%EC
000040970828     A                                      DSPSIZ(24 80 *DS3)
000050970828     A                                      CHGINPDFT(HI CS)
000060970828     A                                      PRINT
000070970828     A                                      CF01
000080970828     A                                      CF02
000090970828     A                                      CF03
000100970828     A                                      CF04
000110970828     A                                      CF05
000120970828     A                                      CF06
000130970828     A                                      CF07
000140970828     A                                      CF08
000150970828     A                                      CF09
000160970828     A                                      CF10
000170970828     A                                      CF11
000180970828     A                                      CF12
000190970828     A                                      CF13
000200970828     A                                      CF14
000210970828     A                                      CF15
000220970828     A                                      CF16
000230970828     A                                      CF17
000240970828     A                                      CF18
000250970828     A                                      CF19
000260970828     A                                      CF20
000270970828     A                                      CF21
000280970828     A                                      CF22
000290970828     A                                      CF23
000300970828     A                                      CF24
000310970828     A                                      HELP
000320000000     A*------------------------------------------------------------------------*
000330000000     A* TESTATA
000340000000     A*------------------------------------------------------------------------*
000350950626     A          R SS30D01
000360950626     A            DSFIRS        20A  O  1  2
000370950627     A                                  1 27'** STATISTICA  AFFIDABILITA'' **'
000380950626     A                                      DSPATR(RI)
000390950626     A                                      DSPATR(UL)
000400950626     A                                  1 62'TNSS30R'
000410950626     A                                  1 72DATE
000420950626     A                                      EDTCDE(Y)
000430950626     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000440950626     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000450950626     A                                  2 72TIME
000460000000     A*------------------------------------------------------------------------*
000470000000     A* FUNZIONI
000480000000     A*------------------------------------------------------------------------*
000490000000     A          R SS30D02
000500000000     A                                      OVERLAY
000510000000     A            FUN001        19A  O 22  2
000520000000     A            FUN002        19A  O 22 22
000530000000     A            FUN003        19A  O 22 42
000540000000     A            FUN004        19A  O 22 62
000550000000     A            FUN005        19A  O 23  2
000560000000     A            FUN006        19A  O 23 22
000570000000     A            FUN007        19A  O 23 42
000580000000     A            FUN008        19A  O 23 62
000590000000     A*------------------------------------------------------------------------*
000600000000     A* PARAMETRI
000610000000     A*------------------------------------------------------------------------*
000620970828     A          R SS30D03
000630970828     A*%%TS  SD  19970828  091138  EDPRN       REL-V3R6M0  5716-PW1
000640970828     A                                      OVERLAY
000650970828     A                                  3 37'LANCIO'
000660970828     A                                      DSPATR(HI)
000670970828     A                                  4  2'Tipo lancio ............:'
000680970828     A            VIDTLA         1A  B  4 28
000690970828     A  69                                  DSPATR(RI)
000700970828     A  69                                  DSPATR(PC)
000710970828     A                                  4 33'(S=per Saldi, E=Estemporaneo)'
000720970828     A                                  5  2'File da rigenerare .....:'
000730970828     A            VIDSNR         1A  B  5 28
000740970828     A  77                                  DSPATR(RI)
000750970828     A  77                                  DSPATR(PC)
000760970828     A                                  5 33'(S/N)'
000770970828     A                                  6  2'Creazione file PC ......:'
000780970828     A            VIDCFP         1A  B  6 28
000790970828     A  89                                  DSPATR(RI)
000800970828     A  89                                  DSPATR(PC)
000810970828     A                                  6 33'(S/N)'
000820970828     A                                  8  2'LANCIO PER SALDI'
000830970828     A                                      DSPATR(HI)
000840970828     A                                  8 43'LANCIO ESTEMPORANEO'
000850970828     A                                      DSPATR(HI)
000860970828     A                                  9  2'Anno ...................:'
000870970828     A            VIDANN         4Y 0B  9 28EDTCDE(Z)
000880970828     A  70                                  DSPATR(RI)
000890970828     A  70                                  DSPATR(PC)
000900970828     A                                  9 43'Dalla data .............:'
000910970828     A            VIDDTI         8Y 0B  9 71EDTWRD('  /  /    ')
000920970828     A  84                                  DSPATR(RI)
000930970828     A  84                                  DSPATR(PC)
000940970828     A                                 10  2'Mese iniziale/finale ...:'
000950970828     A            VIDMMI         2Y 0B 10 28EDTCDE(Z)
000960970828     A  71                                  DSPATR(RI)
000970970828     A  71                                  DSPATR(PC)
000980970828     A                                 10 31'/'
000990970828     A            VIDMMF         2Y 0B 10 33EDTCDE(Z)
001000970828     A  72                                  DSPATR(RI)
001010970828     A  72                                  DSPATR(PC)
001020970828     A                                 10 43'Alla  data .............:'
001030970828     A            VIDDTF         8Y 0B 10 71EDTWRD('  /  /    ')
001040970828     A  85                                  DSPATR(RI)
001050970828     A  85                                  DSPATR(PC)
001060970828     A                                 11 36'SELEZIONI'
001070970828     A                                      DSPATR(HI)
001080970828     A                                 12  2'Affidabilità cliente ...:'
001090970828     A            VIDSNC         1A  B 12 28
001100970828     A  73                                  DSPATR(RI)
001110970828     A  73                                  DSPATR(PC)
001120970828     A                                 12 33'(S/N)'
001130970828     A                                 12 43'Sintetica / Dettaglio ..:'
001140970828     A            VIDSDC         1A  B 12 71
001150970828     A  74                                  DSPATR(RI)
001160970828     A  74                                  DSPATR(PC)
001170970828     A                                 12 74'(S/D)'
001180970828     A                                 13  2'Affidabilità consegna ..:'
001190970828     A            VIDSNA         1A  B 13 28
001200970828     A  75                                  DSPATR(RI)
001210970828     A  75                                  DSPATR(PC)
001220970828     A                                 13 33'(S/N)'
001230970828     A                                 13 43'Sintetica / Dettaglio ..:'
001240970828     A            VIDSDA         1A  B 13 71
001250970828     A  76                                  DSPATR(RI)
001260970828     A  76                                  DSPATR(PC)
001270970828     A                                 13 74'(S/D)'
001280970828     A                                 14  2'Affidabilità partenza ..:'
001290970828     A            VIDSNP         1A  B 14 28
001300970828     A  86                                  DSPATR(RI)
001310970828     A  86                                  DSPATR(PC)
001320970828     A                                 14 33'(S/N)'
001330970828     A                                 16  2'Dati in statistica .....:'
001340970828     A            VIDIOE         1A  B 16 28
001350970828     A  88                                  DSPATR(RI)
001360970828     A  88                                  DSPATR(PC)
001370970828     A                                 16 33'(I=Ita, M=Imp, X=Exp, '' ''=Tutti -
001380970828     A                                      i dati insieme)'
001390970828     A                                 17  2'Stampa tot Area/Dis/Gen :'
001400970828     A            VIDTOT         1A  B 17 28
001410970828     A  87                                  DSPATR(RI)
001420970828     A  87                                  DSPATR(PC)
001430970828     A                                 17 33'(S/N *Solo se in dettaglio)'
001440970828     A                                 18  2'Solo divisione ....... ?:'
001450970828     A            VIDDIV         1A  B 18 28
001460970828     A  78                                  DSPATR(RI)
001470970828     A  78                                  DSPATR(PC)
001480970828     A            VDDDIV        10A  O 18 32
001490970828     A                                 18 43'Solo area .......... ?:'
001500970828     A            VIDARE         3A  B 18 67
001510970828     A  79                                  DSPATR(RI)
001520970828     A  79                                  DSPATR(PC)
001530970828     A            VDDARE        10A  O 18 71
001540970828     A                                 19  2'Solo P.O. partenza ... ?:'
001550970828     A            VIDFLP         3A  B 19 28
001560970828     A  80                                  DSPATR(RI)
001570970828     A  80                                  DSPATR(PC)
001580970828     A            VDDFLP        10A  O 19 32
001590970828     A                                 19 43'Solo P.O. arrivo ... ?:'
001600970828     A            VIDFLA         3A  B 19 67
001610970828     A  82                                  DSPATR(RI)
001620970828     A  82                                  DSPATR(PC)
001630970828     A            VDDFLA        10A  O 19 71
001640970828     A                                 20  2'Solo terminal partenza ?:'
001650970828     A            VIDTFP         3A  B 20 28
001660970828     A  81                                  DSPATR(RI)
001670970828     A  81                                  DSPATR(PC)
001680970828     A            VDDTFP        10A  O 20 32
001690970828     A                                 20 43'Solo terminal arrivo ?:'
001700970828     A            VIDTFA         3A  B 20 67
001710970828     A  83                                  DSPATR(RI)
001720970828     A  83                                  DSPATR(PC)
001730970828     A            VDDTFA        10A  O 20 71
001740000000     A*------------------------------------------------------------------------*
001750000000     A* SUBFILE MESSAGGI
001760000000     A*------------------------------------------------------------------------*
001770000000     A          R SS30DMS                   SFL
001780000000     A                                      SFLMSGRCD(24)
001790000000     A            MSGKEY                    SFLMSGKEY
001800000000     A            MSGQUE                    SFLPGMQ
001810000000     A*------------------------------------------------------------------------*
001820000000     A* SUBFILE CONTROL MESSAGGI
001830000000     A*------------------------------------------------------------------------*
001840000000     A          R SS30DMC                   SFLCTL(SS30DMS)
001850000000     A                                      OVERLAY
001860000000     A                                      SFLDSP
001870000000     A  40                                  SFLCLR
001880000000     A                                      SFLSIZ(0002)
001890000000     A                                      SFLPAG(0001)
