000100151022      */*PRM devtype(*SCS) pagesize(66 198 *rowcol) lpi(6) cpi(15)
000200140115      */*PRM ovrflw(62) usrdta('StatPckLst')
000300140115      */*END
000400140115      *---------------------------------------------------------------*
000500140115      *?TNSS09P - STATISTICA PACKING-LIST                            ?*
000600140115      *---------------------------------------------------------------*
000700140115     A                                      INDARA
000800140116     A                                      REF(GAITRAAZP/WFPDL00F)
000900140115      *---------------------------------------------------------------*
001000140115     A          R SS09TX1                   TEXT('TESTATA')
001100140115      *
001200140115     A                                      SKIPB(002)
001300140115      *
001400140115     A            RSUT      R              1REFFLD(RSUT       DDATIUTE)
001500140122     A                                   +20'STATISTICA PACKING-LIST'
001600140115     A                                      HIGHLIGHT
001700140122     A                                    70'Spedizioni dal'
001800140122     A            T1CDSI    R            + 1REFFLD(WPDDTI)
001900140122     A                                      EDTWRD('  /  /    ')
002000140122     A                                   + 1'al'
002100140122     A            T1CDSF    R            + 1REFFLD(WPDDTF)
002200140122     A                                      EDTWRD('  /  /    ')
002300140122     A            T1CPGM    R            130REFFLD($PGM       CNDIZION)
002400140115     A            T1CDTA    R            +10REFFLD($DA8       CNDIZION)
002500140115     A                                      EDTWRD('  /  /    ')
002600140122     A                                   165
002700140115     A                                      'Pag.'
002800140120     A                                   + 0
002900140115     A                                      PAGNBR
003000140115     A                                      EDTCDE(Z)
003100140115      *
003200140115     A            KNSIF     R              1REFFLD(KNSIF      KPJBA)
003300140115     A                                      SPACEB(001)
003400140122     A                                   +30'                       '
003500140122     A            T1PARZ        55        70
003600140122     A            KNMUS     R            130REFFLD(KNMUS      KPJBA)
003700140120     A            T1CORA    R            +10REFFLD($HMD       CNDIZION)
003800140115     A                                      EDTWRD('  :  :  ')
003900140116      *---------------------------------------------------------------*
004000140122     A*//       R SS09TX2                   TEXT('TESTATA')
004100140116      *
004200140122     A*//                                   SPACEB(001)
004300140116      *
004400140122     A*//         T1PARZ        55        70
004500140115      *---------------------------------------------------------------*
004600140121     A*//       R SS09TX3                   TEXT('TESTATA DISTRETTO/+
004700140121     A*//                                                 AREA/+
004800140121     A*//                                                 FILIALE/+
004900140121     A*//                                                 COMM.LE UNIF')
005000140115      *
005100140121     A*//                                   SPACEB(002)
005200140115      *
005300140121     A*//                                  1'Distretto'
005400140121     A*/31                                  HIGHLIGHT
005500140121     A*//         PDISCOD   R            + 1REFFLD(WPDCDI)
005600140121     A*/31                                  HIGHLIGHT
005700140121     A*//         PDISDES   R            + 1REFFLD(§17DES     DS17)
005800140121     A*/31                                  HIGHLIGHT
005900140115      *
006000140121     A*//                                + 1'Area'
006100140121     A*/32                                  HIGHLIGHT
006200140121     A*//         PARECOD   R            + 1REFFLD(WPDCAR)
006300140121     A*/32                                  HIGHLIGHT
006400140121     A*//         PAREDES   R            + 1REFFLD(§05DES     DS05)
006500140121     A*/32                                  HIGHLIGHT
006600140115      *
006700140121     A*//                                + 1'Filiale'
006800140121     A*/33                                  HIGHLIGHT
006900140121     A*//         PFILCOD   R            + 1REFFLD(WPDFIL)
007000140121     A*/33                                  HIGHLIGHT
007100140121     A*//         PFILDES   R            + 1REFFLD(ORGDES     AZORG00F)
007200140121     A*/33                                  HIGHLIGHT
007300140115      *
007400140121     A*//                                + 1'Commerciale unificante:'
007500140121     A*/34                                  HIGHLIGHT
007600140121     A*//         PCMUCOD   R            + 1REFFLD(WPDCMU)
007700140121     A*/34                                  HIGHLIGHT
007800140121     A*//         PCMUDES   R            + 1REFFLD(CMMDES     AZCMM00F)
007900140121     A*/34                                  HIGHLIGHT
008000140121      *---------------------------------------------------------------*
008100140121     A          R SS09TX3                   TEXT('TESTATA COMM.LE UNIF')
008200140121      *
008300140121     A                                      SPACEB(002)
008400140121      *
008500140121     A                                     1'Commerciale unificante:'
008600140121     A                                      HIGHLIGHT
008700140121     A            PCMUCOD   R            + 1REFFLD(WPDCMU)
008800140121     A                                      HIGHLIGHT
008900140121     A            PCMUDES   R            + 1REFFLD(CMMDES     AZCMM00F)
009000140121     A                                      HIGHLIGHT
009100140115      *---------------------------------------------------------------*
009200140116     A          R SS09TX4                   TEXT('TESTATA X DETTAGLIO')
009300140115      *
009400140117     A                                      SPACEB(002)
009500140115      *
009600140116     A                                     1'          '
009700140115     A*//                                   HIGHLIGHT
009800140115     A                                   + 1'                         -
009900140115     A                                                '
010000140115     A*//                                   HIGHLIGHT
010100140121     A*//                                + 1' Tipo '
010200140121     A*//                                   HIGHLIGHT
010300140121     A                                   + 2'Packing-List'
010400140115     A                                      HIGHLIGHT
010500140121     A                                   + 2'Packing-List'
010600140115     A                                      HIGHLIGHT
010700140121     A                                   + 2'Packing-List'
010800140115     A                                      HIGHLIGHT
010900140121     A                                   + 2'Packing-List'
011000140115     A                                      HIGHLIGHT
011100140121     A                                   + 2'Packing-List'
011200140115     A                                      HIGHLIGHT
011300140121     A                                   + 2'Packing-List'
011400140115     A                                      HIGHLIGHT
011500140121     A                                   + 2' Totale pag.'
011600140115     A                                      HIGHLIGHT
011700151022     A                                   + 2' Totale pag.'
011800151022     A                                      HIGHLIGHT
011900140121     A                                   + 2' Spediz. con'
012000140115     A                                      HIGHLIGHT
012100140121     A                                   + 2'  Totale PDF'
012200140115     A                                      HIGHLIGHT
012300140115      *
012400140116     A                                     1'Cliente   '
012500140115     A                                      HIGHLIGHT
012600140115     A                                      SPACEB(001)
012700140115     A                                   + 1'                         -
012800140115     A                                                '
012900140115     A                                      HIGHLIGHT
013000140121     A*//                                + 1'Modulo'
013100140121     A*//                                   HIGHLIGHT
013200140121     A                                   + 2'   di 1 pag.'
013300140115     A                                      HIGHLIGHT
013400140121     A                                   + 2'   di 2 pag.'
013500140115     A                                      HIGHLIGHT
013600140121     A                                   + 2'   di 3 pag.'
013700140115     A                                      HIGHLIGHT
013800140121     A                                   + 2'   di 4 pag.'
013900140115     A                                      HIGHLIGHT
014000140121     A                                   + 2'   di 5 pag.'
014100140115     A                                      HIGHLIGHT
014200140121     A                                   + 2'di oltre 5p.'
014300140115     A                                      HIGHLIGHT
014400140121     A                                   + 2'Pck-Lst +5p.'
014500140115     A                                      HIGHLIGHT
014600151022     A                                   + 2'Packing-List'
014700151022     A                                      HIGHLIGHT
014800140121     A                                   + 2'almeno 1 PDF'
014900140115     A                                      HIGHLIGHT
015000140121     A                                   + 2'    allegati'
015100140115     A                                      HIGHLIGHT
015200140115      *
015300140116     A                                     1'=========='
015400140115     A                                      HIGHLIGHT
015500140115     A                                      SPACEB(001)
015600140115     A                                   + 1'=========================-
015700140115     A                                      =========='
015800140115     A                                      HIGHLIGHT
015900140121     A*//                                + 1'======'
016000140121     A*//                                   HIGHLIGHT
016100140121     A                                   + 2'============'
016200140115     A                                      HIGHLIGHT
016300140121     A                                   + 2'============'
016400140115     A                                      HIGHLIGHT
016500140121     A                                   + 2'============'
016600140115     A                                      HIGHLIGHT
016700140121     A                                   + 2'============'
016800140115     A                                      HIGHLIGHT
016900140121     A                                   + 2'============'
017000140115     A                                      HIGHLIGHT
017100140121     A                                   + 2'============'
017200140115     A                                      HIGHLIGHT
017300140121     A                                   + 2'============'
017400140115     A                                      HIGHLIGHT
017500151022     A                                   + 2'============'
017600151022     A                                      HIGHLIGHT
017700140121     A                                   + 2'============'
017800140115     A                                      HIGHLIGHT
017900140121     A                                   + 2'============'
018000140115     A                                      HIGHLIGHT
018100140116      *---------------------------------------------------------------*
018200140116     A          R SS09KSU                   TEXT('CLIENTE UNIFICANTE')
018300140116      *
018400140117     A                                      SPACEB(002)
018500140116      *
018600140116     A            UPDKSU    R              1REFFLD(WPDKSU)
018700140116     A                                      HIGHLIGHT
018800140116     A            UPDRSU    R            + 1REFFLD(WPDRSU)
018900140116     A                                      HIGHLIGHT
019000140121     A            UPDN1P    R    9  0    + 5REFFLD(WPDN1P)
019100140116     A                                      EDTCDE(2)
019200140121     A            UPDN2P    R    9  0    + 3REFFLD(WPDN2P)
019300140116     A                                      EDTCDE(2)
019400140121     A            UPDN3P    R    9  0    + 3REFFLD(WPDN3P)
019500140116     A                                      EDTCDE(2)
019600140121     A            UPDN4P    R    9  0    + 3REFFLD(WPDN4P)
019700140116     A                                      EDTCDE(2)
019800140121     A            UPDN5P    R    9  0    + 3REFFLD(WPDN5P)
019900140116     A                                      EDTCDE(2)
020000140121     A            UPDNOP    R    9  0    + 3REFFLD(WPDNOP)
020100140116     A                                      EDTCDE(2)
020200140121     A            UPDPO5    R            + 3REFFLD(WPDPO5)
020300140116     A                                      EDTCDE(2)
020400151022     A            UPDNTOTP  R    9  0    + 3REFFLD(WPDN1P)
020500151022     A                                      EDTCDE(2)
020600140121     A            UPDPDFSP  R    9  0    + 3REFFLD(WPDPDFSP)
020700140116     A                                      EDTCDE(2)
020800140121     A            UPDPDFNR  R    9  0    + 3REFFLD(WPDPDFNR)
020900140116     A                                      EDTCDE(2)
021000140115      *---------------------------------------------------------------*
021100140116     A          R SS09KSC                   TEXT('DETTAGLIO CLIENTI')
021200140115      *
021300140115     A                                      SPACEB(001)
021400140115      *
021500140116     A            WPDKSC    R              4
021600140116     A            WPDRSM    R            + 1
021700140121     A*//         WPDTMD    R            + 2
021800140116     A            CPDN1P    R    9  0    + 2REFFLD(WPDN1P)
021900140115     A                                      EDTCDE(2)
022000140121     A            CPDN2P    R    9  0    + 3REFFLD(WPDN2P)
022100140116     A                                      EDTCDE(2)
022200140121     A            CPDN3P    R    9  0    + 3REFFLD(WPDN3P)
022300140115     A                                      EDTCDE(2)
022400140121     A            CPDN4P    R    9  0    + 3REFFLD(WPDN4P)
022500140115     A                                      EDTCDE(2)
022600140121     A            CPDN5P    R    9  0    + 3REFFLD(WPDN5P)
022700140115     A                                      EDTCDE(2)
022800140121     A            CPDNOP    R    9  0    + 3REFFLD(WPDNOP)
022900140115     A                                      EDTCDE(2)
023000140121     A            CPDPO5    R            + 3REFFLD(WPDPO5)
023100140115     A                                      EDTCDE(2)
023200151022     A            CPDNTOTP  R    9  0    + 3REFFLD(WPDN1P)
023300151022     A                                      EDTCDE(2)
023400140121     A            CPDPDFSP  R    9  0    + 3REFFLD(WPDPDFSP)
023500140115     A                                      EDTCDE(2)
023600140121     A            CPDPDFNR  R    9  0    + 3REFFLD(WPDPDFNR)
023700140115     A                                      EDTCDE(2)
023800140116      *---------------------------------------------------------------*
023900140116     A          R SS09TOT                   TEXT('TOTALE GENERALE')
024000140116      *
024100140117     A                                      SPACEB(003)
024200140116      *
024300151104     A                                     1'T O T A L E   +
024400151104     A                                       G E N E R A L E'
024500140116     A                                      HIGHLIGHT
024600140121     A            TPDN1P    R    9  0     49REFFLD(WPDN1P)
024700140116     A                                      EDTCDE(2)
024800140117     A                                      HIGHLIGHT
024900140121     A            TPDN2P    R    9  0    + 3REFFLD(WPDN2P)
025000140116     A                                      EDTCDE(2)
025100140117     A                                      HIGHLIGHT
025200140121     A            TPDN3P    R    9  0    + 3REFFLD(WPDN3P)
025300140116     A                                      EDTCDE(2)
025400140117     A                                      HIGHLIGHT
025500140121     A            TPDN4P    R    9  0    + 3REFFLD(WPDN4P)
025600140116     A                                      EDTCDE(2)
025700140117     A                                      HIGHLIGHT
025800140121     A            TPDN5P    R    9  0    + 3REFFLD(WPDN5P)
025900140116     A                                      EDTCDE(2)
026000140117     A                                      HIGHLIGHT
026100140121     A            TPDNOP    R    9  0    + 3REFFLD(WPDNOP)
026200140116     A                                      EDTCDE(2)
026300140117     A                                      HIGHLIGHT
026400140121     A            TPDPO5    R            + 3REFFLD(WPDPO5)
026500140116     A                                      EDTCDE(2)
026600140117     A                                      HIGHLIGHT
026700151022     A            TPDNTOTP  R    9  0    + 3REFFLD(WPDN1P)
026800151022     A                                      EDTCDE(2)
026900151022     A                                      HIGHLIGHT
027000140121     A            TPDPDFSP  R    9  0    + 3REFFLD(WPDPDFSP)
027100140116     A                                      EDTCDE(2)
027200140117     A                                      HIGHLIGHT
027300140121     A            TPDPDFNR  R    9  0    + 3REFFLD(WPDPDFNR)
027400140116     A                                      EDTCDE(2)
027500140117     A                                      HIGHLIGHT
027600151022      *
027700151103     A                                     1'M E D I A   +
027800151103     A                                       G I O R N A L I E R A'
027900151022     A                                      SPACEB(002)
028000151022     A                                      HIGHLIGHT
028100151022     A            MPDN1P    R    9  0     49REFFLD(WPDN1P)
028200151022     A                                      EDTCDE(2)
028300151022     A                                      HIGHLIGHT
028400151022     A            MPDN2P    R    9  0    + 3REFFLD(WPDN2P)
028500151022     A                                      EDTCDE(2)
028600151022     A                                      HIGHLIGHT
028700151022     A            MPDN3P    R    9  0    + 3REFFLD(WPDN3P)
028800151022     A                                      EDTCDE(2)
028900151022     A                                      HIGHLIGHT
029000151022     A            MPDN4P    R    9  0    + 3REFFLD(WPDN4P)
029100151022     A                                      EDTCDE(2)
029200151022     A                                      HIGHLIGHT
029300151022     A            MPDN5P    R    9  0    + 3REFFLD(WPDN5P)
029400151022     A                                      EDTCDE(2)
029500151022     A                                      HIGHLIGHT
029600151022     A            MPDNOP    R    9  0    + 3REFFLD(WPDNOP)
029700151022     A                                      EDTCDE(2)
029800151022     A                                      HIGHLIGHT
029900151022     A            MPDPO5    R            + 3REFFLD(WPDPO5)
030000151022     A                                      EDTCDE(2)
030100151022     A                                      HIGHLIGHT
030200151022     A            MPDNTOTP  R    9  0    + 3REFFLD(WPDN1P)
030300151022     A                                      EDTCDE(2)
030400151022     A                                      HIGHLIGHT
030500151022     A            MPDPDFSP  R    9  0    + 3REFFLD(WPDPDFSP)
030600151022     A                                      EDTCDE(2)
030700151022     A                                      HIGHLIGHT
030800151022     A            MPDPDFNR  R    9  0    + 3REFFLD(WPDPDFNR)
030900151022     A                                      EDTCDE(2)
031000151022     A                                      HIGHLIGHT
