000100110114      */*PRM mbr(*none) size(1 0 0)
000200110114      */*END
000300110114      *---------------------------------------------------------------*
000400110114      *?PARAMETRI PER STATISTICA ANOMALIE IMPIANTI SMISTACOLLI       ?*
000500110114      *---------------------------------------------------------------*
000600110118     A                                      REF(DMVIPARMS)
000700110114      *
000800110114     A          R D04REC                    TEXT('PARAMETRI X STAT. AN-
000900110114     A                                      OMALIE IMPIANTI SMISTACOLL-
001000110114     A                                      I')
001100110114      *
001200110118     A            D04PRC1   R               REFFLD(§MVIPRC1)
001300110118     A            D04PRC2   R               REFFLD(§MVIPRC2)
001400110118     A            D04MIN2   R               REFFLD(§MVIMIN2)
