000010110401     A*%%TS  SD  20110401  110129  EDPRM       REL-V6R1M0  5761-WDS
000020000000     A*------------------------------------------------------------------------*
000030110401     A*%%EC
000040110401     A                                      DSPSIZ(24 80 *DS3)
000050110401     A                                      CHGINPDFT(HI CS)
000060110401     A                                      PRINT
000070110401     A                                      CF01
000080110401     A                                      CF02
000090110401     A                                      CF03
000100110401     A                                      CF04
000110110401     A                                      CF05
000120110401     A                                      CF06
000130110401     A                                      CF07
000140110401     A                                      CF08
000150110401     A                                      CF09
000160110401     A                                      CF10
000170110401     A                                      CF11
000180110401     A                                      CF12
000190110401     A                                      CF13
000200110401     A                                      CF14
000210110401     A                                      CF15
000220110401     A                                      CF16
000230110401     A                                      CF17
000240110401     A                                      CF18
000250110401     A                                      CF19
000260110401     A                                      CF20
000270110401     A                                      CF21
000280110401     A                                      CF22
000290110401     A                                      CF23
000300110401     A                                      CF24
000310110401     A                                      ROLLUP(97)
000320110401     A                                      ROLLDOWN(97)
000330110401     A                                      HELP
000340000000     A*------------------------------------------------------------------------*
000350000000     A          R SS20DVT
000360000000     A*%%TS  SD  19960312  113534  EDPRN       REL-V3R1M0  5763-PW1
000370020717     A            RSUT          20A  O  1  2
000380000000     A                                  1 29'** STATISTICA CLIENTI VAS **'
000390000000     A                                      DSPATR(RI)
000400000000     A                                      DSPATR(UL)
000410000000     A                                  1 62'TNSS20R'
000420000000     A                                  1 72DATE
000430000000     A                                      EDTCDE(Y)
000440000000     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000450000000     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000460000000     A                                  2 72TIME
000470000000     A*------------------------------------------------------------------------*
000480000000     A          R SS20DVF
000490000000     A                                      OVERLAY
000500000000     A            VFD001        19A  O 22  2
000510000000     A            VFD002        19A  O 22 22
000520000000     A            VFD003        19A  O 22 42
000530000000     A            VFD004        19A  O 22 62
000540000000     A            VFD005        19A  O 23  2
000550000000     A            VFD006        19A  O 23 22
000560000000     A            VFD007        19A  O 23 42
000570000000     A            VFD008        19A  O 23 62
000580000000     A*------------------------------------------------------------------------*
000590110401     A          R SS20DV1
000600110401     A*%%TS  SD  20110401  110129  EDPRM       REL-V6R1M0  5761-WDS
000610110401     A                                      OVERLAY
000620110401     A                                  4  2'LANCIO'
000630110401     A                                      DSPATR(HI)
000640110401     A                                  5  2'Data inizio .............:'
000650110401     A            V1CDTI         8Y 0B  5 29EDTCDE(8)
000660110401     A N60                                  DSPATR(HI)
000670110401     A  60                                  DSPATR(RI)
000680110401     A  60                                  DSPATR(PC)
000690110401     A                                      CHECK(RB)
000700110401     A                                  5 40'(gg/mm/anno)'
000710110401     A                                  6  2'Data fine ...............:'
000720110401     A            V1CDTF         8Y 0B  6 29EDTCDE(8)
000730110401     A N61                                  DSPATR(HI)
000740110401     A  61                                  DSPATR(RI)
000750110401     A  61                                  DSPATR(PC)
000760110401     A                                      CHECK(RB)
000770110401     A                                  6 40'(gg/mm/anno)'
000780110401     A                                  7  2'N° minimo spedizioni/gg .:'
000790110401     A            V1CNBO         3Y 0B  7 29TEXT('N.bolle')
000800110401     A                                      EDTCDE(Z)
000810110401     A N62                                  DSPATR(HI)
000820110401     A  62                                  DSPATR(RI)
000830110401     A  62                                  DSPATR(PC)
000840110401     A                                      CHECK(RB)
000850110401     A                                  8  2'N° minimo colli/gg ......:'
000860110401     A            V1NCOL         3Y 0B  8 29TEXT('N.minimo colli/giorno')
000870110401     A                                      EDTCDE(Z)
000880110401     A N62                                  DSPATR(HI)
000890110401     A  62                                  DSPATR(RI)
000900110401     A  62                                  DSPATR(PC)
000910110401     A                                      CHECK(RB)
000920110401     A                                 10  2'SELEZIONI'
000930110401     A                                      DSPATR(HI)
000940110401     A                                 11  2'Parzializzazione ........:'
000950110401     A            V1PARZ         1A  B 11 29TEXT('Parzializzazione')
000960110401     A                                      VALUES('V' 'N' 'B' ' ')
000970110401     A                                 11 32'(V=solo VAS,B=solo VAS B,N=solo No-
000980110401     A                                       VAS,'' ''=Tutti)'
000990110401     A                                 12  2'Solo stampa .............:'
001000110401     A            V1STEL         1A  B 12 29TEXT('Rielaborazione/Solo stampa')
001010110401     A                                      VALUES('S' ' ')
001020110401     A                                 12 32'(S=solo stampa, '' ''=Rielabora)'
001030110401     A                                 15  2'Clienti con comodato ....:'
001040110401     A N14                                  DSPATR(ND)
001050110401     A            V1BCOM         1A  B 15 29
001060110401     A N14                                  DSPATR(ND)
001070110401     A N14                                  DSPATR(PR)
001080110401     A                                      VALUES('S' 'N')
001090110401     A                                 15 32'(S/N)'
001100110401     A N14                                  DSPATR(ND)
001110110401     A                                 14  2'Stampa solo:'
001120110401     A N14                                  DSPATR(ND)
001130000000     A*------------------------------------------------------------------------*
001140000000     A          R SS20DVM                   SFL
001150000000     A                                      SFLMSGRCD(24)
001160000000     A            VMCKEY                    SFLMSGKEY
001170000000     A            VMCQUE                    SFLPGMQ
001180000000     A*------------------------------------------------------------------------*
001190000000     A          R SS20DVK                   SFLCTL(SS20DVM)
001200000000     A                                      OVERLAY
001210000000     A                                      SFLDSP
001220000000     A  40                                  SFLCLR
001230000000     A  44                                  SFLEND
001240000000     A                                      SFLSIZ(0002)
001250000000     A                                      SFLPAG(0001)
