000100010627     A*%%TS  SD  20010627  121243  EDPX1       REL-V4R4M0  5769-PW1
000200000000     A*------------------------------------------------------------------------*
000300010627     A*%%EC
000400010627     A                                      DSPSIZ(24 80 *DS3)
000500010627     A                                      CHGINPDFT(HI CS)
000600010627     A                                      PRINT
000700010627     A                                      CF01
000800010627     A                                      CF02
000900010627     A                                      CF03
001000010627     A                                      CF04
001100010627     A                                      CF05
001200010627     A                                      CF06
001300010627     A                                      CF07
001400010627     A                                      CF08
001500010627     A                                      CF09
001600010627     A                                      CF10
001700010627     A                                      CF11
001800010627     A                                      CF12
001900010627     A                                      CF13
002000010627     A                                      CF14
002100010627     A                                      CF15
002200010627     A                                      CF16
002300010627     A                                      CF17
002400010627     A                                      CF18
002500010627     A                                      CF19
002600010627     A                                      CF20
002700010627     A                                      CF21
002800010627     A                                      CF22
002900010627     A                                      CF23
003000010627     A                                      CF24
003100010627     A                                      ROLLUP(97)
003200010627     A                                      ROLLDOWN(97)
003300010627     A                                      HELP
003400000000     A*------------------------------------------------------------------------*
003500000000     A          R SS20DVT
003600000000     A*%%TS  SD  19960312  113534  EDPRN       REL-V3R1M0  5763-PW1
003700020717     A            RSUT          20A  O  1  2
003800000000     A                                  1 29'** STATISTICA CLIENTI VAS **'
003900000000     A                                      DSPATR(RI)
004000000000     A                                      DSPATR(UL)
004100000000     A                                  1 62'TNSS20R'
004200000000     A                                  1 72DATE
004300000000     A                                      EDTCDE(Y)
004400000000     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
004500000000     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
004600000000     A                                  2 72TIME
004700000000     A*------------------------------------------------------------------------*
004800000000     A          R SS20DVF
004900000000     A                                      OVERLAY
005000000000     A            VFD001        19A  O 22  2
005100000000     A            VFD002        19A  O 22 22
005200000000     A            VFD003        19A  O 22 42
005300000000     A            VFD004        19A  O 22 62
005400000000     A            VFD005        19A  O 23  2
005500000000     A            VFD006        19A  O 23 22
005600000000     A            VFD007        19A  O 23 42
005700000000     A            VFD008        19A  O 23 62
005800000000     A*------------------------------------------------------------------------*
005900010627     A          R SS20DV1
006000010627     A*%%TS  SD  20010627  121243  EDPX1       REL-V4R4M0  5769-PW1
006100010627     A                                      OVERLAY
006200010627     A                                  4  2'LANCIO'
006300010627     A                                      DSPATR(HI)
006400010627     A                                  5  2'Data inizio .............:'
006500010627     A            V1CDTI         8Y 0B  5 29EDTCDE(8)
006600010627     A N60                                  DSPATR(HI)
006700010627     A  60                                  DSPATR(RI)
006800010627     A  60                                  DSPATR(PC)
006900010627     A                                      CHECK(RB)
007000010627     A                                  5 40'(gg/mm/anno)'
007100010627     A                                  6  2'Data fine ...............:'
007200010627     A            V1CDTF         8Y 0B  6 29EDTCDE(8)
007300010627     A N61                                  DSPATR(HI)
007400010627     A  61                                  DSPATR(RI)
007500010627     A  61                                  DSPATR(PC)
007600010627     A                                      CHECK(RB)
007700010627     A                                  6 40'(gg/mm/anno)'
007800010627     A                                  7  2'N° minimo spedizioni/gg .:'
007900010627     A            V1CNBO         3Y 0B  7 29TEXT('N.bolle')
008000010627     A                                      EDTCDE(Z)
008100010627     A N62                                  DSPATR(HI)
008200010627     A  62                                  DSPATR(RI)
008300010627     A  62                                  DSPATR(PC)
008400010627     A                                      CHECK(RB)
008500010627     A                                  8  2'N° minimo colli/gg ......:'
008600010627     A            V1NCOL         3Y 0B  8 29TEXT('N.minimo colli/giorno')
008700010627     A                                      EDTCDE(Z)
008800010627     A N62                                  DSPATR(HI)
008900010627     A  62                                  DSPATR(RI)
009000010627     A  62                                  DSPATR(PC)
009100010627     A                                      CHECK(RB)
009200010627     A                                 10  2'SELEZIONI'
009300010627     A                                      DSPATR(HI)
009400010627     A                                 11  2'Parzializzazione ........:'
009500010627     A            V1PARZ         1A  B 11 29TEXT('Parzializzazione')
009600010627     A                                      VALUES('V' 'N' 'B' ' ')
009700010627     A                                 11 33'(V=solo VAS, B=solo VAS B, '' ''=T-
009800010627     A                                      utti)'
009900010627     A                                 12  2'Solo stampa .............:'
010000010627     A            V1STEL         1A  B 12 29TEXT('Rielaborazione/Solo stampa')
010100010627     A                                      VALUES('S' ' ')
010200010627     A                                 12 33'(S=solo stampa, '' ''=Rielabora)'
010300010627     A                                 13  2'Anche se solo Track&Trac.:'
010400010627     A            V1STRK         1A  B 13 29VALUES('S' 'N')
010500010627     A                                 13 33'(S/N)'
010600010627     A                                 14  2'Dati POSTE ..............:'
010700010627     A            V1SPOS         1A  B 14 29VALUES('S' 'N')
010800010627     A                                 14 33'(S/N)'
010900070626     A                                 17  2'Clienti con comodato ....:'
011000010627     A N14                                  DSPATR(ND)
011100010627     A            V1BCOM         1A  B 17 29
011200010627     A N14                                  DSPATR(ND)
011300010627     A N14                                  DSPATR(PR)
011400010627     A                                      VALUES('S' 'N')
011500010627     A                                 17 33'(S/N)'
011600010627     A N14                                  DSPATR(ND)
011700010627     A                                 16  2'Stampa solo:'
011800010627     A N14                                  DSPATR(ND)
011900000000     A*------------------------------------------------------------------------*
012000000000     A          R SS20DVM                   SFL
012100000000     A                                      SFLMSGRCD(24)
012200000000     A            VMCKEY                    SFLMSGKEY
012300000000     A            VMCQUE                    SFLPGMQ
012400000000     A*------------------------------------------------------------------------*
012500000000     A          R SS20DVK                   SFLCTL(SS20DVM)
012600000000     A                                      OVERLAY
012700000000     A                                      SFLDSP
012800000000     A  40                                  SFLCLR
012900000000     A  44                                  SFLEND
013000000000     A                                      SFLSIZ(0002)
013100000000     A                                      SFLPAG(0001)
