000100140725      *---------------------------------------------------------------*
000200140807      * ACQ. POT.: DATI RICEVUTI DA "CRIBIS" ELIMIMABILI              *
000300140725      *---------------------------------------------------------------*
000400140725     A                                      REF(CNDIZION)
000500140725      *
000600140807     A          R WFACPE00                  TEXT('WF ACQUISIZ.POTENZ.:-
000700140725     A                                       DATI DA CRIBIS')
000800140725      *
000900140725     A            WAPIDCRI      10S 0
001000140725     A                                      TEXT('ID CRIBIS')
001100140725     A                                      COLHDG('ID CRIBIS')
001200140725     A            WAPCPO    R     S         REFFLD($CPO)
001300140725     A                                      TEXT('ID BRT')
001400140725     A                                      COLHDG('ID BRT')
001500140725     A            WAPRAG    R               REFFLD($RAGSOC)
001600140728     A                                      TEXT('Ragione sociale BRT')
001700140728     A                                      COLHDG('Ragione sociale BRT')
001800140725     A            WAPCPI    R               REFFLD($CDIVA)
001900140725     A                                      TEXT('Partita Iva BRT')
002000140725     A                                      COLHDG('Partita Iva BRT')
002100140725     A            WAPCFI    R               REFFLD($CDFISCAL)
002200140725     A                                      TEXT('Codice Fiscale BRT')
002300140725     A                                      COLHDG('Codice Fiscale BRT')
002400140725     A            WAPIND    R               REFFLD($IND)
002500140725     A                                      TEXT('Indirizzo BRT')
002600140725     A                                      COLHDG('Indirizzo BRT')
002700140725     A            WAPLOC    R               REFFLD($LOC)
002800140725     A                                      TEXT('Località BRT')
002900140725     A                                      COLHDG('Località BRT')
003000140725     A            WAPCAP    R               REFFLD($CAD)
003100140725     A                                      TEXT('Cap BRT')
003200140725     A                                      COLHDG('Cap BRT')
003300140725     A            WAPPRV    R               REFFLD($PRO)
003400140725     A                                      TEXT('Provincia BRT')
003500140725     A                                      COLHDG('Prv' 'BRT')
003600140725     A            WAPPRVDES R               REFFLD(§PRDES     DSPR)
003700140728     A                                      TEXT('Provincia estesa BRT')
003800140725     A                                      COLHDG('Prov estesa BRT')
003900140725     A            WAPNAZ    R               REFFLD($NAZ)
004000140725     A                                      TEXT('Nazione BRT')
004100140725     A                                      COLHDG('Naz' 'BRT')
004200140725     A            WAPTEL    R               REFFLD($TELE)
004300140725     A                                      TEXT('Telefono BRT')
004400140725     A                                      COLHDG('Telefono BRT')
004500140725     A            WAPTIPIND R               REFFLD($FLA)
004600140725     A                                      TEXT('Tipo indirizzo BRT')
004700140725     A                                      COLHDG('Tipo' 'Ind.')
004800140725     A            WAPDUNS   R               REFFLD($DUNS)
004900140725     A                                      TEXT('DUNS BRT')
005000140725     A                                      COLHDG('DUNS BRT')
005100140729     A            WAPCRIF       15
005200140725     A                                      TEXT('Crif Number')
005300140725     A                                      COLHDG('Crif Number')
005400140725     A            WAPOOB    R               REFFLD($FLA)
005500140725     A                                      TEXT('OOB Indicator')
005600140725     A                                      COLHDG('OOB' 'Ind')
005700140725     A            WAPCMPVND R               REFFLD($FLA)
005800140725     A                                      TEXT('Compravendita')
005900140725     A                                      COLHDG('Compravendita')
006000140725     A            WAPCONF        2
006100140725     A                                      TEXT('Confidence code')
006200140725     A                                      COLHDG('Conf' 'Code')
006300140728     A            WAPSIMN        3S 0
006400140725     A                                      TEXT('Name similarity %')
006500140725     A                                      COLHDG('Name' 'Sim%')
006600140728     A            WAPSIMC        3S 0
006700140725     A                                      TEXT('City similarity %')
006800140725     A                                      COLHDG('City' 'Sim%')
006900140728     A            WAPSIMA        3S 0
007000140725     A                                      TEXT('Address similarity %')
007100140725     A                                      COLHDG('Addr' 'Sim%')
007200140728     A            WAPSIMP        3S 0
007300140725     A                                      TEXT('Province similarity %')
007400140725     A                                      COLHDG('Prov' 'Sim%')
007500140728     A            WAPMGRN        3S 0
007600140725     A                                      TEXT('Name Match Grade %')
007700140725     A                                      COLHDG('Name' 'MG %')
007800140728     A            WAPMGRC        3S 0
007900140725     A                                      TEXT('City Match Grade %')
008000140725     A                                      COLHDG('City' 'MG %')
008100140728     A            WAPMGRA        3S 0
008200140725     A                                      TEXT('Address Match Grade %')
008300140725     A                                      COLHDG('Addr' 'MG %')
008400140729     A            WAPMGRP        3S 0
008500140725     A                                      TEXT('Province Match Grade %')
008600140725     A                                      COLHDG('Prov' 'MG %')
008700140729     A            WAPDENO      255
008800140725     A                                      TEXT('Denominazione')
008900140725     A                                      COLHDG('Denominazione')
009000140729     A            WAPIND2      255
009100140725     A                                      TEXT('Indirizzo')
009200140725     A                                      COLHDG('Indirizzo')
009300140729     A            WAPLOC2       50
009400140725     A                                      TEXT('Comune')
009500140725     A                                      COLHDG('Comune')
009600140728     A            WAPCAP2   R     A         REFFLD($CAP)
009700140725     A                                      TEXT('Cap')
009800140725     A                                      COLHDG('Cap')
009900140725     A            WAPREG2   R   30          REFFLD(§14DES     DS14)
010000140725     A                                      TEXT('Regione')
010100140725     A                                      COLHDG('Regione')
010200140729     A            WAPFRA2       50
010300140725     A                                      TEXT('Frazione')
010400140725     A                                      COLHDG('Frazione')
010500140725     A            WAPPRV2   R               REFFLD($PRO)
010600140725     A                                      TEXT('Provincia')
010700140725     A                                      COLHDG('Prov')
010800140725     A            WAPPRVDE2     30
010900140725     A                                      TEXT('Provincia estesa')
011000140725     A                                      COLHDG('Provincia estesa')
011100140725     A            WAPCFI2   R   16          REFFLD($CDFISCAL)
011200140725     A                                      TEXT('Codice Fiscale')
011300140725     A                                      COLHDG('Codice Fiscale')
011400140725     A            WAPCPI2   R   11          REFFLD($CDIVA)
011500140725     A                                      TEXT('Partita Iva')
011600140725     A                                      COLHDG('Partita Iva')
011700140725     A            WAPTEL2       20
011800140725     A                                      TEXT('Telefono 1')
011900140725     A                                      COLHDG('Telefono 1')
012000140725     A            WAPFAX2       20
012100140725     A                                      TEXT('Fax 1')
012200140725     A                                      COLHDG('Fax 1')
012300140729     A            WAPSITO2     255
012400140725     A                                      TEXT('Sito Internet 1')
012500140725     A                                      COLHDG('Sito Internet 1')
012600140725     A            WAPECOM        1
012700140725     A                                      TEXT('Flag E-commerce')
012800140725     A                                      COLHDG(' E-' 'Com')
012900140725     A            WAPCAPSOC     15S 0
013000140725     A                                      TEXT('Capitale sociale Euro')
013100140725     A                                      COLHDG('Cap.Soc. Euro')
013200140725     A            WAPAAFON       4S 0
013300140725     A                                      TEXT('Anno Fondazione')
013400140725     A                                      COLHDG('Anno' 'Fond')
013500140801     A            WAPAACOS       4S 0
013600140801     A                                      TEXT('Anno Costituzione')
013700140801     A                                      COLHDG('Anno' 'Cost')
013800140728     A            WAPDTINI       8S 0
013900140728     A                                      TEXT('Data inizio attività')
014000140728     A                                      COLHDG('Dt Ini' 'Attività')
014100140725     A            WAPATECO      10
014200140725     A                                      TEXT('Ateco (2007)  1')
014300140725     A                                      COLHDG('Ateco' '(2007)')
014400140729     A            WAPATECODE   255
014500140725     A                                      TEXT('Descrizione codice ateco')
014600140725     A                                      COLHDG('Descrizione ateco')
014700140725     A            WAPSICP        5
014800140725     A                                      TEXT('Sic primario')
014900140725     A                                      COLHDG('Sic  ' 'primario')
015000140729     A            WAPSICPDES   255
015100140725     A                                      TEXT('Descrizione Sic')
015200140725     A                                      COLHDG('Descrizione Sic')
015300140725     A            WAPDIP        10S 0
015400140725     A                                      TEXT('Dipendenti')
015500140725     A                                      COLHDG('Dipendenti')
015600140729     A            WAPNATG      100
015700140725     A                                      TEXT('Natura giuridica')
015800140725     A                                      COLHDG('Natura giuridica')
015900140725     A            WAPCCIAA       2
016000140725     A                                      TEXT('CCIAA')
016100140725     A                                      COLHDG('CCIAA')
016200140725     A            WAPREA        10
016300140725     A                                      TEXT('REA')
016400140725     A                                      COLHDG('REA')
016500140729     A            WAPOGGSOC    255
016600140725     A                                      TEXT('Oggetto sociale')
016700140725     A                                      COLHDG('Oggetto sociale')
016800140725     A            WAPSTIMP      30
016900140725     A                                      TEXT('Stato Impresa Cribis')
017000140725     A                                      COLHDG('Stato Impresa Cribis')
017100140725     A            WAPFATT       15S 0
017200140725     A                                      TEXT('Fatturato Euro')
017300140725     A                                      COLHDG('Fatturato Euro')
017400140725     A            WAPAAFT        4S 0
017500140725     A                                      TEXT('Anno Fatturato')
017600140725     A                                      COLHDG('Anno Fatturato')
017700140725     A            WAPPVNFT       1
017800140725     A                                      TEXT('Provenienza Fatturato')
017900140725     A                                      COLHDG('Proven' ' Fatt.')
018000140725     A            WAPUTILE      15S 0
018100140725     A                                      TEXT('Utile/Perdita')
018200140725     A                                      COLHDG('Utile/Perdita')
018300140728     A            WAPPIMP        5S 2
018400140725     A                                      TEXT('% import')
018500140725     A                                      COLHDG('% import')
018600140728     A            WAPPEXP        5S 2
018700140725     A                                      TEXT('% export')
018800140725     A                                      COLHDG('% export')
018900140801     A            WAPCMCRIF     15
019000140801     A                                      TEXT('Crif Number casa madre')
019100140801     A                                      COLHDG('Crif Number' 'madre')
019200140729     A            WAPCMNOM     255
019300140725     A                                      TEXT('Nome casa madre')
019400140725     A                                      COLHDG('Nome casa madre')
019500140729     A            WAPCMIND     255
019600140725     A                                      TEXT('Indirizzo casa madre')
019700140725     A                                      COLHDG('Indirizzo casa madre')
019800140728     A            WAPCMCAP  R     A         REFFLD($CAP)
019900140725     A                                      TEXT('Cap casa madre')
020000140725     A                                      COLHDG(' Cap ' 'madre')
020100140729     A            WAPCMLOC      50
020200140725     A                                      TEXT('Città casa madre')
020300140725     A                                      COLHDG('Città casa madre')
020400140725     A            WAPCMPRV  R               REFFLD($PRO)
020500140725     A                                      TEXT('Provincia casa madre')
020600140725     A                                      COLHDG(' Prv ' 'madre')
020700140725     A            WAPCMNAZ  R               REFFLD($NAZ)
020800140725     A                                      TEXT('Nazione casa madre')
020900140725     A                                      COLHDG(' Naz ' 'madre')
021000140725     A            WAPFR4         1
021100140725     A                                      TEXT('FlagRating4')
021200140725     A                                      COLHDG('FlagRating4')
021300140728     A            WAPPIMPEX      5S 2
021400140725     A                                      TEXT('% impex')
021500140725     A                                      COLHDG('% impex')
021600140728     A            WAPAIMPEX      4S 0
021700140725     A                                      TEXT('anno %impex')
021800140725     A                                      COLHDG('anno %impex')
