000100140725      *---------------------------------------------------------------*
000200140725      * ACQUISIZIONE POTENZIALI: DATI RICEVUTI DA "CRIBIS"            *
000300140725      *---------------------------------------------------------------*
000400140725     A                                      REF(CNDIZION)
000500140725      *
000600140725     A          R WFACP000                  TEXT('WF ACQUISIZ.POTENZ.:-
000700140725     A                                       DATI DA CRIBIS')
000800140725      *
000900140725     A            WAPIDCRI      10S 0
001000140725     A                                      TEXT('ID CRIBIS')
001100140725     A                                      COLHDG('ID CRIBIS')
001200140725     A            WAPCPO    R     S         REFFLD($CPO)
001300140725     A                                      TEXT('ID BRT')
001400140725     A                                      COLHDG('ID BRT')
001500140725     A            WAPRAG    R               REFFLD($RAGSOC)
001600140728     A                                      TEXT('Ragione sociale BRT')
001700140728     A                                      COLHDG('Ragione sociale BRT')
001800140725     A            WAPCPI    R               REFFLD($CDIVA)
001900140725     A                                      TEXT('Partita Iva BRT')
002000140725     A                                      COLHDG('Partita Iva BRT')
002100140725     A            WAPCFI    R               REFFLD($CDFISCAL)
002200140725     A                                      TEXT('Codice Fiscale BRT')
002300140725     A                                      COLHDG('Codice Fiscale BRT')
002400140725     A            WAPIND    R               REFFLD($IND)
002500140725     A                                      TEXT('Indirizzo BRT')
002600140725     A                                      COLHDG('Indirizzo BRT')
002700140725     A            WAPLOC    R               REFFLD($LOC)
002800140725     A                                      TEXT('Località BRT')
002900140725     A                                      COLHDG('Località BRT')
003000140725     A            WAPCAP    R               REFFLD($CAD)
003100140725     A                                      TEXT('Cap BRT')
003200140725     A                                      COLHDG('Cap BRT')
003300140725     A            WAPPRV    R               REFFLD($PRO)
003400140725     A                                      TEXT('Provincia BRT')
003500140725     A                                      COLHDG('Prv' 'BRT')
003600140728     A*//         WAPPRVDES R   35          REFFLD(§PRDES     DSPR)
003700140725     A            WAPPRVDES R               REFFLD(§PRDES     DSPR)
003800140728     A                                      TEXT('Provincia estesa BRT')
003900140725     A                                      COLHDG('Prov estesa BRT')
004000140725     A            WAPNAZ    R               REFFLD($NAZ)
004100140725     A                                      TEXT('Nazione BRT')
004200140725     A                                      COLHDG('Naz' 'BRT')
004300140725     A            WAPTEL    R               REFFLD($TELE)
004400140725     A                                      TEXT('Telefono BRT')
004500140725     A                                      COLHDG('Telefono BRT')
004600140725     A            WAPCAT    R               REFFLD($FLA)
004700140728     A                                      TEXT('Categoria Potenziale BRT')
004800140725     A                                      COLHDG('Cat.' 'Pot.')
004900140725     A            WAPTIPIND R               REFFLD($FLA)
005000140725     A                                      TEXT('Tipo indirizzo BRT')
005100140725     A                                      COLHDG('Tipo' 'Ind.')
005200140725     A            WAPDUNS   R               REFFLD($DUNS)
005300140725     A                                      TEXT('DUNS BRT')
005400140725     A                                      COLHDG('DUNS BRT')
005500140729     A            WAPCRIF       15
005600140725     A                                      TEXT('Crif Number')
005700140725     A                                      COLHDG('Crif Number')
005800140725     A            WAPOOB    R               REFFLD($FLA)
005900140725     A                                      TEXT('OOB Indicator')
006000140725     A                                      COLHDG('OOB' 'Ind')
006100140725     A            WAPCMPVND R               REFFLD($FLA)
006200140725     A                                      TEXT('Compravendita')
006300140725     A                                      COLHDG('Compravendita')
006400140725     A            WAPCONF        2
006500140725     A                                      TEXT('Confidence code')
006600140725     A                                      COLHDG('Conf' 'Code')
006700140728     A*//         WAPSIMN        4
006800140728     A            WAPSIMN        3S 0
006900140725     A                                      TEXT('Name similarity %')
007000140725     A                                      COLHDG('Name' 'Sim%')
007100140728     A*//         WAPSIMC        4
007200140728     A            WAPSIMC        3S 0
007300140725     A                                      TEXT('City similarity %')
007400140725     A                                      COLHDG('City' 'Sim%')
007500140728     A*//         WAPSIMA        4
007600140728     A            WAPSIMA        3S 0
007700140725     A                                      TEXT('Address similarity %')
007800140725     A                                      COLHDG('Addr' 'Sim%')
007900140728     A*//         WAPSIMP        4
008000140728     A            WAPSIMP        3S 0
008100140725     A                                      TEXT('Province similarity %')
008200140725     A                                      COLHDG('Prov' 'Sim%')
008300140728     A*//         WAPMGRN        4
008400140728     A            WAPMGRN        3S 0
008500140725     A                                      TEXT('Name Match Grade %')
008600140725     A                                      COLHDG('Name' 'MG %')
008700140728     A*//         WAPMGRC        4
008800140728     A            WAPMGRC        3S 0
008900140725     A                                      TEXT('City Match Grade %')
009000140725     A                                      COLHDG('City' 'MG %')
009100140728     A*//         WAPMGRA        4
009200140728     A            WAPMGRA        3S 0
009300140725     A                                      TEXT('Address Match Grade %')
009400140725     A                                      COLHDG('Addr' 'MG %')
009500140728     A*//         WAPMGRP        4
009600140729     A            WAPMGRP        3S 0
009700140725     A                                      TEXT('Province Match Grade %')
009800140725     A                                      COLHDG('Prov' 'MG %')
009900140729VARL A*//         WAPDENO      255          VARLEN(50)
010000140729     A            WAPDENO      255
010100140725     A                                      TEXT('Denominazione')
010200140725     A                                      COLHDG('Denominazione')
010300140729VARL A*//         WAPIND2      255          VARLEN(50)
010400140729     A            WAPIND2      255
010500140725     A                                      TEXT('Indirizzo')
010600140725     A                                      COLHDG('Indirizzo')
010700140729VARL A*//         WAPLOC2       50          VARLEN(35)
010800140729     A            WAPLOC2       50
010900140725     A                                      TEXT('Comune')
011000140725     A                                      COLHDG('Comune')
011100140728     A            WAPCAP2   R     A         REFFLD($CAP)
011200140725     A                                      TEXT('Cap')
011300140725     A                                      COLHDG('Cap')
011400140725     A            WAPREG2   R   30          REFFLD(§14DES     DS14)
011500140725     A                                      TEXT('Regione')
011600140725     A                                      COLHDG('Regione')
011700140729VARL A*//         WAPFRA2       50          VARLEN(35)
011800140729     A            WAPFRA2       50
011900140725     A                                      TEXT('Frazione')
012000140725     A                                      COLHDG('Frazione')
012100140725     A            WAPPRV2   R               REFFLD($PRO)
012200140725     A                                      TEXT('Provincia')
012300140725     A                                      COLHDG('Prov')
012400140725     A            WAPPRVDE2     30
012500140725     A                                      TEXT('Provincia estesa')
012600140725     A                                      COLHDG('Provincia estesa')
012700140725     A            WAPCFI2   R   16          REFFLD($CDFISCAL)
012800140725     A                                      TEXT('Codice Fiscale')
012900140725     A                                      COLHDG('Codice Fiscale')
013000140725     A            WAPCPI2   R   11          REFFLD($CDIVA)
013100140725     A                                      TEXT('Partita Iva')
013200140725     A                                      COLHDG('Partita Iva')
013300140725     A            WAPTEL2       20
013400140725     A                                      TEXT('Telefono 1')
013500140725     A                                      COLHDG('Telefono 1')
013600140725     A            WAPFAX2       20
013700140725     A                                      TEXT('Fax 1')
013800140725     A                                      COLHDG('Fax 1')
013900140729VARL A*//         WAPSITO2     255          VARLEN(50)
014000140729     A            WAPSITO2     255
014100140725     A                                      TEXT('Sito Internet 1')
014200140725     A                                      COLHDG('Sito Internet 1')
014300140725     A            WAPECOM        1
014400140725     A                                      TEXT('Flag E-commerce')
014500140725     A                                      COLHDG(' E-' 'Com')
014600140725     A            WAPCAPSOC     15S 0
014700140725     A                                      TEXT('Capitale sociale Euro')
014800140725     A                                      COLHDG('Cap.Soc. Euro')
014900140725     A            WAPAACOS       4S 0
015000140725     A                                      TEXT('Anno Costituzione')
015100140725     A                                      COLHDG('Anno' 'Cost')
015200140725     A            WAPAAFON       4S 0
015300140725     A                                      TEXT('Anno Fondazione')
015400140725     A                                      COLHDG('Anno' 'Fond')
015500140728     A            WAPDTINI       8S 0
015600140728     A                                      TEXT('Data inizio attività')
015700140728     A                                      COLHDG('Dt Ini' 'Attività')
015800140725     A            WAPATECO      10
015900140725     A                                      TEXT('Ateco (2007)  1')
016000140725     A                                      COLHDG('Ateco' '(2007)')
016100140729VARL A*//         WAPATECODE   255          VARLEN(120)
016200140729     A            WAPATECODE   255
016300140725     A                                      TEXT('Descrizione codice ateco')
016400140725     A                                      COLHDG('Descrizione ateco')
016500140725     A            WAPSICP        5
016600140725     A                                      TEXT('Sic primario')
016700140725     A                                      COLHDG('Sic  ' 'primario')
016800140729VARL A*//         WAPSICPDES   255          VARLEN(120)
016900140729     A            WAPSICPDES   255
017000140725     A                                      TEXT('Descrizione Sic')
017100140725     A                                      COLHDG('Descrizione Sic')
017200140725     A            WAPDIP        10S 0
017300140725     A                                      TEXT('Dipendenti')
017400140725     A                                      COLHDG('Dipendenti')
017500140729VARL A*//         WAPNATG      100          VARLEN(50)
017600140729     A            WAPNATG      100
017700140725     A                                      TEXT('Natura giuridica')
017800140725     A                                      COLHDG('Natura giuridica')
017900140725     A            WAPCCIAA       2
018000140725     A                                      TEXT('CCIAA')
018100140725     A                                      COLHDG('CCIAA')
018200140725     A            WAPREA        10
018300140725     A                                      TEXT('REA')
018400140725     A                                      COLHDG('REA')
018500140729VARL A*//         WAPOGGSOC    255          VARLEN(120)
018600140729     A            WAPOGGSOC    255
018700140725     A                                      TEXT('Oggetto sociale')
018800140725     A                                      COLHDG('Oggetto sociale')
018900140725     A            WAPSTIMP      30
019000140725     A                                      TEXT('Stato Impresa Cribis')
019100140725     A                                      COLHDG('Stato Impresa Cribis')
019200140725      *
019300140729VARL A*//         WAPDENO1     255          VARLEN(50)
019400140729     A            WAPDENO1     255
019500140725     A                                      TEXT('Denominazione Esp 1')
019600140725     A                                      COLHDG('Denominazione Esp 1')
019700140729VARL A*//         WAPCOGN1      50          VARLEN(25)
019800140729     A            WAPCOGN1      50
019900140725     A                                      TEXT('Cognome Esp 1')
020000140725     A                                      COLHDG('Cognome Esp 1')
020100140729VARL A*//         WAPNOME1      50          VARLEN(25)
020200140729     A            WAPNOME1      50
020300140725     A                                      TEXT('Nome Esp 1')
020400140725     A                                      COLHDG('Nome Esp 1')
020500140725     A            WAPSESS1       1
020600140725     A                                      TEXT('Sesso Esp 1')
020700140725     A                                      COLHDG('Sesso' 'Esp 1')
020800140729VARL A*//         WAPCARI1     100          VARLEN(50)
020900140729     A            WAPCARI1     100
021000140725     A                                      TEXT('Carica Esp 1')
021100140725     A                                      COLHDG('Carica Esp 1')
021200140725      *
021300140729VARL A*//         WAPDENO2     255          VARLEN(50)
021400140729     A            WAPDENO2     255
021500140725     A                                      TEXT('Denominazione Esp 2')
021600140725     A                                      COLHDG('Denominazione Esp 2')
021700140729VARL A*//         WAPCOGN2      50          VARLEN(25)
021800140729     A            WAPCOGN2      50
021900140725     A                                      TEXT('Cognome Esp 2')
022000140725     A                                      COLHDG('Cognome Esp 2')
022100140729VARL A*//         WAPNOME2      50          VARLEN(25)
022200140729     A            WAPNOME2      50
022300140725     A                                      TEXT('Nome Esp 2')
022400140725     A                                      COLHDG('Nome Esp 2')
022500140725     A            WAPSESS2       1
022600140725     A                                      TEXT('Sesso Esp 2')
022700140725     A                                      COLHDG('Sesso' 'Esp 2')
022800140729VARL A*//         WAPCARI2     100          VARLEN(50)
022900140729     A            WAPCARI2     100
023000140725     A                                      TEXT('Carica Esp 2')
023100140725     A                                      COLHDG('Carica Esp 2')
023200140725      *
023300140729VARL A*//         WAPDENO3     255          VARLEN(50)
023400140729     A            WAPDENO3     255
023500140725     A                                      TEXT('Denominazione Esp 3')
023600140725     A                                      COLHDG('Denominazione Esp 3')
023700140729VARL A*//         WAPCOGN3      50          VARLEN(25)
023800140729     A            WAPCOGN3      50
023900140725     A                                      TEXT('Cognome Esp 3')
024000140725     A                                      COLHDG('Cognome Esp 3')
024100140729VARL A*//         WAPNOME3      50          VARLEN(25)
024200140729     A            WAPNOME3      50
024300140725     A                                      TEXT('Nome Esp 3')
024400140725     A                                      COLHDG('Nome Esp 3')
024500140725     A            WAPSESS3       1
024600140725     A                                      TEXT('Sesso Esp 3')
024700140725     A                                      COLHDG('Sesso' 'Esp 3')
024800140729VARL A*//         WAPCARI3     100          VARLEN(50)
024900140729     A            WAPCARI3     100
025000140725     A                                      TEXT('Carica Esp 3')
025100140725     A                                      COLHDG('Carica Esp 3')
025200140725      *
025300140729VARL A*//         WAPDENO4     255          VARLEN(50)
025400140729     A            WAPDENO4     255
025500140725     A                                      TEXT('Denominazione Esp 4')
025600140725     A                                      COLHDG('Denominazione Esp 4')
025700140729VARL A*//         WAPCOGN4      50          VARLEN(25)
025800140729     A            WAPCOGN4      50
025900140725     A                                      TEXT('Cognome Esp 4')
026000140725     A                                      COLHDG('Cognome Esp 4')
026100140729VARL A*//         WAPNOME4      50          VARLEN(25)
026200140729     A            WAPNOME4      50
026300140725     A                                      TEXT('Nome Esp 4')
026400140725     A                                      COLHDG('Nome Esp 4')
026500140725     A            WAPSESS4       1
026600140725     A                                      TEXT('Sesso Esp 4')
026700140725     A                                      COLHDG('Sesso' 'Esp 4')
026800140729VARL A*//         WAPCARI4     100          VARLEN(50)
026900140729     A            WAPCARI4     100
027000140725     A                                      TEXT('Carica Esp 4')
027100140725     A                                      COLHDG('Carica Esp 4')
027200140725      *
027300140729VARL A*//         WAPDENO5     255          VARLEN(50)
027400140729     A            WAPDENO5     255
027500140725     A                                      TEXT('Denominazione Esp 5')
027600140725     A                                      COLHDG('Denominazione Esp 5')
027700140729VARL A*//         WAPCOGN5      50          VARLEN(25)
027800140729     A            WAPCOGN5      50
027900140725     A                                      TEXT('Cognome Esp 5')
028000140725     A                                      COLHDG('Cognome Esp 5')
028100140729VARL A*//         WAPNOME5      50          VARLEN(25)
028200140729     A            WAPNOME5      50
028300140725     A                                      TEXT('Nome Esp 5')
028400140725     A                                      COLHDG('Nome Esp 5')
028500140725     A            WAPSESS5       1
028600140725     A                                      TEXT('Sesso Esp 5')
028700140725     A                                      COLHDG('Sesso' 'Esp 5')
028800140729VARL A*//         WAPCARI5     100          VARLEN(50)
028900140729     A            WAPCARI5     100
029000140725     A                                      TEXT('Carica Esp 5')
029100140725     A                                      COLHDG('Carica Esp 5')
029200140725      *
029300140729VARL A*//         WAPDENO6     255          VARLEN(50)
029400140729     A            WAPDENO6     255
029500140725     A                                      TEXT('Denominazione Esp 6')
029600140725     A                                      COLHDG('Denominazione Esp 6')
029700140729VARL A*//         WAPCOGN6      50          VARLEN(25)
029800140729     A            WAPCOGN6      50
029900140725     A                                      TEXT('Cognome Esp 6')
030000140725     A                                      COLHDG('Cognome Esp 6')
030100140729VARL A*//         WAPNOME6      50          VARLEN(25)
030200140729     A            WAPNOME6      50
030300140725     A                                      TEXT('Nome Esp 6')
030400140725     A                                      COLHDG('Nome Esp 6')
030500140725     A            WAPSESS6       1
030600140725     A                                      TEXT('Sesso Esp 6')
030700140725     A                                      COLHDG('Sesso' 'Esp 6')
030800140729VARL A*//         WAPCARI6     100          VARLEN(50)
030900140729     A            WAPCARI6     100
031000140725     A                                      TEXT('Carica Esp 6')
031100140725     A                                      COLHDG('Carica Esp 6')
031200140725      *
031300140729VARL A*//         WAPDENO7     255          VARLEN(50)
031400140729     A            WAPDENO7     255
031500140725     A                                      TEXT('Denominazione Esp 7')
031600140725     A                                      COLHDG('Denominazione Esp 7')
031700140729VARL A*//         WAPCOGN7      50          VARLEN(25)
031800140729     A            WAPCOGN7      50
031900140725     A                                      TEXT('Cognome Esp 7')
032000140725     A                                      COLHDG('Cognome Esp 7')
032100140729VARL A*//         WAPNOME7      50          VARLEN(25)
032200140729     A            WAPNOME7      50
032300140725     A                                      TEXT('Nome Esp 7')
032400140725     A                                      COLHDG('Nome Esp 7')
032500140725     A            WAPSESS7       1
032600140725     A                                      TEXT('Sesso Esp 7')
032700140725     A                                      COLHDG('Sesso' 'Esp 7')
032800140729VARL A*//         WAPCARI7     100          VARLEN(50)
032900140729     A            WAPCARI7     100
033000140725     A                                      TEXT('Carica Esp 7')
033100140725     A                                      COLHDG('Carica Esp 7')
033200140725      *
033300140729VARL A*//         WAPDENO8     255          VARLEN(50)
033400140729     A            WAPDENO8     255
033500140728     A                                      TEXT('Denominazione Esp 8')
033600140728     A                                      COLHDG('Denominazione Esp 8')
033700140729VARL A*//         WAPCOGN8      50          VARLEN(25)
033800140729     A            WAPCOGN8      50
033900140725     A                                      TEXT('Cognome Esp 8')
034000140725     A                                      COLHDG('Cognome Esp 8')
034100140729VARL A*//         WAPNOME8      50          VARLEN(25)
034200140729     A            WAPNOME8      50
034300140725     A                                      TEXT('Nome Esp 8')
034400140725     A                                      COLHDG('Nome Esp 8')
034500140725     A            WAPSESS8       1
034600140725     A                                      TEXT('Sesso Esp 8')
034700140725     A                                      COLHDG('Sesso' 'Esp 8')
034800140729VARL A*//         WAPCARI8     100          VARLEN(50)
034900140729     A            WAPCARI8     100
035000140725     A                                      TEXT('Carica Esp 8')
035100140725     A                                      COLHDG('Carica Esp 8')
035200140725      *
035300140725     A            WAPFATT       15S 0
035400140725     A                                      TEXT('Fatturato Euro')
035500140725     A                                      COLHDG('Fatturato Euro')
035600140725     A            WAPAAFT        4S 0
035700140725     A                                      TEXT('Anno Fatturato')
035800140725     A                                      COLHDG('Anno Fatturato')
035900140725     A            WAPPVNFT       1
036000140725     A                                      TEXT('Provenienza Fatturato')
036100140725     A                                      COLHDG('Proven' ' Fatt.')
036200140725     A            WAPUTILE      15S 0
036300140725     A                                      TEXT('Utile/Perdita')
036400140725     A                                      COLHDG('Utile/Perdita')
036500140728     A*//         WAPPIMP       20
036600140728     A            WAPPIMP        5S 2
036700140725     A                                      TEXT('% import')
036800140725     A                                      COLHDG('% import')
036900140728     A*//         WAPPEXP       20
037000140728     A            WAPPEXP        5S 2
037100140725     A                                      TEXT('% export')
037200140725     A                                      COLHDG('% export')
037300140729VARL A*//         WAPCMNOM     255          VARLEN(50)
037400140729     A            WAPCMNOM     255
037500140725     A                                      TEXT('Nome casa madre')
037600140725     A                                      COLHDG('Nome casa madre')
037700140729VARL A*//         WAPCMIND     255          VARLEN(50)
037800140729     A            WAPCMIND     255
037900140725     A                                      TEXT('Indirizzo casa madre')
038000140725     A                                      COLHDG('Indirizzo casa madre')
038100140728     A            WAPCMCAP  R     A         REFFLD($CAP)
038200140725     A                                      TEXT('Cap casa madre')
038300140725     A                                      COLHDG(' Cap ' 'madre')
038400140729VARL A*//         WAPCMLOC      50          VARLEN(25)
038500140729     A            WAPCMLOC      50
038600140725     A                                      TEXT('Città casa madre')
038700140725     A                                      COLHDG('Città casa madre')
038800140725     A            WAPCMPRV  R               REFFLD($PRO)
038900140725     A                                      TEXT('Provincia casa madre')
039000140725     A                                      COLHDG(' Prv ' 'madre')
039100140725     A            WAPCMNAZ  R               REFFLD($NAZ)
039200140725     A                                      TEXT('Nazione casa madre')
039300140725     A                                      COLHDG(' Naz ' 'madre')
039400140725     A            WAPFR4         1
039500140725     A                                      TEXT('FlagRating4')
039600140725     A                                      COLHDG('FlagRating4')
039700140728     A            WAPPIMPEX      5S 2
039800140725     A                                      TEXT('% impex')
039900140725     A                                      COLHDG('% impex')
040000140728     A            WAPAIMPEX      4S 0
040100140725     A                                      TEXT('anno %impex')
040200140725     A                                      COLHDG('anno %impex')
