000100000000     A*  STAMPA CHIAVI FILES DIPENDENTI
000200000000     A*
000300000000     A**************************************************************************
000400000000     A          R DBRFP0
000500000000     A                                      SKIPB(2)
000600000000     A                                    26'R E L A Z I O N I    D I    D A T-
000700000000     A                                       A B A S E' HIGHLIGHT
000800000000     A                                    95'Data:'
000900000000     A                                   101DATE
001000000000     A                                      EDTCDE(Y)
001100000000     A                                   114'Pag.'
001200000000     A N05                               118PAGNBR EDTCDE(Z)
001300000000     A                                      SPACEA(1)
001400000000     A**************************************************************************
001500000000     A          R DBRFP1                    SPACEB(1)
001600000000     A                                     1'Nome file    :'
001700000000     A            APFILE        10A       16HIGHLIGHT
001800000000     A N09N11                             35'Testo file  :'
001900000000     A N09N11     DESFIL        50A       50
002000000000     A                                     1'Libreria     :' SPACEB(1)
002100000000     A            APLIB         10A       16
002200000000     A                                     1'Attributo    :' SPACEB(1)
002300000000     A            APFATR         6A       16
002400000000     A**************************************************************************
002500000000     A          R DBRFP6
002600000000     A  03                                35'File fisico :'
002700000000     A  03        APBOF         10A       50
002800000000     A                                     1'Nome formato :' SPACEB(1)
002900000000     A            NOMERE        10A       16
003000000000     A  10                                35'Testo record:'
003100000000     A  10        WHTEXT        50A       50
003200000000     A**************************************************************************
003300000000     A          R DBRFP2
003400000000     A  10                                 1'Lungh. record:' SPACEB(1)
003500000000     A  10        WHRLEN         5S 0     16EDTCDE(Z)
003600000000     A  09                                35'Numero Rec. :'
003700000000     A  09        NRREC          3S 0     49EDTCDE(Z)
003800000000     A  09                                54'di'
003900000000     A  09        APNSCO         3S 0     57EDTCDE(Z)
004000000000     A                                     1'Acc.path :' SPACEB(2)
004100000000     A            ACCPAT       119A       13SPACEA(1)
004200000000     A**************************************************************************
004300000000     A          R DBRFP3
004400000000     A                                      SPACEA(1)
004500000000     A N06        MANTEN         5A       14
004600000000     A N06        CHIUNI         2A       28
004700000000     A N06        ORDIN          4A       42
004800000000     A N06        SCEOMI         2A       57
004900000000     A            APKEYF        10A       76
005000000000     A            APKSEQ         1A       92
005100000000     A            SPECIF         5A       98
005200000000     A            ALTER          2A      109
005300000000     A N06        JOIN           2A      117
005400000000     A**************************************************************************
005500000000     A          R DBRFP4
005600000000     A                                      SPACEB(3)
005700000000     A                                     1'Nome campo'
005800000000     A                                    29'Testo'
005900000000     A                                    63'T'
006000000000     A                                    65'Lungh'
006100000000     A                                    71'DC'
006200000000     A                                    74'Uso'
006300000000     A                                    78'Posizione'
006400000000     A                                    89'File'
006500000000     A                                   100'Libreria'
006600000000     A                                   111'Campo'
006700000000     A                                    28'commento' SPACEB(1)
006800000000     A                                    63'P'
006900000000     A                                    80'da    a'
007000000000     A                                    89'riferim.'
007100000000     A                                   100'riferim.'
007200000000     A                                   111'riferim.'
007300000000     A                                     1'-----------------------------------
007400000000     A                                      ------------------------------------
007500000000     A                                      ------------------------------------
007600000000     A                                      ----------------' SPACEB(1)
007700000000     A**************************************************************************
007800000000     A          R DBRFP5
007900000000     A                                      SPACEB(1)
008000000000     A            WHFLDE        10A        1
008100000000     A            WHFTXT        50A       12
008200000000     A            WHFLDT         1A       63
008300000000     A            WHFLD          5S 0     65EDTCDE(Z)
008400000000     A  07        WHFLDP         2S 0     71EDTCDE(3)
008500000000     A            WHFIOB         1A       75
008600000000     A            WHFOBO         5S 0     77EDTCDE(Z)
008700000000     A            FINOA          5S 0     82EDTCDE(Z)
008800000000     A            WHRFIL        10A       89
008900000000     A            WHRLIB        10A      100
009000000000     A            WHRFLD        10A      111
009100000000     A**************************************************************************
009200000000     A          R DBRFP7                    SPACEB(1)
009300000000     A                                     1' '
