000100000000     A*  STAMPA DIZIONARIO FILE
000200000000     A*
000300000000     A**************************************************************************
000400000000     A          R PRTFP1
000500000000     A                                      SKIPB(2)
000600000000     A                                     1'F I L E      :'
000700000000     A            APFILE        10A       16HIGHLIGHT
000800000000     A                                    47'D I Z I O N A R I O     F I L E'
000900000000     A                                      HIGHLIGHT
001000000000     A                                   104'Data:'
001100000000     A                                   110DATE
001200000000     A                                      EDTCDE(Y)
001300000000     A                                   123'Pag.'
001400000000     A N05                               128PAGNBR EDTCDE(Z)
001500000000     A                                     1'Libreria     :' SKIPB(3)
001600000000     A            APLIB         10A       16
001700000000     A                                   104'Ora:'
001800000000     A            ORARIO         6S 0    110EDTWRD('  :  :  ')
001900000000     A                                     1'Attributo    :' SKIPB(4)
002000000000     A            APFATR         6A       16
002100000000     A                                    35'Testo file  :'
002200000000     A            DESFIL        50A       50
002300000000     A**************************************************************************
002400000000     A          R PRTFP6
002500000000     A  03                                 1'File fisico  :' SPACEB(1)
002600000000     A  03        APBOF         10A       16
002700000000     A                                     1'Nome formato :' SPACEB(1)
002800000000     A            NOMERE        10A       16
002900000000     A  10                                35'Testo record:'
003000000000     A  10        WHTEXT        50A       50
003100000000     A**************************************************************************
003200000000     A          R PRTFP2
003300000000     A  10                                 1'Lungh. record:' SPACEB(2)
003400000000     A  10        WHRLEN         5S 0     16EDTCDE(Z)
003500000000     A  09                                35'Numero rec. :'
003600000000     A  09        NRREC          3S 0     49EDTCDE(Z)
003700000000     A  09                                54'di'
003800000000     A  09        APNSCO         3S 0     57EDTCDE(Z)
003900000000     A                                     1'Acc.path :' SPACEB(2)
004000000000     A            ACCPAT       119A       13SPACEA(1)
004100000000     A**************************************************************************
004200000000     A          R PRTFP3
004300000000     A                                      SPACEB(1)
004400000000     A N06        MANTEN         5A       14
004500000000     A N06        CHIUNI         2A       28
004600000000     A N06        ORDIN          4A       42
004700000000     A N06        SCEOMI         2A       55
004800000000     A            APKEYF        10A       75
004900000000     A            APKSEQ         1A       92
005000000000     A            SPECIF         5A       98
005100000000     A            ALTER          2A      109
005200000000     A N06        JOIN           2A      117
005300000000     A**************************************************************************
005400000000     A          R PRTFP4
005500000000     A                                      SPACEB(3)
005600000000     A                                     1'Nome campo'
005700000000     A                                    29'Testo'
005800000000     A                                    63'T'
005900000000     A                                    65'Lungh'
006000000000     A                                    71'Dc'
006100000000     A                                    74'Uso'
006200000000     A                                    78'Posizione'
006300000000     A                                    89'File'
006400000000     A                                   100'Libreria'
006500000000     A                                   111'Campo'
006600000000     A                                    28'commento' SPACEB(1)
006700000000     A                                    63'p'
006800000000     A                                    80'da    a'
006900000000     A                                    89'riferim.'
007000000000     A                                   100'riferim.'
007100000000     A                                   111'riferim.'
007200000000     A                                     1'-----------------------------------
007300000000     A                                      ------------------------------------
007400000000     A                                      ------------------------------------
007500000000     A                                      ----------------' SPACEB(1)
007600000000     A**************************************************************************
007700000000     A          R PRTFP5
007800000000     A                                      SPACEB(1)
007900000000     A            WHFLDE        10A        1
008000000000     A            WHFTXT        50A       12
008100000000     A            WHFLDT         1A       63
008200000000     A            WHFLD          5S 0     65EDTCDE(Z)
008300000000     A  07        WHFLDP         2S 0     71EDTCDE(3)
008400000000     A            WHFIOB         1A       75
008500000000     A            WHFOBO         5S 0     77EDTCDE(Z)
008600000000     A            FINOA          5S 0     82EDTCDE(Z)
008700000000     A            WHRFIL        10A       89
008800000000     A            WHRLIB        10A      100
008900000000     A            WHRFLD        10A      111
