000100970526     A*--------------------------------------------------------------------------------------------*
000200130906     A* STAMPA ORARI SERVIZI -                                                                     *
000300970526     A*--------------------------------------------------------------------------------------------*
000400970526     A                                      REF(CNDIZION)
000500130906     A          R DO6REC                    TEXT('STAMPA CAPPARIO:ORARI S-
000501130906     A                                      ERVIZI')
000502130906     A            DO6DRI    R     S         REFFLD($DA8)
000503130906     A                                      TEXT('DATA RIF. GG/MM/AAAA')
000504130906     A                                      COLHDG('RIFERIMENTO')
000505130906     A            DO6VER    R     S         REFFLD(COSVER *LIBL/AZCOS00F)
000506130909     A            DO6NAR    R               REFFLD(COSNAR *LIBL/AZCOS00F)
000900130906     A            DO6CA1    R               REFFLD(COSCAP *LIBL/AZCOS00F)
001100130906     A            DO6CA2    R               REFFLD(COSCAP *LIBL/AZCOS00F)
001200130906     A            DO6LNA    R               REFFLD(COSLNA *LIBL/AZCOS00F)
