000100020322             PGM        PARM(&KPJBA)
000200150504
000300020329             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
000400161110             DCL        VAR(&KPJBU) TYPE(*CHAR) LEN(256)
000500161115
000600170504             ADDLIBLE   LIB(WRKQUERY)
000700170504             MONMSG     MSGID(CPF0000)
000800161115
000900170424                        CLRPFM     FILE(WFDEP00F)
001000150504
001100051107
001200170428             CALL       PGM(TISIE12R) PARM(&KPJBA)
001300161123             MONMSG     MSGID(CPF0000)
001400170504
001500170504             RMVLIBLE   LIB(WRKQUERY)
001600170504             MONMSG     MSGID(CPF0000)
001700161110
001800000000             ENDPGM
