000010131216     A*%%TS  SD  20131216  160804  EDPES       REL-V7R1M0  5770-WDS
000020910306     A*  91/03/06  14:57:45    EDPLB       REL-R02M00  5728-PW1
000030130820     A*** FILE : TRSIO2D *--------------------------------------------*
000040080627     A*      GESTIONE/INTERROGAZIONE INFO COMMERCIALI                 *
000050920423     A***------------------------------------------------------------**
000060131216     A*%%EC
000070131216     A                                      DSPSIZ(24 80 *DS3)
000080131216     A                                      REF(*LIBL/CNDIZION)
000090131216     A                                      INDARA
000100131216     A                                      PRINT
000110131216     A  05                                  CA03
000120960710     A**-------------------------------------------------------------**
000130131216     A          R SIO2S01                   SFL
000140131216     A*%%TS  SD  20131216  160005  EDPES       REL-V7R1M0  5770-WDS
000150131216     A            V1HIMM         1A  H
000160131216     A            V1HLNA         3S 0H
000170131216     A            V1HTSER        1A  H
000180131216     A            V1HFORZ        1A  H
000190131216     A            V1HFORZLNA     1A  H
000200131216     A            CAPVISUAL      1A  H
000210130829     A******      CAPOSTIS       4S 0H
000220130829     A*****       CAPOSTFS       4S 0H
000230130829     A*****       CAPOMIIS       4S 0H
000240130829     A*****       CAPOMXFS       4S 0H
000250130829     A******      CAPTRZS        2S 0H
000260131216     A            CAPRIFER       1A  H
000270131216     A            V1DLNA        11A  O  9  2
000280131216     A  14 15                               DSPATR(HI)
000290131216     A N14 15
000300131216     AO 17                                  DSPATR(ND)
000310131216     A  14
000320131216     AON15                                  DSPATR(UL)
000330131216     A            V1DTSER        6A  O  9 14
000340131216     A  03                                  DSPATR(HI)
000350131216     A N03                                  DSPATR(RI)
000360131216     A  17                                  DSPATR(ND)
000370131216     A            V1CSOGL        3A  O  9 21DSPATR(HI)
000380131216     A  11
000390131216     AO 17                                  DSPATR(ND)
000400131216     A                                      COLOR(RED)
000410131216     A            V1CPROP        4A  O  9 25
000420131216     A  17                                  DSPATR(ND)
000430131216     A            V1CTRZS        4Y 0B  9 30
000440131216     A  44                                  DSPATR(PC)
000450131216     A                                      CHECK(RZ)
000460131216     A  01
000470131216     AO 11
000480131216     AO 17                                  DSPATR(PR)
000490131216     A  11
000500131216     AO 17                                  DSPATR(ND)
000510131216     A                                      EDTWRD('0 :  ')
000520131216     A  58                                  DSPATR(BL)
000530131216     A            V1COMIIS       4Y 0B  9 38EDTWRD('0 :  ')
000540131216     A  01
000550131216     AO 11
000560131216     AO 17                                  DSPATR(PR)
000570131216     A  42                                  DSPATR(PC)
000580131216     A  52                                  DSPATR(BL)
000590131216     A  11
000600131216     AO 17                                  DSPATR(ND)
000610131216     A            V1COMXFS       4Y 0B  9 44CHECK(RB)
000620131216     A                                      EDTWRD('0 :  ')
000630131216     A  01
000640131216     AO 11
000650131216     AO 17                                  DSPATR(PR)
000660131216     A  43                                  DSPATR(PC)
000670131216     A  53                                  DSPATR(BL)
000680131216     A  11
000690131216     AO 17                                  DSPATR(ND)
000700131216     A            V1COSTIS       4Y 0B  9 50CHECK(RB)
000710131216     A                                      EDTWRD('0 :  ')
000720131216     A  40                                  DSPATR(PC)
000730131216     A  01
000740131216     AO 17                                  DSPATR(PR)
000750131216     A  50                                  DSPATR(BL)
000760131216     A  17N11                               DSPATR(ND)
000770131216     A            V1COSTFS       4Y 0B  9 56EDTWRD('0 :  ')
000780131216     A                                      CHECK(RB)
000790131216     A  41                                  DSPATR(PC)
000800131216     A  01
000810131216     AO 17                                  DSPATR(PR)
000820131216     A  51                                  DSPATR(BL)
000830131216     A  17N11                               DSPATR(ND)
000840131216     A                                  9 62'|'
000850131216     A  11
000860131216     AO 17                                  DSPATR(ND)
000870131216     A            V1COLRSC       4Y 0B  9 64CHECK(RB)
000880131216     A                                      EDTWRD('0 :  ')
000890131216     A  47                                  DSPATR(PC)
000900131216     A  01
000910131216     AON11                                  DSPATR(PR)
000920131216     A  55                                  DSPATR(BL)
000930131216     A N11                                  DSPATR(ND)
000940131216     A            V1COLRNC       4Y 0B  9 70CHECK(RB)
000950131216     A                                      EDTWRD('0 :  ')
000960131216     A  48                                  DSPATR(PC)
000970131216     A  01
000980131216     AON11                                  DSPATR(PR)
000990131216     A  56                                  DSPATR(BL)
001000131216     A N11                                  DSPATR(ND)
001010131216     A            V1COLRNK       4Y 0B  9 76EDTWRD('0 :  ')
001020131216     A  49                                  DSPATR(PC)
001030131216     A  01
001040131216     AON11                                  DSPATR(PR)
001050131216     A  57                                  DSPATR(BL)
001060131216     A N11                                  DSPATR(ND)
001070131216     A                                      CHECK(RB)
001080131216     A            V1CLNA         3S 0O 10  2
001090131216     A  15 14                               DSPATR(HI)
001100131216     A  45                                  DSPATR(PC)
001110131216     A N15                                  DSPATR(RI)
001120131216     A N14 15
001130131216     AO 17                                  DSPATR(ND)
001140131216     A  14                                  DSPATR(UL)
001150131216     A            CAPPROP        9A  O 10 22COLOR(BLU)
001160131216     A N10
001170131216     AO 17                                  DSPATR(ND)
001180131216     A                                      DSPATR(UL)
001190131216     A            CAPTRZS        4Y 0O 10 32EDTWRD('0 :  ')
001200131216     A                                      COLOR(BLU)
001210131216     A N10
001220131216     AO 11
001230131216     AO 17N11                               DSPATR(ND)
001240131216     A            CAPOMIIS       4Y 0O 10 38EDTWRD('0 :  ')
001250131216     A                                      COLOR(BLU)
001260131216     A N10
001270131216     AO 11
001280131216     AO 17                                  DSPATR(ND)
001290131216     A            CAPOMXFS       4Y 0O 10 44EDTWRD('0 :  ')
001300131216     A                                      COLOR(BLU)
001310131216     A N10
001320131216     AO 11
001330131216     AO 17                                  DSPATR(ND)
001340131216     A            CAPOSTIS       4Y 0O 10 50EDTWRD('0 :  ')
001350131216     A                                      COLOR(BLU)
001360131216     A N10
001370131216     AO 17N11                               DSPATR(ND)
001380131216     A            CAPOSTFS       4Y 0O 10 56EDTWRD('0 :  ')
001390131216     A                                      COLOR(BLU)
001400131216     A N10
001410131216     AO 17N11                               DSPATR(ND)
001420131216     A            CAPOLRSC       4Y 0O 10 64EDTWRD('0 :  ')
001430131216     A                                      COLOR(BLU)
001440131216     A N10
001450131216     AON11                                  DSPATR(ND)
001460131216     A            CAPOLRNC       4Y 0O 10 70EDTWRD('0 :  ')
001470131216     A                                      COLOR(BLU)
001480131216     A N10
001490131216     AON11                                  DSPATR(ND)
001500131216     A            CAPOLRNK       4Y 0O 10 76EDTWRD('0 :  ')
001510131216     A                                      COLOR(BLU)
001520131216     A N10
001530131216     AON11                                  DSPATR(ND)
001540131216     A                                  9 36'|'
001550131216     A  17                                  DSPATR(ND)
001560080627     A************************************************************
001570131216     A          R SIO2C01                   SFLCTL(SIO2S01)
001580131216     A*%%TS  SD  20131216  160804  EDPES       REL-V7R1M0  5770-WDS
001590131216     A                                      SFLSIZ(0014)
001600131216     A                                      SFLPAG(0007)
001610131216     A                                      CA12
001620131216     A N02N30                               CF06
001630131216     A N12                                  CF07
001640131216     A  13                                  CF09
001650131216     A                                      OVERLAY
001660131216     A                                      SFLCSRRRN(&C01CSR)
001670131216     A N30                                  SFLDSP
001680131216     A N31                                  SFLDSPCTL
001690131216     A  30 31                               SFLCLR
001700131216     A N30                                  SFLEND
001710131216     A            C01RCD         4S 0H      SFLRCDNBR(CURSOR)
001720131216     A            C01CSR         5S 0H
001730131216     A  28        VSCMSG        78   M
001740131216     A            RSUT          20A  O  1  2TEXT('DESCRIZIONE DITTA')
001750131216     A                                  1 28'** CAPPARIO: ORARI SERVIZI **'
001760131216     A                                      DSPATR(RI)
001770131216     A                                      DSPATR(UL)
001780131216     A            VSCPGM         8A  O  1 62
001790131216     A                                  1 73DATE
001800131216     A                                      EDTCDE(Y)
001810131216     A            KNSIF         10A  O  2  2
001820131216     A            KNMUS         10A  O  2 14
001830131216     A            VSCTES2       14A  O  2 35DSPATR(RI)
001840131216     A                                      DSPATR(HI)
001850131216     A                                  2 73TIME
001860131216     A                                  3  2'Nazione..................:'
001870131216     A            DO0NAR         3A  O  3 29DSPATR(HI)
001880131216     A                                      DSPATR(CS)
001890131216     A            V1DNAR        15A  O  3 36
001900131216     A  08                              4  2'Cap......................:'
001910131216     A  08        DO0CAP         9A  O  4 29DSPATR(HI)
001920131216     A                                      DSPATR(CS)
001930131216     A                                  4 54'Ins/Mod'
001940131216     A            V1CUTE        10A  O  4 62COLOR(YLW)
001950131216     A            V1DDUV         6Y 0O  4 73EDTWRD('  /  /  ')
001960131216     A                                      COLOR(YLW)
001970131216     A  09                              5  2'Località.................:'
001980131216     A  09        DO0LOC        35A  O  5 29DSPATR(HI)
001990131216     A                                      DSPATR(CS)
002000131216     A                                  6 28'|'
002010131216     A                                      DSPATR(HI)
002020131216     A                                  6 32'C O N S E G N E'
002030131216     A                                      DSPATR(HI)
002040131216     A                                  6 49'|'
002050131216     A                                      DSPATR(HI)
002060131216     A                                  6 52'CONS/RIT'
002070131216     A                                      DSPATR(HI)
002080131216     A                                  6 62'|Limiti R I T I R O'
002090131216     A                                      DSPATR(HI)
002100131216     A                                  7  3'L I N E A'
002110131216     A                                      DSPATR(HI)
002120131216     A                                  7 19'SOGLIA'
002130131216     A                                      DSPATR(HI)
002140131216     A                                  7 28'| Tempo |'
002150131216     A                                      DSPATR(HI)
002160131216     A                                  7 49'|'
002170131216     A                                      DSPATR(HI)
002180131216     A                                  7 52'STANDARD'
002190131216     A                                      DSPATR(HI)
002200131216     A                                  7 62'| Commi'
002210131216     A                                      DSPATR(HI)
002220131216     A                                  7 71'NO'
002230131216     A                                      DSPATR(HI)
002240131216     A                                  7 77'Cli'
002250131216     A                                      DSPATR(HI)
002260131216     A                                  8  2'                          |Org.HH -
002270131216     A                                      |  Min   Max |Inizio Fine | ssion C-
002280131216     A                                      omm  codif'
002290131216     A                                      DSPATR(UL)
002300131216     A                                      DSPATR(HI)
002310131213     A          R SIO2Z01
002320131213     A*%%TS  SD  20131213  093102  EDPES       REL-V7R1M0  5770-WDS
002330131213     A N02                             24  2'F6=Aggiorna'
002340131213     A                                 24 16'F7=Orari di Riferimento'
002350131213     A                                      COLOR(BLU)
002360131213     A  12                                  DSPATR(ND)
002370131213     A                                 24 43'F9=Soglia'
002380131213     A                                      COLOR(RED)
002390131213     A N13                                  DSPATR(ND)
002400131213     A                                 24 68'F12=Ritorno'
002410130822     A          R SIO2D02
002420130822     A*%%TS  SD  20130822  090327  EDPES       REL-V7R1M0  5770-WDS
002430130822     A                                 24 54'F12=Ritorno'
002440130822     A                                 11 16'Orari previsti soltanto per il rit-
002450130822     A                                      iro / consegna in '
002460130822     A                                      COLOR(RED)
002470130822     A                                 13 37'I T A L I A'
002480130822     A                                      COLOR(RED)
002490131003     A          R SIO2D03
002500131003     A*%%TS  SD  20131003  113555  EDPES       REL-V7R1M0  5770-WDS
002510131003     A                                 11 20'Nessuna filiale abilitata alla ges-
002520131003     A                                      tione   '
002530131003     A                                      COLOR(RED)
002540131003     A                                 13 35'degli  ORARI'
002550131003     A                                      COLOR(RED)
002560131003     A                                 24 54'F12=Ritorno'
