000100000000     A*------------------------------------------------------------------------*
000200960528     A* DS SIMULAZIONE DELIVERY E TASSAZIONE                                   *
000300000000     A*------------------------------------------------------------------------*
000400001121     A                                      REF(CNDIZION)
000500960528     A          R D92REC                    TEXT('SIMUL. DELIVERY E TASSAZIONE')
000600000000    ?A*-------------------
000700000000    ?A* Parametri informativi
000800000000    ?A*-------------------
000900000000     A            D92OP0         3          TEXT('LIV PROCEDURA MENU CHIAMANTE')
001000000000     A            D92OP1         3          TEXT('LIVELLO PGM  -PGM  CHIAMANTE')
001100000000     A            D92F03         1          TEXT('1=PREMUTO F03')
001200000000     A            D92F12         1          TEXT('1=PREMUTO F12')
001300000000     A            D92ERR         1          TEXT('1=ERRORE')
001400000000     A            D92MSG        80          TEXT('MESSAGGIO DI RITORNO')
001500000000    ?A*-------------------
001600960528    ?A* Simulazione delivery
001700000000    ?A*-------------------
001800000000     A            D92DSP    R               REFFLD($DA8)
001900000000     A                                      TEXT('DATA SPEDIZIONE')
002000000000     A            D92LNP    R               REFFLD($FIL)
002100000000     A            D92NAR    R               REFFLD($NAR)
002200000000     A            D92CAD    R               REFFLD($CAD)
002300970704     A            D92LOD    R               REFFLD($LOD)
002400000000     A            D92TSP    R               REFFLD($TSP)
002500000000     A            D92ISO    R               REFFLD($FLA)
002600000000     A                                      TEXT('FLAG ISOLA/PROVINCIA/CITTA''')
002700980116     A            D92FFD    R               REFFLD($FLA)
002800980116     A                                      TEXT('S=FERMO DEPOSITO')
002900000919     A            D92FDN    R               REFFLD($FLA)
003000000919     A                                      TEXT('S=MERCE A MAGAZZINO')
003100960614     A            D92KSC    R               REFFLD($KSC)
003200960614     A                                      TEXT('CLIENTE TASSAZIONE -SEDE-')
003300960614     A            D92CTR    R               REFFLD($CTR)
003400960614     A                                      TEXT('TARIFFA TASSAZIONE -SEDE-')
003500960528    ?A*-------------------
003600960528    ?A* Simulazione tassazione
003700960528    ?A*-------------------
003800960925     A* Obbigatori
003900960528     A            D92NCL    R               REFFLD($NCL)
004000960528     A            D92PKB    R               REFFLD($PKB)
004100960528     A            D92VLF    R               REFFLD($VLF)
004200960925     A* Opzionali
004300960925     A            D92VCA    R               REFFLD($VCA)
004400960925     A            D92TIC    R               REFFLD($TIC)
004500960925     A            D92CAS    R               REFFLD($CAS)
004600960926     A            D92VAS    R               REFFLD($VAS)
004700960926     A            D92IAS    R               REFFLD($IAS)
004800970414     A            D92DDT         1A         TEXT('SI/NO DDT')
004900020813     A            D92SCO         3S 1       TEXT('% di sconto')
005000050413     A            D92TC1    R               REFFLD($TC1)
005100050413     A            D92TC2    R               REFFLD($TC1)
005200050413     A                                      TEXT('2°CONSEGNA PARTICOLARE')
005300050415     A            D92QFT    R               REFFLD($QFT)
005301110818     A            D92EMD         1A         TEXT('S=AVVISO EMAIL AL DEST.')
005400980703    ?A*-------------------
005500980703    ?A* Comuni
005600980703    ?A*-------------------
005700980703     A            D92TPO    R               REFFLD($TPO)
005800980703     A            D92NZM    R               REFFLD($NZM)
005900980703     A            D92CAM    R               REFFLD($CAM)
006000980703     A            D92LOM    R               REFFLD($LOD)
006100980703     A                                      TEXT('LOCALITA'' MITTENTE')
006200020225     A            D92NTW         3A         TEXT('NETWORK')
