000010160316     A*%%TS  SD  20160316  150626  EDPMM       REL-V7R1M0  5770-WDS
000020970526     A*-------------------------------------------------------------------------
000030160316     A*%%EC
000040160316     A                                      DSPSIZ(24 80 *DS3)
000050160316     A                                      CHGINPDFT(HI CS)
000060160316     A                                      PRINT
000070160316     A                                      CF01
000080160316     A                                      CF02
000090160316     A                                      CF03
000100160316     A                                      CF04
000110160316     A                                      CF05
000120160316     A                                      CF06
000130160316     A                                      CF07
000140160316     A                                      CF08
000150160316     A                                      CF09
000160160316     A                                      CF10
000170160316     A                                      CF11
000180160316     A                                      CF12
000190160316     A                                      CF13
000200160316     A                                      CF14
000210160316     A                                      CF15
000220160316     A                                      CF16
000230160316     A                                      CF17
000240160316     A                                      CF18
000250160316     A                                      CF19
000260160316     A                                      CF20
000270160316     A                                      CF21
000280160316     A                                      CF22
000290160316     A                                      CF23
000300160316     A                                      CF24
000310160316     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330150211     A          R SIG2D01
000340150211     A*%%TS  SD  20150211  085907  EDPMM       REL-V7R1M0  5770-WDS
000350150211     A                                      TEXT('Testata')
000360150211     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370150211     A                                  1 29'*Gestione Bancali Clienti*'
000380150211     A                                      DSPATR(RI)
000390150211     A                                      DSPATR(UL)
000400150211     A                                  1 61'TISIG13R'
000410150211     A                                  1 71DATE
000420150211     A                                      EDTCDE(Y)
000430150211     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000440150211     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000450150211     A            VIDFUN        16A  O  2 34DSPATR(RI)
000460150211     A                                      DSPATR(HI)
000470150211     A                                  2 71TIME
000480970526     A*-------------------------------------------------------------------------
000490021211     A          R SIG2D02
000500970526     A                                      OVERLAY
000510970526     A            FUN001        19A  O 22  2
000520970526     A            FUN002        19A  O 22 22
000530970526     A            FUN003        19A  O 22 42
000540970526     A            FUN004        19A  O 22 62
000550970526     A            FUN005        19A  O 23  2
000560970526     A            FUN006        19A  O 23 22
000570970526     A            FUN007        19A  O 23 42
000580970526     A            FUN008        19A  O 23 62
000590970526     A*-------------------------------------------------------------------------
000600160316     A          R SIG2D03
000610160316     A*%%TS  SD  20160316  150626  EDPMM       REL-V7R1M0  5770-WDS
000620160316     A                                      CHGINPDFT
000630160316     A                                      OVERLAY
000640160316     A                                  7  2'Codice cliente .............:'
000650160316     A            VIDKSU         8A  O  7 32DSPATR(HI)
000660160316     A                                      DSPATR(CS)
000670160316     A            VIDKSUD       35A  O  7 42
000680160316     A            VIDKSC         8A  B  8 32
000690160316     A N83                                  DSPATR(HI)
000700160316     A  83                                  DSPATR(RI)
000710160316     A N83                                  DSPATR(CS)
000720160316     A  83                                  DSPATR(PC)
000730160316     A  91
000740160316     AO 90                                  DSPATR(PR)
000750160316     A                                      CHECK(RZ)
000760160316     A                                  8  2'Codice cliente abbinabile..?:'
000770160316     A            VIDKSCD       35A  O  8 42
000780970526     A*-------------------------------------------------------------------------
000790021211     A          R SIG2DMS                   SFL
000800970526     A                                      SFLMSGRCD(24)
000810970526     A            MSGKEY                    SFLMSGKEY
000820970526     A            MSGQUE                    SFLPGMQ
000830970526     A*-------------------------------------------------------------------------
000840021211     A          R SIG2DMC                   SFLCTL(SIG2DMS)
000850970526     A                                      OVERLAY
000860970526     A                                      SFLDSP
000870970526     A  40                                  SFLCLR
000880970526     A                                      SFLSIZ(0002)
000890970526     A                                      SFLPAG(0001)
