000100170620     H*--------------------------------------------------------------------------------------------*
000200170620     H DFTACTGRP(*NO) ACTGRP(*CALLER)
000300170620     H DECEDIT('0,') DATEDIT(*DMY.)
000400170620     C*--------------------------------------------------------------------------------------------*
000500170620     C* Main lines
000600170620     C*--------------------------------------------------------------------------------------------*
000700150518     C/EXEC SQL
000800170914     C+  update dpLEG10f set LEGDSC = int(curdate())
000900170914     C+  WHERE LEGDSC > int(curdate())
001000170918     C+  and LEGDEP7 not in (SELECT CDPDPTN FROM dpcdp10f
001100170918     C+  WHERE CDPVER in (SELECT cvever FROM dpcve10f
001200170703     C+   where int(curdate()) between CVEDDE and CVEDSC)
001300170703     C+  )
001400150518     C/END-EXEC
001500170620     C                   seton                                        lr
001600060515     C*
001700060515     C*------------------------------------------------------------------------*
