000100171109             PGM        PARM(&PARAM)
000200171109
000300171109             DCL        VAR(&PARAM) TYPE(*CHAR) LEN(5)
000400150504
000500171109             CLRPFM     FILE(WFTISID0R9)
000600051107
000700171113             CALL       PGM(TISID0R9) PARM(&PARAM)
000800150504
000900000000             ENDPGM
