000100170620     H*--------------------------------------------------------------------------------------------*
000200170620     H* DPD GeoRDB 2017 - Allineamento validità VERS
000300170620     H*--------------------------------------------------------------------------------------------*
000400170620     H DFTACTGRP(*NO) ACTGRP(*CALLER)
000500170620     H DECEDIT('0,') DATEDIT(*DMY.)
000600170620
000700170620
000800170628     D ISID3VER        s              5S 0
000900170620
001000170620
001100170620     C*--------------------------------------------------------------------------------------------*
001200170620     C* Main lines
001300170620     C*--------------------------------------------------------------------------------------------*
001400150518     C*
001500150518     C* Definisco le opzioni con cui verranno d seguito utilizzate le istruzioni SQL
001600150518     C
001700150518     C/EXEC SQL
001800150518     C+ SET OPTION DYNUSRPRF = *OWNER, CLOSQLCSR = *ENDMOD
001900150518     C/END-EXEC
002000170620     C*
002100170620     C* Avvio il monitoring del intero flusso
002200170620     C                   monitor
002300170620     C
002400170620     C/EXEC SQL
002500170620     C+ DELETE FROM DPCVE10F WHERE CVEVER = :ISID3VER
002600170620     C/END-EXEC
002700170620     C
002800170620     C/EXEC SQL
002900170620     C+ DELETE FROM DPCAS10F WHERE CASVER = :ISID3VER
003000170620     C/END-EXEC
003100170620     C
003200170620     C/EXEC SQL
003300170620     C+ DELETE FROM DPCBU10F WHERE CBUVER = :ISID3VER
003400170620     C/END-EXEC
003500170620     C
003600170620     C/EXEC SQL
003700170620     C+ DELETE FROM DPCCC10F WHERE CCCVER = :ISID3VER
003800170620     C/END-EXEC
003900170620     C
004000170620     C/EXEC SQL
004100170620     C+ DELETE FROM DPCDE10F WHERE CDEVER = :ISID3VER
004200170620     C/END-EXEC
004300170620     C
004400170620     C/EXEC SQL
004500170620     C+ DELETE FROM DPCDP10F WHERE CDPVER = :ISID3VER
004600170620     C/END-EXEC
004700170620     C
004800170620     C/EXEC SQL
004900170620     C+ DELETE FROM DPCEL10F WHERE CELVER = :ISID3VER
005000170620     C/END-EXEC
005100170620     C
005200170620     C/EXEC SQL
005300170620     C+ DELETE FROM DPCIC10F WHERE CICVER = :ISID3VER
005400170620     C/END-EXEC
005500170620     C
005600170620     C/EXEC SQL
005700170620     C+ DELETE FROM DPCNP10F WHERE CNPVER = :ISID3VER
005800170620     C/END-EXEC
005900170620     C
006000170620     C/EXEC SQL
006100170620     C+ DELETE FROM DPCNT10F WHERE CNTVER = :ISID3VER
006200170620     C/END-EXEC
006300170620     C
006400170620     C/EXEC SQL
006500170620     C+ DELETE FROM DPCPC10F WHERE CPCVER = :ISID3VER
006600170620     C/END-EXEC
006700170620     C
006800170620     C/EXEC SQL
006900170620     C+ DELETE FROM DPCRE10F WHERE CREVER = :ISID3VER
007000170620     C/END-EXEC
007100170620     C
007200170620     C/EXEC SQL
007300170620     C+ DELETE FROM DPCR110F WHERE CR1VER = :ISID3VER
007400170620     C/END-EXEC
007500170620     C
007600170620     C/EXEC SQL
007700170620     C+ DELETE FROM DPCR210F WHERE CR2VER = :ISID3VER
007800170620     C/END-EXEC
007900170620     C
008000170620     C/EXEC SQL
008100170620     C+ DELETE FROM DPCR310F WHERE CR3VER = :ISID3VER
008200170620     C/END-EXEC
008300170620     C
008400170620     C/EXEC SQL
008500170620     C+ DELETE FROM DPCR410F WHERE CR4VER = :ISID3VER
008600170620     C/END-EXEC
008700170620     C
008800170620     C/EXEC SQL
008900170620     C+ DELETE FROM DPCR510F WHERE CR5VER = :ISID3VER
009000170620     C/END-EXEC
009100170620     C
009200170620     C/EXEC SQL
009300170620     C+ DELETE FROM DPCSO10F WHERE CSOVER = :ISID3VER
009400170620     C/END-EXEC
009500170620     C
009600170620     C/EXEC SQL
009700170620     C+ DELETE FROM DPCST10F WHERE CSTVER = :ISID3VER
009800170620     C/END-EXEC
009900170620     C
010000170620     C/EXEC SQL
010100170620     C+ DELETE FROM DPCWA10F WHERE CWAVER = :ISID3VER
010200170620     C/END-EXEC
010300170620     C
010400170620     C/EXEC SQL
010500170620     C+ DELETE FROM DPCWS10F WHERE CWSVER = :ISID3VER
010600170620     C/END-EXEC
010700170620     C
010800170620     C*
010900170620     C* Gestisco eventuale errore
011000170620     C                   on-error
011100170620     C                   dump(A)
011200170620     C*
011300170620     C* Arresto il monitoring
011400170620     C                   endmon
011500170620     C*
011600170620     C                   seton                                        lr
011700060515     C*
011800170620
011900170620
012000170620     C*--------------------------------------------------------------------------------------------*
012100170620     C* *inzsr - operazioni iniziali
012200170620     C*--------------------------------------------------------------------------------------------*
012300170620     C     *inzsr        BEGSR
012400170620     C*
012500170620     C* Ricevimento parametri
012600170620     C     *ENTRY        PLIST
012700170620     C                   PARM                    ISID3VER
012800170620     C*
012900170620     C                   ENDSR
013000170620
