000010060929     A*%%TS  SD  20060929  131712  EDPES       REL-V5R3M0  5722-WDS
000020970526     A*-------------------------------------------------------------------------
000030060929     A*%%EC
000040060929     A                                      DSPSIZ(24 80 *DS3)
000050060929     A                                      CHGINPDFT(HI CS)
000060060929     A                                      PRINT
000070060929     A                                      CF01
000080060929     A                                      CF02
000090060929     A                                      CF03
000100060929     A                                      CF04
000110060929     A                                      CF05
000120060929     A                                      CF06
000130060929     A                                      CF07
000140060929     A                                      CF08
000150060929     A                                      CF09
000160060929     A                                      CF11
000170060929     A                                      CF12
000180060929     A                                      CF13
000190060929     A                                      CF14
000200060929     A                                      CF15
000210060929     A                                      CF16
000220060929     A                                      CF17
000230060929     A                                      CF18
000240060929     A                                      CF19
000250060929     A                                      CF20
000260060929     A                                      CF21
000270060929     A                                      CF22
000280060929     A                                      CF23
000290060929     A                                      CF24
000300060929     A                                      ROLLUP
000310060929     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330971203     A          R SI17D01
000340971203     A*%%TS  SD  19971203  174147  EDPRN       REL-V3R7M0  5716-PW1
000350971203     A                                      TEXT('Testata')
000360971203     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370971203     A                                  1 30'** GESTIONE TERMINAL **'
000380971203     A                                      DSPATR(RI)
000390971203     A                                      DSPATR(UL)
000400971203     A                                  1 61'TISI17R'
000410971203     A                                  1 71DATE
000420971203     A                                      EDTCDE(Y)
000430971203     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000440971203     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000450971203     A            VIDING        16A  O  2 33DSPATR(RI)
000460971203     A                                      DSPATR(HI)
000470971203     A                                  2 71TIME
000480970526     A*-------------------------------------------------------------------------
000490970528     A          R SI17D02
000500970526     A                                      TEXT('Opzioni')
000510970526     A                                      OVERLAY
000520970526     A                                  3  2'Immettere le opzioni e premere inv-
000530970526     A                                      io.'
000540970526     A            OPZ001        19A  O  4  2
000550970526     A            OPZ002        19A  O  4 22
000560970526     A            OPZ003        19A  O  4 42
000570970526     A            OPZ004        19A  O  4 62
000580970526     A            OPZ005        19A  O  5  2
000590970526     A            OPZ006        19A  O  5 22
000600970526     A            OPZ007        19A  O  5 42
000610970526     A            OPZ008        19A  O  5 62
000620970526     A*-------------------------------------------------------------------------
000630060706     A          R SI17D03
000640060706     A*%%TS  SD  20060706  090818  EDPES       REL-V5R3M0  5722-WDS
000650060706     A                                      TEXT('Parzializzazioni sfile')
000660060706     A                                      OVERLAY
000670060706     A                                  7  2'Inizio elenco->'
000680060706     A                                      DSPATR(HI)
000690060706     A                                  7 18'Par/Arr/£6/Co/Ot'
000700060706     A            VIDPPA    R        B  7 35REFFLD(CAEEPA AZCAE00F)
000710060706     A N80                                  DSPATR(CS)
000720060706     A N80                                  DSPATR(HI)
000730060706     A  80                                  DSPATR(RI)
000740060706     A  80                                  DSPATR(PC)
000750060706     A                                  7 38'Linea par'
000760060706     A            VIDPTP    R     Y  B  7 48REFFLD(CAETFP AZCAE00F)
000770060706     A N81                                  DSPATR(HI)
000780060706     A  81                                  DSPATR(RI)
000790060706     A N81                                  DSPATR(CS)
000800060706     A  81                                  DSPATR(PC)
000810060706     A                                      EDTCDE(Z)
000820060706     A                                      CHECK(RB)
000830060706     A                                  7 53'Linea arr'
000840060706     A            VIDPTA    R     Y  B  7 63REFFLD(CAETFA AZCAE00F)
000850060706     A N82                                  DSPATR(HI)
000860060706     A  82                                  DSPATR(RI)
000870060706     A N82                                  DSPATR(CS)
000880060706     A  82                                  DSPATR(PC)
000890060706     A                                      EDTCDE(Z)
000900060706     A                                      CHECK(RB)
000910060706     A                                  7 68'Linea ter'
000920060706     A            VIDPTE    R     Y  B  7 78REFFLD(CAETFE AZCAE00F)
000930060706     A N84                                  DSPATR(HI)
000940060706     A  84                                  DSPATR(RI)
000950060706     A N84                                  DSPATR(CS)
000960060706     A  84                                  DSPATR(PC)
000970060706     A                                      EDTCDE(Z)
000980060706     A                                      CHECK(RB)
000990060706     A                                  8  2'Selezione per->'
001000060706     A                                      DSPATR(HI)
001010060706     A                                  8 18'In decorrenza'
001020060706     A            VIDPDD    R     Y  B  8 35REFFLD(CAEDDE AZCAE00F)
001030060706     A N83                                  DSPATR(HI)
001040060706     A  83                                  DSPATR(RI)
001050060706     A N83                                  DSPATR(CS)
001060060706     A  83                                  DSPATR(PC)
001070060706     A                                      CHECK(RB)
001080060706     A                                      EDTCDE(8)
001090970526     A*-------------------------------------------------------------------------
001100060706     A          R SI17D04
001110060706     A*%%TS  SD  20060706  091509  EDPES       REL-V5R3M0  5722-WDS
001120060706     A                                      TEXT('Intestazione sfile')
001130060706     A                                      OVERLAY
001140060706     A                                  9  2'    P/A/6                         -
001150060706     A                                                                Data     -
001160060706     A                                        Data   '
001170060706     A                                      DSPATR(RI)
001180060706     A                                 10  2'Op A C/O __ Partenza __  ___ Arriv-
001190060706     A                                      o ___  ___Terminal __  decorrenza  -
001200060706     A                                      scadenza '
001210060706     A                                      DSPATR(RI)
001220060706     A                                      DSPATR(UL)
001230970526     A*-------------------------------------------------------------------------
001240060928     A          R SI17D05                   SFL
001250060928     A*%%TS  SD  20060928  125014  EDPES       REL-V5R3M0  5722-WDS
001260060928     A                                      TEXT('Sfile dati')
001270060928     A  41                                  SFLNXTCHG
001280060928     A            VIHDDE    R        H      REFFLD(CAEDDE AZCAE00F)
001290060928     A            OPZKEY         2A  B 11  2CHGINPDFT
001300060928     A                                      DSPATR(UL)
001310060928     A  01                                  DSPATR(PR)
001320060928     A            VIDATB         1A  O 11  5
001330060928     A            VIDEPA    R        O 11  8REFFLD(CAEEPA AZCAE00F)
001340060928     A                                      DSPATR(HI)
001350060928     A            VIDTFP    R     Y  O 11 11REFFLD(CAETFP AZCAE00F)
001360060928     A                                      DSPATR(HI)
001370060928     A                                      EDTCDE(Z)
001380060928     A            VIDDTP        10A  O 11 15
001390060928     A            VIDTFA    R     Y  O 11 27REFFLD(CAETFA AZCAE00F)
001400060928     A                                      DSPATR(HI)
001410060928     A                                      EDTCDE(Z)
001420060928     A            VIDDTA        10A  O 11 31
001430060928     A            VIDTFE    R     Y  O 11 43REFFLD(CAETFE AZCAE00F)
001440060928     A                                      DSPATR(HI)
001450060928     A                                      EDTCDE(Z)
001460060928     A            VIDDTE        10A  O 11 47
001470060928     A            VIDDDE    R     Y  O 11 59REFFLD(CAEDDE AZCAE00F)
001480060928     A                                      EDTCDE(8)
001490060928     A            VIDDSC    R     Y  O 11 70REFFLD(CAEDSC AZCAE00F)
001500060928     A                                      EDTCDE(8)
001510970526     A*-------------------------------------------------------------------------
001520970528     A          R SI17D06                   SFLCTL(SI17D05)
001530970528     A*%%TS  SD  19970528  102514  EDPRN       REL-V3R6M0  5716-PW1
001540970528     A                                      TEXT('Sfile control')
001550970528     A                                      BLINK
001560970528     A                                      OVERLAY
001570970528     A N40                                  SFLDSP
001580970528     A N40                                  SFLDSPCTL
001590970528     A  40                                  SFLCLR
001600970528     A                                      SFLSIZ(0011)
001610970528     A                                      SFLPAG(0010)
001620970528     A            SFLNBR         4S 0H      SFLRCDNBR(CURSOR)
001630970526     A*-------------------------------------------------------------------------
001640970528     A          R SI17DMS                   SFL
001650970526     A                                      TEXT('Sfile messaggi')
001660970526     A                                      SFLMSGRCD(24)
001670970526     A            MSGKEY                    SFLMSGKEY
001680970526     A            MSGQUE                    SFLPGMQ(10)
001690970526     A*-------------------------------------------------------------------------
001700970528     A          R SI17DMC                   SFLCTL(SI17DMS)
001710970526     A                                      TEXT('Sfile control messaggi')
001720970526     A                                      OVERLAY
001730970526     A                                      SFLDSP
001740970526     A  40                                  SFLCLR
001750970526     A                                      SFLSIZ(0002)
001760970526     A                                      SFLPAG(0001)
001770970526     A*-------------------------------------------------------------------------
001780970528     A          R SI17D09
001790970526     A                                      TEXT('Funzioni')
001800970526     A                                      OVERLAY
001810970526     A            FUN001        19A  O 22  2
001820970526     A            FUN002        19A  O 22 22
001830970526     A            FUN003        19A  O 22 42
001840970526     A            FUN004        19A  O 22 62
001850970526     A            FUN005        19A  O 23  2
001860970526     A            FUN006        19A  O 23 22
001870970526     A            FUN007        19A  O 23 42
001880970526     A            FUN008        19A  O 23 62
001890970526     A*-------------------------------------------------------------------------
001900970528     A          R SI17D0A
001910970526     A                                      OVERLAY
001920970526     A                                      PUTOVR
001930970526     A                                      OVRDTA
001940970526     A                                      OVRATR
001950970526     A                                 12 16'NON VI SONO DATI CON LE CARATTERIS-
001960970526     A                                      TICHE RICHIESTE'
001970970526     A                                      DSPATR(HI)
001980060928     A**************************************************************************
001990060929     A          R SI17S11                   SFL
002000060929     A*%%TS  SD  20060929  123257  EDPES       REL-V5R3M0  5722-WDS
002010060929     A            V11TFP    R     Y  O 11 14REFFLD(CAETFP AZCAE00F)
002020060929     A                                      DSPATR(HI)
002030060929     A                                      EDTCDE(Z)
002040060929     A            V11DTP        10A  O 11 18
002050060929     A            V11TFA    R     Y  O 11 32REFFLD(CAETFA AZCAE00F)
002060060929     A                                      DSPATR(HI)
002070060929     A                                      EDTCDE(Z)
002080060929     A            V11DTA        10A  O 11 36
002090060929     A            V11TFE    R     Y  O 11 50REFFLD(CAETFE AZCAE00F)
002100060929     A                                      DSPATR(HI)
002110060929     A                                      EDTCDE(Z)
002120060929     A            V11DTE        10A  O 11 54
002130060929     A            V11EPA         1A  O 11  7DSPATR(HI)
002140060928     A**************************************************************************
002150060929     A          R SI17C11                   SFLCTL(SI17S11)
002160060929     A*%%TS  SD  20060929  131712  EDPES       REL-V5R3M0  5722-WDS
002170060929     A                                      SFLSIZ(0500)
002180060929     A                                      SFLPAG(0010)
002190060929     A                                      OVERLAY
002200060929     A N70                                  SFLDSP
002210060929     A N70                                  SFLDSPCTL
002220060929     A  70                                  SFLCLR
002230060929     A N70                                  SFLEND
002240060929     A            REC1           4S 0H      SFLRCDNBR
002250060929     A  28        VIDMSG        78   M
002260060929     A                                  5  2'Fare scadere le linee sottoelencat-
002270060929     A                                      e  alla data'
002280060929     A            V11DSC         8Y 0B  5 50CHECK(RB)
002290060929     A                                      EDTWRD('  /  /    ')
002300060929     A  64                                  DSPATR(PC)
002310060929     A                                  6 14'N U O V E    E C C E Z I O N I :'
002320060929     A                                      DSPATR(HI)
002330060929     A                                      DSPATR(UL)
002340060929     A                                  7 22'LINEA / TERMINAL .......?.'
002350060929     A            V11NWTFE       3A  B  7 50CHECK(RZ)
002360060929     A            V11NWDTE      25A  O  7 56
002370060929     A                                  8 22'Data Scadenza ............'
002380060929     A            V11NWDSC       8Y 0B  8 50CHECK(RB)
002390060929     A                                      EDTWRD('  /  /    ')
002400060929     A  65                                  DSPATR(PC)
002410060929     A                                  9 22'ripristinare la precedente'
002420060929     A            V11NWRIP       2A  B  9 50VALUES('SI' 'NO')
002430060929     A                                  9 62'(SI/NO)'
002440060929     A                                 10  2'TipTerminal __ Partenza __    ___ -
002450060929     A                                      Arrivo ___    __ Terminal __      '
002460060929     A                                      DSPATR(UL)
002470060929     A                                      DSPATR(RI)
002480060928     A**************************************************************************
002490060929     A          R SI17Z11
002500060929     A*%%TS  SD  20060929  114256  EDPES       REL-V5R3M0  5722-WDS
002510060929     A                                      OVERLAY
002520060929     A                                 24  2'F6=Elaborazione'
002530060929     A                                 24 67'F12=Ritorno'
