000010060214     A*%%TS  SD  20060214  084812  EDPMB       REL-V5R3M0  5722-WDS
000020060214     A*%%EC
000030060214     A                                      DSPSIZ(24 80 *DS3)
000040060214     A                                      CHGINPDFT(HI UL)
000050060214     A                                      PRINT
000060000000     A*-------------------------------------------------------*
000070060208     A          R SI49T01
000080060208     A*%%TS  SD  20060208  101004  EDPMB       REL-V5R3M0  5722-WDS
000090060208     A            RSUT          20A  O  1  2
000100060208     A            VTCTIT        35A  O  1 25DSPATR(RI)
000110060208     A                                      DSPATR(UL)
000120060208     A            VTCPGM        10A  O  1 62
000130060208     A                                  1 73DATE
000140060208     A                                      EDTCDE(Y)
000150060208     A            KNSIF         10A  O  2  2
000160060208     A            KNMUS         10A  O  2 13
000170060208     A                                  2 73TIME
000180060208     A*-------------------------------------------------------*
000190060214     A          R SI49S01                   SFL
000200060214     A*%%TS  SD  20060214  084448  EDPMB       REL-V5R3M0  5722-WDS
000210060214     A            V1SCOD         3A  O  8 23
000220060214     A            V1SDES        30A  O  8 28
000230060208     A*-------------------------------------------------------*
000240060214     A          R SI49C01                   SFLCTL(SI49S01)
000250060214     A*%%TS  SD  20060214  084812  EDPMB       REL-V5R3M0  5722-WDS
000260060214     A                                      SFLSIZ(9999)
000270060214     A                                      SFLPAG(0015)
000280060214     A                                      CA03
000290060214     A                                      CF06
000300060214     A                                      OVERLAY
000310060214     A  20                                  SFLDSP
000320060214     A  21                                  SFLDSPCTL
000330060214     A N21                                  SFLCLR
000340060214     A  31                                  SFLEND(*MORE)
000350060214     A                                  7 22'Verranno estratte le seguenti tabe-
000360060214     A                                      lle:'
000370060214     A                                      DSPATR(UL)
000380060214     A                                      DSPATR(HI)
000390060214     A                                  5 13'Il File generato è nella GAITRAAZM-
000400060214     A                                       e si chiama TNTBEPCV'
000410060214     A                                      DSPATR(HI)
000420060208     A*-------------------------------------------------------*
000430060208     A          R SI49Z01
000440060208     A*%%TS  SD  20060208  100555  EDPMB       REL-V5R3M0  5722-WDS
000450060208     A                                      OVERLAY
000460060208     A                                 24  3'F3=Fine'
000470060208     A                                 24 35'F6=Conferma'
