000001130909     A*%%***********************************************************************
000002130909     A*%%TS  RD  20130909  150518  EDPRM       REL-V7R1M0  5770-WDS
000003130909     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004130909     A*%%FI       0000000000000000000000000000000000000000000000000
000005130909     A*%%***********************************************************************
000006130909     A          R SIO6T
000007130909     A*%%***********************************************************************
000008130909     A*%%RI 00000
000009130909     A*%%FS 001
000010130909     A*%%***********************************************************************
000011130909     A                                      SKIPB(002)
000012130909     A            RSUT          20A  O     1
000013130909     A            PTITOLO       44A  O    45
000014130909     A                                   125
000015130909     A                                      'PAG.'
000016130909     A                                   104
000017130909     A                                      'TISIO6R'
000018130909     A            WDATE          8  0O    +2
000019130909     A                                      EDTWRD('  /  /    ')
000020130909     A                                   129
000021130909     A                                      PAGNBR
000022130909     A                                      EDTCDE(Z)
000023130909     A            KNSIF     R     A  O     1
000024130909     A                                      REFFLD(KNSIF KPJBA)
000025130909     A                                      SPACEB(001)
000026130909     A            KNMUS     R        O    +1
000027130909     A                                      REFFLD(KNMUS KPJBA)
000028130909     A            PTITOLO2      70A  O    31
000029130909     A            UTIME          6  0O   113
000030130909     A                                      EDTWRD('  :  :  ')
000031130909     A                                     1
000032130909     A                                      SPACEB(002)
000033130909     A                                      '-----------------------------------
000034130909     A                                      ------------------------------------
000035130909     A                                      ------------------------------------
000036130909     A                                      ----------------------------'
000037130909     A                                     1
000038130909     A                                      ' C A P   '
000039130909     A                                      SPACEB(001)
000040130909     A                                    11
000041130909     A                                      'LOCALITA''           '
000042130909     A            PINTLNA       16A  O    +1
000043130909     A                                    49
000044130909     A                                      '|'
000045130909     A                                    50
000046130909     A                                      '--------- R I T I R I ---------'
000047130909     A                                    81
000048130909     A                                      '|'
000049130909     A                                    82
000050130909     A                                      '------- C O N S E G N E -------'
000051130909     A                                   113
000052130909     A                                      '|'
000053130909     A                                    +0
000054130909     A                                      'INSER./ULT.MODIFICA'
000055130909     A                                    49
000056130909     A                                      '|'
000057130909     A                                      SPACEB(001)
000058130909     A                                    50
000059130909     A                                      ' Standard   '
000060130909     A                                    64
000061130909     A                                      'Minimo'
000062130909     A                                    71
000063130909     A                                      'Max'
000064130909     A                                    77
000065130909     A                                      'T.R.'
000066130909     A                                    81
000067130909     A                                      '|'
000068130909     A                                    82
000069130909     A                                      ' Standard   '
000070130909     A                                    96
000071130909     A                                      'Minimo'
000072130909     A                                   103
000073130909     A                                      'Max'
000074130909     A                                   109
000075130909     A                                      'T.R.'
000076130909     A                                   113
000077130909     A                                      '|'
000078130909     A                                    49
000079130909     A                                      '|'
000080130909     A                                      SPACEB(001)
000081130909     A                                    50
000082130909     A                                      'Inizio Fine'
000083130909     A                                    64
000084130909     A                                      'Inizio'
000085130909     A                                    71
000086130909     A                                      'Fine'
000087130909     A                                    78
000088130909     A                                      'hh'
000089130909     A                                    81
000090130909     A                                      '|'
000091130909     A                                    82
000092130909     A                                      'Inizio Fine'
000093130909     A                                    96
000094130909     A                                      'Inizio'
000095130909     A                                   103
000096130909     A                                      'Fine'
000097130909     A                                   110
000098130909     A                                      'hh'
000099130909     A                                   113
000100130909     A                                      '|'
000101130909     A                                    +0
000102130909     A                                      'Utente'
000103130909     A                                    +5
000104130909     A                                      'Data'
000105130909     A                                     1
000106130909     A                                      SPACEB(001)
000107130909     A                                      '-----------------------------------
000108130909     A                                      ------------------------------------
000109130909     A                                      ------------------------------------
000110130909     A                                      ----------------------------'
000111130909     A*%%***********************************************************************
000112130909     A*%%SS
000113130909     A*%%CL 001
000114130909     A*%%CL 002
000115130909     A*%%CL 001
000116130909     A*%%CL 001
000117130909     A*%%CL 001
000118130909     A*%%CL 001
000119130909     A*%%***********************************************************************
000120130909     A          R SIO6D
000121130909     A*%%***********************************************************************
000122130909     A*%%RI 00000
000123130909     A*%%***********************************************************************
000124130909     A                                      SPACEB(001)
000125130909     A            PSTD          16A  O    32
000126130909     A            PCAP           9A  O     1
000127130909     A            PLOC          20A  O    +1
000128130909     A  21        PLNA           3  0O    +1
000129130909     A            PLNAD         12A  O    36
000130130909     A                                    49
000131130909     A                                      '|'
000132130909     A            POSTIS         4  0O    +0
000133130909     A                                      EDTWRD('  :  ')
000134130909     A            POSTFS         4  0O    +2
000135130909     A                                      EDTWRD('  :  ')
000136130909     A            POMIIS         4  0O    +2
000137130909     A                                      EDTWRD('  :  ')
000138130909     A            POMXFS         4  0O    +2
000139130909     A                                      EDTWRD('  :  ')
000140130909     A            PTRZS          2  0O    +2
000141130909     A                                      EDTCDE(Z)
000142130909     A                                    +1
000143130909     A                                      '|'
000144130909     A            POSTISC        4  0O    +0
000145130909     A                                      EDTWRD('  :  ')
000146130909     A            POSTFSC        4  0O    +2
000147130909     A                                      EDTWRD('  :  ')
000148130909     A            POMIISC        4  0O    +2
000149130909     A                                      EDTWRD('  :  ')
000150130909     A            POMXFSC        4  0O    +2
000151130909     A                                      EDTWRD('  :  ')
000152130909     A            PTRZSC         2  0O    +2
000153130909     A                                      EDTCDE(Z)
000154130909     A                                   113
000155130909     A                                      '|'
000156130909     A            PUTE          10A  O    +0
000157130909     A            PDUV           6  0O    +1
000158130909     A                                      EDTWRD('  /  /  ')
000159130909     A*%%***********************************************************************
000160130909     A*%%SS
000161130909     A*%%***********************************************************************
000162130909     A          R FINES
000163130909     A*%%***********************************************************************
000164130909     A*%%RI 00000
000165130909     A*%%FS 001
000166130909     A*%%***********************************************************************
000167130909     A                                      SPACEB(002)
000168130909     A                                    26
000169130909     A                                      '***  FINE STAMPA  ***'
000170130909     A*%%***********************************************************************
000171130909     A*%%SS                                   FINE STAMPA  ***
000172130909     A*%%CP+999CRTPRTF
000173130909     A*%%CP+    FILE(GAITRASRC/TISIO6P)
000174130909     A*%%CP+    DEVTYPE(*SCS)
000175130909     A*%%CP     PAGESIZE(*N       132      *N     )
000176130909     A*%%***********************************************************************
