000100150514      *PARMS MBR(*NONE)
000200150504     A          R TISI795O0                 TEXT('TEMPI DI Consegna -
000300150504     A                                      OUTPUT.')
000400150504     A            FORMATO       10A         TEXT('Nome DS "TISI795O0".')
000500150504     A                                      DFT('TISI795O0')
000600120223     A            VERSIONE       1A         TEXT('Versione formato "A".')
000700120223     A                                      DFT('A')
000800150504     A            FIL_FP         3S 0       TEXT('filiale      di Partenza ')
000900150504     A            DES_FP        20A         TEXT('Descrizione  FilPartenza ')
001000150504     A            IND_FP        20A         TEXT('Indirizzo    FilPartenza ')
001100150513     A            CAP_FP         9A         TEXT('C.A.P.       FilPartenza ')
001200150513     A            LOC_FP        20A         TEXT('Località     FilPartenza ')
001300150513     A            PRV_FP         2A         TEXT('PROVINCIA    FilPartenza ')
001400150514     A            TEL_FP        13A         TEXT('Telefono     FilPartenza ')
001500150514     A            FAX_FP        13A         TEXT('Fax          FilPartenza ')
001600150513     A            MAIL_FP      255A         TEXT('Email        FilPartenza ')
001700150513     A            FIL_FA         3S 0       TEXT('filiale      di Arrivo   ')
001800150513     A            DES_FA        20A         TEXT('Descrizione  Fil.Arrivo  ')
001900150513     A            IND_FA        20A         TEXT('Indirizzo    Fil.Arrivo  ')
002000150513     A            CAP_FA         9A         TEXT('C.A.P.       Fil.Arrivo  ')
002100150513     A            LOC_FA        20A         TEXT('Località     Fil.Arrivo  ')
002200150513     A            PRV_FA         2A         TEXT('PROVINCIA    Fil.Arrvio  ')
002300150513     A            TEL_FA        16A         TEXT('Telefono     Fil.Arrivo  ')
002400150513     A            FAX_FA        16A         TEXT('Fax          Fil.Arrivo  ')
002500150513     A            MAIL_FA      255A         TEXT('Email        Fil.Arrivo  ')
002600150514     A            NOT1_RIT     255A         TEXT('Ritiro: note 1')
002700150514     A            NOT2_RIT     255A         TEXT('Ritiro: note 2')
002800150514     A            TSP_TOT        2S 0       TEXT('Numero tipi servizio ')
002900150514     A            TSP_DISPO     18A         TEXT('TipServ.Disponibili  ')
003000150514     A            TSP_COD       18A         TEXT('TipServ.Codici       ')
003100150514     A            TSP_DESCR    450A         TEXT('TipServ.Descrizione  ')
003200150514     A            TSP_NOT     1800A         TEXT('TipServ.nota consegna')
003300150529     A            NOT1_CON     255A         TEXT('Consegna: note 1')
003400150529     A            NOT2_CON     255A         TEXT('consegna: note 2')
003500150601     A            DAY_RIT       20A         TEXT('Giorno settimana ritiro')
003600150629     A            URL_FP       256A         TEXT('URL Filiale partenza   ')
003700150629     A            URL_FA       256A         TEXT('URL Filiale arrivo     ')
