000010970624     A*%%TS  SD  19970624  160900  EDPRN       REL-V3R6M0  5716-PW1
000020970526     A*-------------------------------------------------------------------------
000030970624     A*%%EC
000040970624     A                                      DSPSIZ(24 80 *DS3)
000050970624     A                                      CHGINPDFT(HI CS)
000060970624     A                                      PRINT
000070970624     A                                      CF01
000080970624     A                                      CF02
000090970624     A                                      CF03
000100970624     A                                      CF04
000110970624     A                                      CF05
000120970624     A                                      CF06
000130970624     A                                      CF07
000140970624     A                                      CF08
000150970624     A                                      CF09
000160970624     A                                      CF10
000170970624     A                                      CF11
000180970624     A                                      CF12
000190970624     A                                      CF13
000200970624     A                                      CF14
000210970624     A                                      CF15
000220970624     A                                      CF16
000230970624     A                                      CF17
000240970624     A                                      CF18
000250970624     A                                      CF19
000260970624     A                                      CF20
000270970624     A                                      CF21
000280970624     A                                      CF22
000290970624     A                                      CF23
000300970624     A                                      CF24
000310970624     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330970603     A          R SI36D01
000340970526     A                                      TEXT('Testata')
000350970526     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000360970603     A                                  1 30'** SINONIMI LOCALITA''**'
000370970526     A                                      DSPATR(RI)
000380970526     A                                      DSPATR(UL)
000390970603     A                                  1 61'TISI36R'
000400970526     A                                  1 71DATE
000410970526     A                                      EDTCDE(Y)
000420970526     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000430970526     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000440970526     A            VIDFUN        16A  O  2 34DSPATR(RI)
000450970526     A                                      DSPATR(HI)
000460970526     A                                  2 71TIME
000470970526     A*-------------------------------------------------------------------------
000480970603     A          R SI36D02
000490970526     A                                      OVERLAY
000500970526     A            FUN001        19A  O 22  2
000510970526     A            FUN002        19A  O 22 22
000520970526     A            FUN003        19A  O 22 42
000530970526     A            FUN004        19A  O 22 62
000540970526     A            FUN005        19A  O 23  2
000550970526     A            FUN006        19A  O 23 22
000560970526     A            FUN007        19A  O 23 42
000570970526     A            FUN008        19A  O 23 62
000580970526     A*-------------------------------------------------------------------------
000590970624     A          R SI36D03
000600970624     A*%%TS  SD  19970624  160900  EDPRN       REL-V3R6M0  5716-PW1
000610970624     A                                      CHGINPDFT
000620970624     A                                      OVERLAY
000630970624     A                                  4  2'Nazione ...................?:'
000640970624     A            VIDNAR    R     A  B  4 32REFFLD(CPSNAR AZCPS00F)
000650970624     A N60                                  DSPATR(CS)
000660970624     A N60                                  DSPATR(HI)
000670970624     A  60                                  DSPATR(RI)
000680970624     A  60                                  DSPATR(PC)
000690970624     A  90
000700970624     AO 91                                  DSPATR(PR)
000710970624     A            VDDNAR        15A  O  4 36
000720970624     A                                  5  2'Cap ........................:'
000730970624     A            VIDCAP    R     A  B  5 32REFFLD(CPSCAP AZCPS00F)
000740970624     A N61                                  DSPATR(CS)
000750970624     A N61                                  DSPATR(HI)
000760970624     A  61                                  DSPATR(RI)
000770970624     A  61                                  DSPATR(PC)
000780970624     A  90
000790970624     AO 91                                  DSPATR(PR)
000800970624     A                                  6  2'Località ...................:'
000810970624     A            VIDLOC    R     A  B  6 32REFFLD(CPSLOC AZCPS00F)
000820970624     A N62                                  DSPATR(CS)
000830970624     A N62                                  DSPATR(HI)
000840970624     A  62                                  DSPATR(RI)
000850970624     A  62                                  DSPATR(PC)
000860970624     A  90
000870970624     AO 91                                  DSPATR(PR)
000880970624     A                                  7  2'Sinonimo ...................:'
000890970624     A            VIDSIN    R     A  B  7 32REFFLD(CPSSIN AZCPS00F)
000900970624     A N63                                  DSPATR(CS)
000910970624     A N63                                  DSPATR(HI)
000920970624     A  63                                  DSPATR(RI)
000930970624     A  63                                  DSPATR(PC)
000940970624     A  91                                  DSPATR(PR)
000950970526     A*-------------------------------------------------------------------------
000960970603     A          R SI36DMS                   SFL
000970970526     A                                      SFLMSGRCD(24)
000980970526     A            MSGKEY                    SFLMSGKEY
000990970526     A            MSGQUE                    SFLPGMQ
001000970526     A*-------------------------------------------------------------------------
001010970603     A          R SI36DMC                   SFLCTL(SI36DMS)
001020970526     A                                      OVERLAY
001030970526     A                                      SFLDSP
001040970526     A  40                                  SFLCLR
001050970526     A                                      SFLSIZ(0002)
001060970526     A                                      SFLPAG(0001)
