000001131008     A*%%***********************************************************************
000002131008     A*%%TS  RD  20131008  084306  EDPRM       REL-V7R1M0  5770-WDS
000003131008     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004131008     A*%%FI       0000000000000000000000000000000000000000000000000
000005131008     A*%%***********************************************************************
000006131008     A          R SIO6T
000007131008     A*%%***********************************************************************
000008131008     A*%%RI 00000
000009131008     A*%%FS 001
000010131008     A*%%***********************************************************************
000011131008     A                                      SKIPB(002)
000012131008     A            RSUT          20A  O     1
000013131008     A            PTITOLO       44A  O    74
000014131008     A                                   170
000015131008     A                                      'TISIO6R'
000016131008     A            WDATE          8  0O   179
000017131008     A                                      EDTWRD('  /  /    ')
000018131008     A                                   191
000019131008     A                                      'PAG.'
000020131008     A                                   195
000021131008     A                                      PAGNBR
000022131008     A                                      EDTCDE(Z)
000023131008     A            KNSIF     R     A  O     1
000024131008     A                                      REFFLD(KNSIF KPJBA)
000025131008     A                                      SPACEB(001)
000026131008     A            KNMUS     R        O    +1
000027131008     A                                      REFFLD(KNMUS KPJBA)
000028131008     A            PTITOLO2      70A  O    61
000029131008     A            UTIME          6  0O   179
000030131008     A                                      EDTWRD('  :  :  ')
000031131008     A                                     1
000032131008     A                                      SPACEB(002)
000033131008     A                                      '-----------------------------------
000034131008     A                                      ------------------------------------
000035131008     A                                      ------------------------------------
000036131008     A                                      ------------------------------------
000037131008     A                                      -----------------'
000038131008     A                                     1
000039131008     A                                      ' C A P   '
000040131008     A                                      SPACEB(001)
000041131008     A                                    11
000042131008     A                                      'LOCALITA''           '
000043131008     A            PINTLNA       16A  O   +17
000044131008     A                                    74
000045131008     A                                      '|'
000046131008     A                                    75
000047131008     A                                      '-------- R I T I R I -------'
000048131008     A                                   103
000049131008     A                                      '|'
000050131008     A                                   104
000051131008     A                                      '-------- C O N S E G N E -------'
000052131008     A                                   136
000053131008     A                                      '|'
000054131008     A                                   138
000055131008     A                                      'INSER./ULT.MODIFICA'
000056131008     A                                    74
000057131008     A                                      '|'
000058131008     A                                      SPACEB(001)
000059131008     A                                    76
000060131008     A                                      ' Standard   '
000061131008     A                                    90
000062131008     A                                      'Minimo'
000063131008     A                                    97
000064131008     A                                      'Max'
000065131008     A                                   103
000066131008     A                                      '|'
000067131008     A                                   105
000068131008     A                                      ' Standard   '
000069131008     A                                   119
000070131008     A                                      'Minimo'
000071131008     A                                   126
000072131008     A                                      'Max'
000073131008     A                                   132
000074131008     A                                      'Torg'
000075131008     A                                   136
000076131008     A                                      '|'
000077131008     A                                    74
000078131008     A                                      '|'
000079131008     A                                      SPACEB(001)
000080131008     A                                    76
000081131008     A                                      'Inizio Fine'
000082131008     A                                    90
000083131008     A                                      'Inizio'
000084131008     A                                    97
000085131008     A                                      'Fine'
000086131008     A                                   103
000087131008     A                                      '|'
000088131008     A                                   105
000089131008     A                                      'Inizio Fine'
000090131008     A                                   119
000091131008     A                                      'Inizio'
000092131008     A                                   126
000093131008     A                                      'Fine'
000094131008     A                                   133
000095131008     A                                      'hh'
000096131008     A                                   136
000097131008     A                                      '|'
000098131008     A                                   138
000099131008     A                                      'Utente'
000100131008     A                                   149
000101131008     A                                      'Data'
000102131008     A                                     1
000103131008     A                                      SPACEB(001)
000104131008     A                                      '-----------------------------------
000105131008     A                                      ------------------------------------
000106131008     A                                      ------------------------------------
000107131008     A                                      ------------------------------------
000108131008     A                                      -----------------'
000109131008     A*%%***********************************************************************
000110131008     A*%%SS
000111131008     A*%%CL 001
000112131008     A*%%CL 002
000113131008     A*%%CL 001
000114131008     A*%%CL 001
000115131008     A*%%CL 001
000116131008     A*%%CL 001
000117131008     A*%%***********************************************************************
000118131008     A          R SIO6D
000119131008     A*%%***********************************************************************
000120131008     A*%%RI 00000
000121131008     A*%%***********************************************************************
000122131008     A                                      SPACEB(001)
000123131008     A            PLNAD         20A  O    52
000124131008     A                                    74
000125131008     A                                      '|'
000126131008     A            POSTIS         4  0O    76
000127131008     A                                      EDTWRD('  :  ')
000128131008     A            POSTFS         4  0O    83
000129131008     A                                      EDTWRD('  :  ')
000130131008     A            POMIIS         4  0O    90
000131131008     A                                      EDTWRD('  :  ')
000132131008     A            POMXFS         4  0O    97
000133131008     A                                      EDTWRD('  :  ')
000134131008     A                                   103
000135131008     A                                      '|'
000136131008     A            POSTISC        4  0O   105
000137131008     A                                      EDTWRD('  :  ')
000138131008     A            POSTFSC        4  0O   112
000139131008     A                                      EDTWRD('  :  ')
000140131008     A            POMIISC        4  0O   119
000141131008     A                                      EDTWRD('  :  ')
000142131008     A            POMXFSC        4  0O   126
000143131008     A                                      EDTWRD('  :  ')
000144131008     A            PTRZSC         2  0O   133
000145131008     A                                      EDTCDE(Z)
000146131008     A                                   136
000147131008     A                                      '|'
000148131008     A            PUTE          10A  O   138
000149131008     A            PDUV           6  0O   149
000150131008     A                                      EDTWRD('  /  /  ')
000151131008     A            PCAP           9A  O     1
000152131008     A            PLOC          35A  O    +1
000153131008     A  21        PLNA           3  0O    48
000154131008     A            PSTD          24A  O    48
000155131008     A*%%***********************************************************************
000156131008     A*%%SS
000157131008     A*%%***********************************************************************
000158131008     A          R FINES
000159131008     A*%%***********************************************************************
000160131008     A*%%RI 00000
000161131008     A*%%FS 001
000162131008     A*%%***********************************************************************
000163131008     A                                      SPACEB(002)
000164131008     A                                    48
000165131008     A                                      '***  FINE STAMPA  ***'
000166131008     A*%%***********************************************************************
000167131008     A*%%SS
000168131008     A*%%CP+999CRTPRTF
000169131008     A*%%CP+    FILE(GAITRAFIL/TISIO6P)
000170131008     A*%%CP+    DEVTYPE(*SCS)
000171131008     A*%%CP+    PAGESIZE(*N 198)
000172131008     A*%%CP+    CPI(15)
000173131008     A*%%CP     OVRFLW(61)
000174131008     A*%%***********************************************************************
