000100970603     A*--------------------------------------------------------------------------------------------*
000200970603     A* AGGIORNA UNA LOCALITA' DAI SUOI ARCHIVI                                                    *
000300970603     A*--------------------------------------------------------------------------------------------*
000400970603     A                                      REF(CNDIZION)
000500970603     A          R D82REC                    TEXT('AGGIORNAMENTO LOCALITA''')
000600970603    ?A*---
000700970603    ?A* Dati input
000800970603    ?A*---
000900970603     A            D82VER    R     S         REFFLD(CPRVER *LIBL/AZCPR00F)
001000970603     A            D82NAR    R               REFFLD(CPCNAR *LIBL/AZCPC00F)
001100970603     A            D82CAP    R               REFFLD(CPCCAP *LIBL/AZCPC00F)
001200970611     A            D82LOC    R               REFFLD(CPLLOC *LIBL/AZCPL00F)
001300970603     A            D82CHK         1          TEXT('CONTROLLO: S=SIN,V=VIE')
