000100970515     A*------------------------------------------------------------------------*
000200060515     A* DS INPUT/OUTPUT X CALCOLO INSTRADAMENTO CAPPARIO CAP - DPD GEOPOST
000300970515     A*------------------------------------------------------------------------*
000400060515     A          R TISIE300                  TEXT('INSTRADAMENTO CAPPARIO DPD')
000500060515     A*******
000600060515     A* PARAMETRI "IN"
000700060515     A*******
000800060516     A            ISIE3TLA       1A         TEXT('LANCIO: C=LR E=EXE+RT " "=EXE-
000900060516     A                                      +LR')
001000060515     A            ISIE3DRI  R               REFFLD(CVEDDE DPCVE00F)
001100060515     A                                      TEXT('DATA RIFERIMENTO')
001200060515     A                                      COLHDG('DATA RIF.')
001300060515     A            ISIE3DSP       8S 0       TEXT('DATA SPEDIZIONE (AAAAMMGG)')
001400060515     A            ISIE3HSP       6S 0       TEXT('ORA  SPEDIZIONE (HHMMSS)')
001500060515     A            ISIE3NZD  R               REFFLD(CCCISO3 DPCCC00F)
001600060515     A                                      TEXT('NAZIONE DESTINATARIO')
001700060515     A            ISIE3CAD  R               REFFLD(CROPTCB DPCRO00F)
001800060515     A                                      TEXT('CAP DESTINATARIO')
001900060515     A            ISIE3AREA R               REFFLD(CLOAREA DPCLO00F)
002000060515     A                                      TEXT('AREA DESTINATARIO (OPZ)')
002100060515     A            ISIE3CTY  R               REFFLD(CLOCTY DPCLO00F)
002200060515     A                                      TEXT('CITY DESTINATARIO (OPZ)')
002300060515     A            ISIE3SRV  R               REFFLD(CROSRVC DPCRO00F)
002400060515     A                                      TEXT('SERVIZIO DPD')
002500060515     A            ISIE3LNP  R               REFFLD(TASLNP TITAS00F)
002600060515     A                                      TEXT('LINEA DI PARTENZA')
002700060515     A            ISIE3EXC       1A         TEXT('ECCEZIONI BARTOLINI: Y/N')
002800060531     A*******
002900060531     A* PARAMETRI "INPUT MODIFICATO"
003000060531     A*******
003100060531     A            USIE3CAD  R               REFFLD(CROPTCB DPCRO00F)
003200060531     A                                      TEXT('CAP DESTINATARIO UTILIZZATO')
003300060515     A*******
003400060515     A* PARAMETRI "OUT"
003500060515     A*******
003600060515     A            OSIE3VER  R               REFFLD(CVEVER DPCVE00F)
003700060515     A                                      TEXT('VERSIONE BARTOLINI')
003800060515     A            OSIE3VERD R               REFFLD(CVEVERD DPCVE00F)
003900060515     A                                      TEXT('VERSIONE DPD')
004000060515     A            OSIE3DDE  R               REFFLD(CVEDDE DPCVE00F)
004100060515     A                                      TEXT('DATA DECORRENZA')
004200060515     A            OSIE3NAZN R               REFFLD(CCCISOK DPCCC00F)
004300060515     A                                      TEXT('NAZIONE ISO NUMERICA')
004400060515     A            OSIE3NAZ2 R               REFFLD(CCCISO2 DPCCC00F)
004500060515     A                                      TEXT('NAZIONE ISO ALFA2')
004600060515     A            OSIE3NAZ3 R               REFFLD(CCCISO3 DPCCC00F)
004700060515     A                                      TEXT('NAZIONE ISO ALFA3')
004800060515     A            OSIE3SRVM R               REFFLD(CSCSRVM DPCSC00F)
004900060515     A                                      TEXT('SERVICE MARK')
005000060515     A            OSIE3SRVD R               REFFLD(CSCSRVD DPCSC00F)
005100060515     A                                      TEXT('SERVICE PRINT DESCRIPTION')
005200060515     A            OSIE3OSRT R               REFFLD(CROOSRT DPCRO00F)
005300060515     A                                      TEXT('O-SORT')
005400060515     A            OSIE3RDEP R               REFFLD(CRODDEP DPCRO00F)
005500060515     A                                      TEXT('DEPOT PARTENZA')
005600060515     A            OSIE3DDEP R               REFFLD(CRODDEP DPCRO00F)
005700060515     A                                      TEXT('D-DEPOT')
005800060515     A            OSIE3DSRT R               REFFLD(CRODSRT DPCRO00F)
005900060515     A                                      TEXT('D-SORT')
006000060515     A            OSIE3PTYG R               REFFLD(CROPTYG DPCRO00F)
006100060515     A                                      TEXT('GROUP PRIORITY')
006200060515     A            OSIE3BID  R               REFFLD(CROBID DPCRO00F)
006300060515     A                                      TEXT('BARCODE ID')
006400060516     A            OSIE3BIDP R               REFFLD(CROBIDP DPCRO00F)
006500060516     A                                      TEXT('BARCODE ID PRINT')
006600060530     A            OSIE3ALWIDR               REFFLD(CALID   DPCAL00F)
006700060530     A                                      TEXT('ALLOW ID')
006800060607     A            OSIE3NAZNDR               REFFLD(CCCISOK DPCCC00F)
006900060607     A                                      TEXT('NAZIONE ISO NUMERICA D-DEPOT')
007000060607     A            OSIE3NAZ2DR               REFFLD(CCCISO2 DPCCC00F)
007100060607     A                                      TEXT('NAZIONE ISO ALFA2 D-DEPOT')
007200060607     A            OSIE3NAZ3DR               REFFLD(CCCISO3 DPCCC00F)
007300060607     A                                      TEXT('NAZIONE ISO ALFA3 D-DEPOT')
007400060607     A            OSIE3IATADR               REFFLD(CDPIATA DPCDP00F)
007500060607     A                                      TEXT('IATA LIKE CODE D-DEPOT')
007600060515     A* ....
007700060515     A
007800060515     A            OSIE3ERR       1A         TEXT('FLAG ERRORE: *BLANKS=OK')
007900060515     A            OSIE3ERRL      2A         TEXT('LIVELLO ERRORE')
008000060520     A            OSIE3ERRD     70A         TEXT('MESSAGGIO ERRORE')
