000001131018     A*%%***********************************************************************
000002131018     A*%%TS  RD  20131018  133806  EDPRM       REL-V7R1M0  5770-WDS
000003131018     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004131018     A*%%FI       0000000000000000000000000000000000000000000000000
000005131018     A*%%***********************************************************************
000006131018     A          R SIO6T
000007131018     A*%%***********************************************************************
000008131018     A*%%RI 00000
000009131018     A*%%FS 001
000010131018     A*%%***********************************************************************
000011131018     A                                      SKIPB(002)
000012131018     A            RSUT          20A  O     1
000013131018     A            PTITOLO       44A  O    74
000014131018     A                                   170
000015131018     A                                      'TISIO6R'
000016131018     A            WDATE          8  0O   179
000017131018     A                                      EDTWRD('  /  /    ')
000018131018     A                                   191
000019131018     A                                      'PAG.'
000020131018     A                                   195
000021131018     A                                      PAGNBR
000022131018     A                                      EDTCDE(Z)
000023131018     A            KNSIF     R     A  O     1
000024131018     A                                      REFFLD(KNSIF KPJBA)
000025131018     A                                      SPACEB(001)
000026131018     A            KNMUS     R        O    +1
000027131018     A                                      REFFLD(KNMUS KPJBA)
000028131018     A            PTITOLO2      70A  O    61
000029131018     A            UTIME          6  0O   179
000030131018     A                                      EDTWRD('  :  :  ')
000031131018     A                                     1
000032131018     A                                      'Tempo Organizzazione Consegne in g-
000033131018     A                                      iornata:'
000034131018     A                                      SPACEB(002)
000035131018     A            PTRZSC         4  0O    44
000036131018     A                                      EDTWRD('  :  ')
000037131018     A                                    +1
000038131018     A                                      '(hh:mm)'
000039131018     A                                     1
000040131018     A                                      SPACEB(001)
000041131018     A                                      '-----------------------------------
000042131018     A                                      ------------------------------------
000043131018     A                                      ------------------------------------
000044131018     A                                      ------------------------------------
000045131018     A                                      --------------------'
000046131018     A                                     1
000047131018     A                                      ' C A P   '
000048131018     A                                      SPACEB(001)
000049131018     A                                    11
000050131018     A                                      'LOCALITA''           '
000051131018     A            PINTLNA       16A  O   +17
000052131018     A                                    74
000053131018     A                                      '|'
000054131018     A                                    75
000055131018     A                                      '----------- R I T I R I -----------
000056131018     A                                      -'
000057131018     A                                   110
000058131018     A                                      '|'
000059131018     A                                   111
000060131018     A                                      '----- C O N S E G N E ------'
000061131018     A                                   139
000062131018     A                                      '|'
000063131018     A                                   141
000064131018     A                                      'INSER./ULT.MODIFICA'
000065131018     A                                    74
000066131018     A                                      '|'
000067131018     A                                      SPACEB(001)
000068131018     A                                    76
000069131018     A                                      ' Standard   '
000070131018     A                                    +2
000071131018     A                                      '   Limiti Ritiro    '
000072131018     A                                   110
000073131018     A                                      '|'
000074131018     A                                   112
000075131018     A                                      'Minimo'
000076131018     A                                   119
000077131018     A                                      'Max'
000078131018     A                                   126
000079131018     A                                      ' Standard   '
000080131018     A                                   139
000081131018     A                                      '|'
000082131018     A                                    74
000083131018     A                                      '|'
000084131018     A                                      SPACEB(001)
000085131018     A                                    76
000086131018     A                                      'Inizio Fine'
000087131018     A                                    90
000088131018     A                                      'Comm. '
000089131018     A                                    96
000090131018     A                                      'NoComm'
000091131018     A                                   103
000092131018     A                                      'CliCod'
000093131018     A                                   110
000094131018     A                                      '|'
000095131018     A                                   112
000096131018     A                                      'Inizio'
000097131018     A                                   119
000098131018     A                                      'Fine'
000099131018     A                                   126
000100131018     A                                      'Inizio Fine'
000101131018     A                                   139
000102131018     A                                      '|'
000103131018     A                                   141
000104131018     A                                      'Utente'
000105131018     A                                   152
000106131018     A                                      'Data'
000107131018     A                                     1
000108131018     A                                      SPACEB(001)
000109131018     A                                      '-----------------------------------
000110131018     A                                      ------------------------------------
000111131018     A                                      ------------------------------------
000112131018     A                                      ------------------------------------
000113131018     A                                      --------------------'
000114131018     A*%%***********************************************************************
000115131018     A*%%SS
000116131018     A*%%CL 001
000117131018     A*%%CL 002
000118131018     A*%%CL 001
000119131018     A*%%CL 001
000120131018     A*%%CL 001
000121131018     A*%%CL 001
000122131018     A*%%CL 001
000123131018     A*%%***********************************************************************
000124131018     A          R SIO6D
000125131018     A*%%***********************************************************************
000126131018     A*%%RI 00000
000127131018     A*%%***********************************************************************
000128131018     A                                      SPACEB(001)
000129131018     A            PLNAD         20A  O    52
000130131018     A                                    74
000131131018     A                                      '|'
000132131018     A            POSTIS         4  0O    76
000133131018     A                                      EDTWRD('  :  ')
000134131018     A            POSTFS         4  0O    83
000135131018     A                                      EDTWRD('  :  ')
000136131018     A            PLRSC          4  0O    90
000137131018     A                                      EDTWRD('  :  ')
000138131018     A            PLRNC          4  0O    97
000139131018     A                                      EDTWRD('  :  ')
000140131018     A            PLRNK          4  0O   104
000141131018     A                                      EDTWRD('  :  ')
000142131018     A                                   110
000143131018     A                                      '|'
000144131018     A            POMIISC        4  0O   112
000145131018     A                                      EDTWRD('  :  ')
000146131018     A            POMXFSC        4  0O   119
000147131018     A                                      EDTWRD('  :  ')
000148131018     A            POSTISC        4  0O   126
000149131018     A                                      EDTWRD('  :  ')
000150131018     A            POSTFSC        4  0O   133
000151131018     A                                      EDTWRD('  :  ')
000152131018     A                                   139
000153131018     A                                      '|'
000154131018     A            PUTE          10A  O   141
000155131018     A            PDUV           6  0O   152
000156131018     A                                      EDTWRD('  /  /  ')
000157131018     A            PCAP           9A  O     1
000158131018     A            PLOC          35A  O    +1
000159131018     A  21        PLNA           3  0O    48
000160131018     A            PSTD          24A  O    48
000161131018     A*%%***********************************************************************
000162131018     A*%%SS
000163131018     A*%%***********************************************************************
000164131018     A          R FINES
000165131018     A*%%***********************************************************************
000166131018     A*%%RI 00000
000167131018     A*%%FS 001
000168131018     A*%%***********************************************************************
000169131018     A                                      SPACEB(002)
000170131018     A                                    48
000171131018     A                                      '***  FINE STAMPA  ***'
000172131018     A*%%***********************************************************************
000173131018     A*%%SS
000174131018     A*%%CP+999CRTPRTF
000175131018     A*%%CP+    CPI(15)
000176131018     A*%%CP+    OVRFLW(61)
000177131018     A*%%CP+    FILE(GAITRAFIL/TISIO6P)
000178131018     A*%%CP+    DEVTYPE(*SCS)
000179131018     A*%%CP     PAGESIZE(*N       198      *N     )
000180131018     A*%%***********************************************************************
