000010051216     A*%%TS  SD  20051216  101955  EDPRM       REL-V5R3M0  5722-WDS
000020971121     A*------------------------------------------------------------------------*
000030051216     A*%%EC
000040051216     A                                      DSPSIZ(24 80 *DS3)
000050051216     A                                      CHGINPDFT(HI CS)
000060051216     A                                      PRINT
000070051216     A                                      CF01
000080051216     A                                      CF02
000090051216     A                                      CF03
000100051216     A                                      CF04
000110051216     A                                      CF05
000120051216     A                                      CF06
000130051216     A                                      CF07
000140051216     A                                      CF08
000150051216     A                                      CF09
000160051216     A                                      CF10
000170051216     A                                      CF11
000180051216     A                                      CF12
000190051216     A                                      CF13
000200051216     A                                      CF14
000210051216     A                                      CF15
000220051216     A                                      CF16
000230051216     A                                      CF17
000240051216     A                                      CF18
000250051216     A                                      CF19
000260051216     A                                      CF20
000270051216     A                                      CF21
000280051216     A                                      CF22
000290051216     A                                      CF23
000300051216     A                                      CF24
000310051216     A                                      ROLLUP(97)
000320051216     A                                      ROLLDOWN(97)
000330051216     A                                      HELP
000340971121     A*------------------------------------------------------------------------*
000350971121     A          R SI27DVT
000360971121     A            DSFIRS        20A  O  1  2
000370971121     A                                  1 27'* AUTOMATISMI TEMPI DI TRAZIONE *'
000380971121     A                                      DSPATR(RI)
000390971121     A                                      DSPATR(UL)
000400971121     A                                  1 63'TISI27R'
000410971121     A                                  1 72DATE
000420971121     A                                      EDTCDE(Y)
000430971121     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000440971121     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000450971121     A                                  2 72TIME
000460971121     A*------------------------------------------------------------------------*
000470971121     A          R SI27DVF
000480971121     A                                      OVERLAY
000490971121     A            VFD001        19A  O 22  2
000500971121     A            VFD002        19A  O 22 22
000510971121     A            VFD003        19A  O 22 42
000520971121     A            VFD004        19A  O 22 62
000530971121     A            VFD005        19A  O 23  2
000540971121     A            VFD006        19A  O 23 22
000550971121     A            VFD007        19A  O 23 42
000560971121     A            VFD008        19A  O 23 62
000570971121     A*------------------------------------------------------------------------*
000580051216     A          R SI27DV1
000590051216     A*%%TS  SD  20051216  101955  EDPRM       REL-V5R3M0  5722-WDS
000600051216     A                                      OVERLAY
000610051216     A                                  4  2'Creazione tempi'
000620051216     A                                      DSPATR(HI)
000630051216     A                                  5  2'Tipo tempo ...............:'
000640051216     A            V1CTEM         1A  B  5 31
000650051216     A N60                                  DSPATR(HI)
000660051216     A  60                                  DSPATR(RI)
000670051216     A  60                                  DSPATR(PC)
000680051216     A                                  5 35'(P=Partenza, T=Trazione)'
000690051216     A                                  6  2'Simulazione lancio .......:'
000700051216     A            V1CSIM         1A  B  6 31
000710051216     A N61                                  DSPATR(HI)
000720051216     A  61                                  DSPATR(RI)
000730051216     A  61                                  DSPATR(PC)
000740051216     A                                  6 35'(S=Stampa, N=Aggiorna)'
000750051216     A                                  8  2'Data decorrenza ..........:'
000760051216     A            V1CDDE         8Y 0B  8 31EDTCDE(8)
000770051216     A                                      CHECK(RB)
000780051216     A N62                                  DSPATR(HI)
000790051216     A  62                                  DSPATR(RI)
000800051216     A  62                                  DSPATR(PC)
000810971121     A*------------------------------------------------------------------------*
000820971121     A          R SI27DVM                   SFL
000830971121     A                                      SFLMSGRCD(24)
000840971121     A            VMCKEY                    SFLMSGKEY
000850971121     A            VMCQUE                    SFLPGMQ
000860971121     A*------------------------------------------------------------------------*
000870971121     A          R SI27DVK                   SFLCTL(SI27DVM)
000880971121     A                                      OVERLAY
000890971121     A                                      SFLDSP
000900971121     A  40                                  SFLCLR
000910971121     A  44                                  SFLEND
000920971121     A                                      SFLSIZ(0002)
000930971121     A                                      SFLPAG(0001)
