000010080828     A*%%TS  SD  20080828  115653  EDPRM       REL-V5R4M0  5722-WDS
000020060922     A*---FILE : TISIQ1D  ------------------------------------------------------
000030060922     A*          CAPPARIO UTILIZZI PARTICOLARI
000040000000     A*-------------------------------------------------------------------------
000050080828     A*%%EC
000060080828     A                                      DSPSIZ(24 80 *DS3)
000070080828     A                                      CHGINPDFT(HI UL)
000080080828     A                                      PRINT
000090080828     A          R SIQ1D01
000100080828     A*%%TS  SD  20080828  115653  EDPRM       REL-V5R4M0  5722-WDS
000110080828     A  02 06
000120080828     AO 03
000130080828     AO 04                                  CF06
000140080828     A                                      CA03
000150080828     A                                      CF12
000160080828     A N11                                  CF07
000170080828     A  16                                  CF08
000180080828     A            V1HUTI         2A  H
000190080828     A  28        V1CMSG        78   M
000200080828     A            V1CRSU        20A  O  1  2
000210080828     A                                  1 25'** CAPPARIO UTILIZZI PARTICOLARI *-
000220080828     A                                      *'
000230080828     A                                      DSPATR(RI)
000240080828     A                                      DSPATR(UL)
000250080828     A                                  1 62'TISIQ1R'
000260080828     A                                  1 71DATE
000270080828     A                                      EDTCDE(Y)
000280080828     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000290080828     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000300080828     A  02                              2 35'  INSERIMENTO  '
000310080828     A                                      DSPATR(RI)
000320080828     A                                      DSPATR(HI)
000330080828     A  04                              2 35' MANUTENZIONE '
000340080828     A                                      DSPATR(HI)
000350080828     A  03                              2 35' ANNULLAMENTO '
000360080828     A                                      DSPATR(RI)
000370080828     A                                      DSPATR(HI)
000380080828     A  05                              2 35' INTERROGAZIONE '
000390080828     A                                      DSPATR(RI)
000400080828     A                                      DSPATR(HI)
000410080828     A                                  2 71TIME
000420080828     A                                  6  3'Nazione .............:'
000430080828     A            V1CNAR         3A  B  6 26
000440080828     A  40                                  DSPATR(PC)
000450080828     A  01
000460080828     AO 04
000470080828     AO 02 06                               DSPATR(PR)
000480080828     A N04                                  DSPATR(HI)
000490080828     A            V1DNAR        25A  O  6 32
000500080828     A                                  8  3'C. A. P. ............:'
000510080828     A            V1CCAP         9A  B  8 26
000520080828     A  41                                  DSPATR(PC)
000530080828     A  01
000540080828     AO 04
000550080828     AO 02 06                               DSPATR(PR)
000560080828     A N04                                  DSPATR(HI)
000570080828     A                                  4  3'Network ...........? :'
000580080828     A            V1CNTW         3A  B  4 26
000590080828     A  42                                  DSPATR(PC)
000600080828     A  01
000610080828     AO 04
000620080828     AO 02 06                               DSPATR(PR)
000630080828     A N04                                  DSPATR(HI)
000640080828     A            V1DNTW        20A  O  4 32
000650080828     A                                 11  3'Data Decorrenza .....:'
000660080828     A            V1CDDE         8Y 0B 11 26CHECK(RB)
000670080828     A                                      EDTWRD('  /  /    ')
000680080828     A  43                                  DSPATR(PC)
000690080828     A  01
000700080828     AO 02 06                               DSPATR(PR)
000710080828     A                                 13  3'Data Scadenza .......:'
000720080828     A            V1CDSC         8Y 0B 13 26CHECK(RB)
000730080828     A                                      EDTWRD('  /  /    ')
000740080828     A  44                                  DSPATR(PC)
000750080828     A  01
000760080828     AO 02 06                               DSPATR(PR)
000770080828     A                                 15  3'-----------------------------------
000780080828     A                                      ------------------------------------
000790080828     A                                      ---------'
000800080828     A  02N06                               DSPATR(ND)
000810080828     A                                 17 13'Bloccare tutte le spedizioni .....-
000820080828     A                                      ....:'
000830080828     A  02N06                               DSPATR(ND)
000840080828     A            V1CTUT         2A  B 17 53VALUES('SI' '  ')
000850080828     A  61                                  DSPATR(PC)
000860080828     A  01
000870080828     AO 02N06                               DSPATR(PR)
000880080828     A  02N06                               DSPATR(ND)
000890080828     A                                 17 57'(SI)'
000900080828     A  02N06                               DSPATR(ND)
000910080828     A                                 18 17'OPPURE'
000920080828     A  02N06                               DSPATR(ND)
000930080828     A                                 19 13'Bloccare spedizioni con C/Assegno -
000940080828     A                                      ....:'
000950080828     A  02N06                               DSPATR(ND)
000960080828     A            V1CCAS         2A  B 19 53VALUES('SI' '  ')
000970080828     A  01
000980080828     AO 02N06                               DSPATR(PR)
000990080828     A  02N06                               DSPATR(ND)
001000080828     A                                 19 57'(SI)'
001010080828     A  02N06                               DSPATR(ND)
001020080828     A                                 24  2'F3=Fine'
001030080828     A  02
001040080828     AO 03
001050080828     AO 04                             24 14'F6=Conferma'
001060080828     A  02N06                               DSPATR(ND)
001070080828     A N11                             24 33'F7=Cappario'
001080080828     A                                 24 69'F12=Ritorno'
001090080828     A                                 20 13'Bloccare spedizioni in porto asseg-
001100080828     A                                      nato:'
001110080828     A  02N06                               DSPATR(ND)
001120080828     A            V1CPAS         1A  B 20 53
001130080828     A  01
001140080828     AO 02N06                               DSPATR(PR)
001150080828     A                                      VALUES('S' 'O' ' ')
001160080828     A  02N06                               DSPATR(ND)
001170080828     A                                 20 57'(S=Si,O=Tranne'
001180080828     A  02N06                               DSPATR(ND)
001190080828     A                                 21 57' Se abbinate a ORM)'
001200080828     A  02N06                               DSPATR(ND)
001210080828     A                                  6 59'("*"=Tutte le nazioni)'
001220080828     A                                  8 59'("*"=Tutti i CAP)'
001230080828     A                                 16  3'SPEDIZIONI:'
001240080828     A  02N06                               DSPATR(ND)
001250080828     A                                 22  3'RITIRI:'
001260080828     A  02N06                               DSPATR(ND)
001270080828     A                                 23 13'Bloccare tutti i ritiri ..........-
001280080828     A                                      ....:'
001290080828     A  02N06                               DSPATR(ND)
001300080828     A                                 23 57'(SI)'
001310080828     A  02N06                               DSPATR(ND)
001320080828     A            V1CRIT         2A  B 23 53VALUES('SI' '  ')
001330080828     A  01
001340080828     AO 02N06                               DSPATR(PR)
001350080828     A  02N06                               DSPATR(ND)
001360080828     A  16                             24 47'F8=Contr.CAP/LOC'
001370060927     A          R SIQ1DW2
001380060927     A*%%TS  SD  20060927  102231  EDPES       REL-V5R3M0  5722-WDS
001390060927     A                                      KEEP
001400060927     A                                      ASSUME
001410060927     A                                      OVERLAY
001420060927     A                                      PUTOVR
001430060927     A                                  2 63' '
001440060927     A                                      OVRATR
001450060329     A*------------------------------------------------------------------------*
001460080521     A          R SIQ1DV2
001470080521     A*%%TS  SD  20080521  092832  EDPRM       REL-V5R4M0  5722-WDS
001480080521     A                                      WINDOW(2 2 5 74)
001490080521     A                                      CF06
001500080521     A                                      CF12
001510080521     A N11                                  CF07
001520080521     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
001530080521     A                                          '))
001540080521     A  28        V1CMSG        78   M
001550080521     A                                  1  2'Copia dal'
001560080521     A                                      DSPATR(HI)
001570080521     A                                  1 13'___C.A.P.____'
001580080521     A                                  1 28'NETWORK'
001590080521     A                                  1 37'DECORRENZA'
001600080521     A                                      DSPATR(HI)
001610080521     A                                  1 49'SCADENZA'
001620080521     A                                      DSPATR(HI)
001630080521     A                                  1 60'BOLLE'
001640080521     A                                      DSPATR(HI)
001650080521     A            V1CNAR         3A  O  2 13DSPATR(HI)
001660080521     A            V1CCAP         9A  O  2 17
001670080521     A            V1CNTW         3A  O  2 30
001680080521     A            V1CDDE         8Y 0O  2 37EDTWRD('  /  /    ')
001690080521     A            V1CDSC         8Y 0O  2 48EDTWRD('  /  /    ')
001700080521     A            V1CBOL         9A  O  2 59
001710080521     A                                  3  2'---->  al'
001720080521     A                                      DSPATR(HI)
001730080521     A            VVCNAR    R        B  3 13REFFLD(CPLNAR AZCPL00F)
001740080521     A                                      DSPATR(HI)
001750080521     A                                      DSPATR(CS)
001760080521     A  40                                  DSPATR(PC)
001770080521     A            VVCCAP         9A  B  3 17DSPATR(CS)
001780080521     A  41                                  DSPATR(PC)
001790080521     A                                  4  3'F6=Conferma'
001800080521     A N11                              4 33'F7=Cappario'
001810080521     A                                  4 59'F12=Ritorno'
001820080521     A                                  1 69'RITIRI'
001830080521     A                                      DSPATR(HI)
001840080521     A            V1CRIT         2A  O  2 71
