000010150210     A*%%TS  SD  20150210  112835  EDPBA       REL-V7R1M0  5770-WDS
000020970526     A*-------------------------------------------------------------------------
000030150210     A*%%EC
000040150210     A                                      DSPSIZ(24 80 *DS3)
000050150210     A                                      CHGINPDFT(HI)
000060150210     A                                      PRINT
000070150210     A                                      CF01
000080150210     A                                      CF02
000090150210     A                                      CF03
000100150210     A                                      CF04
000110150210     A                                      CF05
000120150210     A                                      CF06
000130150210     A                                      CF07
000140150210     A                                      CF08
000150150210     A                                      CF09
000160150210     A                                      CF11
000170150210     A                                      CF12
000180150210     A                                      CF13
000190150210     A                                      CF14
000200150210     A                                      CF15
000210150210     A                                      CF16
000220150210     A                                      CF17
000230150210     A                                      CF18
000240150210     A                                      CF19
000250150210     A                                      CF20
000260150210     A                                      CF21
000270150210     A                                      CF22
000280150210     A                                      CF23
000290150210     A                                      CF24
000300150210     A                                      ROLLUP
000310150210     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330021213     A          R SIG3D01
000340021212     A*%%TS  SD  20021212  092908  EDPFG       REL-V4R4M0  5769-PW1
000350021212     A                                      TEXT('Testata')
000360021212     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370021212     A                                  1 24'*GESTIONE MOVIMENTI  GABBIE/BANCAL-
000380021212     A                                      I*'
000390021212     A                                      DSPATR(RI)
000400021212     A                                      DSPATR(UL)
000410021212     A                                  1 61'TISIG3R'
000420021212     A                                  1 71DATE
000430021212     A                                      EDTCDE(Y)
000440021212     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000450021212     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000460021212     A            VIDING        16A  O  2 33DSPATR(RI)
000470021212     A                                      DSPATR(HI)
000480021212     A                                  2 71TIME
000490970526     A*-------------------------------------------------------------------------
000500021213     A          R SIG3D02
000510970526     A                                      TEXT('Opzioni')
000520970526     A                                      OVERLAY
000530970526     A                                  3  2'Immettere le opzioni e premere inv-
000540970526     A                                      io.'
000550970526     A            OPZ001        19A  O  4  2
000560970526     A            OPZ002        19A  O  4 22
000570970526     A            OPZ003        19A  O  4 42
000580970526     A            OPZ004        19A  O  4 62
000590970526     A            OPZ005        19A  O  5  2
000600970526     A            OPZ006        19A  O  5 22
000610970526     A            OPZ007        19A  O  5 42
000620970526     A            OPZ008        19A  O  5 62
000630970526     A*-------------------------------------------------------------------------
000640150210     A          R SIG3D03
000650150210     A*%%TS  SD  20150210  112835  EDPBA       REL-V7R1M0  5770-WDS
000660150210     A                                      TEXT('Parzializzazioni sfile')
000670150210     A                                      OVERLAY
000680150210     A                                  6 25'Saldo movimenti visualizzati:'
000690150210     A                                      DSPATR(UL)
000700150210     A            VIDSAL        18Y 5B  6 55EDTCDE(O)
000710150210     A                                      DSPATR(CS)
000720150210     A                                  8  2'Inizio el. ->'
000730150210     A                                      DSPATR(HI)
000740150210     A                                  8 16'Data movimento'
000750150210     A            VIDDA1         8Y 0B  8 31EDTWRD('  /  /    ')
000760150210     A N81                                  DSPATR(HI)
000770150210     A  81                                  DSPATR(RI)
000780150210     A  81                                  DSPATR(PC)
000790150210     A N81                                  DSPATR(CS)
000800150210     A                                      CHECK(RB)
000810150210     A                                  9  2'Selez. per ->'
000820150210     A                                      DSPATR(HI)
000830150210     A                                  9 16'Periodo da:'
000840150210     A            VIDPD2         8Y 0B  9 28EDTWRD('  /  /    ')
000850150210     A N88                                  DSPATR(HI)
000860150210     A  88                                  DSPATR(RI)
000870150210     A  88                                  DSPATR(PC)
000880150210     A N88                                  DSPATR(CS)
000890150210     A                                      CHECK(RB)
000900150210     A                                  9 40'al:'
000910150210     A            VIDPA2         8Y 0B  9 44EDTWRD('  /  /    ')
000920150210     A N89                                  DSPATR(HI)
000930150210     A  89                                  DSPATR(RI)
000940150210     A  89                                  DSPATR(PC)
000950150210     A N89                                  DSPATR(CS)
000960150210     A                                      CHECK(RB)
000970150210     A                                  9 56'Fil.inserimento(?):'
000980150210     A            VIDPI2         3A  B  9 76
000990150210     A N80                                  DSPATR(HI)
001000150210     A  80                                  DSPATR(RI)
001010150210     A  80                                  DSPATR(PC)
001020150210     A N80                                  DSPATR(CS)
001030150210     A                                      CHECK(RZ)
001040150210     A                                 10 16'Sogg.:'
001050150210     A                                 10 23'Fil.(?)'
001060150210     A            VIDPO2         3A  B 10 31
001070150210     A N82                                  DSPATR(HI)
001080150210     A  82                                  DSPATR(RI)
001090150210     A  82                                  DSPATR(PC)
001100150210     A N82                                  DSPATR(CS)
001110150210     A                                      CHECK(RZ)
001120150210     A                                 10 36'Cliente(?)'
001130150210     A            VIDKS2         7A  B 10 47
001140150210     A N83                                  DSPATR(HI)
001150150210     A  83                                  DSPATR(RI)
001160150210     A  83                                  DSPATR(PC)
001170150210     A N83                                  DSPATR(CS)
001180150210     A                                      CHECK(RZ)
001190150210     A                                 10 56'Destinatario(?)'
001200150210     A                                      DSPATR(ND)
001210150210     A            VIDDS2         7A  B 10 72
001220150210     A N84                                  DSPATR(HI)
001230150210     A  84                                  DSPATR(RI)
001240150210     A  84                                  DSPATR(PC)
001250150210     A                                      CHECK(RZ)
001260150210     A                                      DSPATR(ND)
001270150210     A                                      DSPATR(PR)
001280150210     A                                 11 16'Causale(?)'
001290150210     A            VIDCA2    R        B 11 27REFFLD(MGBCAU AZMGB00F)
001300150210     A N85                                  DSPATR(HI)
001310150210     A  85                                  DSPATR(RI)
001320150210     A  85                                  DSPATR(PC)
001330150210     A N85                                  DSPATR(CS)
001340150210     A                                 11 33'Articolo(?)'
001350150210     A            VIDCO2    R        B 11 45REFFLD(MGBCOD AZMGB00F)
001360150210     A N86                                  DSPATR(HI)
001370150210     A  86                                  DSPATR(RI)
001380150210     A  86                                  DSPATR(PC)
001390150210     A N86                                  DSPATR(CS)
001400150210     A                                 11 62'Utente'
001410150210     A            VIDUT2    R        B 11 69REFFLD(MGBUTE AZMGB00F)
001420150210     A N87                                  DSPATR(HI)
001430150210     A  87                                  DSPATR(RI)
001440150210     A  87                                  DSPATR(PC)
001450150210     A N87                                  DSPATR(CS)
001460970526     A*-------------------------------------------------------------------------
001470030325     A          R SIG3D04
001480030325     A*%%TS  SD  20030325  142806  EDPFG       REL-V4R4M0  5769-PW1
001490030325     A                                      TEXT('Intestazione sfile')
001500030325     A                                      OVERLAY
001510030325     A                                 12  2'Op    Data       Ora   Soggetto   -
001520030325     A                                        Articolo        Quantità         -
001530030325     A                                         Causale'
001540030325     A                                      DSPATR(RI)
001550970526     A*-------------------------------------------------------------------------
001560070509     A          R SIG3D05                   SFL
001570070509     A*%%TS  SD  20070509  152140  EDPMB       REL-V5R3M0  5722-WDS
001580070509     A                                      TEXT('Sfile dati')
001590070509     A  41                                  SFLNXTCHG
001600070509     A            VIHUTE    R        H      REFFLD(MGBUTE AZMGB00F)
001610070509     A            VIHPRG    R        H      REFFLD(MGBPRG AZMGB00F)
001620070509     A            VIHTIP    R        H      REFFLD(MGBTIP AZMGB00F)
001630070509     A            VIHFORZA       1A  H
001640070509     A            OPZKEY         2A  B 13  2CHGINPDFT
001650070509     A                                      DSPATR(UL)
001660070509     A            VIDDAT    R        O 13  5REFFLD(MGBDAT AZMGB00F)
001670070509     A                                      EDTWRD('    /  /  ')
001680070509     A            VIDORA    R        O 13 16REFFLD(MGBORA AZMGB00F)
001690070509     A                                      EDTWRD('  :  :  ')
001700070509     A            VIDSOG    R        O 13 25REFFLD(MGBSOG AZMGB00F)
001710070509     A            VIDDSO         3A  O 13 34
001720070509     A            VIDCOD    R        O 13 38REFFLD(MGBCOD AZMGB00F)
001730070509     A            VIDQTA    R        O 13 54REFFLD(MGBQTA AZMGB00F)
001740070509     A                                      EDTCDE(O)
001750070509     A            VIDCAU    R        O 13 74REFFLD(MGBCAU AZMGB00F)
001760070509     A            VIDTIM    R        O 13 79REFFLD(MGBTIM AZMGB00F)
001770070509     A            VIDRAG        25A  O 14 25
001780970526     A*-------------------------------------------------------------------------
001790030325     A          R SIG3D06                   SFLCTL(SIG3D05)
001800030325     A*%%TS  SD  20030325  140342  EDPFG       REL-V4R4M0  5769-PW1
001810030325     A                                      TEXT('Sfile control')
001820030325     A                                      BLINK
001830030325     A                                      OVERLAY
001840030325     A N40                                  SFLDSP
001850030325     A N40                                  SFLDSPCTL
001860030325     A  40                                  SFLCLR
001870030325     A                                      SFLDROP(CF09)
001880030325     A                                      SFLSIZ(0005)
001890030325     A                                      SFLPAG(0004)
001900030325     A            SFLNBR         4S 0H      SFLRCDNBR(CURSOR)
001910970526     A*-------------------------------------------------------------------------
001920021213     A          R SIG3DMS                   SFL
001930970526     A                                      TEXT('Sfile messaggi')
001940970526     A                                      SFLMSGRCD(24)
001950970526     A            MSGKEY                    SFLMSGKEY
001960970526     A            MSGQUE                    SFLPGMQ(10)
001970970526     A*-------------------------------------------------------------------------
001980021213     A          R SIG3DMC                   SFLCTL(SIG3DMS)
001990991025     A*%%TS  SD  19991025  152842  EDPMM       REL-V4R2M0  5769-PW1
002000991025     A                                      TEXT('Sfile control messaggi')
002010991025     A                                      OVERLAY
002020991025     A                                      SFLDSP
002030991025     A  40                                  SFLCLR
002040991025     A                                      SFLSIZ(0002)
002050991025     A                                      SFLPAG(0001)
002060970526     A*-------------------------------------------------------------------------
002070021213     A          R SIG3D09
002080970526     A                                      TEXT('Funzioni')
002090970526     A                                      OVERLAY
002100970526     A            FUN001        19A  O 22  2
002110970526     A            FUN002        19A  O 22 22
002120970526     A            FUN003        19A  O 22 42
002130970526     A            FUN004        19A  O 22 62
002140970526     A            FUN005        19A  O 23  2
002150970526     A            FUN006        19A  O 23 22
002160970526     A            FUN007        19A  O 23 42
002170970526     A            FUN008        19A  O 23 62
002180970526     A*-------------------------------------------------------------------------
002190021213     A          R SIG3D0A
002200970526     A                                      OVERLAY
002210970526     A                                      PUTOVR
002220970526     A                                      OVRDTA
002230970526     A                                      OVRATR
002240030305     A                                 13 16'NON VI SONO DATI CON LE CARATTERIS-
002250970526     A                                      TICHE RICHIESTE'
002260970526     A                                      DSPATR(HI)
002270030305     A*         R SIG3D0A
002280030305     A          R SIG3D1A
002290030305     A*%%TS  SD  20030305  174848  EDPFG       REL-V4R4M0  5769-PW1
002300030305     A                                      OVERLAY
002310030305     A                                      PUTOVR
002320030305     A                                      OVRDTA
002330030305     A                                      OVRATR
002340030305     A                                 13 16'IMMETTERE SELEZIONI PER PARZIALIZZ-
002350030305     A                                      AZIONE DATI    '
002360030305     A                                      DSPATR(HI)
