000100051117      ****** PAGESIZE(66 132) OVRFLW(60) CPI(15) LPI(8)
000200051117      *PARMS PAGESIZE(88 120) OVRFLW(80) CPI(15) LPI(8)
000300051117      *---------------------------------------------------------------*
000400040628     A          R SI65TE
000500040628     A                                      SKIPB(001)
000600040628     A                                      SPACEB(013)
000700040628     A                                     1
000800040628     A                                      'lì'
000900040628     A                                     5
001000040628     A                                      DATE(*YY)
001100040628     A                                      EDTCDE(Y)
001200040628     A                                    54
001300040628     A                                      'PICKUP - AREA'
001400040628     A                                      HIGHLIGHT
001500040628     A                                   108
001600040628     A                                      'PAG.'
001700040628     A                                   112
001800040628     A                                      PAGNBR
001900040628     A                                      EDTCDE(Z)
002000040628     A            STPTSP        25A  O     1
002100040628     A                                      SPACEB(002)
002200051117     ***A  20                                56
002300051117     ***A                                      'Città'
002400051117     ***A                                      SPACEB(001)
002500051117     ***A  20                                69
002600051117     ***A                                      'Provincia'
002700051117     ***A  21                                84
002800051117     ***A                                      'Disagiata'
002900051117     ***A  22                               101
003000051117     ***A                                      'Isola'
003100051117     ***A  20        STPIOC         1A  O   113
003200051117     ***A  20                                53
003300051117     ***A                                      'MAT.'
003400051117     ***A                                      SPACEB(001)
003500051117     ***A  20                                60
003600051117     ***A                                      'POM.'
003700051117     ***A  20                                68
003800051117     ***A                                      'MAT.'
003900051117     ***A  20                                75
004000051117     ***A                                      'POM.'
004100051117     ***A  21                                83
004200051117     ***A                                      'MAT.'
004300051117     ***A  21                                90
004400051117     ***A                                      'POM.'
004500051117     ***A  22                                98
004600051117     ***A                                      'MAT.'
004700051117     ***A  22                               105
004800051117     ***A                                      'POM.'
004900051117     ***A  20                                53
005000051117     ***A                                      '-----------------------------------
005100051117     ***A                                      -----------------------'
005200051117     ***A                                      SPACEB(001)
005300051117      *---------------------------------------------------------------*
005400040628     A          R SI65RE
005500040628     A            STPREG1      115A  O     2
005600040628     A                                      SPACEB(001)
005700040628     A                                      HIGHLIGHT
005800051117      *---------------------------------------------------------------*
005900040628     A          R SI65DE
006000040628     A                                      SPACEB(001)
006100040628     A            STPREG        20A  O     2
006200051117     ***A  20        STPMATMC       2S  O    53
006300051117     ***A                                      EDTCDE(4)
006400051117     ***A  20        STPX1          1A  O    55
006500051117     ***A  20        STPMATXC       2S  O    56
006600051117     ***A                                      EDTCDE(4)
006700051117     ***A  20        STPPOMMC       2S  O    60
006800051117     ***A                                      EDTCDE(4)
006900051117     ***A  20        STPX2          1A  O    62
007000051117     ***A  20        STPPOMXC       2S  O    63
007100051117     ***A                                      EDTCDE(4)
007200051117     ***A  20        STPMATMP       2S  O    68
007300051117     ***A                                      EDTCDE(4)
007400051117     ***A  20        STPX3          1A  O    70
007500051117     ***A  20        STPMATXP       2S  O    71
007600051117     ***A                                      EDTCDE(4)
007700051117     ***A  20        STPPOMMP       2S  O    75
007800051117     ***A                                      EDTCDE(4)
007900051117     ***A  20        STPX4          1A  O    77
008000051117     ***A  20        STPPOMXP       2S  O    78
008100051117     ***A                                      EDTCDE(4)
008200051117     ***A  20        STPMATMD       2S  O    83
008300051117     ***A                                      EDTCDE(4)
008400051117     ***A  20        STPX5          1A  O    85
008500051117     ***A  20        STPMATXD       2S  O    86
008600051117     ***A                                      EDTCDE(4)
008700051117     ***A  20        STPPOMMD       2S  O    90
008800051117     ***A                                      EDTCDE(4)
008900051117     ***A  20        STPX6          1A  O    92
009000051117     ***A  20        STPPOMXD       2S  O    93
009100051117     ***A                                      EDTCDE(4)
009200051117     ***A  20        STPMATMI       2S  O    98
009300051117     ***A                                      EDTCDE(4)
009400051117     ***A  20        STPX7          1A  O   100
009500051117     ***A  20        STPMATXI       2S  O   101
009600051117     ***A                                      EDTCDE(4)
009700051117     ***A  20        STPPOMMI       2S  O   105
009800051117     ***A                                      EDTCDE(4)
009900051117     ***A  20        STPX8          1A  O   107
010000051117     ***A  20        STPPOMXI       2S  O   108
010100051117     ***A                                      EDTCDE(4)
010200051117      *---------------------------------------------------------------*
010300040628     A          R SI65EC
010400040628     A                                      SPACEB(001)
010500040628     A            STPECC       105A  O     2
010600051117      *---------------------------------------------------------------*
010700040628     A          R SI65LO
010800040628     A                                      SPACEB(001)
010900040628     A            STPDETT       20A  O     2
011000040628     A            STPLIST       87A  O    24
011100051117     ***A  23
011200051117     ***AO 20                               112
011300051117     ***A                                      'M'
011400051117     ***A  23
011500051117     ***AO 20        STPDLVMAT      2S  O   113
011600051117     ***A                                      EDTCDE(4)
011700051117     ***A  23
011800051117     ***AO 20                               116
011900051117     ***A                                      'P'
012000051117     ***A  23
012100051117     ***AO 20        STPDLVPOM      2S  O   117
012200051117     ***A                                      EDTCDE(4)
012300051117      *---------------------------------------------------------------*
012400040628     A          R SI65RI
012500040628     A                                      SPACEB(001)
012600040628     A                                     1
012700040628     A                                      '                                  -
012800040628     A                                                                         -
012900040628     A                                                           '
013000051117      *---------------------------------------------------------------*
013100040628     A          R SI65NO
013200040628     A            STPNOT1       75A  O    21
013300040628     A                                      SPACEB(001)
013400040628     A            STPNOT2       75A  O    21
013500040628     A                                      SPACEB(001)
013600040628     A            STPNOT3       75A  O    21
013700040628     A                                      SPACEB(001)
013800040628     A*------------------------------------------------------------------------*
013900040628     A* FINE PROSPETTO
014000040628     A*------------------------------------------------------------------------*
014100040628     A          R SI65FI
014200040628     A                                      SPACEB(001)
014300040628     A                                    38
014400040628     A                                      '***    F I N E    P R O S P E T T -
014500040628     A                                      O    ***'
