000010061205     A*%%TS  SD  20061205  104129  EDPES       REL-V5R3M0  5722-WDS
000020971121     A*------------------------------------------------------------------------*
000030061205     A*%%EC
000040061205     A                                      DSPSIZ(24 80 *DS3)
000050061205     A                                      CHGINPDFT(HI CS)
000060061205     A                                      PRINT
000070061205     A                                      CF01
000080061205     A                                      CF02
000090061205     A                                      CF03
000100061205     A                                      CF04
000110061205     A                                      CF05
000120061205     A                                      CF06
000130061205     A                                      CF07
000140061205     A                                      CF08
000150061205     A                                      CF09
000160061205     A                                      CF10
000170061205     A                                      CF11
000180061205     A                                      CF12
000190061205     A                                      CF13
000200061205     A                                      CF14
000210061205     A                                      CF15
000220061205     A                                      CF16
000230061205     A                                      CF17
000240061205     A                                      CF18
000250061205     A                                      CF19
000260061205     A                                      CF20
000270061205     A                                      CF21
000280061205     A                                      CF22
000290061205     A                                      CF23
000300061205     A                                      CF24
000310061205     A                                      ROLLUP(97)
000320061205     A                                      ROLLDOWN(97)
000330061205     A                                      HELP
000340971121     A*------------------------------------------------------------------------*
000350971121     A          R SI27DVT
000360971121     A            DSFIRS        20A  O  1  2
000370971121     A                                  1 27'* AUTOMATISMI TEMPI DI TRAZIONE *'
000380971121     A                                      DSPATR(RI)
000390971121     A                                      DSPATR(UL)
000400971121     A                                  1 63'TISI27R'
000410971121     A                                  1 72DATE
000420971121     A                                      EDTCDE(Y)
000430971121     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000440971121     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000450971121     A                                  2 72TIME
000460971121     A*------------------------------------------------------------------------*
000470971121     A          R SI27DVF
000480971121     A                                      OVERLAY
000490971121     A            VFD001        19A  O 22  2
000500971121     A            VFD002        19A  O 22 22
000510971121     A            VFD003        19A  O 22 42
000520971121     A            VFD004        19A  O 22 62
000530971121     A            VFD005        19A  O 23  2
000540971121     A            VFD006        19A  O 23 22
000550971121     A            VFD007        19A  O 23 42
000560971121     A            VFD008        19A  O 23 62
000570971121     A*------------------------------------------------------------------------*
000580061205     A          R SI27DV1
000590061205     A*%%TS  SD  20061205  104129  EDPES       REL-V5R3M0  5722-WDS
000600061205     A                                      OVERLAY
000610061205     A                                  4  2'Creazione tempi'
000620061205     A                                      DSPATR(HI)
000630061205     A                                  5  2'Tipo tempo ...............:'
000640061205     A            V1CTEM         1A  B  5 31
000650061205     A N60                                  DSPATR(HI)
000660061205     A  60                                  DSPATR(RI)
000670061205     A  60                                  DSPATR(PC)
000680061205     A                                  5 35'(P=Partenza, T=Trazione)'
000690061205     A                                  6  2'Simulazione lancio .......:'
000700061205     A            V1CSIM         1A  B  6 31
000710061205     A N61                                  DSPATR(HI)
000720061205     A  61                                  DSPATR(RI)
000730061205     A  61                                  DSPATR(PC)
000740061205     A                                  6 35'(S=Stampa, N=Aggiorna)'
000750061205     A                                  8  2'Data decorrenza ..........:'
000760061205     A            V1CDDE         8Y 0B  8 31EDTCDE(8)
000770061205     A                                      CHECK(RB)
000780061205     A N62                                  DSPATR(HI)
000790061205     A  62                                  DSPATR(RI)
000800061205     A  62                                  DSPATR(PC)
000810061205     A                                 11  2'Solo per tempi di TRAZIONE :'
000820061205     A                                      DSPATR(HI)
000830061205     A                                 12 11'per il terminal ..........:'
000840061205     A            V1CTFP         3Y 0B 12 39CHECK(RZ)
000850061205     A N63                                  DSPATR(HI)
000860061205     A  63                                  DSPATR(RI)
000870061205     A  63                                  DSPATR(PC)
000880061205     A            V1DTFP        25A  O 12 45
000890061205     A                                 14 11'copiando dal terminal ....:'
000900061205     A            V1CTPCPY       3Y 0B 14 39CHECK(RZ)
000910061205     A N64                                  DSPATR(HI)
000920061205     A  64                                  DSPATR(RI)
000930061205     A  64                                  DSPATR(PC)
000940061205     A            V1DTPCPY      25A  O 14 45
000950971121     A*------------------------------------------------------------------------*
000960971121     A          R SI27DVM                   SFL
000970971121     A                                      SFLMSGRCD(24)
000980971121     A            VMCKEY                    SFLMSGKEY
000990971121     A            VMCQUE                    SFLPGMQ
001000971121     A*------------------------------------------------------------------------*
001010971121     A          R SI27DVK                   SFLCTL(SI27DVM)
001020971121     A                                      OVERLAY
001030971121     A                                      SFLDSP
001040971121     A  40                                  SFLCLR
001050971121     A  44                                  SFLEND
001060971121     A                                      SFLSIZ(0002)
001070971121     A                                      SFLPAG(0001)
