000100050623     A          R COMMITC000
000200050623     A            IDA            3  0
000300050623     A                                      EDTCDE(Z)
000400050623     A            IDC            3  0
000500050623     A                                      EDTCDE(Z)
000600050623     A            IMPORTO        5  2
000700050623     A                                      EDTCDE(K)
