000100050623     A          R COMMITA000
000200050623     A            IDA            3  0
000300050623     A                                      EDTCDE(Z)
000400050623     A            IMPORTOB       7  2
000500050623     A                                      EDTCDE(K)
000600050623     A            IMPORTOC       7  2
000700050623     A                                      EDTCDE(K)
