000001170526     A*%%***********************************************************************
000002170526     A*%%TS  RD  20170526  133711  EDPMB       REL-V7R2M0  5770-WDS
000003170526     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004170526     A*%%FI       0000000000000000000000000000000000000000000000000
000005170526     A*%%***********************************************************************
000006170526      *PARMS PAGESIZE(66 124 *ROWCOL) LPI(6) CPI(16,7) OVRFLW(65)
000007170526      *---------------------------------------------------------------*
000008170526     A          R TA54PPP
000009170526     A*%%***********************************************************************
000010170526     A*%%RI 00000
000011170526     A*%%FS 009
000012170526     A*%%***********************************************************************
000013170526     A                                      SKIPB(010)
000014170526     A            BIANCO         1A  O     1
000015170526     A*%%***********************************************************************
000016170526     A*%%SS
000017170526     A*%%***********************************************************************
000018170526      *---------------------------------------------------------------*
000019170526     A          R TA54P01
000020170526     A*%%***********************************************************************
000021170526     A*%%RI 00000
000022170526     A*%%***********************************************************************
000023170526     A                                      SPACEB(001)
000024170526     A                                    10
000025170526     A                                      'Filiale de:'
000026170526     A            TD1FIL        20A  O    10
000027170526     A                                      SPACEB(001)
000028170526     A            TD1VIA        25A  O    10
000029170526     A                                      SPACEB(001)
000030170526     A            TD1CAP         5S 0O    10
000031170526     A                                      SPACEB(001)
000032170526     A                                      EDTCDE(Z)
000033170526     A            TD1LOC        25A  O    16
000034170526     A            TD1PRV         2A  O    42
000035170526     A                                    10
000036170526     A                                      'Tel.'
000037170526     A                                      SPACEB(001)
000038170526     A            TD2TEL        13A  O    15
000039170526     A                                    29
000040170526     A                                      'Fax.'
000041170526     A            TD2TFX        13A  O    34
000042170526     A            PICRAG        48A  O    71
000043170526     A            PICIND        35A  O    71
000044170526     A                                      SPACEB(001)
000045170526     A            PICCAP         9A  O    71
000046170526     A                                      SPACEB(001)
000047170526     A            PICLOC        30A  O    81
000048170526     A            PICPRO         2A  O   112
000049170526     A  70                                10
000050170526     A                                      'ns. Réf'
000051170526     A                                      SPACEB(001)
000052170526     A  70        PICNR1         2A  O    18
000053170526     A  70                                21
000054170526     A                                      '/'
000055170526     A  70        PICNR2         2A  O    23
000056170526     A            DESNAR        25A  O    71
000057170526     A  73                                54
000058170526     A                                      'A l''attention de'
000059170526     A                                      SPACEB(002)
000060170526     A  73        RESPTRA       50A  O    71
000061170526     A  77        RESPTRA2      50A  O    71
000062170526     A                                      SPACEB(001)
000063170526     A                                    10
000064170526     A                                      'Au téléphone, demander M.'
000065170526     A                                      SPACEB(002)
000066170526     A            DESCOM        20A  O    +1
000067170526     A            PICDAL        35A  O    10
000068170526     A                                      SPACEB(002)
000069170526     A                                    15
000070170526     A                                      SPACEB(003)
000071170526     A                                      'Objet: OFFRE TARIFAIRE'
000072170526     A                                      HIGHLIGHT
000073170526     A                                    15
000074170526     A                                      SPACEB(003)
000075170526     A                                      'Madame, Monsieur,'
000076170526     A                                    15
000077170526     A                                      SPACEB(002)
000078170526     A                                      'Suite à nos contacts, nous vous en-
000079170526     A                                      voyons ci-joint notre proposition t-
000080170526     A                                      arifaire préparée sur la base de ce'
000081170526     A                                    15
000082170526     A                                      SPACEB(001)
000083170526     A                                      'que vuous nous avez fournit et de -
000084170526     A                                      vos besoins en matière de service.'
000085170526     A                                    15
000086170526     A                                      SPACEB(002)
000087170526     A                                      'Nous espérons avoir répondu à vos -
000088170526     A                                      attentes. Pour la définition du con-
000089170526     A                                      trat de transport, nous vous invito-
000090170526     A                                      ns'
000091170526     A                                    15
000092170526     A                                      SPACEB(001)
000093170526     A                                      'à l''imprimer en deux exemplaires:-
000094170526     A                                       un que vous conserverez et un à no-
000095170526     A                                      us retourner signé pour acceptation'
000096170526     A                                    15
000097170526     A                                      SPACEB(001)
000098170526     A                                      'aux deux endroits indiqués par "le-
000099170526     A                                       donneur d''ordre".'
000100170526     A                                    15
000101170526     A                                      SPACEB(002)
000102170526     A                                      'Veuillez trouver également:'
000103170526     A                                    15
000104170526     A                                      SPACEB(002)
000105170526     A                                      '- la liste de nos filiales'
000106170526     A                                      HIGHLIGHT
000107170526     A                                    15
000108170526     A                                      SPACEB(001)
000109170526     A                                      '- nos délais indicatifs de livrais-
000110170526     A                                      on'
000111170526     A                                      HIGHLIGHT
000112170526     A                                    15
000113170526     A                                      SPACEB(001)
000114170526     A                                      '- nos conditions générales et part-
000115170526     A                                      iculières'
000116170526     A                                      HIGHLIGHT
000117170526     A                                    15
000118170526     A                                      SPACEB(001)
000119170526     A                                      '- la note d''information sur la pr-
000120170526     A                                      otection des données personnelles'
000121170526     A                                      HIGHLIGHT
000122170526      *
000123170526     A                                    15
000124170526     A                                      SPACEB(002)
000125170526     A                                      'Si la proposition tarifaire prévoi-
000126170526     A                                      t "Assurance pour compte - AC BASE"-
000127170526     A                                      , vous trouverez ci-joint deux    '
000128170526     A***                                   UNDERLINE
000129170526     A                                    15
000130170526     A                                      SPACEB(001)
000131170526     A                                      'exemplaires du formulaire à rempli-
000132170526     A                                      r, un que vous conserverez et un à -
000133170526     A                                      nous retourner signé pour acceptati-
000134170526     A                                      on'
000135170526     A***                                   UNDERLINE
000136170526     A                                    15
000137170526     A                                      SPACEB(001)
000138170526     A                                      'aux deux endroits indiqués par "le-
000139170526     A                                       donneur d''ordre (Assuré)".       -
000140170526     A                                              '
000141170526     A***                                   UNDERLINE
000142170526      *
000143170526     A                                    15
000144170526     A                                      SPACEB(002)
000145170526     A                                      'Nous tenons à vous garantir de not-
000146170526     A                                      re meilleure collaboration pour tou-
000147170526     A                                      s vos besoins. Dans l''attente de r-
000148170526     A                                      ecevoir'
000149170526     A                                    15
000150170526     A                                      SPACEB(001)
000151170526     A                                      'l''exemplaire du contrat signé, no-
000152170526     A                                      us espérons commencer dès maintenan-
000153170526     A                                      t à traiter vos marchandises.'
000154170526     A                                    15
000155170526     A                                      SPACEB(002)
000156170526     A                                      'Nous vous informons que la validit-
000157170526     A                                      é de la présente offre est subordon-
000158170526     A                                      née à son acceptation dans les 60 j-
000159170526     A                                      ours'
000160170526     A                                    15
000161170526     A                                      SPACEB(001)
000162170526     A                                      'à compter de sa date d''émission.'
000163170526     A                                    15
000164170526     A                                      SPACEB(002)
000165170526     A                                      'Veuillez agréer, Madame, Monsieur,-
000166170526     A                                       nos salutations distinguées.'
000167170526     A            RSUTOLD       20A  O    71
000168170526     A                                      SPACEB(002)
000169170526     A***                                 67
000170170526     A                                    71
000171170526     A                                      'Filiale de'
000172170526     A                                      SPACEB(001)
000173170526     A***         PD1FIL        20A  O    90
000174170526     A            PD1FIL        20A  O    +1
000175170526     A                                    10
000176170526     A***                                   SPACEB(009)
000177170526     A                                      SPACEB(004)
000178170526     A                                      'Décret législatif 196/2003: le tra-
000179170526     A                                      itement des données vous concernant-
000180170526     A                                      , à des fins d''initiatives promoti-
000181170526     A                                      onnelles,'
000182170526     A                                    10
000183170526     A                                      SPACEB(001)
000184170526     A                                      'est effectué conformément à la loi-
000185170526     A                                      , sans préjudice de vos droits aux -
000186170526     A                                      termes de l''article 7.'
000187170526     A*%%***********************************************************************
000188170526     A*%%SS
000189170526     A*%%CL 001
000190170526     A*%%CL 001
000191170526     A*%%CL 001
000192170526     A*%%CL 001
000193170526     A*%%CL 001
000194170526     A*%%CL 001
000195170526     A*%%CL 001
000196170526     A*%%CL 002
000197170526     A*%%CL 001
000198170526     A*%%CL 002
000199170526     A*%%CL 002
000200170526     A*%%CL 003
000201170526     A*%%CL 003
000202170526     A*%%CL 002
000203170526     A*%%CL 001
000204170526     A*%%CL 002
000205170526     A*%%CL 001
000206170526     A*%%CL 001
000207170526     A*%%CL 002
000208170526     A*%%CL 002
000209170526     A*%%CL 001
000210170526     A*%%CL 001
000211170526     A*%%CL 001
000212170526     A*%%CL 002
000213170526     A*%%CL 001
000214170526     A*%%CL 001
000215170526     A*%%CL 002
000216170526     A*%%CL 001
000217170526     A*%%CL 002
000218170526     A*%%CL 001
000219170526     A*%%CL 002
000220170526     A*%%CL 002
000221170526     A*%%CL 001
000222170526     A*%%CL 004
000223170526     A*%%CL 001
000224170526     A*%%CP+999CRTPRTF
000225170526     A*%%CP+    FILE(GAITRAFIL/TNTA54P3)
000226170526     A*%%CP+    DEVTYPE(*SCS)
000227170526     A*%%CP+    PAGESIZE(*N 124)
000228170526     A*%%CP+    CPI(16,7)
000229170526     A*%%CP     OVRFLW(65)
000230170526     A*%%***********************************************************************
