000010070319     A*%%TS  SD  20070319  085149  EDPMB       REL-V5R3M0  5722-WDS
000020070319     A*%%EC
000030070319     A                                      DSPSIZ(24 80 *DS3)
000040070319     A                                      CHGINPDFT(HI UL)
000050070319     A                                      PRINT
000060061002     A          R TA90D01
000070061002     A*%%TS  SD  20061002  135552  EDPRM       REL-V5R3M0  5722-WDS
000080061002     A                                      CA03
000090061002     A                                      CF06
000100061002     A  28        VIDMSG        78   M
000110061002     A            RSUT          20A  O  1  2
000120061002     A                                  1 26'* Elenco Clienti per Sottoconto  *'
000130061002     A                                      DSPATR(RI)
000140061002     A                                  1 64'TNTA90R'
000150061002     A                                  1 73DATE
000160061002     A                                      EDTCDE(Y)
000170061002     A            KNSIF         10A  O  2  2
000180061002     A            KNMUS         10A  O  2 13
000190061002     A                                  2 73TIME
000200061002     A                                  9  2'P.O. Cliente . . . . . . .:'
000210061002     A            V1CPOP         3Y 0B  9 30DSPATR(HI)
000220061002     A                                      CHECK(RZ)
000230061002     A                                      EDTCDE(Z)
000240061002     A  02                                  DSPATR(PC)
000250061002     A            V1DPOP        15A  O  9 62
000260061002     A                                  9 35'(999=Tutti i p.o. gestiti)'
000270061002     A                                 24  2'F3=Fine'
000280061002     A                                 24 11'F6=CONFERMA'
000290061002     A                                  2 26'*     Intestazione Fattura       *'
000300061002     A                                      DSPATR(UL)
000310061002     A                                      DSPATR(RI)
000320061002     A                                 11  2'Clienti unificati bloccati:'
000330061002     A            V1CABL         1A  B 11 30VALUES('I' 'E')
000340061002     A                                 11 35'(I=Includi;E=Escludi)'
000350061002     A                                 18  2'Solo clienti senza invio fattura v-
000360061002     A                                      ia e-mail:'
000370061002     A                                 20  2'Solo anomalie invio fattura . . . -
000380061002     A                                      . . . . .:'
000390061002     A            V1CFATT        1A  B 18 48VALUES('S' 'N')
000400061002     A  03                                  DSPATR(PC)
000410061002     A            V1CANOM        1A  B 20 48VALUES('S' 'N')
000420061002     A  04                                  DSPATR(PC)
000430061002     A                                 18 51'(S/N)'
000440061002     A                                 20 51'(S/N)'
000450061002     A                                 13  2'Ordinamento Stampa . . . .:'
000460061002     A                                 13 35'(K=Cod.Cliente Int.Fatt.'
000470061002     A                                 14 36'C=Cod.Commerciale unificante)'
000480061002     A            V1CORD         1   B 13 30VALUES('C' 'K')
