000001160623     A*%%***********************************************************************
000002160623     A*%%TS  RD  20160623  140116  EDPMB       REL-V7R1M0  5770-WDS
000003160623     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004160623     A*%%FI       0000000000000000000000000000000000000000000000000
000005160623     A*%%***********************************************************************
000006160623     A          R TA49PPP
000007160623     A*%%***********************************************************************
000008160623     A*%%RI 00000
000009160623     A*%%FS 009
000010160623     A*%%***********************************************************************
000011160623     A                                      SKIPB(010)
000012160623     A            BIANCO         1A  O     1
000013160623     A*%%***********************************************************************
000014160623     A*%%SS
000015160623     A*%%***********************************************************************
000016160623     A          R TA49P01
000017160623     A*%%***********************************************************************
000018160623     A*%%RI 00000
000019160623     A*%%***********************************************************************
000020160623     A                                      SPACEB(001)
000021160623     A                                     1
000022160623     A                                      'Filiale in:'
000023160623     A            TD1FIL        20A  O     1
000024160623     A                                      SPACEB(001)
000025160623     A            TD1VIA        25A  O     1
000026160623     A                                      SPACEB(001)
000027160623     A            TD1CAP         5S 0O     1
000028160623     A                                      SPACEB(001)
000029160623     A                                      EDTCDE(Z)
000030160623     A            TD1LOC        25A  O    +1
000031160623     A            TD1PRV         2A  O    +1
000032160623     A                                   +28
000033160623     A                                      'AN'
000034160623     A                                     1
000035160623     A                                      'TEL.'
000036160623     A                                      SPACEB(001)
000037160623     A            TD2TEL        13A  O    +1
000038160623     A                                    +1
000039160623     A                                      'FAX.'
000040160623     A            TD2TFX        13A  O    +1
000041160623     A            PICRAG        48A  O   +25
000042160623     A            PICIND        35A  O    63
000043160623     A                                      SPACEB(001)
000044160623     A            PICCAP         9A  O    63
000045160623     A                                      SPACEB(001)
000046160623     A            PICLOC        30A  O    +1
000047160623     A            PICPRO         2A  O    +1
000048160623     A            DESNAR        25A  O    63
000049160623     A                                      SPACEB(001)
000050160623     A            PICDAL        35A  O     1
000051160623     A                                      SPACEB(001)
000052160623     A  73                               +21
000053160623     A                                      'z.Hd.'
000054160623     A  73        RESPTRA       60A  O    +1
000055160623     A                                      HIGHLIGHT
000056160623     A                                     1
000057160623     A                                      'Unser Zeichen'
000058160623     A                                      SPACEB(001)
000059160623     A            PICNR1         2A  O    +1
000060160623     A                                    +1
000061160623     A                                      '/'
000062160623     A            PICNR2         2A  O    +1
000063160623     A  77        RESPTRA2      60A  O   +41
000064160623     A                                      HIGHLIGHT
000065160623     A                                     1
000066160623     A                                      'Telefonischer Ansprechpartner: Her-
000067160623     A                                      r'
000068160623     A                                      SPACEB(001)
000069160623     A            DESCOM        25A  O    +1
000070160623     A            DESTAR        30A  O    49
000071160623     A                                      SPACEB(001)
000072160623     A                                      HIGHLIGHT
000073160623     A                                     1
000074160623     A                                      SPACEB(002)
000075160623     A                                      'Mit Bezug auf die getroffenen Vere-
000076160623     A                                      inbarungen freuen wir uns, Ihnen un-
000077160623     A                                      ser bestes Angebot (in'
000078160623     A            DESDIV         5A  O    +1
000079160623     A                                    +0
000080160623     A                                      ') für den Transport Ihrer'
000081160623     A                                     1
000082160623     A                                      SPACEB(001)
000083160623     A                                      'Sendungen zu unterdreiten, der sic-
000084160623     A                                      h zu Ihren Lasten versteht:'
000085160623     A*%%***********************************************************************
000086160623     A*%%SS
000087160623     A*%%CL 001
000088160623     A*%%CL 001
000089160623     A*%%CL 001
000090160623     A*%%CL 001
000091160623     A*%%CL 001
000092160623     A*%%CL 001
000093160623     A*%%CL 001
000094160623     A*%%CL 001
000095160623     A*%%CL 001
000096160623     A*%%CL 001
000097160623     A*%%CL 001
000098160623     A*%%CL 002
000099160623     A*%%CL 001
000100160623     A*%%***********************************************************************
000101160623     A          R TA49P02A
000102160623     A*%%***********************************************************************
000103160623     A*%%RI 00000
000104160623     A*%%***********************************************************************
000105160623     A                                      SPACEB(001)
000106160623     A            PRTLNP        80A  O     1
000107160623     A                                      HIGHLIGHT
000108160623     A*%%***********************************************************************
000109160623     A*%%SS
000110160623     A*%%***********************************************************************
000111160623     A          R TA49P02
000112160623     A*%%***********************************************************************
000113160623     A*%%RI 00000
000114160623     A*%%***********************************************************************
000115160623     A                                      SPACEB(001)
000116160623     A                                     1
000117160623     A                                      '-----------------------------------
000118160623     A                                      ------------------------------------
000119160623     A                                      ------------------------------------
000120160623     A                                      ------------------- '
000121160623     A                                      HIGHLIGHT
000122160623     A N78                                 2
000123160623     A                                      'Von'
000124160623     A                                      SPACEB(001)
000125160623     A N78                                +1
000126160623     A                                      'Ihrem Lager'
000127160623     A                                      HIGHLIGHT
000128160623     A N12        DESUM         10A  O    33
000129160623     A                                      HIGHLIGHT
000130160623     A  78                                  SPACEB(001)
000131160623     A  12        DESUMF        26A  O    17
000132160623     A                                      HIGHLIGHT
000133160623     A  78                                  SPACEB(001)
000134160623     A            DISSCA        80A  O    +1
000135160623     A                                      HIGHLIGHT
000136160623     A N78                                 2
000137160623     A                                      'nach:'
000138160623     A                                      HIGHLIGHT
000139160623     A                                      SPACEB(001)
000140160623     A N79        PRTATF        80A  O    44
000141160623     A                                      HIGHLIGHT
000142160623     A  78N79                               SPACEB(001)
000143160623     A                                     1
000144160623     A                                      '-----------------------------------
000145160623     A                                      ------------------------------------
000146160623     A                                      ------------------------------------
000147160623     A                                      ------------------- '
000148160623     A                                      SPACEB(001)
000149160623     A                                      HIGHLIGHT
000150160623     A*%%***********************************************************************
000151160623     A*%%SS
000152160623     A*%%CL 001
000153160623     A*%%CL 001
000154160623     A*%%CL 001
000155160623     A*%%CL 001
000156160623     A*%%CL 001
000157160623     A*%%CL 001
000158160623     A*%%***********************************************************************
000159160623     A          R TA49P03
000160160623     A*%%***********************************************************************
000161160623     A*%%RI 00000
000162160623     A*%%***********************************************************************
000163160623     A                                      SPACEB(001)
000164160623     A            P03DES        42A  O     1
000165160623     A  61        TAR01          7S 3O    +3
000166160623     A                                      EDTWRD('  0 ,   ')
000167160623     A            PER01          1A  O    +1
000168160623     A  62        TAR02          7S 3O    +3
000169160623     A                                      EDTWRD('  0 ,   ')
000170160623     A            PER02          1A  O    +1
000171160623     A  63        TAR03          7S 3O    +3
000172160623     A                                      EDTWRD('  0 ,   ')
000173160623     A            PER03          1A  O    +1
000174160623     A  64        TAR04          7S 3O    +3
000175160623     A                                      EDTWRD('  0 ,   ')
000176160623     A            PER04          1A  O    +1
000177160623     A  65        TAR05          7S 3O    +3
000178160623     A                                      EDTWRD('  0 ,   ')
000179160623     A            PER05          1A  O    +1
000180160623     A  66        TAR06          7S 3O    +3
000181160623     A                                      EDTWRD('  0 ,   ')
000182160623     A            PER06          1A  O    +1
000183160623     A*%%***********************************************************************
000184160623     A*%%SS
000185160623     A*%%***********************************************************************
000186160623     A          R TA49P06
000187160623     A*%%***********************************************************************
000188160623     A*%%RI 00000
000189160623     A*%%FS 001
000190160623     A*%%***********************************************************************
000191160623     A                                      SPACEB(002)
000192160623     A                                     1
000193160623     A                                      'Warenvolumen zwecks Besteuerung:'
000194160623     A                                     1
000195160623     A                                      'kg pro Kubikmeter'
000196160623     A                                      SPACEB(001)
000197160623     A            VOLSCA        80A  O    44
000198160623     A*%%***********************************************************************
000199160623     A*%%SS
000200160623     A*%%CL 001
000201160623     A*%%***********************************************************************
000202160623     A          R TA49P06B
000203160623     A*%%***********************************************************************
000204160623     A*%%RI 00000
000205160623     A*%%***********************************************************************
000206160623     A                                      SPACEB(001)
000207160623     A                                     1
000208160623     A                                      'Im Preis enthaltenes Warenvolumen'
000209160623     A                                      HIGHLIGHT
000210160623     A*%%***********************************************************************
000211160623     A*%%SS
000212160623     A*%%***********************************************************************
000213160623     A          R TA49P05
000214160623     A*%%***********************************************************************
000215160623     A*%%RI 00000
000216160623     A*%%***********************************************************************
000217160623     A                                      SPACEB(001)
000218160623     A                                     1
000219160623     A                                      'Rundungen:'
000220160623     A            P05AR1        45A  O    +1
000221160623     A            P05AR2        45A  O    12
000222160623     A                                      SPACEB(001)
000223160623     A*%%***********************************************************************
000224160623     A*%%SS
000225160623     A*%%CL 001
000226160623     A*%%***********************************************************************
000227160623     A          R TA49P07
000228160623     A*%%***********************************************************************
000229160623     A*%%RI 00000
000230160623     A*%%FS 001
000231160623     A*%%***********************************************************************
000232160623     A                                      SPACEB(002)
000233160623     A                                     1
000234160623     A                                      'Kunden Code:'
000235160623     A                                      HIGHLIGHT
000236160623     A                                      UNDERLINE
000237160623     A            P07KSC         7S 0O    +1
000238160623     A                                      HIGHLIGHT
000239160623     A                                      UNDERLINE
000240160623     A  98                                +2
000241160623     A                                      'Ang.Nr.:'
000242160623     A                                      HIGHLIGHT
000243160623     A  98N85     P07NRV         6S 0O    32
000244160623     A                                      EDTCDE(Z)
000245160623     A                                      HIGHLIGHT
000246160623     A  98N85                             39
000247160623     A                                      '-'
000248160623     A                                      HIGHLIGHT
000249160623     A  98N85     P07PRV         1S 0O    41
000250160623     A                                      EDTCDE(Z)
000251160623     A                                      HIGHLIGHT
000252160623     A  85        P07NTRA        7S 0O    32
000253160623     A                                      EDTCDE(Z)
000254160623     A                                      HIGHLIGHT
000255160623     A                                     1
000256160623     A                                      'Preis:'
000257160623     A                                      SPACEB(001)
000258160623     A                                      HIGHLIGHT
000259160623     A            DESCTR        13A  O    +1
000260160623     A                                      HIGHLIGHT
000261160623     A                                    +1
000262160623     A                                      '-'
000263160623     A                                      HIGHLIGHT
000264160623     A N85        PTARIFFA      12A  O    25
000265160623     A  85        PTRATTA       14A  O    24
000266160623     A                                    +1
000267160623     A                                      '-'
000268160623     A                                      HIGHLIGHT
000269160623     A            P07DES        50A  O    +1
000270160623     A                                      HIGHLIGHT
000271160623     A*%%***********************************************************************
000272160623     A*%%SS
000273160623     A*%%CL 001
000274160623     A*%%***********************************************************************
000275160623     A          R TA49P07S
000276160623     A*%%***********************************************************************
000277160623     A*%%RI 00000
000278160623     A*%%***********************************************************************
000279160623     A                                      SPACEB(001)
000280160623     A                                      HIGHLIGHT
000281160623     A                                     1
000282160623     A                                      'Anwendung : Gestaffelt'
000283160623     A*%%***********************************************************************
000284160623     A*%%SS
000285160623     A*%%***********************************************************************
000286160623     A          R TA49P07G
000287160623     A*%%***********************************************************************
000288160623     A*%%RI 00000
000289160623     A*%%***********************************************************************
000290160623     A                                      SPACEB(001)
000291160623     A                                      HIGHLIGHT
000292160623     A                                     1
000293160623     A                                      'Anwendung : Höchste vorherige Stuf-
000294160623     A                                      e'
000295160623     A*%%***********************************************************************
000296160623     A*%%SS
000297160623     A*%%***********************************************************************
000298160623     A          R TA49P08
000299160623     A*%%***********************************************************************
000300160623     A*%%RI 00000
000301160623     A*%%***********************************************************************
000302160623     A                                      SPACEB(001)
000303160623     A                                     1
000304160623     A                                      'NACHNAHME: DIESER SERVICE STEHT NI-
000305160623     A                                      CHT ZUR VERFÜGUNG'
000306160623     A                                      HIGHLIGHT
000307160623     A                                     1
000308160623     A                                      'UNFREIE SENDUNGEN: DIESER SERVICE -
000309160623     A                                      STEHT NICHT ZUR VERFÜGUNG'
000310160623     A                                      SPACEB(001)
000311160623     A                                      HIGHLIGHT
000312160623     A                                     1
000313160623     A                                      '1 PACKSTÜCK PRO SENDUNG'
000314160623     A                                      SPACEB(001)
000315160623     A                                      HIGHLIGHT
000316160623     A            COM08A        90A  O     1
000317160623     A                                      SPACEB(001)
000318160623     A                                      HIGHLIGHT
000319160623     A            COM08B       120A  O     1
000320160623     A                                      SPACEB(001)
000321160623     A                                      HIGHLIGHT
000322160623     A*%%***********************************************************************
000323160623     A*%%SS
000324160623     A*%%CL 001
000325160623     A*%%CL 001
000326160623     A*%%CL 001
000327160623     A*%%CL 001
000328160623     A*%%***********************************************************************
000329160623     A          R TA49P09
000330160623     A*%%***********************************************************************
000331160623     A*%%RI 00000
000332160623     A*%%FS 001
000333160623     A*%%***********************************************************************
000334160623     A                                      SPACEB(002)
000335160623     A                                     1
000336160623     A                                      'Die Preise gelten vom'
000337160623     A                                      HIGHLIGHT
000338160623     A            STADDT        10A  O    +1
000339160623     A                                      HIGHLIGHT
000340160623     A                                    +1
000341160623     A                                      'biz zum'
000342160623     A                                      HIGHLIGHT
000343160623     A            STADST        10A  O    +1
000344160623     A                                      HIGHLIGHT
000345160623     A  26                                +2
000346160623     A                                      'und für:'
000347160623     A                                      HIGHLIGHT
000348160623     A*%%***********************************************************************
000349160623     A*%%SS
000350160623     A*%%***********************************************************************
000351160623     A          R TA49P09A
000352160623     A*%%***********************************************************************
000353160623     A*%%RI 00000
000354160623     A*%%***********************************************************************
000355160623     A                                      SPACEB(001)
000356160623     A                                     1
000357160623     A                                      'Jährliche Sendungen: mindestens'
000358160623     A            COMLRC         7S 0O    +1
000359160623     A                                      EDTCDE(Z)
000360160623     A                                    +1
000361160623     A                                      'höchstens'
000362160623     A            COMLAS         7S 0O    +1
000363160623     A                                      EDTCDE(Z)
000364160623     A*%%***********************************************************************
000365160623     A*%%SS
000366160623     A*%%***********************************************************************
000367160623     A          R TA49P09B
000368160623     A*%%***********************************************************************
000369160623     A*%%RI 00000
000370160623     A*%%***********************************************************************
000371160623     A                                      SPACEB(001)
000372160623     A                                     1
000373160623     A                                      'Ware mit durchschnittlichem spezif-
000374160623     A                                      ischen Gewicht von:'
000375160623     A            COMKPM         5S 1O    +1
000376160623     A                                      EDTWRD('  0 , ')
000377160623     A                                    +1
000378160623     A                                      'kg pro Kubikmeter'
000379160623     A*%%***********************************************************************
000380160623     A*%%SS
000381160623     A*%%***********************************************************************
000382160623     A          R TA49P09C
000383160623     A*%%***********************************************************************
000384160623     A*%%RI 00000
000385160623     A*%%***********************************************************************
000386160623     A                                      SPACEB(001)
000387160623     A                                     1
000388160623     A                                      'Ware mit einem Packstückvolumen vo-
000389160623     A                                      n'
000390160623     A            COMCKM         5S 1O    +1
000391160623     A                                      EDTWRD('0 ,   ')
000392160623     A                                    +1
000393160623     A                                      'Kubikmeter'
000394160623     A*%%***********************************************************************
000395160623     A*%%SS
000396160623     A*%%***********************************************************************
000397160623     A          R TA49P09S
000398160623     A*%%***********************************************************************
000399160623     A*%%RI 00000
000400160623     A*%%***********************************************************************
000401160623     A                                      SPACEB(001)
000402160623     A*%%***********************************************************************
000403160623     A*%%SS
000404160623     A*%%***********************************************************************
000405160623     A          R TA49P10
000406160623     A*%%***********************************************************************
000407160623     A*%%RI 00000
000408160623     A*%%***********************************************************************
000409160623     A                                      SPACEB(001)
000410160623     A            COMNOT        60A  O     1
000411160623     A*%%***********************************************************************
000412160623     A*%%SS
000413160623     A*%%***********************************************************************
000414160623     A          R TA49P11
000415160623     A*%%***********************************************************************
000416160623     A*%%RI 00000
000417160623     A*%%FS 001
000418160623     A*%%***********************************************************************
000419160623     A                                      SPACEB(002)
000420160623     A                                     1
000421160623     A                                      'ABGABEN UND ZUSÄTZLICHE GEBÜHREN:'
000422160623     A                                      HIGHLIGHT
000423160623     A                                     1
000424160623     A                                      'Gesetzliche Abgaben: geltende MwSt'
000425160623     A                                      SPACEB(001)
000426160623     A                                    +2
000427160623     A                                      '-'
000428160623     A  27        COMDAG        50A  O    +2
000429160623     A  27        COMCAG         5S 2O    +1
000430160623     A                                      EDTWRD(' 0 ,  ')
000431160623     A  27                                +1
000432160623     A                                      '%'
000433160623     A  29        COMDAG1       50A  O    40
000434160623     A                                      SPACEB(001)
000435160623     A  29        COMCAG1        5S 2O    91
000436160623     A                                      EDTWRD(' 0 ,  ')
000437160623     A  29                                98
000438160623     A                                      '%'
000439160623     A*%%***********************************************************************
000440160623     A*%%SS
000441160623     A*%%CL 001
000442160623     A*%%CL 001
000443160623     A*%%***********************************************************************
000444160623     A          R TA49PIST
000445160623     A*%%***********************************************************************
000446160623     A*%%RI 00000
000447160623     A*%%***********************************************************************
000448160623     A                                      SPACEB(001)
000449160623     A                                     1
000450160623     A                                      'Seit'
000451160623     A            DTAIST         8S 0O    +1
000452160623     A                                      EDTWRD('  /  /    ')
000453160623     A                                    +1
000454160623     A                                      'werden die Tarife entsprechend den-
000455160623     A                                       im Laufe des Vorjahres verzeichnet-
000456160623     A                                      en Preiserhöhungen'
000457160623     A  11                                +1
000458160623     A                                      '(um'
000459160623     A  11        TAMPRI         5S 2O     1
000460160623     A                                      SPACEB(001)
000461160623     A                                      EDTCDE(L)
000462160623     A  11                                +0
000463160623     A                                      '%) jährlich angepasst. Der Umfang -
000464160623     A                                      der jährlichen Preisschwankungen en-
000465160623     A                                      tspricht dem Verbraucherpreisindex'
000466160623     A  11                                 1
000467160623     A                                      'für alle privaten Haushalte (NIC) -
000468160623     A                                      ohne Tabakwaren, der den Durchschni-
000469160623     A                                      tt von 12 monatlichen Erhebungen da-
000470160623     A                                      rstellt'
000471160623     A                                      SPACEB(001)
000472160623     A  11                                 1
000473160623     A                                      'und auf der Webseite des Nationale-
000474160623     A                                      n Instituts für Statistik ISTAT (ww-
000475160623     A                                      w.istat.it) veröffentlicht wird.'
000476160623     A                                      SPACEB(001)
000477160623     A N11                                 1
000478160623     A                                      'jährlich angepasst. Der Umfang der-
000479160623     A                                       jährlichen Preisschwankungen entsp-
000480160623     A                                      richt dem Verbraucherpreisindex für'
000481160623     A                                      SPACEB(001)
000482160623     A N11                                 1
000483160623     A                                      'alle privaten Haushalte (NIC) ohne-
000484160623     A                                       Tabakwaren, der den Durchschnitt v-
000485160623     A                                      on 12 monatlichen Erhebungen darste-
000486160623     A                                      llt'
000487160623     A                                      SPACEB(001)
000488160623     A N11                                 1
000489160623     A                                      'und auf der Webseite des Nationale-
000490160623     A                                      n Instituts für Statistik ISTAT (ww-
000491160623     A                                      w.istat.it) veröffentlicht wird.'
000492160623     A                                      SPACEB(001)
000493160623     A*%%***********************************************************************
000494160623     A*%%SS
000495160623     A*%%CL 001
000496160623     A*%%SN TAMPRI     99999
000497160623     A*%%CL 001
000498160623     A*%%CL 001
000499160623     A*%%CL 001
000500160623     A*%%CL 001
000501160623     A*%%CL 001
000502160623     A*%%***********************************************************************
000503160623     A          R TA49PSTD
000504160623     A*%%***********************************************************************
000505160623     A*%%RI 00000
000506160623     A*%%***********************************************************************
000507160623     A                                      SPACEB(001)
000508160623     A            COMSTD        31A  O     1
000509160623     A                                      HIGHLIGHT
000510160623     A            COMDSTD       83A  O    33
000511160623     A*%%***********************************************************************
000512160623     A*%%SS
000513160623     A*%%***********************************************************************
000514160623     A          R TA49PSH2
000515160623     A*%%***********************************************************************
000516160623     A*%%RI 00000
000517160623     A*%%***********************************************************************
000518160623     A                                      SPACEB(001)
000519160623     A            RIGA1H1030   120A  O     1
000520160623     A            RIGA2H1030   120A  O     1
000521160623     A************                         1
000522160623     A************                          'Mit dem "10:30 SERVICE" Dienst kön-
000523160623     A************                          nen nur Sendungen mit grösstem Umfa-
000524160623     A************                          ng von 1 Kubikmeter und grösstem Ge-
000525160623     A************                          wicht'
000526160623     A************                         1
000527160623     A************                          'von 250 kg, die nur an die Orten, -
000528160623     A************                          die auf der BRT Webseite sind, adre-
000529160623     A************                          ssiert sind, geschickt werden.'
000530160623     A                                      SPACEB(001)
000531160623     A                                     1
000532160623     A                                      'Die Sendungen, die nicht unter die-
000533160623     A                                       oben genannten Standard fallen ode-
000534160623     A                                      r, die an Orten, die nicht auf der -
000535160623     A                                      BRT'
000536160623     A                                      SPACEB(001)
000537160623     A                                     1
000538160623     A                                      'Webseite (www.BRT.it) sind, mit de-
000539160623     A                                      m "PRIORITY" Dienst geschickt werde-
000540160623     A                                      n.'
000541160623     A                                      SPACEB(001)
000542160623     A                                     1
000543160623     A                                      'Für Zustellungen mit dem "10:30 SE-
000544160623     A                                      RVICE" Service auf dem Dokument bit-
000545160623     A                                      te "10:30 SERVICE" angeben oder hie-
000546160623     A                                      r den'
000547160623     A                                      SPACEB(001)
000548160623     A                                     1
000549160623     A                                      'von uns gelieferten zugehörigen Au-
000550160623     A                                      fkleber anbringen.'
000551160623     A                                      SPACEB(001)
000552160623     A*%%***********************************************************************
000553160623     A*%%SS
000554160623     A*%%CL 001
000555160623     A*%%CL 001
000556160623     A*%%CL 001
000557160623     A*%%CL 001
000558160623     A*%%CL 001
000559160623     A*%%***********************************************************************
000560160623     A          R TA49PSE2
000561160623     A*%%***********************************************************************
000562160623     A*%%RI 00000
000563160623     A*%%***********************************************************************
000564160623     A                                      SPACEB(001)
000565160623     A                                     1
000566160623     A                                      'Für Zustellungen mit dem "PRIORITY-
000567160623     A                                      " Service auf dem Dokument bitte "P-
000568160623     A                                      RIORITY" angeben oder hier den von -
000569160623     A                                      uns'
000570160623     A                                     1
000571160623     A                                      'gelieferten zugehörigen Aufkleber -
000572160623     A                                      anbringen.'
000573160623     A                                      SPACEB(001)
000574160623     A*%%***********************************************************************
000575160623     A*%%SS
000576160623     A*%%CL 001
000577160623     A*%%***********************************************************************
000578160623     A          R TA49PTP
000579160623     A*%%***********************************************************************
000580160623     A*%%RI 00000
000581160623     A*%%***********************************************************************
000582160623     A                                      SPACEB(001)
000583160623     A  08                                 1
000584160623     A                                      'Mindestmenge für die Besteuerung:'
000585160623     A  08        COMMTS         3S 0O    +1
000586160623     A                                      EDTCDE(Z)
000587160623     A  08                                +1
000588160623     A                                      'kg.'
000589160623     A  18                                +3
000590160623     A                                      'Rundungen:'
000591160623     A  18        ARROT1        45A  O    +1
000592160623     A  18 20     ARROT2        45A  O    56
000593160623     A  20                                  SPACEB(001)
000594160623     A  19                                 1
000595160623     A                                      'Der Warenumfang beträgt für die Ge-
000596160623     A                                      bührenbemessung'
000597160623     A                                      SPACEB(001)
000598160623     A  19        COMRPV         4S 0O    +1
000599160623     A                                      EDTCDE(2)
000600160623     A  19                                +1
000601160623     A                                      'kg pro Kubikmeter.'
000602160623     A*%%***********************************************************************
000603160623     A*%%SS                                                   :
000604160623     A*%%CL 001
000605160623     A*%%CL 001
000606160623     A*%%***********************************************************************
000607160623     A          R TA49POR2
000608160623     A*%%***********************************************************************
000609160623     A*%%RI 00000
000610160623     A*%%***********************************************************************
000611160623     A                                      SPACEB(001)
000612160623     A                                     1
000613160623     A                                      'Für Sendungen mit Eingang in Ihrem-
000614160623     A                                       Lager.'
000615160623     A*%%***********************************************************************
000616160623     A*%%SS
000617160623     A*%%***********************************************************************
000618160623     A          R TA49PPC1
000619160623     A*%%***********************************************************************
000620160623     A*%%RI 00000
000621160623     A*%%***********************************************************************
000622160623     A                                      SPACEB(001)
000623160623     A                                     1
000624160623     A                                      'Einzug mit auf den'
000625160623     A            COMINT        20A  O    +1
000626160623     A                                      HIGHLIGHT
000627160623     A                                    +1
000628160623     A                                      'ausgestelltem Scheck'
000629160623     A*%%***********************************************************************
000630160623     A*%%SS
000631160623     A*%%***********************************************************************
000632160623     A          R TA49PPC2
000633160623     A*%%***********************************************************************
000634160623     A*%%RI 00000
000635160623     A*%%***********************************************************************
000636160623     A                                      SPACEB(001)
000637160623     A                                     1
000638160623     A                                      'Bedingungen für die Rückerstattung-
000639160623     A                                      :'
000640160623     A            COMAAS         9A  O    +1
000641160623     A                                    +1
000642160623     A                                      'IBAN:'
000643160623     A            COMBAB1        4A  O    +1
000644160623     A            COMBAB2        4A  O    +1
000645160623     A            COMBAB3        4A  O    +1
000646160623     A            COMBAB4        4A  O    +1
000647160623     A            COMBAB5        4A  O    +1
000648160623     A            COMBAB6        4A  O    +1
000649160623     A            COMBAB7        4A  O    +1
000650160623     A            COMBAB8        4A  O    +1
000651160623     A*%%***********************************************************************
000652160623     A*%%SS
000653160623     A*%%***********************************************************************
000654160623     A          R TA49PTAM
000655160623     A*%%***********************************************************************
000656160623     A*%%RI 00000
000657160623     A*%%***********************************************************************
000658160623     A                                      SPACEB(001)
000659160623     A                                      HIGHLIGHT
000660160623     A                                     1
000661160623     A                                      'WARENVERSICHERUNG :'
000662160623     A*%%***********************************************************************
000663160623     A*%%SS
000664160623     A*%%***********************************************************************
000665160623     A          R TA49PEL
000666160623     A*%%***********************************************************************
000667160623     A*%%RI 00000
000668160623     A*%%***********************************************************************
000669160623     A                                      SPACEB(001)
000670160623     A                                     1
000671160623     A                                      'Kostenbeitreibung            '
000672160623     A            STPPER         7A  O    +3
000673160623     A                                    +1
000674160623     A                                      '% sul valore eccedente i'
000675160623     A            COMLRP         5S 3O    +1
000676160623     A                                      EDTCDE(2)
000677160623     A            DESDIV         5A  O    +1
000678160623     A                                    +1
000679160623     A                                      'a kg.'
000680160623     A*%%***********************************************************************
000681160623     A*%%SS                          arcibile
000682160623     A*%%***********************************************************************
000683160623     A          R TA49PEL1
000684160623     A*%%***********************************************************************
000685160623     A*%%RI 00000
000686160623     A*%%***********************************************************************
000687160623     A                                      SPACEB(001)
000688160623     A                                      HIGHLIGHT
000689160623     A                                     1
000690160623     A                                      'MANDATO INTEGRATIVO AD ELEVARE IL -
000691160623     A                                      LIMITE DI RISARCIMENTO A'
000692160623     A            DESDIV         5A  O    +1
000693160623     A            COMELR         7S 3O    +1
000694160623     A                                      EDTCDE(2)
000695160623     A                                    +1
000696160623     A                                      'A KG.'
000697160623     A*%%***********************************************************************
000698160623     A*%%SS
000699160623     A*%%***********************************************************************
000700160623     A          R TA49PEL2
000701160623     A*%%***********************************************************************
000702160623     A*%%RI 00000
000703160623     A*%%***********************************************************************
000704160623     A                                      SPACEB(001)
000705160623     A                                      HIGHLIGHT
000706160623     A                                     1
000707160623     A                                      'COPERTURA ASSICURATIVA PER RESPONS-
000708160623     A                                      ABILITA'' VETTORIALE (LEGGE 450/85)'
000709160623     A*%%***********************************************************************
000710160623     A*%%SS
000711160623     A*%%***********************************************************************
000712160623     A          R TA49PMA
000713160623     A*%%***********************************************************************
000714160623     A*%%RI 00000
000715160623     A*%%***********************************************************************
000716160623     A                                      SPACEB(001)
000717160623     A                                     1
000718160623     A                                      'Kostenbeitreibung    '
000719160623     A            COMMA         83A  O   +11
000720160623     A*%%***********************************************************************
000721160623     A*%%SS
000722160623     A*%%***********************************************************************
000723160623     A          R TA49PMA1
000724160623     A*%%***********************************************************************
000725160623     A*%%RI 00000
000726160623     A*%%***********************************************************************
000727160623     A                                      SPACEB(001)
000728160623     A                                      HIGHLIGHT
000729160623     A                                     1
000730160623     A                                      'VERSICHERUNGSVOLLMACHT ALL RISK - -
000731160623     A                                      AC PLUS, FÜR WARE MIT FESTGESETZTEM-
000732160623     A                                       WERT IN HÖHE VON EURO'
000733160623     A            COMVLM        11S 3O    +1
000734160623     A                                      EDTCDE(3)
000735160623     A                                    +1
000736160623     A                                      'PRO'
000737160623     A            DESFVM        10A  O    +1
000738160623     A*%%***********************************************************************
000739160623     A*%%SS
000740160623     A*%%***********************************************************************
000741160623     A          R TA49PMA2
000742160623     A*%%***********************************************************************
000743160623     A*%%RI 00000
000744160623     A*%%***********************************************************************
000745160623     A                                      SPACEB(001)
000746160623     A                                      HIGHLIGHT
000747160623     A                                     1
000748160623     A                                      'VERSICHERUNGSVOLLMACHT ALL RISK - -
000749160623     A                                      AC BASE ZWECKS DECKUNG BIS ZU EINEM-
000750160623     A                                       ERSTATTUNGSFÄHIGEN HÖCHSTBETRAG VO-
000751160623     A                                      N'
000752160623     A                                     1
000753160623     A                                      'EURO'
000754160623     A                                      SPACEB(001)
000755160623     A            COMVLM        11S 3O    +1
000756160623     A                                      EDTCDE(3)
000757160623     A                                    +1
000758160623     A                                      'PRO'
000759160623     A            DESFVM        10A  O    +1
000760160623     A*%%***********************************************************************
000761160623     A*%%SS
000762160623     A*%%CL 001
000763160623     A*%%***********************************************************************
000764160623     A          R TA49PMAV
000765160623     A*%%***********************************************************************
000766160623     A*%%RI 00000
000767160623     A*%%***********************************************************************
000768160623     A                                      SPACEB(001)
000769160623     A                                      HIGHLIGHT
000770160623     A                                     1
000771160623     A                                      'VERSICHERUNGSVOLLMACHT ALL RISK - -
000772160623     A                                      AC PLUS, BEI EINDEUTIGER ANGABE DES-
000773160623     A                                       ZU VERSICHERNDEN WERTES AUF DEM TR-
000774160623     A                                      ANSPORTDOKUMENT.'
000775160623     A*%%***********************************************************************
000776160623     A*%%SS
000777160623     A*%%***********************************************************************
000778160623     A          R TA49PMAF1
000779160623     A*%%***********************************************************************
000780160623     A*%%RI 00000
000781160623     A*%%***********************************************************************
000782160623     A                                      SPACEB(001)
000783160623     A                                      HIGHLIGHT
000784160623     A                                     1
000785160623     A                                      'ES GILT DANN VERSICHERUNGSSCHUTZ F-
000786160623     A                                      ÜR EINE SENDUNG, WENN DER ZU VERSIC-
000787160623     A                                      HERNDE WARENWERT IM TRANSPORTDOKUME-
000788160623     A                                      NT'
000789160623     A                                     1
000790160623     A                                      'KLAR AUSGEWIESEN IST.'
000791160623     A                                      SPACEB(001)
000792160623     A*%%***********************************************************************
000793160623     A*%%SS
000794160623     A*%%CL 001
000795160623     A*%%***********************************************************************
000796160623     A          R TA49PVMA
000797160623     A*%%***********************************************************************
000798160623     A*%%RI 00000
000799160623     A*%%***********************************************************************
000800160623     A                                      SPACEB(001)
000801160623     A                                     1
000802160623     A                                      'Gültig für Sendungen der'
000803160623     A            COMVMA        22A  O    +1
000804160623     A*%%***********************************************************************
000805160623     A*%%SS
000806160623     A*%%***********************************************************************
000807160623     A          R TA49PEST
000808160623     A*%%***********************************************************************
000809160623     A*%%RI 00000
000810160623     A*%%***********************************************************************
000811160623     A                                      SPACEB(001)
000812160623     A            COMEST        83A  O    33
000813160623     A*%%***********************************************************************
000814160623     A*%%SS
000815160623     A*%%***********************************************************************
000816160623     A          R TA49PSTD1
000817160623     A*%%***********************************************************************
000818160623     A*%%RI 00000
000819160623     A*%%***********************************************************************
000820160623     A                                      SPACEB(001)
000821160623     A            COMSTDA1      31A  O     1
000822160623     A                                      HIGHLIGHT
000823160623     A            COMSTDB1      25A  O    32
000824160623     A            COMSTDA2      31A  O    60
000825160623     A                                      HIGHLIGHT
000826160623     A            COMSTDB2      25A  O    91
000827160623     A*%%***********************************************************************
000828160623     A*%%SS
000829160623     A*%%***********************************************************************
000830160623     A          R TA49PSTDC
000831160623     A*%%***********************************************************************
000832160623     A*%%RI 00000
000833160623     A*%%***********************************************************************
000834160623     A                                      SPACEB(001)
000835160623     A            COMSTDC      105A  O     1
000836160623     A                                      HIGHLIGHT
000837160623     A            COMSTDC1      10A  O    +0
000838160623     A*%%***********************************************************************
000839160623     A*%%SS
000840160623     A*%%***********************************************************************
000841160623     A          R TA49PTF
000842160623     A*%%***********************************************************************
000843160623     A*%%RI 00000
000844160623     A*%%***********************************************************************
000845160623     A                                      SPACEB(001)
000846160623     A                                     1
000847160623     A                                      'TREIBSTOFFZUSCHLAG (FUEL SURCHARGE-
000848160623     A                                      )'
000849160623     A                                      HIGHLIGHT
000850160623     A*%%***********************************************************************
000851160623     A*%%SS
000852160623     A*%%***********************************************************************
000853160623     A          R TA49PTF1
000854160623     A*%%***********************************************************************
000855160623     A*%%RI 00000
000856160623     A*%%***********************************************************************
000857160623     A                                      SPACEB(001)
000858160623     A                                     1
000859160623     A                                      'BRT behält sich das Recht vor, auf-
000860160623     A                                       alle Sendungen einen Zuschlag zu b-
000861160623     A                                      erechnen, der entsprechend der Erhö-
000862160623     A                                      hung des'
000863160623     A                                     1
000864160623     A                                      'Durchschnittspreises für Kraftfahr-
000865160623     A                                      zeug-Dieselöl gegenüber dem Preis v-
000866160623     A                                      on'
000867160623     A                                      SPACEB(001)
000868160623     A            COMFPMG        4S 3O    +1
000869160623     A                                      EDTCDE(4)
000870160623     A                                    +1
000871160623     A                                      'Euro kalkuliert wird.'
000872160623     A*%%***********************************************************************
000873160623     A*%%SS
000874160623     A*%%CL 001
000875160623     A*%%***********************************************************************
000876160623     A          R TA49PTF2
000877160623     A*%%***********************************************************************
000878160623     A*%%RI 00000
000879160623     A*%%***********************************************************************
000880160623     A                                      SPACEB(001)
000881160623     A                                     1
000882160623     A                                      'Bei Überschreiten der einzelnen Pr-
000883160623     A                                      eisstufen wird jeweils ein Zuschlag-
000884160623     A                                       in Höhe von'
000885160623     A            COMFITR        5S 3O    +1
000886160623     A                                      EDTWRD('0 ,   ')
000887160623     A                                    +1
000888160623     A                                      '% berechnet.'
000889160623     A*%%***********************************************************************
000890160623     A*%%SS
000891160623     A*%%***********************************************************************
000892160623     A          R TA49PTF4
000893160623     A*%%***********************************************************************
000894160623     A*%%RI 00000
000895160623     A*%%***********************************************************************
000896160623     A                                      SPACEB(001)
000897160623     A                                     1
000898160623     A                                      'Der Zuschlag wird nach der Staffel-
000899160623     A                                      ung, dem Verbraucherpreis für Diese-
000900160623     A                                      lkraftstoff und dem jeweils geltend-
000901160623     A                                      en Prozentsatz'
000902160623     A                                     1
000903160623     A                                      'berechnet:'
000904160623     A                                      SPACEB(001)
000905160623     A*%%***********************************************************************
000906160623     A*%%SS
000907160623     A*%%CL 001
000908160623     A*%%***********************************************************************
000909160623     A          R TA49PTF5
000910160623     A*%%***********************************************************************
000911160623     A*%%RI 00000
000912160623     A*%%***********************************************************************
000913160623     A                                      SPACEB(001)
000914160623     A                                     1
000915160623     A                                      'Minimum:'
000916160623     A            COMPMA         5S 3O    +1
000917160623     A                                      EDTWRD('0 ,   ')
000918160623     A                                    +1
000919160623     A                                      '%'
000920160623     A*%%***********************************************************************
000921160623     A*%%SS
000922160623     A*%%***********************************************************************
000923160623     A          R TA49PTF3
000924160623     A*%%***********************************************************************
000925160623     A*%%RI 00000
000926160623     A*%%***********************************************************************
000927160623     A                                      SPACEB(001)
000928160623     A                                     1
000929160623     A                                      'Auf unserer Website www.BRT.it ste-
000930160623     A                                      hen sowohl die "Durchschnittspreise-
000931160623     A                                       für Dieselöl" als auch die Tabelle-
000932160623     A                                       "Erhöhungen/'
000933160623     A                                     1
000934160623     A                                      'Reduzierungen des Ölpreises" sowie-
000935160623     A                                       der Mindestanwendungswert zur Verf-
000936160623     A                                      ügung, den der Auftraggeber ausdrüc-
000937160623     A                                      klich annimmt.'
000938160623     A                                      SPACEB(001)
000939160623     A*%%***********************************************************************
000940160623     A*%%SS
000941160623     A*%%CL 001
000942160623     A*%%***********************************************************************
000943160623     A          R TA49PTF6
000944160623     A*%%***********************************************************************
000945160623     A*%%RI 00000
000946160623     A*%%***********************************************************************
000947160623     A                                      SPACEB(001)
000948160623     A                                     1
000949160623     A                                      'Auf unserer Website www.BRT.it ste-
000950160623     A                                      hen sowohl die "Durchschnittspreise-
000951160623     A                                       für Dieselöl" als auch die Tabelle-
000952160623     A                                       "Erhöhungen/'
000953160623     A                                     1
000954160623     A                                      'Reduzierungen des Ölpreises", den -
000955160623     A                                      der Auftraggeber ausdrücklich annim-
000956160623     A                                      mt.'
000957160623     A                                      SPACEB(001)
000958160623     A*%%***********************************************************************
000959160623     A*%%SS
000960160623     A*%%CL 001
000961160623     A*%%***********************************************************************
000962160623     A          R TA49PGI
000963160623     A*%%***********************************************************************
000964160623     A*%%RI 00000
000965160623     A*%%FS 001
000966160623     A*%%***********************************************************************
000967160623     A                                      SPACEB(002)
000968160623     A                                     1
000969160623     A                                      'ZWISCHENLAGERUNGEN:'
000970160623     A                                      HIGHLIGHT
000971160623     A                                    +1
000972160623     A                                      'Bearbeitungsgebühr          :'
000973160623     A            COMSGD        11S 3O    51
000974160623     A                                      EDTCDE(2)
000975160623     A  28                                +1
000976160623     A                                      'Verschiedene Kosten'
000977160623     A  28        COMSGV        11S 3O    +2
000978160623     A                                      EDTCDE(2)
000979160623     A  28                                +1
000980160623     A                                      'pro Sendung'
000981160623     A                                     1
000982160623     A                                      'Kosten für die erneute Zustellung -
000983160623     A                                      im Stadtgebiet'
000984160623     A                                      SPACEB(001)
000985160623     A                                     1
000986160623     A                                      'nach vollem Doppelzentner         -
000987160623     A                                                    :'
000988160623     A                                      SPACEB(001)
000989160623     A            COMSGR        11S 3O    51
000990160623     A                                      EDTCDE(2)
000991160623     A                                    +1
000992160623     A                                      'in der Provinz'
000993160623     A            COMSGP        11S 3O    +1
000994160623     A                                      EDTCDE(2)
000995160623     A                                    +1
000996160623     A                                      'nach vollem Doppelzentner'
000997160623     A                                     1
000998160623     A                                      'Kosten für Aufbewahrung nach volle-
000999160623     A                                      m Doppelzenter:'
001000160623     A                                      SPACEB(001)
001001160623     A            COMST1        11S 3O    +1
001002160623     A                                      EDTCDE(2)
001003160623     A                                    +1
001004160623     A                                      'pro Tag für die ersten'
001005160623     A            COMSG1         3S 0O    +1
001006160623     A                                      EDTCDE(Z)
001007160623     A                                    +1
001008160623     A                                      'Tage;'
001009160623     A                                     1
001010160623     A                                      SPACEB(001)
001011160623     A                                      'für die nachfolgenden Tage        -
001012160623     A                                                    :'
001013160623     A            COMST2        11S 3O    +1
001014160623     A                                      EDTCDE(2)
001015160623     A                                    +1
001016160623     A                                      'pro Tag, mit einem Minimum von '
001017160623     A            COMSTM        11S 3O    +1
001018160623     A                                      EDTCDE(2)
001019160623     A                                     1
001020160623     A                                      SPACEB(001)
001021160623     A                                      'Für die Rücksendung vereinbarte Ta-
001022160623     A                                      ge            :'
001023160623     A            COMGGR         2S 0O   +13
001024160623     A                                      EDTCDE(Z)
001025160623     A                                    +1
001026160623     A                                      'Das Volumen zwecks Besteuerung bet-
001027160623     A                                      rägt'
001028160623     A            COMGPV         4S 0O    +1
001029160623     A                                      EDTCDE(2)
001030160623     A                                    66
001031160623     A                                      'kg pro Kubikmeter'
001032160623     A                                      SPACEB(001)
001033160623     A*%%***********************************************************************
001034160623     A*%%SS
001035160623     A*%%CL 001
001036160623     A*%%CL 001
001037160623     A*%%CL 001
001038160623     A*%%CL 001
001039160623     A*%%CL 001
001040160623     A*%%CL 001
001041160623     A*%%***********************************************************************
001042160623     A          R TA49PGIF
001043160623     A*%%***********************************************************************
001044160623     A*%%RI 00000
001045160623     A*%%***********************************************************************
001046160623     A                                      SPACEB(001)
001047160623     A                                     1
001048160623     A                                      'Tage mit Selbstbeteiligung        -
001049160623     A                                                    :'
001050160623     A            COMSGF         2S 0O   +13
001051160623     A                                      EDTCDE(Z)
001052160623     A                                    +1
001053160623     A                                      'Anwendung der Selbstbeteiligung:'
001054160623     A            COMAPF        54A  O    66
001055160623     A                                      SPACEB(001)
001056160623     A*%%***********************************************************************
001057160623     A*%%SS
001058160623     A*%%CL 001
001059160623     A*%%***********************************************************************
001060160623     A          R TA49PGI1
001061160623     A*%%***********************************************************************
001062160623     A*%%RI 00000
001063160623     A*%%***********************************************************************
001064160623     A                                      SPACEB(001)
001065160623     A                                     1
001066160623     A                                      'Sollten Sendungen unabgeholt im La-
001067160623     A                                      ger verbleiben, wird die Ware dem A-
001068160623     A                                      bsender nach der'
001069160623     A            COMNAV         1S 0O    +1
001070160623     A                                    +0
001071160623     A                                      '. Benachrichtigung auf dessen Risi-
001072160623     A                                      ko'
001073160623     A                                     1
001074160623     A                                      'zurückgesendet, und es werden ihm -
001075160623     A                                      die anfallenden Kosten in Rechnung -
001076160623     A                                      gestellt.'
001077160623     A                                      SPACEB(001)
001078160623     A            COMNAVD        4A  O    +1
001079160623     A*%%***********************************************************************
001080160623     A*%%SS
001081160623     A*%%CL 001
001082160623     A*%%***********************************************************************
001083160623     A          R TA49PCON
001084160623     A*%%***********************************************************************
001085160623     A*%%RI 00000
001086160623     A*%%FS 001
001087160623     A*%%***********************************************************************
001088160623     A                                      SPACEB(002)
001089160623     A                                     1
001090160623     A                                      'ZAHLUNGSBEDINGUNGEN:'
001091160623     A                                      HIGHLIGHT
001092160623     A            DESCDP        28A  O    +1
001093160623     A  72                               +16
001094160623     A                                      'Kosten für die Versendung der Rech-
001095160623     A                                      nung:'
001096160623     A  72        VALSIN         5S 3O    +1
001097160623     A                                      EDTCDE(2)
001098160623     A*%%***********************************************************************
001099160623     A*%%SS
001100160623     A*%%***********************************************************************
001101160623     A          R TA49PCON1
001102160623     A*%%***********************************************************************
001103160623     A*%%RI 00000
001104160623     A*%%***********************************************************************
001105160623     A                                      SPACEB(001)
001106160623     A                                     1
001107160623     A                                      'Bankverdindung:'
001108160623     A            PCABI          5S 0O    +6
001109160623     A                                      EDTCDE(Z)
001110160623     A            PCCAB          5S 0O    +1
001111160623     A                                      EDTCDE(Z)
001112160623     A            DESBNA        36A  O    +2
001113160623     A*%%***********************************************************************
001114160623     A*%%SS
001115160623     A*%%***********************************************************************
001116160623     A          R TA49PAM
001117160623     A*%%***********************************************************************
001118160623     A*%%RI 00000
001119160623     A*%%FS 001
001120160623     A*%%***********************************************************************
001121160623     A                                      SPACEB(002)
001122160623     A                                     1
001123160623     A                                      'WARENVERSICHERUNG'
001124160623     A                                      HIGHLIGHT
001125160623     A                                     1
001126160623     A                                      'Die eventuelle ALL RISK-Versicheru-
001127160623     A                                      ng mit Versicherungsauftrag AC PLUS-
001128160623     A                                       bzw. mit im Frachtpapier ausgewies-
001129160623     A                                      enem Warenwert'
001130160623     A                                      SPACEB(001)
001131160623     A                                     1
001132160623     A                                      'sieht in jedem Fall eine Obergrenz-
001133160623     A                                      e des erstattungsfähigen Betrags vo-
001134160623     A                                      n maximal Euro 100.000,00 für alle -
001135160623     A                                      Sendungen an jeden'
001136160623     A                                      SPACEB(001)
001137160623     A                                     1
001138160623     A                                      'einzelnen Empfänger am selben Tag -
001139160623     A                                      vor.'
001140160623     A                                      SPACEB(001)
001141160623     A*%%***********************************************************************
001142160623     A*%%SS
001143160623     A*%%CL 001
001144160623     A*%%CL 001
001145160623     A*%%CL 001
001146160623     A*%%***********************************************************************
001147160623     A          R TA49PAM1
001148160623     A*%%***********************************************************************
001149160623     A*%%RI 00000
001150160623     A*%%***********************************************************************
001151160623     A                                      SPACEB(001)
001152160623     A                                     1
001153160623     A                                      'Die eventuelle ALL RISK Versicheru-
001154160623     A                                      ng mit Versicherungsauftrag AC BASE-
001155160623     A                                       sieht in jedem Fall eine Obergrenz-
001156160623     A                                      e des '
001157160623     A                                     1
001158160623     A                                      'erstattungsfähigen Betrags von max-
001159160623     A                                      imal Euro 6,20 pro kg vor.'
001160160623     A                                      SPACEB(001)
001161160623     A*%%***********************************************************************
001162160623     A*%%SS
001163160623     A*%%CL 001
001164160623     A*%%***********************************************************************
001165160623     A          R TA49PTE
001166160623     A*%%***********************************************************************
001167160623     A*%%RI 00000
001168160623     A*%%FS 001
001169160623     A*%%***********************************************************************
001170160623     A                                      SPACEB(002)
001171160623     A                                     1
001172160623     A                                      'TELEFONNUMMER DES EMPFÄNGERS'
001173160623     A                                      HIGHLIGHT
001174160623     A                                     1
001175160623     A                                      'Für jede Sendung muss die Telefonn-
001176160623     A                                      ummer des Empfängers angegeben werd-
001177160623     A                                      en.'
001178160623     A                                      SPACEB(001)
001179160623     A                                     1
001180160623     A                                      'Anderenfalls kann es möglicherweis-
001181160623     A                                      e zu Verzögerungen bei der Zustellu-
001182160623     A                                      ng kommen.'
001183160623     A                                      SPACEB(001)
001184160623     A                                     1
001185160623     A                                      'Wenn keine Telefonnummer angegeben-
001186160623     A                                       ist, setzten wir uns bei Sendungen-
001187160623     A                                       direkt an Privatkunden nach der 2.-
001188160623     A                                       hinterlassenen'
001189160623     A                                      SPACEB(001)
001190160623     A                                     1
001191160623     A                                      'Benachrichtigung nicht mehr mit de-
001192160623     A                                      m Empfänger in Verbindung; bei Term-
001193160623     A                                      inlieferungen liefern wir zum gewün-
001194160623     A                                      schten Datum'
001195160623     A                                      SPACEB(001)
001196160623     A                                     1
001197160623     A                                      'oder unter Einhaltung der vereinba-
001198160623     A                                      rten Rücknahmetermine ohne telefoni-
001199160623     A                                      sche Benachrichtigung aus.'
001200160623     A                                      SPACEB(001)
001201160623     A*%%***********************************************************************
001202160623     A*%%SS
001203160623     A*%%CL 001
001204160623     A*%%CL 001
001205160623     A*%%CL 001
001206160623     A*%%CL 001
001207160623     A*%%CL 001
001208160623     A*%%***********************************************************************
001209160623     A          R TA49PTEE
001210160623     A*%%***********************************************************************
001211160623     A*%%RI 00000
001212160623     A*%%FS 001
001213160623     A*%%***********************************************************************
001214160623     A                                      SPACEB(002)
001215160623     A                                     1
001216160623     A                                      'TELEFONNUMMER DES EMPFÄNGERS'
001217160623     A                                      HIGHLIGHT
001218160623     A                                     1
001219160623     A                                      'Bei Nachnahme-und unfreien Sendung-
001220160623     A                                      en muss der Name und die Telefonnum-
001221160623     A                                      mer des Empfängers angegeben werden-
001222160623     A                                      .'
001223160623     A                                      SPACEB(001)
001224160623     A                                     1
001225160623     A                                      'Anderenfalls kann es möglicherweis-
001226160623     A                                      e zu Verzögerungen bei der Zustellu-
001227160623     A                                      ng kommen.'
001228160623     A                                      SPACEB(001)
001229160623     A*%%***********************************************************************
001230160623     A*%%SS
001231160623     A*%%CL 001
001232160623     A*%%CL 001
001233160623     A*%%***********************************************************************
001234160623     A          R TA49PEE
001235160623     A*%%***********************************************************************
001236160623     A*%%RI 00000
001237160623     A*%%FS 001
001238160623     A*%%***********************************************************************
001239160623     A                                      SPACEB(002)
001240160623     A                                     1
001241160623     A                                      'UNFREIE EXPORT-SENDUNGEN'
001242160623     A                                      HIGHLIGHT
001243160623     A                                     1
001244160623     A                                      'Bei eventuellen unfreien Sendungen-
001245160623     A                                      , die nicht vom Empfänger gezahlt w-
001246160623     A                                      erden, wird der Betrag dem Versende-
001247160623     A                                      r'
001248160623     A                                      SPACEB(001)
001249160623     A                                     1
001250160623     A                                      'in Rechnung gestellt.'
001251160623     A                                      SPACEB(001)
001252160623     A*%%***********************************************************************
001253160623     A*%%SS
001254160623     A*%%CL 001
001255160623     A*%%CL 001
001256160623     A*%%***********************************************************************
001257160623     A          R TA49PEE1
001258160623     A*%%***********************************************************************
001259160623     A*%%RI 00000
001260160623     A*%%FS 001
001261160623     A*%%***********************************************************************
001262160623     A                                      SPACEB(002)
001263160623     A                                     1
001264160623     A                                      'EXPORT-SENDUNGEN GEGEN NACHNAHME'
001265160623     A                                      HIGHLIGHT
001266160623     A                                     1
001267160623     A                                      'Angenommen werden nur Wertpapiere -
001268160623     A                                      (Schecks von auf den Versender laut-
001269160623     A                                      enden Bankkonten), für die jede Haf-
001270160623     A                                      tung'
001271160623     A                                      SPACEB(001)
001272160623     A                                     1
001273160623     A                                      'ausgeschlossen ist. Beträge in Höh-
001274160623     A                                      e von mehr als Euro'
001275160623     A                                      SPACEB(001)
001276160623     A            STALCA        13S 3O    +1
001277160623     A                                      EDTCDE(4)
001278160623     A                                    +1
001279160623     A                                      'werden nicht angenommen. Der Nachn-
001280160623     A                                      ahmeservice'
001281160623     A                                     1
001282160623     A                                      'steht in den folgenden Ländern zur-
001283160623     A                                       Verfügung: Benelux, Deutschland, F-
001284160623     A                                      rankreich (einschließlich Korsika),'
001285160623     A                                      SPACEB(001)
001286160623     A                                     1
001287160623     A                                      'Fürstentum Monaco, Österreich, Por-
001288160623     A                                      tugal (einschließlich Azoren und Ma-
001289160623     A                                      deira), Schweiz, Spanien (einschlie-
001290160623     A                                      ßlich Balearen).'
001291160623     A                                      SPACEB(001)
001292160623     A                                     1
001293160623     A                                      'Nicht zur Verfügung steht der Serv-
001294160623     A                                      ice für: Irland (Eire + Ulster), Gr-
001295160623     A                                      oßbritannien, Polen, Tschechische R-
001296160623     A                                      epublik,'
001297160623     A                                      SPACEB(001)
001298160623     A                                     1
001299160623     A                                      'Slowakische Republik, Slowenien, U-
001300160623     A                                      ngarn, Ceuta/Melilla, Kanarische In-
001301160623     A                                      seln, Andorra, Gibraltar, Finland, -
001302160623     A                                      Estland,'
001303160623     A                                      SPACEB(001)
001304160623     A                                     1
001305160623     A                                      'Lettland, Litauen und Norwegen.'
001306160623     A                                      SPACEB(001)
001307160623     A*%%***********************************************************************
001308160623     A*%%SS
001309160623     A*%%CL 001
001310160623     A*%%CL 001
001311160623     A*%%CL 001
001312160623     A*%%CL 001
001313160623     A*%%CL 001
001314160623     A*%%CL 001
001315160623     A*%%CL 001
001316160623     A*%%***********************************************************************
001317160623     A          R TA49PEMA
001318160623     A*%%***********************************************************************
001319160623     A*%%RI 00000
001320160623     A*%%FS 001
001321160623     A*%%***********************************************************************
001322160623     A                                      SPACEB(002)
001323160623     A                                     1
001324160623     A                                      'ONLINE-SERVICELEISTUNGEN UND MITTE-
001325160623     A                                      ILUNGEN PER E-MAIL'
001326160623     A                                      HIGHLIGHT
001327160623     A*%%***********************************************************************
001328160623     A*%%SS
001329160623     A*%%***********************************************************************
001330160623     A          R TA49PEMA1
001331160623     A*%%***********************************************************************
001332160623     A*%%RI 00000
001333160623     A*%%***********************************************************************
001334160623     A                                      SPACEB(001)
001335160623     A                                     1
001336160623     A                                      'Wenn Sie unsere "ONLINE-Servicelei-
001337160623     A                                      stungenn" (Abholaufträge/Sendunsver-
001338160623     A                                      folgung/Abwicklung der Zwischenlage-
001339160623     A                                      rungen/POD-Image)'
001340160623      *----
001341160623     A                                     1
001342160623     A                                      SPACEB(001)
001343160623     A                                      'in Anspruch nehmen möchten, bitten-
001344160623     A                                       wir Sie, uns die E-Mail-Adresse de-
001345160623     A                                      r zuständigen Person mitzuteilen,'
001346160623      *----
001347160623     A                                     1
001348160623     A                                      SPACEB(001)
001349160623     A                                      'der das erforderliche Passwort zug-
001350160623     A                                      esendet wird und die für den ordnun-
001351160623     A                                      gsgemäßen Gebrauch desslben verantw-
001352160623     A                                      ortlich ist:'
001353160623      *----
001354160623     A                                     1
001355160623     A                                      SPACEB(001)
001356160623     A                                      'Name'
001357160623     A                                      HIGHLIGHT
001358160623     A                                    +1
001359160623     A                                      '__________________________________-
001360160623     A                                      _______________'
001361160623     A                                    +2
001362160623     A                                      'E-Mail'
001363160623     A                                      HIGHLIGHT
001364160623     A                                    +1
001365160623     A                                      '__________________________________-
001366160623     A                                      ________________'
001367160623     A*%%***********************************************************************
001368160623     A*%%SS
001369160623     A*%%CL 001
001370160623     A*%%CL 001
001371160623     A*%%CL 001
001372160623     A*%%***********************************************************************
001373160623     A          R TA49PEMA2
001374160623     A*%%***********************************************************************
001375160623     A*%%RI 00000
001376160623     A*%%***********************************************************************
001377160623     A                                      SPACEB(001)
001378160623     A                                     1
001379160623     A                                      'Wenn Sie die folgenden Unterlagen -
001380160623     A                                      per E-Mail erhalten möchten, geben -
001381160623     A                                      Sie bitte die entsprechenden Adress-
001382160623     A                                      en an:'
001383160623     A*%%***********************************************************************
001384160623     A*%%SS
001385160623     A*%%***********************************************************************
001386160623     A          R TA49PEMA3
001387160623     A*%%***********************************************************************
001388160623     A*%%RI 00000
001389160623     A*%%***********************************************************************
001390160623     A                                      SPACEB(001)
001391160623     A                                     1
001392160623     A                                      'Senden der Detaildaten der Bankübe-
001393160623     A                                      rweisung im Falle Zahlung von Nachn-
001394160623     A                                      ahmebeträgen: E-Mail ______________-
001395160623     A                                      _______________'
001396160623     A*%%***********************************************************************
001397160623     A*%%SS
001398160623     A*%%***********************************************************************
001399160623     A          R TA49PEMA4
001400160623     A*%%***********************************************************************
001401160623     A*%%RI 00000
001402160623     A*%%***********************************************************************
001403160623     A                                      SPACEB(001)
001404160623     A                                     1
001405160623     A                                      'Senden der Benachrichtigung im Fal-
001406160623     A                                      le einer Zwischenlagerung: E-Mail _-
001407160623     A                                      ___________________________________-
001408160623     A                                      _______________'
001409160623     A*%%***********************************************************************
001410160623     A*%%SS
001411160623     A*%%***********************************************************************
001412160623     A          R TA49PEMA5
001413160623     A*%%***********************************************************************
001414160623     A*%%RI 00000
001415160623     A*%%***********************************************************************
001416160623     A                                      SPACEB(001)
001417160623     A                                     1
001418160623     A                                      'Senden einer Benachrichtigung im S-
001419160623     A                                      chadensfall: E-Mail _______________-
001420160623     A                                      ___________________________________-
001421160623     A                                      _______________'
001422160623     A*%%***********************************************************************
001423160623     A*%%SS
001424160623     A*%%***********************************************************************
001425160623     A          R TA49PEMA7
001426160623     A*%%***********************************************************************
001427160623     A*%%RI 00000
001428160623     A*%%***********************************************************************
001429160623     A                                      SPACEB(001)
001430160623     A                                     1
001431160623     A                                      'Senden von Rechnungen im PDF-Forma-
001432160623     A                                      t: E-Mail _________________________-
001433160623     A                                      ___________________________________-
001434160623     A                                      _______________'
001435160623     A*%%***********************************************************************
001436160623     A*%%SS
001437160623     A*%%***********************************************************************
001438160623     A          R TA49PEMA8
001439160623     A*%%***********************************************************************
001440160623     A*%%RI 00000
001441160623     A*%%***********************************************************************
001442160623     A                                      SPACEB(001)
001443160623     A                                     1
001444160623     A                                      'Senden der administrativen Mitteil-
001445160623     A                                      ungen: E-Mail _____________________-
001446160623     A                                      ___________________________________-
001447160623     A                                      _______________'
001448160623     A*%%***********************************************************************
001449160623     A*%%SS
001450160623     A*%%***********************************************************************
001451160623     A          R TA49PEMA6
001452160623     A*%%***********************************************************************
001453160623     A*%%RI 00000
001454160623     A*%%***********************************************************************
001455160623     A                                      SPACEB(001)
001456160623     A                                     1
001457160623     A                                      'ZUSTIMMUNG ZUR BEHANDLUNG DER PERS-
001458160623     A                                      ÖNLICHEN DATEN'
001459160623      *---
001460160623     A                                     1
001461160623     A                                      SPACEB(001)
001462160623     A                                      'Die oben genannten Daten dienen de-
001463160623     A                                      m Zugriff auf die ONLINE-Servicelei-
001464160623     A                                      stungen und werden für Mitteilungen-
001465160623     A                                       zu Werbezwecken'
001466160623      *---
001467160623     A                                     1
001468160623     A                                      SPACEB(001)
001469160623     A                                      'per Fax oder E-Mail verwendet.'
001470160623      *---
001471160623     A                                     1
001472160623     A                                      SPACEB(001)
001473160623     A                                      'Dabei besteht jederzeit das Recht -
001474160623     A                                      zur Inanspruchnahme der in Art. 7 d-
001475160623     A                                      er italienichen Rechtsverordnung'
001476160623     A                                     1
001477160623     A                                      SPACEB(001)
001478160623     A                                      '196/2003 genannten Rechte.'
001479160623     A*%%***********************************************************************
001480160623     A*%%SS
001481160623     A*%%CL 001
001482160623     A*%%CL 001
001483160623     A*%%CL 001
001484160623     A*%%CL 001
001485160623     A*%%***********************************************************************
001486160623     A          R TA49PE1
001487160623     A*%%***********************************************************************
001488160623     A*%%RI 00000
001489160623     A*%%FS 001
001490160623     A*%%***********************************************************************
001491160623     A                                      SPACEB(002)
001492160623     A                                     1
001493160623     A                                      'DIE ANGELEGTEN ALLGEMEINEN BEDINGU-
001494160623     A                                      NGEN (FORMULAR '
001495160623     A                                      HIGHLIGHT
001496160623     A            STPMOD         3S 0O    +1
001497160623     A                                      EDTCDE(Z)
001498160623     A                                      HIGHLIGHT
001499160623     A                                    +1
001500160623     A                                      '/'
001501160623     A                                      HIGHLIGHT
001502160623     A            STPANNO        4S 0O    +1
001503160623     A                                      HIGHLIGHT
001504160623     A                                    +1
001505160623     A                                      '), DEREN ERHALT UND KENNTNISNAHME -
001506160623     A                                      DER AUFTRAGGEBER BESTÄTIGT,'
001507160623     A                                      HIGHLIGHT
001508160623     A                                     1
001509160623     A                                      'SIND FESTER BESTANDTEIL DES VORLIE-
001510160623     A                                      GENDEN VERTRAGS, PREISLISTE, DIE VO-
001511160623     A                                      N DEN PARTEIEN ZU ZEICHNEN IST.'
001512160623     A                                      HIGHLIGHT
001513160623     A                                      SPACEB(001)
001514160623     A*%%***********************************************************************
001515160623     A*%%SS
001516160623     A*%%CL 001
001517160623     A*%%***********************************************************************
001518160623     A          R TA49PFI
001519160623     A*%%***********************************************************************
001520160623     A*%%RI 00000
001521160623     A*%%FS 001
001522160623     A*%%***********************************************************************
001523160623     A                                      SPACEB(002)
001524160623     A                                     1
001525160623     A                                      'Die Spedition'
001526160623     A            RSUTOLD       20A  O    +3
001527160623     A                                   +26
001528160623     A                                      'Der Auftraggeber'
001529160623     A                                    +1
001530160623     A                                      '__________________________________-
001531160623     A                                      _____'
001532160623     A                                    55
001533160623     A                                      'Stempel und Unterschrift'
001534160623     A                                      SPACEB(001)
001535160623     A*%%***********************************************************************
001536160623     A*%%SS
001537160623     A*%%CL 001
001538160623     A*%%***********************************************************************
001539160623     A          R TA49PE2
001540160623     A*%%***********************************************************************
001541160623     A*%%RI 00000
001542160623     A*%%FS 001
001543160623     A*%%***********************************************************************
001544160623     A                                      SPACEB(002)
001545160623     A                                     1
001546160623     A                                      'AUSDRÜCKLICH ANGENOMMENE BEDINGUNG-
001547160623     A                                      EN: Laut Art. 1341 und 1342 des ita-
001548160623     A                                      lienishen Bürgerlichen Gesetzbuchs -
001549160623     A                                      erklärt der  '
001550160623     A*%%***********************************************************************
001551160623     A*%%SS
001552160623     A*%%***********************************************************************
001553160623     A          R TA49PE2B
001554160623     A*%%***********************************************************************
001555160623     A*%%RI 00000
001556160623     A*%%***********************************************************************
001557160623     A                                      SPACEB(001)
001558160623     A                                     1
001559160623     A                                      'Auftraggeber hiermit, die folgende-
001560160623     A                                      n Klauseln der Allgemeinen und Beso-
001561160623     A                                      nderen Geschäftsbedingungen sorgfäl-
001562160623     A                                      tig gelesen und'
001563160623     A*%%***********************************************************************
001564160623     A*%%SS
001565160623     A*%%***********************************************************************
001566160623     A          R TA49PE2C
001567160623     A*%%***********************************************************************
001568160623     A*%%RI 00000
001569160623     A*%%***********************************************************************
001570160623     A                                      SPACEB(001)
001571160623     A                                     1
001572160623     A                                      'geprüft zu haben und sie anzunehme-
001573160623     A                                      n: 1 (Allgemeine Geschäftsbedingung-
001574160623     A                                      en); 3 (Zahlungs-/Vergütungsfristen-
001575160623     A                                      ); 4 (Haftung'
001576160623     A*%%***********************************************************************
001577160623     A*%%SS
001578160623     A*%%***********************************************************************
001579160623     A          R TA49PE2D
001580160623     A*%%***********************************************************************
001581160623     A*%%RI 00000
001582160623     A*%%***********************************************************************
001583160623     A                                      SPACEB(001)
001584160623     A                                     1
001585160623     A                                      'des Frachtführers); 5 (Güterversic-
001586160623     A                                      herung); 6 (Zufallsereignis und höh-
001587160623     A                                      ere Gewalt); 7 (Liefer-und Zustellb-
001588160623     A                                      edingungen);'
001589160623     A*%%***********************************************************************
001590160623     A*%%SS
001591160623     A*%%***********************************************************************
001592160623     A          R TA49PE2E
001593160623     A*%%***********************************************************************
001594160623     A*%%RI 00000
001595160623     A*%%***********************************************************************
001596160623     A                                      SPACEB(001)
001597160623     A                                     1
001598160623     A                                      '8 (Zwischenlagerung); 9 (Gültigkei-
001599160623     A                                      t des Angebots-Ausdrückliche Auflös-
001600160623     A                                      ungsklausel); 10 (Gefahrengüter); 1-
001601160623     A                                      1 (Sendung gegen'
001602160623     A*%%***********************************************************************
001603160623     A*%%SS
001604160623     A*%%***********************************************************************
001605160623     A          R TA49PE2F
001606160623     A*%%***********************************************************************
001607160623     A*%%RI 00000
001608160623     A*%%***********************************************************************
001609160623     A                                      SPACEB(001)
001610160623     A                                     1
001611160623     A                                      'Nachnahme); 12 C (Vom Frachtführer-
001612160623     A                                       nicht akzeptierte Güter); 16 (Tran-
001613160623     A                                      sportdokumente); 17 (Zurückbehaltun-
001614160623     A                                      gsrecht);'
001615160623     A*%%***********************************************************************
001616160623     A*%%SS
001617160623     A*%%***********************************************************************
001618160623     A          R TA49PE2G
001619160623     A*%%***********************************************************************
001620160623     A*%%RI 00000
001621160623     A*%%***********************************************************************
001622160623     A                                      SPACEB(001)
001623160623     A                                     1
001624160623     A                                      '19 (Gerichtsstand); 24 (Anwendbare-
001625160623     A                                      s Recht); 26 (Transport von Sendung-
001626160623     A                                      en, die unter das italienische Gese-
001627160623     A                                      tz Nr. 136/2010).'
001628160623     A*%%***********************************************************************
001629160623     A*%%SS
001630160623     A*%%NP
001631160623     A*%%***********************************************************************
001632160623     A          R TA49PFIN
001633160623     A*%%***********************************************************************
001634160623     A*%%RI 00000
001635160623     A*%%FS 063
001636160623     A*%%***********************************************************************
001637160623     A                                      SKIPB(064)
001638160623     A                                    53
001639160623     A                                      'FORTSETZUNG AUF SEITE'
001640160623     A            PAGE           4S 0O    +1
001641160623     A                                      EDTCDE(Z)
001642160623     A*%%***********************************************************************
001643160623     A*%%SS
001644160623     A*%%***********************************************************************
001645160623     A          R TA49PERR
001646160623     A*%%***********************************************************************
001647160623     A*%%RI 00000
001648160623     A*%%FS 001
001649160623     A*%%***********************************************************************
001650160623     A                                      SPACEB(002)
001651160623     A                                     1
001652160623     A                                      '====>  TARIFFA/OFFERTA NON STAMPAB-
001653160623     A                                      ILE IN MODO CORRETTO  <===='
001654160623     A            ERRMSG        78A        1
001655160623     A                                      SPACEB(001)
001656160623     A*%%***********************************************************************
001657160623     A*%%SS
001658160623     A*%%CL 001
001659160623     A*%%CP+999CRTPRTF
001660160623     A*%%CP+    FILE(GAITRAFIL/TNTA49P4)
001661160623     A*%%CP+    DEVTYPE(*SCS)
001662160623     A*%%CP+    PAGESIZE(*N 124)
001663160623     A*%%CP+    CPI(16,7)
001664160623     A*%%CP     OVRFLW(65)
001665160623     A*%%CS+999CRTPRTF
001666160623     A*%%CS+    FILE(QTEMP/QPRDRPT)
001667160623     A*%%CS+    DEVTYPE(*SCS)
001668160623     A*%%CS     PAGESIZE(*N 132)
001669160623     A*%%***********************************************************************
