000100001124     H DECEDIT('0,') DATEDIT(*DMY.)
000200001124
000300001124      *****************************************************************
000400001124      *                                                               *
000500001124      *       STAMPA TARIFFE CON ADDIZIONALE DI GESTIONE              *
000600001124      *                                                               *
000700001124      *****************************************************************
000800001124
000900001124     FTNTA19D   CF   E             WORKSTN
001000001124
001100001124      *   D S   I N T E R N E / E S T E R N E
001200001124
001300001124     D Parm01          DS
001400001124     D  pstp                          2
001500001124
001600001124     D KPJBA         E DS
001700001124
001800001124      ***************************************************************
001900001124      * RICHIESTA STAMPANTE
002000001124      ***************************************************************
002100001124     C     *ENTRY        PLIST
002200001124     C                   PARM                    KPJBA
002300001124
002400001124     C                   eval      v1stp = 'SI'
002500001124
002600001124     C                   do        *hival
002700001124     C                   exfmt     tnta1901
002800001124
002900001124      * F3  - Fine lavoro
003000001124     C   kc              leave
003100001124
003200001124      * F6  - Conferma
003300001124     C                   if        *inkf = *on
003400001124     C                   exsr      Sr_Conferma
003500001124     C                   leave
003600001124     C                   endif
003700001124
003800001124     C                   enddo
003900001124
004000001124     C                   eval      *inlr = *on
004100001124      **********************************************************************
004200001124      * F6 - CONFERMA
004300001124      **********************************************************************
004400001124     C     Sr_Conferma   begsr
004500001124
004600001124     C                   eval      pstp = v1stp
004700001124     C                   movel     parm01        kpjbu
004800001124     C*************      move      'XXXX'        kcoaz
004900001124     C                   call      'TNTA20R'
005000001124     C*************      call      'BCH10'
005100001124     C                   parm                    kpjba
005200001124
005300001124     C                   endsr
