000001170103     A*%%***********************************************************************
000002170103     A*%%TS  RD  20170103  123300  EDPGA       REL-V7R1M0  5770-WDS
000003170103     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004170103     A*%%FI       0000000000000000000000000000000000000000000000000
000005170103     A*%%***********************************************************************
000006170103     A          R TA50PPP
000007170103     A*%%***********************************************************************
000008170103     A*%%RI 00000
000009170103     A*%%FS 009
000010170103     A*%%***********************************************************************
000011170103     A                                      SKIPB(010)
000012170103     A            BIANCO         1A  O     1
000013170103     A*%%***********************************************************************
000014170103     A*%%SS
000015170103     A*%%***********************************************************************
000016170103     A          R TA50P01
000017170103     A*%%***********************************************************************
000018170103     A*%%RI 00000
000019170103     A*%%***********************************************************************
000020170103     A                                      SPACEB(001)
000021170103     A                                     1
000022170103     A                                      'Filiale in:'
000023170103     A            TD1FIL        20A  O     1
000024170103     A                                      SPACEB(001)
000025170103     A            TD1VIA        25A  O     1
000026170103     A                                      SPACEB(001)
000027170103     A            TD1CAP         5S 0O     1
000028170103     A                                      SPACEB(001)
000029170103     A                                      EDTCDE(Z)
000030170103     A            TD1LOC        25A  O    +1
000031170103     A            TD1PRV         2A  O    +1
000032170103     A                                   +28
000033170103     A                                      'AN'
000034170103     A                                     1
000035170103     A                                      'TEL.'
000036170103     A                                      SPACEB(001)
000037170103     A            TD2TEL        13A  O    +1
000038170103     A                                    +1
000039170103     A                                      'FAX.'
000040170103     A            TD2TFX        13A  O    +1
000041170103     A            PICRAG        48A  O   +25
000042170103     A            PICIND        35A  O    63
000043170103     A                                      SPACEB(001)
000044170103     A            PICCAP         9A  O    63
000045170103     A                                      SPACEB(001)
000046170103     A            PICLOC        30A  O    +1
000047170103     A            PICPRO         2A  O    +1
000048170103     A            DESNAR        25A  O    63
000049170103     A                                      SPACEB(001)
000050170103     A            PICDAL        35A  O     1
000051170103     A                                      SPACEB(001)
000052170103     A  73                               +21
000053170103     A                                      'z.Hd.'
000054170103     A  73        RESPTRA       60A  O    +1
000055170103     A                                      HIGHLIGHT
000056170103     A                                     1
000057170103     A                                      'Unser Zeichen'
000058170103     A                                      SPACEB(001)
000059170103     A            PICNR1         2A  O    +1
000060170103     A                                    +1
000061170103     A                                      '/'
000062170103     A            PICNR2         2A  O    +1
000063170103     A  77        RESPTRA2      60A  O   +41
000064170103     A                                      HIGHLIGHT
000065170103     A                                     1
000066170103     A                                      'Telefonischer Ansprechpartner: Her-
000067170103     A                                      r'
000068170103     A                                      SPACEB(001)
000069170103     A            DESCOM        25A  O    +1
000070170103     A            DESTAR        35A  O    47
000071170103     A                                      SPACEB(001)
000072170103     A                                      HIGHLIGHT
000073170103     A                                     1
000074170103     A                                      SPACEB(002)
000075170103     A                                      'Mit Bezug auf die getroffenen Vere-
000076170103     A                                      inbarungen freuen wir uns, Ihnen un-
000077170103     A                                      ser bestes Angebot (in'
000078170103     A            DESDIV         5A  O    +1
000079170103     A                                    +0
000080170103     A                                      ') für den Transport Ihrer'
000081170103     A                                     1
000082170103     A                                      SPACEB(001)
000083170103     A                                      'Sendungen zu unterdreiten, der sic-
000084170103     A                                      h zu Ihren Lasten versteht:'
000085170103     A*%%***********************************************************************
000086170103     A*%%SS
000087170103     A*%%CL 001
000088170103     A*%%CL 001
000089170103     A*%%CL 001
000090170103     A*%%CL 001
000091170103     A*%%CL 001
000092170103     A*%%CL 001
000093170103     A*%%CL 001
000094170103     A*%%CL 001
000095170103     A*%%CL 001
000096170103     A*%%CL 001
000097170103     A*%%CL 001
000098170103     A*%%CL 002
000099170103     A*%%CL 001
000100170103     A*%%***********************************************************************
000101170103     A          R TA50P02A
000102170103     A*%%***********************************************************************
000103170103     A*%%RI 00000
000104170103     A*%%***********************************************************************
000105170103     A                                      SPACEB(001)
000106170103     A            PRTLNP        80A  O     1
000107170103     A                                      HIGHLIGHT
000108170103     A*%%***********************************************************************
000109170103     A*%%SS
000110170103     A*%%***********************************************************************
000111170103     A          R TA50P02
000112170103     A*%%***********************************************************************
000113170103     A*%%RI 00000
000114170103     A*%%***********************************************************************
000115170103     A                                      SPACEB(001)
000116170103     A                                     1
000117170103     A                                      '-----------------------------------
000118170103     A                                      ------------------------------------
000119170103     A                                      ------------------------------------
000120170103     A                                      ------------------- '
000121170103     A                                      HIGHLIGHT
000122170103     A                                     2
000123170103     A                                      'Von Ihrem Lager nach:'
000124170103     A                                      SPACEB(001)
000125170103     A            DZONA1        10A  O    36
000126170103     A                                      HIGHLIGHT
000127170103     A            DZONA2        10A  O    49
000128170103     A                                      HIGHLIGHT
000129170103     A            DZONA3        10A  O    62
000130170103     A                                      HIGHLIGHT
000131170103     A            DZONA4        10A  O    75
000132170103     A                                      HIGHLIGHT
000133170103     A            DZONA5        10A  O    88
000134170103     A                                      HIGHLIGHT
000135170103     A            DZONA6        10A  O   101
000136170103     A                                      HIGHLIGHT
000137170103     A            DZONA7        10A  O   114
000138170103     A                                      HIGHLIGHT
000139170103     A            DESUM         10A  O     2
000140170103     A                                      SPACEB(001)
000141170103     A                                     1
000142170103     A                                      '-----------------------------------
000143170103     A                                      ------------------------------------
000144170103     A                                      ------------------------------------
000145170103     A                                      ------------------- '
000146170103     A                                      SPACEB(001)
000147170103     A                                      HIGHLIGHT
000148170103     A*%%***********************************************************************
000149170103     A*%%SS
000150170103     A*%%CL 001
000151170103     A*%%CL 001
000152170103     A*%%CL 001
000153170103     A*%%***********************************************************************
000154170103     A          R TA50P02B
000155170103     A*%%***********************************************************************
000156170103     A*%%RI 00000
000157170103     A*%%***********************************************************************
000158170103     A                                      SPACEB(001)
000159170103     A                                     1
000160170103     A                                      '-----------------------------------
000161170103     A                                      ------------------------------------
000162170103     A                                      ------------------------------------
000163170103     A                                      ------------------- '
000164170103     A                                      HIGHLIGHT
000165170103     A N78                                 2
000166170103     A                                      'Von'
000167170103     A                                      SPACEB(001)
000168170103     A N78                                +1
000169170103     A                                      'Ihrem Lager'
000170170103     A                                      HIGHLIGHT
000171170103     A            DESUM         10A  O   +12
000172170103     A                                      HIGHLIGHT
000173170103     A  78                                  SPACEB(001)
000174170103     A            DISSCA        80A  O    +5
000175170103     A                                      HIGHLIGHT
000176170103     A N78                                 2
000177170103     A                                      'nach:'
000178170103     A                                      HIGHLIGHT
000179170103     A                                      SPACEB(001)
000180170103     A N79        PRTATF        80A  O    44
000181170103     A                                      HIGHLIGHT
000182170103     A  78N79                               SPACEB(001)
000183170103     A                                     1
000184170103     A                                      '-----------------------------------
000185170103     A                                      ------------------------------------
000186170103     A                                      ------------------------------------
000187170103     A                                      ------------------- '
000188170103     A                                      SPACEB(001)
000189170103     A                                      HIGHLIGHT
000190170103     A*%%***********************************************************************
000191170103     A*%%SS
000192170103     A*%%CL 001
000193170103     A*%%CL 001
000194170103     A*%%CL 001
000195170103     A*%%CL 001
000196170103     A*%%CL 001
000197170103     A*%%***********************************************************************
000198170103     A          R TA50P03A
000199170103     A*%%***********************************************************************
000200170103     A*%%RI 00000
000201170103     A*%%***********************************************************************
000202170103     A                                      SPACEB(001)
000203170103     A                                     1
000204170103     A                                      'MEHR ALS'
000205170103     A                                      HIGHLIGHT
000206170103     A            P03ATA         7S 2O    +1
000207170103     A                                      HIGHLIGHT
000208170103     A                                      EDTCDE(4)
000209170103     A                                    +1
000210170103     A                                      'KG - Der Preis pro kg ist mit dem -
000211170103     A                                      Gesamtgewicht der Sendung zu multip-
000212170103     A                                      lizieren'
000213170103     A                                      HIGHLIGHT
000214170103     A*%%***********************************************************************
000215170103     A*%%SS
000216170103     A*%%***********************************************************************
000217170103     A          R TA50P03
000218170103     A*%%***********************************************************************
000219170103     A*%%RI 00000
000220170103     A*%%***********************************************************************
000221170103     A                                      SPACEB(001)
000222170103     A            TAR01          7S 3O    37
000223170103     A                                      EDTCDE(4)
000224170103     A            TAR02          7S 3O    50
000225170103     A                                      EDTCDE(4)
000226170103     A            TAR03          7S 3O    63
000227170103     A                                      EDTCDE(4)
000228170103     A            TAR04          7S 3O    76
000229170103     A                                      EDTCDE(4)
000230170103     A            TAR05          7S 3O    89
000231170103     A                                      EDTCDE(4)
000232170103     A            TAR06          7S 3O   102
000233170103     A                                      EDTCDE(4)
000234170103     A            TAR07          7S 3O   115
000235170103     A                                      EDTCDE(4)
000236170103     A            P03SGLD        8A  O     4
000237170103     A  50                                13
000238170103     A                                      '-'
000239170103     A  50        P03SGLA        8A  O    15
000240170103     A*%%***********************************************************************
000241170103     A*%%SS
000242170103     A*%%***********************************************************************
000243170103     A          R TA50P03B
000244170103     A*%%***********************************************************************
000245170103     A*%%RI 00000
000246170103     A*%%***********************************************************************
000247170103     A                                      SPACEB(001)
000248170103     A            P03DES        42A  O     1
000249170103     A  61        TAR01P         6S 3O    +4
000250170103     A                                      EDTWRD(' 0 ,   ')
000251170103     A            PER01          1A  O    +1
000252170103     A  62        TAR02P         6S 3O    +4
000253170103     A                                      EDTWRD(' 0 ,   ')
000254170103     A            PER02          1A  O    +1
000255170103     A  63        TAR03P         6S 3O    +4
000256170103     A                                      EDTWRD(' 0 ,   ')
000257170103     A            PER03          1A  O    +1
000258170103     A  64        TAR04P         6S 3O    +4
000259170103     A                                      EDTWRD(' 0 ,   ')
000260170103     A            PER04          1A  O    +1
000261170103     A  65        TAR05P         6S 3O    +4
000262170103     A                                      EDTWRD(' 0 ,   ')
000263170103     A            PER05          1A  O    +1
000264170103     A  66        TAR06P         6S 3O    +4
000265170103     A                                      EDTWRD(' 0 ,   ')
000266170103     A            PER06          1A  O    +1
000267170103     A*%%***********************************************************************
000268170103     A*%%SS
000269170103     A*%%***********************************************************************
000270170103     A          R TA50P06
000271170103     A*%%***********************************************************************
000272170103     A*%%RI 00000
000273170103     A*%%FS 001
000274170103     A*%%***********************************************************************
000275170103     A                                      SPACEB(002)
000276170103     A                                     1
000277170103     A                                      'Gütervolumen zwecks Besteuerung:'
000278170103     A            P06RPV         4  0O    +1
000279170103     A                                      EDTCDE(2)
000280170103     A                                    +1
000281170103     A                                      'kg pro Kubikmeter'
000282170103     A*%%***********************************************************************
000283170103     A*%%SS
000284170103     A*%%***********************************************************************
000285170103     A          R TA50P05
000286170103     A*%%***********************************************************************
000287170103     A*%%RI 00000
000288170103     A*%%***********************************************************************
000289170103     A                                      SPACEB(001)
000290170103     A                                     1
000291170103     A                                      'Rundungen:'
000292170103     A            P05AR1        45A  O    12
000293170103     A            P05AR2        45A  O    12
000294170103     A                                      SPACEB(001)
000295170103     A*%%***********************************************************************
000296170103     A*%%SS
000297170103     A*%%CL 001
000298170103     A*%%***********************************************************************
000299170103     A          R TA50P07
000300170103     A*%%***********************************************************************
000301170103     A*%%RI 00000
000302170103     A*%%FS 001
000303170103     A*%%***********************************************************************
000304170103     A                                      SPACEB(002)
000305170103     A                                     1
000306170103     A                                      'Kunden Kode:'
000307170103     A                                      HIGHLIGHT
000308170103     A                                      UNDERLINE
000309170103     A            P07KSC         7S 0O    +1
000310170103     A                                      HIGHLIGHT
000311170103     A                                      UNDERLINE
000312170103     A  98                                +2
000313170103     A                                      'Ang.Nr.:'
000314170103     A                                      HIGHLIGHT
000315170103     A  98N85     P07NRV         6S 0O    32
000316170103     A                                      EDTCDE(Z)
000317170103     A                                      HIGHLIGHT
000318170103     A  98N85                             39
000319170103     A                                      '-'
000320170103     A                                      HIGHLIGHT
000321170103     A  98N85     P07PRV         1S 0O    41
000322170103     A                                      EDTCDE(Z)
000323170103     A                                      HIGHLIGHT
000324170103     A  85        P07NTRA        7S 0O    32
000325170103     A                                      EDTCDE(Z)
000326170103     A                                      HIGHLIGHT
000327170103     A                                     1
000328170103     A                                      'Preis:'
000329170103     A                                      SPACEB(001)
000330170103     A                                      HIGHLIGHT
000331170103     A            DESCTR        13A  O    +1
000332170103     A                                      HIGHLIGHT
000333170103     A                                    +1
000334170103     A                                      '-'
000335170103     A                                      HIGHLIGHT
000336170103     A N85        PTARIFFA      12A  O    25
000337170103     A  85        PTRATTA       14A  O    24
000338170103     A                                    +1
000339170103     A                                      '-'
000340170103     A                                      HIGHLIGHT
000341170103     A            P07DES        47A  O    +1
000342170103     A                                      HIGHLIGHT
000343170103     A*%%***********************************************************************
000344170103     A*%%SS
000345170103     A*%%CL 001
000346170103     A*%%***********************************************************************
000347170103     A          R TA50P07S
000348170103     A*%%***********************************************************************
000349170103     A*%%RI 00000
000350170103     A*%%***********************************************************************
000351170103     A                                      SPACEB(001)
000352170103     A                                      HIGHLIGHT
000353170103     A                                     1
000354170103     A                                      'Anwendung : Gestaffelt'
000355170103     A*%%***********************************************************************
000356170103     A*%%SS
000357170103     A*%%***********************************************************************
000358170103     A          R TA50P07G
000359170103     A*%%***********************************************************************
000360170103     A*%%RI 00000
000361170103     A*%%***********************************************************************
000362170103     A                                      SPACEB(001)
000363170103     A                                      HIGHLIGHT
000364170103     A                                     1
000365170103     A                                      'Anwendung : Höchste vorherige Stuf-
000366170103     A                                      e'
000367170103     A*%%***********************************************************************
000368170103     A*%%SS
000369170103     A*%%***********************************************************************
000370170103     A          R TA50P08
000371170103     A*%%***********************************************************************
000372170103     A*%%RI 00000
000373170103     A*%%***********************************************************************
000374170103     A                                      SPACEB(001)
000375170103     A                                     1
000376170103     A                                      'Art der Serviceleistung, auf die s-
000377170103     A                                      ich der Preis bezieht: Beschreibung-
000378170103     A                                       und Beschränkungen.'
000379170103     A*%%***********************************************************************
000380170103     A*%%SS
000381170103     A*%%***********************************************************************
000382170103     A          R TA50P08E
000383170103     A*%%***********************************************************************
000384170103     A*%%RI 00000
000385170103     A*%%***********************************************************************
000386170103     A                                      SPACEB(001)
000387170103     A                                     1
000388170103     A                                      'Express-Pakete: Sendungen, die aus-
000389170103     A                                       mehreren Packstücken mit Höchstgew-
000390170103     A                                      icht von je 68 kg bestehen.'
000391170103     A                                     1
000392170103     A                                      '                Die maximal pro Ex-
000393170103     A                                      press-Paket zulässigen Maße: 274 cm-
000394170103     A                                       an der längsten Seite des Packstüc-
000395170103     A                                      ks.'
000396170103     A                                      SPACEB(001)
000397170103     A                                     1
000398170103     A                                      '                Maximale Abmessung-
000399170103     A                                      en(Länge + Umfang): 330 cm.'
000400170103     A                                      SPACEB(001)
000401170103     A                                     1
000402170103     A                                      '                Der su Zollzwecken-
000403170103     A                                       erklärbare Höchstwert: 50.000 US-D-
000404170103     A                                      ollar.'
000405170103     A                                      SPACEB(001)
000406170103     A*%%***********************************************************************
000407170103     A*%%SS
000408170103     A*%%CL 001
000409170103     A*%%CL 001
000410170103     A*%%CL 001
000411170103     A*%%***********************************************************************
000412170103     A          R TA50P08M
000413170103     A*%%***********************************************************************
000414170103     A*%%RI 00000
000415170103     A*%%***********************************************************************
000416170103     A                                      SPACEB(001)
000417170103     A                                     1
000418170103     A                                      'Frachtgut: Sendungen, die aus mind-
000419170103     A                                      estens einem Packstück mit einem Ge-
000420170103     A                                      wicht mehr als 68 kg bestehen.'
000421170103     A                                     1
000422170103     A                                      '           Die maximal pro Frachtg-
000423170103     A                                      ut-Sendung zulässigen Maße der läng-
000424170103     A                                      sten Seite des Packstücks: 302 cm.'
000425170103     A                                      SPACEB(001)
000426170103     A                                     1
000427170103     A                                      '           Maximale Abmessungen (L-
000428170103     A                                      änge + Umfang): 762 cm.'
000429170103     A                                      SPACEB(001)
000430170103     A                                     1
000431170103     A                                      '           Der zu Zollzwecken erkl-
000432170103     A                                      ärbare Höchstwert: 100.000 US-Dolla-
000433170103     A                                      r.'
000434170103     A                                      SPACEB(001)
000435170103     A                                     1
000436170103     A                                      '           In den Zonen F und G st-
000437170103     A                                      eht der Frachtgut-Service nicht zur-
000438170103     A                                       Verfügung. In anderen Zonen unterl-
000439170103     A                                      iegt der '
000440170103     A                                      SPACEB(001)
000441170103     A                                     1
000442170103     A                                      '           Frachtgut-Service mögli-
000443170103     A                                      cherweise Beschränkungen: Genaue Au-
000444170103     A                                      skünfte erhalten Sie bei unserem Ku-
000445170103     A                                      ndenservice.'
000446170103     A                                      SPACEB(001)
000447170103     A*%%***********************************************************************
000448170103     A*%%SS
000449170103     A*%%CL 001
000450170103     A*%%CL 001
000451170103     A*%%CL 001
000452170103     A*%%CL 001
000453170103     A*%%CL 001
000454170103     A*%%***********************************************************************
000455170103     A          R TA50P08D
000456170103     A*%%***********************************************************************
000457170103     A*%%RI 00000
000458170103     A*%%***********************************************************************
000459170103     A                                      SPACEB(001)
000460170103     A                                     1
000461170103     A                                      'Briefpost und Dokumente: Sendungen-
000462170103     A                                       mit einem Höchstgewicht von 2,5 kg-
000463170103     A                                      .'
000464170103     A                                     1
000465170103     A                                      '                         Der zu Zo-
000466170103     A                                      llzwecken erklärbare Höchstwert: 10-
000467170103     A                                      0 US-Dollar.'
000468170103     A                                      SPACEB(001)
000469170103     A*%%***********************************************************************
000470170103     A*%%SS
000471170103     A*%%CL 001
000472170103     A*%%***********************************************************************
000473170103     A          R TA50P08Z
000474170103     A*%%***********************************************************************
000475170103     A*%%RI 00000
000476170103     A*%%FS 001
000477170103     A*%%***********************************************************************
000478170103     A                                      SPACEB(002)
000479170103     A                                     1
000480170103     A                                      'NACHNAHME: DIESER SERVICE STEHT NI-
000481170103     A                                      CHT ZUR VERFÜGUNG'
000482170103     A                                      HIGHLIGHT
000483170103     A                                     1
000484170103     A                                      'UNFREIE SENDUNGEN: DIESER SERVICE -
000485170103     A                                      STEHT NICHT ZUR VERFÜGUNG'
000486170103     A                                      HIGHLIGHT
000487170103     A                                      SPACEB(001)
000488170103     A*%%***********************************************************************
000489170103     A*%%SS
000490170103     A*%%CL 001
000491170103     A*%%***********************************************************************
000492170103     A          R TA50P09
000493170103     A*%%***********************************************************************
000494170103     A*%%RI 00000
000495170103     A*%%FS 001
000496170103     A*%%***********************************************************************
000497170103     A                                      SPACEB(002)
000498170103     A                                     1
000499170103     A                                      'Die Preise gelten vom'
000500170103     A                                      HIGHLIGHT
000501170103     A            STADDT        10A  O    +1
000502170103     A                                      HIGHLIGHT
000503170103     A                                    +1
000504170103     A                                      'biz zum'
000505170103     A                                      HIGHLIGHT
000506170103     A            STADST        10A  O    +1
000507170103     A                                      HIGHLIGHT
000508170103     A  26                                +2
000509170103     A                                      'und für:'
000510170103     A                                      HIGHLIGHT
000511170103     A*%%***********************************************************************
000512170103     A*%%SS
000513170103     A*%%***********************************************************************
000514170103     A          R TA50P09A
000515170103     A*%%***********************************************************************
000516170103     A*%%RI 00000
000517170103     A*%%***********************************************************************
000518170103     A                                      SPACEB(001)
000519170103     A                                     1
000520170103     A                                      'Jährliche Sendungen: mindestens'
000521170103     A            COMLRC         7S 0O    +1
000522170103     A                                      EDTCDE(Z)
000523170103     A                                    +1
000524170103     A                                      'höchstens'
000525170103     A            COMLAS         7S 0O    +1
000526170103     A                                      EDTCDE(Z)
000527170103     A*%%***********************************************************************
000528170103     A*%%SS
000529170103     A*%%***********************************************************************
000530170103     A          R TA50P09B
000531170103     A*%%***********************************************************************
000532170103     A*%%RI 00000
000533170103     A*%%***********************************************************************
000534170103     A                                      SPACEB(001)
000535170103     A                                     1
000536170103     A                                      'Ware mit durchschnittlichem spezif-
000537170103     A                                      ischen Gewicht von:'
000538170103     A            COMKPM         5S 1O    +1
000539170103     A                                      EDTWRD('  0 , ')
000540170103     A                                    +1
000541170103     A                                      'kg pro Kubikmeter'
000542170103     A*%%***********************************************************************
000543170103     A*%%SS
000544170103     A*%%***********************************************************************
000545170103     A          R TA50P09C
000546170103     A*%%***********************************************************************
000547170103     A*%%RI 00000
000548170103     A*%%***********************************************************************
000549170103     A                                      SPACEB(001)
000550170103     A                                     1
000551170103     A                                      'Ware mit einem Packstückvolumen vo-
000552170103     A                                      n'
000553170103     A            COMCKM         5S 1O    +1
000554170103     A                                      EDTWRD('0 ,   ')
000555170103     A                                    +1
000556170103     A                                      'Kubikmeter'
000557170103     A*%%***********************************************************************
000558170103     A*%%SS
000559170103     A*%%***********************************************************************
000560170103     A          R TA50P09S
000561170103     A*%%***********************************************************************
000562170103     A*%%RI 00000
000563170103     A*%%***********************************************************************
000564170103     A                                      SPACEB(001)
000565170103     A*%%***********************************************************************
000566170103     A*%%SS
000567170103     A*%%***********************************************************************
000568170103     A          R TA50P10
000569170103     A*%%***********************************************************************
000570170103     A*%%RI 00000
000571170103     A*%%***********************************************************************
000572170103     A                                      SPACEB(001)
000573170103     A            COMNOT        60A  O     1
000574170103     A*%%***********************************************************************
000575170103     A*%%SS
000576170103     A*%%***********************************************************************
000577170103     A          R TA50P11
000578170103     A*%%***********************************************************************
000579170103     A*%%RI 00000
000580170103     A*%%FS 001
000581170103     A*%%***********************************************************************
000582170103     A                                      SPACEB(002)
000583170103     A                                     1
000584170103     A                                      'ABGABEN UND ZUSÄTZLICHE GEBÜHREN:'
000585170103     A                                      HIGHLIGHT
000586170103     A                                     1
000587170103     A                                      'Gesetzliche Abgaben: geltende MwSt'
000588170103     A                                      SPACEB(001)
000589170103     A                                    +2
000590170103     A                                      '-'
000591170103     A  27        COMDAG        50A  O    +2
000592170103     A  27        COMCAG         5S 2O    +1
000593170103     A                                      EDTWRD(' 0 ,  ')
000594170103     A  27                                +1
000595170103     A                                      '%'
000596170103     A  29        COMDAG1       50A  O    40
000597170103     A                                      SPACEB(001)
000598170103     A  29        COMCAG1        5S 2O    +1
000599170103     A                                      EDTWRD(' 0 ,  ')
000600170103     A  29                                +1
000601170103     A                                      '%'
000602170103     A*%%***********************************************************************
000603170103     A*%%SS
000604170103     A*%%CL 001
000605170103     A*%%CL 001
000606170103     A*%%***********************************************************************
000607170103     A          R TA50PIST
000608170103     A*%%***********************************************************************
000609170103     A*%%RI 00000
000610170103     A*%%***********************************************************************
000611170103     A                                      SPACEB(001)
000612170103     A                                     1
000613170103     A                                      'Seit'
000614170103     A            DTAIST         8S 0O    +1
000615170103     A                                      EDTWRD('  /  /    ')
000616170103     A                                    +1
000617170103     A                                      'werden die Tarife entsprechend den-
000618170103     A                                       im Laufe des Vorjahres verzeichnet-
000619170103     A                                      en Preiserhöhungen'
000620170103     A  11                                +1
000621170103     A                                      '(um'
000622170103     A  11        TAMPRI         5S 2O     1
000623170103     A                                      SPACEB(001)
000624170103     A                                      EDTCDE(L)
000625170103     A  11                                +0
000626170103     A                                      '%) jährlich angepasst. Der Umfang -
000627170103     A                                      der jährlichen Preisschwankungen en-
000628170103     A                                      tspricht dem Verbraucherpreisindex'
000629170103     A  11                                 1
000630170103     A                                      'für alle privaten Haushalte (NIC),-
000631170103     A                                       der den Durchschnitt von 12 monatl-
000632170103     A                                      ichen Erhebungen darstellt und auf -
000633170103     A                                      der '
000634170103     A                                      SPACEB(001)
000635170103     A  11                                 1
000636170103     A                                      'Webseite des Nationalen Instituts -
000637170103     A                                      für Statistik ISTAT (www.istat.it) -
000638170103     A                                      veröffentlicht wird.'
000639170103     A                                      SPACEB(001)
000640170103     A N11                                 1
000641170103     A                                      'jährlich angepasst. Der Umfang der-
000642170103     A                                       jährlichen Preisschwankungen entsp-
000643170103     A                                      richt dem Verbraucherpreisindex für'
000644170103     A                                      SPACEB(001)
000645170103     A N11                                 1
000646170103     A                                      'alle privaten Haushalte (NIC), der-
000647170103     A                                       den Durchschnitt von 12 monatliche-
000648170103     A                                      n Erhebungen darstellt und auf der'
000649170103     A                                      SPACEB(001)
000650170103     A N11                                 1
000651170103     A                                      'Webseite des Nationalen Instituts -
000652170103     A                                      für Statistik ISTAT (www.istat.it) -
000653170103     A                                      veröffentlicht wird.'
000654170103     A                                      SPACEB(001)
000655170103     A*%%***********************************************************************
000656170103     A*%%SS
000657170103     A*%%CL 001
000658170103     A*%%CL 001
000659170103     A*%%CL 001
000660170103     A*%%CL 001
000661170103     A*%%CL 001
000662170103     A*%%CL 001
000663170103     A*%%***********************************************************************
000664170103     A          R TA50PSTD
000665170103     A*%%***********************************************************************
000666170103     A*%%RI 00000
000667170103     A*%%***********************************************************************
000668170103     A                                      SPACEB(001)
000669170103     A            COMSTD        31A  O     1
000670170103     A                                      HIGHLIGHT
000671170103     A            COMDSTD       83A  O    33
000672170103     A*%%***********************************************************************
000673170103     A*%%SS
000674170103     A*%%***********************************************************************
000675170103     A          R TA50PSE2
000676170103     A*%%***********************************************************************
000677170103     A*%%RI 00000
000678170103     A*%%***********************************************************************
000679170103     A                                      SPACEB(001)
000680170103     A                                     1
000681170103     A                                      'Für eine Expresslieferung muss das-
000682170103     A                                       Dokument mit der Aufschrift "Expre-
000683170103     A                                      ss" stioder mit dem speziellen von -
000684170103     A                                      uns gelieferten'
000685170103     A                                     1
000686170103     A                                      'Aufkleber versehen werden.'
000687170103     A                                      SPACEB(001)
000688170103     A*%%***********************************************************************
000689170103     A*%%SS
000690170103     A*%%CL 001
000691170103     A*%%***********************************************************************
000692170103     A          R TA50PTP
000693170103     A*%%***********************************************************************
000694170103     A*%%RI 00000
000695170103     A*%%***********************************************************************
000696170103     A                                      SPACEB(001)
000697170103     A  08                                 1
000698170103     A                                      'Mindestmenge für die Besteuerung:'
000699170103     A  08        COMMTS         3S 0O    +1
000700170103     A                                      EDTCDE(Z)
000701170103     A  08                                +1
000702170103     A                                      'kg.'
000703170103     A                                    +3
000704170103     A                                      'Rundungen:'
000705170103     A  18        ARROT1        45A  O    +1
000706170103     A  18 20     ARROT2        45A  O    56
000707170103     A  20                                  SPACEB(001)
000708170103     A  19                                 1
000709170103     A                                      'Zwecks Besteuerung gilt ein Güterv-
000710170103     A                                      olumen von'
000711170103     A                                      SPACEB(001)
000712170103     A  19        COMRPV         4S 0O    +1
000713170103     A                                      EDTCDE(2)
000714170103     A  19                                +1
000715170103     A                                      'kg pro Kubikmeter.'
000716170103     A*%%***********************************************************************
000717170103     A*%%SS                                                   :
000718170103     A*%%CL 001
000719170103     A*%%CL 001
000720170103     A*%%***********************************************************************
000721170103     A          R TA50POR2
000722170103     A*%%***********************************************************************
000723170103     A*%%RI 00000
000724170103     A*%%***********************************************************************
000725170103     A                                      SPACEB(001)
000726170103     A                                     1
000727170103     A                                      'Für Sendungen mit Eingang in Ihrem-
000728170103     A                                       Lager.'
000729170103     A*%%***********************************************************************
000730170103     A*%%SS
000731170103     A*%%***********************************************************************
000732170103     A          R TA50PPC1
000733170103     A*%%***********************************************************************
000734170103     A*%%RI 00000
000735170103     A*%%***********************************************************************
000736170103     A                                      SPACEB(001)
000737170103     A                                     1
000738170103     A                                      'Einzug mit auf den'
000739170103     A            COMINT        20A  O    +1
000740170103     A                                      HIGHLIGHT
000741170103     A                                    +1
000742170103     A                                      'ausgestelltem Scheck'
000743170103     A*%%***********************************************************************
000744170103     A*%%SS
000745170103     A*%%***********************************************************************
000746170103     A          R TA50PPC2
000747170103     A*%%***********************************************************************
000748170103     A*%%RI 00000
000749170103     A*%%***********************************************************************
000750170103     A                                      SPACEB(001)
000751170103     A                                     1
000752170103     A                                      'Bedingungen für die Rückerstattung-
000753170103     A                                      :'
000754170103     A            COMAAS         9A  O    +1
000755170103     A                                    +1
000756170103     A                                      'IBAN:'
000757170103     A            COMBAB1        4A  O    +1
000758170103     A            COMBAB2        4A  O    +1
000759170103     A            COMBAB3        4A  O    +1
000760170103     A            COMBAB4        4A  O    +1
000761170103     A            COMBAB5        4A  O    +1
000762170103     A            COMBAB6        4A  O    +1
000763170103     A            COMBAB7        4A  O    +1
000764170103     A            COMBAB8        4A  O    +1
000765170103     A*%%***********************************************************************
000766170103     A*%%SS
000767170103     A*%%***********************************************************************
000768170103     A          R TA50PTAM
000769170103     A*%%***********************************************************************
000770170103     A*%%RI 00000
000771170103     A*%%***********************************************************************
000772170103     A                                      SPACEB(001)
000773170103     A                                      HIGHLIGHT
000774170103     A                                     1
000775170103     A                                      'WARENVERSICHERUNG :'
000776170103     A*%%***********************************************************************
000777170103     A*%%SS
000778170103     A*%%***********************************************************************
000779170103     A          R TA50PEL
000780170103     A*%%***********************************************************************
000781170103     A*%%RI 00000
000782170103     A*%%***********************************************************************
000783170103     A                                      SPACEB(001)
000784170103     A                                     1
000785170103     A                                      'Kostenbeitreibung            '
000786170103     A            STPPER         7A  O    +3
000787170103     A                                    +1
000788170103     A                                      '% sul valore eccedente i'
000789170103     A            COMLRP         5S 3O    +1
000790170103     A                                      EDTCDE(2)
000791170103     A            DESDIV         5A  O    +1
000792170103     A                                    +1
000793170103     A                                      'a kg.'
000794170103     A*%%***********************************************************************
000795170103     A*%%SS
000796170103     A*%%***********************************************************************
000797170103     A          R TA50PEL1
000798170103     A*%%***********************************************************************
000799170103     A*%%RI 00000
000800170103     A*%%***********************************************************************
000801170103     A                                      SPACEB(001)
000802170103     A                                      HIGHLIGHT
000803170103     A                                     1
000804170103     A                                      'MANDATO INTEGRATIVO AD ELEVARE IL -
000805170103     A                                      LIMITE DI RISARCIMENTO A'
000806170103     A            DESDIV         5A  O    +1
000807170103     A            COMELR         7S 3O    +1
000808170103     A                                      EDTCDE(2)
000809170103     A                                    +1
000810170103     A                                      'A KG.'
000811170103     A*%%***********************************************************************
000812170103     A*%%SS
000813170103     A*%%***********************************************************************
000814170103     A          R TA50PEL2
000815170103     A*%%***********************************************************************
000816170103     A*%%RI 00000
000817170103     A*%%***********************************************************************
000818170103     A                                      SPACEB(001)
000819170103     A                                      HIGHLIGHT
000820170103     A                                     1
000821170103     A                                      'COPERTURA ASSICURATIVA PER RESPONS-
000822170103     A                                      ABILITA'' VETTORIALE (LEGGE 450/85)'
000823170103     A*%%***********************************************************************
000824170103     A*%%SS
000825170103     A*%%***********************************************************************
000826170103     A          R TA50PMA
000827170103     A*%%***********************************************************************
000828170103     A*%%RI 00000
000829170103     A*%%***********************************************************************
000830170103     A                                      SPACEB(001)
000831170103     A                                     1
000832170103     A                                      'Kostenbeitreibung    '
000833170103     A            COMMA         83A  O   +11
000834170103     A*%%***********************************************************************
000835170103     A*%%SS
000836170103     A*%%***********************************************************************
000837170103     A          R TA50PMA1
000838170103     A*%%***********************************************************************
000839170103     A*%%RI 00000
000840170103     A*%%***********************************************************************
000841170103     A                                      SPACEB(001)
000842170103     A                                      HIGHLIGHT
000843170103     A                                     1
000844170103     A                                      'VERSICHERUNGSVOLLMACHT ALL RISK - -
000845170103     A                                      AC PLUS, FÜR WARE MIT FESTGESETZTEM-
000846170103     A                                       WERT IN HÖHE VON EURO'
000847170103     A            COMVLM        11S 3O    +1
000848170103     A                                      EDTCDE(3)
000849170103     A                                    +1
000850170103     A                                      'PRO'
000851170103     A            DESFVM        10A  O    +1
000852170103     A*%%***********************************************************************
000853170103     A*%%SS
000854170103     A*%%***********************************************************************
000855170103     A          R TA50PMA2
000856170103     A*%%***********************************************************************
000857170103     A*%%RI 00000
000858170103     A*%%***********************************************************************
000859170103     A                                      SPACEB(001)
000860170103     A                                      HIGHLIGHT
000861170103     A                                     1
000862170103     A                                      'VERSICHERUNGSVOLLMACHT ALL RISK - -
000863170103     A                                      AC BASE ZWECKS DECKUNG BIS ZU EINEM-
000864170103     A                                       ERSTATTUNGSFÄHIGEN HÖCHSTBETRAG VO-
000865170103     A                                      N'
000866170103     A                                     1
000867170103     A                                      'EURO'
000868170103     A                                      SPACEB(001)
000869170103     A            COMVLM        11S 3O     6
000870170103     A                                      EDTCDE(3)
000871170103     A                                    19
000872170103     A                                      'PRO'
000873170103     A            DESFVM        10A  O    23
000874170103     A*%%***********************************************************************
000875170103     A*%%SS
000876170103     A*%%CL 001
000877170103     A*%%***********************************************************************
000878170103     A          R TA50PMAV
000879170103     A*%%***********************************************************************
000880170103     A*%%RI 00000
000881170103     A*%%***********************************************************************
000882170103     A                                      SPACEB(001)
000883170103     A                                      HIGHLIGHT
000884170103     A                                     1
000885170103     A                                      'VERSICHERUNGSVOLLMACHT ALL RISK - -
000886170103     A                                      AC PLUS, BEI EINDEUTIGER ANGABE DES-
000887170103     A                                       ZU VERSICHERNDEN WERTES AUF DEM TR-
000888170103     A                                      ANSPORTDOKUMENT.'
000889170103     A*%%***********************************************************************
000890170103     A*%%SS
000891170103     A*%%***********************************************************************
000892170103     A          R TA50PMAF1
000893170103     A*%%***********************************************************************
000894170103     A*%%RI 00000
000895170103     A*%%***********************************************************************
000896170103     A                                      SPACEB(001)
000897170103     A                                      HIGHLIGHT
000898170103     A                                     1
000899170103     A                                      'ES GILT DANN VERSICHERUNGSSCHUTZ F-
000900170103     A                                      ÜR EINE SENDUNG, WENN DER ZU VERSIC-
000901170103     A                                      HERNDE WARENWERT IM TRANSPORTDOKUME-
000902170103     A                                      NT'
000903170103     A                                     1
000904170103     A                                      'KLAR AUSGEWIESEN IST.'
000905170103     A                                      SPACEB(001)
000906170103     A*%%***********************************************************************
000907170103     A*%%SS
000908170103     A*%%CL 001
000909170103     A*%%***********************************************************************
000910170103     A          R TA50PVMA
000911170103     A*%%***********************************************************************
000912170103     A*%%RI 00000
000913170103     A*%%***********************************************************************
000914170103     A                                      SPACEB(001)
000915170103     A                                     1
000916170103     A                                      'Gültig für Sendungen der'
000917170103     A            COMVMA        22A  O    +1
000918170103     A*%%***********************************************************************
000919170103     A*%%SS
000920170103     A*%%***********************************************************************
000921170103     A          R TA50PEST
000922170103     A*%%***********************************************************************
000923170103     A*%%RI 00000
000924170103     A*%%***********************************************************************
000925170103     A                                      SPACEB(001)
000926170103     A            COMEST        83A  O    33
000927170103     A*%%***********************************************************************
000928170103     A*%%SS
000929170103     A*%%***********************************************************************
000930170103     A          R TA50PSTD1
000931170103     A*%%***********************************************************************
000932170103     A*%%RI 00000
000933170103     A*%%***********************************************************************
000934170103     A                                      SPACEB(001)
000935170103     A            COMSTDA1      31A  O     1
000936170103     A                                      HIGHLIGHT
000937170103     A            COMSTDB1      25A  O    32
000938170103     A            COMSTDA2      31A  O    60
000939170103     A                                      HIGHLIGHT
000940170103     A            COMSTDB2      25A  O    91
000941170103     A*%%***********************************************************************
000942170103     A*%%SS
000943170103     A*%%***********************************************************************
000944170103     A          R TA50PSTDC
000945170103     A*%%***********************************************************************
000946170103     A*%%RI 00000
000947170103     A*%%***********************************************************************
000948170103     A                                      SPACEB(001)
000949170103     A            COMSTDC      105A  O     1
000950170103     A                                      HIGHLIGHT
000951170103     A            COMSTDC1      10A  O    +0
000952170103     A*%%***********************************************************************
000953170103     A*%%SS
000954170103     A*%%***********************************************************************
000955170103     A          R TA50PGI
000956170103     A*%%***********************************************************************
000957170103     A*%%RI 00000
000958170103     A*%%FS 001
000959170103     A*%%***********************************************************************
000960170103     A                                      SPACEB(002)
000961170103     A                                     1
000962170103     A                                      'ZWISCHENLAGERUNGEN:'
000963170103     A                                      HIGHLIGHT
000964170103     A                                    21
000965170103     A                                      'Bearbeitungsgebühr          :'
000966170103     A            COMSGD        11S 3O    51
000967170103     A                                      EDTCDE(2)
000968170103     A  28                                +1
000969170103     A                                      'Verschiedene Kosten'
000970170103     A  28        COMSGV        11S 3O    +2
000971170103     A                                      EDTCDE(2)
000972170103     A  28                                +1
000973170103     A                                      'pro Sendung'
000974170103     A                                     1
000975170103     A                                      'Kosten für die erneute Zustellung -
000976170103     A                                      im Stadtgebiet'
000977170103     A                                      SPACEB(001)
000978170103     A                                     1
000979170103     A                                      'nach vollem Doppelzentner         -
000980170103     A                                                    :'
000981170103     A                                      SPACEB(001)
000982170103     A            COMSGR        11S 3O    51
000983170103     A                                      EDTCDE(2)
000984170103     A                                    +1
000985170103     A                                      'in der Provinz'
000986170103     A            COMSGP        11S 3O    +1
000987170103     A                                      EDTCDE(2)
000988170103     A                                    +1
000989170103     A                                      'nach vollem Doppelzentner'
000990170103     A                                     1
000991170103     A                                      'Kosten für Aufbewahrung nach volle-
000992170103     A                                      m Doppelzenter:'
000993170103     A                                      SPACEB(001)
000994170103     A            COMST1        11S 3O    +1
000995170103     A                                      EDTCDE(2)
000996170103     A                                    +1
000997170103     A                                      'pro Tag für die ersten'
000998170103     A            COMSG1         3S 0O    +1
000999170103     A                                      EDTCDE(Z)
001000170103     A                                    +1
001001170103     A                                      'Tage;'
001002170103     A                                     1
001003170103     A                                      SPACEB(001)
001004170103     A                                      'für die nachfolgenden Tage        -
001005170103     A                                                    :'
001006170103     A            COMST2        11S 3O    +1
001007170103     A                                      EDTCDE(2)
001008170103     A                                    +1
001009170103     A                                      'pro Tag, mit einem Minimum von '
001010170103     A            COMSTM        11S 3O    +1
001011170103     A                                      EDTCDE(2)
001012170103     A                                     1
001013170103     A                                      SPACEB(001)
001014170103     A                                      'Für die Rücksendung vereinbarte Ta-
001015170103     A                                      ge            :'
001016170103     A            COMGGR         2S 0O   +13
001017170103     A                                      EDTCDE(Z)
001018170103     A                                    +1
001019170103     A                                      'Das Volumen zwecks Besteuerung bet-
001020170103     A                                      rägt'
001021170103     A            COMGPV         4S 0O    +1
001022170103     A                                      EDTCDE(2)
001023170103     A                                    66
001024170103     A                                      'kg pro Kubikmeter'
001025170103     A                                      SPACEB(001)
001026170103     A*%%***********************************************************************
001027170103     A*%%SS
001028170103     A*%%CL 001
001029170103     A*%%CL 001
001030170103     A*%%CL 001
001031170103     A*%%CL 001
001032170103     A*%%CL 001
001033170103     A*%%CL 001
001034170103     A*%%***********************************************************************
001035170103     A          R TA50PGIF
001036170103     A*%%***********************************************************************
001037170103     A*%%RI 00000
001038170103     A*%%***********************************************************************
001039170103     A                                      SPACEB(001)
001040170103     A                                     1
001041170103     A                                      'Tage mit Selbstbeteiligung        -
001042170103     A                                                    :'
001043170103     A            COMSGF         2S 0O   +13
001044170103     A                                      EDTCDE(Z)
001045170103     A                                    +1
001046170103     A                                      'Anwendung der Selbstbeteiligung:'
001047170103     A            COMAPF        54A  O    66
001048170103     A                                      SPACEB(001)
001049170103     A*%%***********************************************************************
001050170103     A*%%SS
001051170103     A*%%CL 001
001052170103     A*%%***********************************************************************
001053170103     A          R TA50PGI1
001054170103     A*%%***********************************************************************
001055170103     A*%%RI 00000
001056170103     A*%%***********************************************************************
001057170103     A                                      SPACEB(001)
001058170103     A                                     1
001059170103     A                                      'Sollten Sendungen unabgeholt im La-
001060170103     A                                      ger verbleiben, wird die Ware dem A-
001061170103     A                                      bsender nach der'
001062170103     A            COMNAV         1S 0O    +1
001063170103     A                                    +0
001064170103     A                                      '. Benachrichtigung auf dessen Risi-
001065170103     A                                      ko '
001066170103     A                                     1
001067170103     A                                      'zurückgesendet, und es werden ihm -
001068170103     A                                      die anfallenden Kosten in Rechnung -
001069170103     A                                      gestellt.'
001070170103     A                                      SPACEB(001)
001071170103     A            COMNAVD        4A  O    +1
001072170103     A*%%***********************************************************************
001073170103     A*%%SS
001074170103     A*%%CL 001
001075170103     A*%%***********************************************************************
001076170103     A          R TA50PCON
001077170103     A*%%***********************************************************************
001078170103     A*%%RI 00000
001079170103     A*%%FS 001
001080170103     A*%%***********************************************************************
001081170103     A                                      SPACEB(002)
001082170103     A                                     1
001083170103     A                                      'ZAHLUNGSBEDINGUNGEN:'
001084170103     A                                      HIGHLIGHT
001085170103     A            DESCDP        28A  O    +1
001086170103     A  72                               +16
001087170103     A                                      'Kosten für die Versendung der Rech-
001088170103     A                                      nung:'
001089170103     A  72        VALSIN         5S 3O    +1
001090170103     A                                      EDTCDE(2)
001091170103     A*%%***********************************************************************
001092170103     A*%%SS
001093170103     A*%%***********************************************************************
001094170103     A          R TA50PCON1
001095170103     A*%%***********************************************************************
001096170103     A*%%RI 00000
001097170103     A*%%***********************************************************************
001098170103     A                                      SPACEB(001)
001099170103     A                                     1
001100170103     A                                      'Bankverdindung:'
001101170103     A            PCABI          5S 0O    +6
001102170103     A                                      EDTCDE(Z)
001103170103     A            PCCAB          5S 0O    +1
001104170103     A                                      EDTCDE(Z)
001105170103     A            DESBNA        36A  O    +2
001106170103     A*%%***********************************************************************
001107170103     A*%%SS
001108170103     A*%%***********************************************************************
001109170103     A          R TA50PAM
001110170103     A*%%***********************************************************************
001111170103     A*%%RI 00000
001112170103     A*%%FS 001
001113170103     A*%%***********************************************************************
001114170103     A                                      SPACEB(002)
001115170103     A                                     1
001116170103     A                                      'WARENVERSICHERUNG'
001117170103     A                                      HIGHLIGHT
001118170103     A                                     1
001119170103     A                                      'Die eventuelle ALL RISK-Versicheru-
001120170103     A                                      ng mit Versicherungsauftrag AC PLUS-
001121170103     A                                       bzw. mit im Frachtpapier ausgewies-
001122170103     A                                      enem Warenwert'
001123170103     A                                      SPACEB(001)
001124170103     A                                     1
001125170103     A                                      'sieht in jedem Fall eine Obergrenz-
001126170103     A                                      e des erstattungsfähigen Betrags vo-
001127170103     A                                      n maximal Euro 100.000,00 für alle -
001128170103     A                                      Sendungen an jeden'
001129170103     A                                      SPACEB(001)
001130170103     A                                     1
001131170103     A                                      'einzelnen Empfänger am selben Tag -
001132170103     A                                      vor.'
001133170103     A                                      SPACEB(001)
001134170103     A*%%***********************************************************************
001135170103     A*%%SS
001136170103     A*%%CL 001
001137170103     A*%%CL 001
001138170103     A*%%CL 001
001139170103     A*%%***********************************************************************
001140170103     A          R TA50PTE
001141170103     A*%%***********************************************************************
001142170103     A*%%RI 00000
001143170103     A*%%FS 001
001144170103     A*%%***********************************************************************
001145170103     A                                      SPACEB(002)
001146170103     A                                     1
001147170103     A                                      'TELEFONNUMMER DES EMPFÄNGERS'
001148170103     A                                      HIGHLIGHT
001149170103     A                                     1
001150170103     A                                      SPACEB(001)
001151170103     A                                      'Für jede Sendung muss die Telefonn-
001152170103     A                                      ummer des Empfängers angegeben werd-
001153170103     A                                      en.'
001154170103     A                                     1
001155170103     A                                      'Anderenfalls kann es möglicherweis-
001156170103     A                                      e zu Verzögerungen bei der Zustellu-
001157170103     A                                      ng kommen.'
001158170103     A                                      SPACEB(001)
001159170103     A*%%***********************************************************************
001160170103     A*%%SS
001161170103     A*%%CL 001
001162170103     A*%%CL 001
001163170103     A*%%***********************************************************************
001164170103     A          R TA50PSC
001165170103     A*%%***********************************************************************
001166170103     A*%%RI 00000
001167170103     A*%%***********************************************************************
001168170103     A                                      SPACEB(001)
001169170103     A                                     1
001170170103     A                                      'BRT behält sich das Recht vor, auf-
001171170103     A                                       alle FedEx-Sendungen einen Zuschla-
001172170103     A                                      g gemaß der Preisentwicklung des '
001173170103     A*%%***********************************************************************
001174170103     A*%%SS
001175170103     A*%%***********************************************************************
001176170103     A          R TA50PSC1
001177170103     A*%%***********************************************************************
001178170103     A*%%RI 00000
001179170103     A*%%***********************************************************************
001180170103     A                                      SPACEB(001)
001181170103     A                                     1
001182170103     A                                      'Strahltriebwerktreibstoffs JetA1 z-
001183170103     A                                      u berechnen (und im Laufe der Zeit -
001184170103     A                                      entsprechend anzupassen).'
001185170103     A*%%***********************************************************************
001186170103     A*%%SS
001187170103     A*%%***********************************************************************
001188170103     A          R TA50PSC2
001189170103     A*%%***********************************************************************
001190170103     A*%%RI 00000
001191170103     A*%%***********************************************************************
001192170103     A                                      SPACEB(001)
001193170103     A                                     1
001194170103     A                                      'Auf der Website sind alle geltende-
001195170103     A                                      n Zuschläge aufgeführt. Eventuelle -
001196170103     A                                      Änderungen werden hier mindestens 1-
001197170103     A                                      5 Tage vor'
001198170103     A*%%***********************************************************************
001199170103     A*%%SS
001200170103     A*%%***********************************************************************
001201170103     A          R TA50PSC3
001202170103     A*%%***********************************************************************
001203170103     A*%%RI 00000
001204170103     A*%%***********************************************************************
001205170103     A                                      SPACEB(001)
001206170103     A                                     1
001207170103     A                                      'Inkrafttreten angezeigt.'
001208170103     A*%%***********************************************************************
001209170103     A*%%SS
001210170103     A*%%***********************************************************************
001211170103     A          R TA50PEMA
001212170103     A*%%***********************************************************************
001213170103     A*%%RI 00000
001214170103     A*%%FS 001
001215170103     A*%%***********************************************************************
001216170103     A                                      SPACEB(002)
001217170103     A                                     1
001218170103     A                                      'ONLINE-SERVICELEISTUNGEN UND MITTE-
001219170103     A                                      ILUNGEN PER E-MAIL'
001220170103     A                                      HIGHLIGHT
001221170103     A*%%***********************************************************************
001222170103     A*%%SS
001223170103     A*%%***********************************************************************
001224170103     A          R TA50PEMA1
001225170103     A*%%***********************************************************************
001226170103     A*%%RI 00000
001227170103     A*%%***********************************************************************
001228170103     A                                      SPACEB(001)
001229170103     A                                     1
001230170103     A                                      'Wenn Sie unsere "ONLINE-Servicelei-
001231170103     A                                      stungenn" (Abholaufträge/Sendunsver-
001232170103     A                                      folgung/Abwicklung der Zwischenlage-
001233170103     A                                      rungen/POD-Image)'
001234170103      *----
001235170103     A                                     1
001236170103     A                                      SPACEB(001)
001237170103     A                                      'in Anspruch nehmen möchten, bitten-
001238170103     A                                       wir Sie, uns die E-Mail-Adresse de-
001239170103     A                                      r zuständigen Person mitzuteilen,'
001240170103      *----
001241170103     A                                     1
001242170103     A                                      SPACEB(001)
001243170103     A                                      'der das erforderliche Passwort zug-
001244170103     A                                      esendet wird und die für den ordnun-
001245170103     A                                      gsgemäßen Gebrauch desslben verantw-
001246170103     A                                      ortlich ist:'
001247170103      *----
001248170103     A                                     1
001249170103     A                                      SPACEB(001)
001250170103     A                                      'Name'
001251170103     A                                      HIGHLIGHT
001252170103     A                                    +1
001253170103     A                                      '__________________________________-
001254170103     A                                      _______________'
001255170103     A                                    +2
001256170103     A                                      'E-Mail'
001257170103     A                                      HIGHLIGHT
001258170103     A                                    +1
001259170103     A                                      '__________________________________-
001260170103     A                                      ________________'
001261170103     A*%%***********************************************************************
001262170103     A*%%SS
001263170103     A*%%CL 001
001264170103     A*%%CL 001
001265170103     A*%%CL 001
001266170103     A*%%***********************************************************************
001267170103     A          R TA50PEMA2
001268170103     A*%%***********************************************************************
001269170103     A*%%RI 00000
001270170103     A*%%***********************************************************************
001271170103     A                                      SPACEB(001)
001272170103     A                                     1
001273170103     A                                      'Wenn Sie die folgenden Unterlagen -
001274170103     A                                      per E-Mail erhalten möchten, geben -
001275170103     A                                      Sie bitte die entsprechenden Adress-
001276170103     A                                      en an:'
001277170103     A*%%***********************************************************************
001278170103     A*%%SS
001279170103     A*%%***********************************************************************
001280170103     A          R TA50PEMA3
001281170103     A*%%***********************************************************************
001282170103     A*%%RI 00000
001283170103     A*%%***********************************************************************
001284170103     A                                      SPACEB(001)
001285170103     A                                     1
001286170103     A                                      'Senden der Detaildaten der Bankübe-
001287170103     A                                      rweisung im Falle Zahlung von Nachn-
001288170103     A                                      ahmebeträgen: E-Mail ______________-
001289170103     A                                      _______________'
001290170103     A*%%***********************************************************************
001291170103     A*%%SS
001292170103     A*%%***********************************************************************
001293170103     A          R TA50PEMA4
001294170103     A*%%***********************************************************************
001295170103     A*%%RI 00000
001296170103     A*%%***********************************************************************
001297170103     A                                      SPACEB(001)
001298170103     A                                     1
001299170103     A                                      'Senden der Benachrichtigung im Fal-
001300170103     A                                      le einer Zwischenlagerung: E-Mail _-
001301170103     A                                      ___________________________________-
001302170103     A                                      _______________'
001303170103     A*%%***********************************************************************
001304170103     A*%%SS
001305170103     A*%%***********************************************************************
001306170103     A          R TA50PEMA5
001307170103     A*%%***********************************************************************
001308170103     A*%%RI 00000
001309170103     A*%%***********************************************************************
001310170103     A                                      SPACEB(001)
001311170103     A                                     1
001312170103     A                                      'Senden einer Benachrichtigung im S-
001313170103     A                                      chadensfall: E-Mail _______________-
001314170103     A                                      ___________________________________-
001315170103     A                                      _______________'
001316170103     A*%%***********************************************************************
001317170103     A*%%SS
001318170103     A*%%***********************************************************************
001319170103     A          R TA50PEMA7
001320170103     A*%%***********************************************************************
001321170103     A*%%RI 00000
001322170103     A*%%***********************************************************************
001323170103     A                                      SPACEB(001)
001324170103     A                                     1
001325170103     A                                      'Senden von Rechnungen im PDF-Forma-
001326170103     A                                      t: E-Mail _________________________-
001327170103     A                                      ___________________________________-
001328170103     A                                      _______________'
001329170103     A*%%***********************************************************************
001330170103     A*%%SS
001331170103     A*%%***********************************************************************
001332170103     A          R TA50PEMA8
001333170103     A*%%***********************************************************************
001334170103     A*%%RI 00000
001335170103     A*%%***********************************************************************
001336170103     A                                      SPACEB(001)
001337170103     A                                     1
001338170103     A                                      'Senden der administrativen Mitteil-
001339170103     A                                      ungen: E-Mail _____________________-
001340170103     A                                      ___________________________________-
001341170103     A                                      _______________'
001342170103     A*%%***********************************************************************
001343170103     A*%%SS
001344170103     A*%%***********************************************************************
001345170103     A          R TA50PEMA6
001346170103     A*%%***********************************************************************
001347170103     A*%%RI 00000
001348170103     A*%%***********************************************************************
001349170103     A                                      SPACEB(001)
001350170103     A                                     1
001351170103     A                                      'ZUSTIMMUNG ZUR BEHANDLUNG DER PERS-
001352170103     A                                      ÖNLICHEN DATEN'
001353170103      *---
001354170103     A                                     1
001355170103     A                                      SPACEB(001)
001356170103     A                                      'Die oben genannten Daten dienen de-
001357170103     A                                      m Zugriff auf die ONLINE-Servicelei-
001358170103     A                                      stungen und werden für Mitteilungen-
001359170103     A                                       zu Werbezwecken'
001360170103      *---
001361170103     A                                     1
001362170103     A                                      SPACEB(001)
001363170103     A                                      'per Fax oder E-Mail verwendet.'
001364170103      *---
001365170103     A                                     1
001366170103     A                                      SPACEB(001)
001367170103     A                                      'Dabei besteht jederzeit das Recht -
001368170103     A                                      zur Inanspruchnahme der in Art. 7 d-
001369170103     A                                      er italienichen Rechtsverordnung'
001370170103     A                                     1
001371170103     A                                      SPACEB(001)
001372170103     A                                      '196/2003 genannten Rechte.'
001373170103     A*%%***********************************************************************
001374170103     A*%%SS
001375170103     A*%%CL 001
001376170103     A*%%CL 001
001377170103     A*%%CL 001
001378170103     A*%%CL 001
001379170103     A*%%***********************************************************************
001380170103     A          R TA50PE1
001381170103     A*%%***********************************************************************
001382170103     A*%%RI 00000
001383170103     A*%%FS 001
001384170103     A*%%***********************************************************************
001385170103     A                                      SPACEB(002)
001386170103     A                                     1
001387170103     A                                      'DIE ALLGEMEINEN GESCHÄFTSBEDINGUNG-
001388170103     A                                      EN LAUT VORDRUCK'
001389170103     A                                      HIGHLIGHT
001390170103     A            STPMOD         3S 0O    +1
001391170103     A                                      EDTCDE(Z)
001392170103     A                                      HIGHLIGHT
001393170103     A                                    +1
001394170103     A                                      '/'
001395170103     A                                      HIGHLIGHT
001396170103     A            STPANNO        4S 0O    +1
001397170103     A                                      HIGHLIGHT
001398170103     A                                    +1
001399170103     A                                      'UND DAS ALS ANLAGE BEIGEFÜGTE INFO-
001400170103     A                                      RMATIONSBLATT ZUM'
001401170103     A                                      HIGHLIGHT
001402170103     A                                     1
001403170103     A                                      'DATENSCHUTZ LAUT VORDRUCK'
001404170103     A                                      HIGHLIGHT
001405170103     A                                      SPACEB(001)
001406170103     A            STPMODI        3S 0O    +1
001407170103     A                                      HIGHLIGHT
001408170103     A                                      EDTWRD('0  ')
001409170103     A                                    +1
001410170103     A                                      '/'
001411170103     A                                      HIGHLIGHT
001412170103     A            STPANNOI       4S 0O    +1
001413170103     A                                      HIGHLIGHT
001414170103     A                                    +1
001415170103     A                                      'MIT DEN IM SINNE UND MIT DEN WIRKU-
001416170103     A                                      NGEN VON ART. 13 DES GESETZESVERTRE-
001417170103     A                                      TENDEN'
001418170103     A                                      HIGHLIGHT
001419170103     A                                     1
001420170103     A                                      'DEKRETS 196/2003 ZU ERTEILENDEN IN-
001421170103     A                                      FORMATIONEN BILDEN IN JEDER HINSICH-
001422170103     A                                      T BESTANDTEILE DES VORLIEGENDEN'
001423170103     A                                      HIGHLIGHT
001424170103     A                                      SPACEB(001)
001425170103     A                                     1
001426170103     A                                      'VERGÜTUNGSVERTRAGES, DER VON DEN P-
001427170103     A                                      ARTEIEN ZU UNTERZEICHNEN IST UND DI-
001428170103     A                                      E AUFSTELLUNG DER TARIFE ENTHÄLT. D-
001429170103     A                                      ER AUFTRAGGEBER'
001430170103     A                                      HIGHLIGHT
001431170103     A                                      SPACEB(001)
001432170103     A                                     1
001433170103     A                                      'BESTÄTIGT, BEIDE DOKUMENTE ERHALTE-
001434170103     A                                      N UND DARIN EINSICHT GENOMMEN ZU HA-
001435170103     A                                      BEN. DIESE DOKUMENTE SIND AUCH AUF -
001436170103     A                                      DER WEBSITE'
001437170103     A                                      HIGHLIGHT
001438170103     A                                      SPACEB(001)
001439170103     A                                     1
001440170103     A                                      'WWW.BRT.IT ABRUFBAR. '
001441170103     A                                      HIGHLIGHT
001442170103     A                                      SPACEB(001)
001443170103     A*%%***********************************************************************
001444170103     A*%%SS
001445170103     A*%%CL 001
001446170103     A*%%CL 001
001447170103     A*%%CL 001
001448170103     A*%%CL 001
001449170103     A*%%CL 001
001450170103     A*%%***********************************************************************
001451170103     A          R TA50PFI
001452170103     A*%%***********************************************************************
001453170103     A*%%RI 00000
001454170103     A*%%FS 001
001455170103     A*%%***********************************************************************
001456170103     A                                      SPACEB(002)
001457170103     A                                     1
001458170103     A                                      'Die Spedition'
001459170103     A            RSUTOLD       20A  O    +3
001460170103     A                                   +26
001461170103     A                                      'Der Auftraggeber'
001462170103     A                                    +1
001463170103     A                                      '__________________________________-
001464170103     A                                      _____'
001465170103     A                                    55
001466170103     A                                      'Stempel und Unterschrift'
001467170103     A                                      SPACEB(001)
001468170103     A*%%***********************************************************************
001469170103     A*%%SS
001470170103     A*%%CL 001
001471170103     A*%%***********************************************************************
001472170103     A          R TA50PE2
001473170103     A*%%***********************************************************************
001474170103     A*%%RI 00000
001475170103     A*%%FS 001
001476170103     A*%%***********************************************************************
001477170103     A                                      SPACEB(002)
001478170103     A                                     1
001479170103     A                                      'AUSDRÜCKLICH ANGENOMMENE BEDINGUNG-
001480170103     A                                      EN: Laut Art. 1341 und 1342 des ita-
001481170103     A                                      lienishen Bürgerlichen Gesetzbuchs -
001482170103     A                                      erklärt der  '
001483170103     A*%%***********************************************************************
001484170103     A*%%SS
001485170103     A*%%***********************************************************************
001486170103     A          R TA50PE2B
001487170103     A*%%***********************************************************************
001488170103     A*%%RI 00000
001489170103     A*%%***********************************************************************
001490170103     A                                      SPACEB(001)
001491170103     A                                     1
001492170103     A                                      'Auftraggeber hiermit, die folgende-
001493170103     A                                      n Klauseln der Allgemeinen und Beso-
001494170103     A                                      nderen Geschäftsbedingungen sorgfäl-
001495170103     A                                      tig gelesen und'
001496170103     A*%%***********************************************************************
001497170103     A*%%SS
001498170103     A*%%***********************************************************************
001499170103     A          R TA50PE2C
001500170103     A*%%***********************************************************************
001501170103     A*%%RI 00000
001502170103     A*%%***********************************************************************
001503170103     A                                      SPACEB(001)
001504170103     A                                     1
001505170103     A                                      'geprüft zu haben und sie anzunehme-
001506170103     A                                      n: 1 (Allgemeine Geschäftsbedingung-
001507170103     A                                      en); 3 (Zahlungs-/Vergütungsfristen-
001508170103     A                                      ); 4 (Haftung'
001509170103     A*%%***********************************************************************
001510170103     A*%%SS
001511170103     A*%%***********************************************************************
001512170103     A          R TA50PE2D
001513170103     A*%%***********************************************************************
001514170103     A*%%RI 00000
001515170103     A*%%***********************************************************************
001516170103     A                                      SPACEB(001)
001517170103     A                                     1
001518170103     A                                      'des Frachtführers); 5 (Güterversic-
001519170103     A                                      herung); 6 (Zufallsereignis und höh-
001520170103     A                                      ere Gewalt); 7 (Liefer-und Zustellb-
001521170103     A                                      edingungen);'
001522170103     A*%%***********************************************************************
001523170103     A*%%SS
001524170103     A*%%***********************************************************************
001525170103     A          R TA50PE2E
001526170103     A*%%***********************************************************************
001527170103     A*%%RI 00000
001528170103     A*%%***********************************************************************
001529170103     A                                      SPACEB(001)
001530170103     A                                     1
001531170103     A                                      '8 (Zwischenlagerung); 9 (Gültigkei-
001532170103     A                                      t des Angebots-Ausdrückliche Auflös-
001533170103     A                                      ungsklausel); 10 (Gefahrengüter); 1-
001534170103     A                                      1 (Sendung gegen'
001535170103     A*%%***********************************************************************
001536170103     A*%%SS
001537170103     A*%%***********************************************************************
001538170103     A          R TA50PE2F
001539170103     A*%%***********************************************************************
001540170103     A*%%RI 00000
001541170103     A*%%***********************************************************************
001542170103     A                                      SPACEB(001)
001543170103     A                                     1
001544170103     A                                      'Nachnahme); 12 C (Vom Frachtführer-
001545170103     A                                       nicht akzeptierte Güter); 16 (Tran-
001546170103     A                                      sportdokumente); 17 (Zurückbehaltun-
001547170103     A                                      gsrecht);'
001548170103     A*%%***********************************************************************
001549170103     A*%%SS
001550170103     A*%%***********************************************************************
001551170103     A          R TA50PE2G
001552170103     A*%%***********************************************************************
001553170103     A*%%RI 00000
001554170103     A*%%***********************************************************************
001555170103     A                                      SPACEB(001)
001556170103     A                                     1
001557170103     A                                      '19 (Gerichtsstand); 24 (Anwendbare-
001558170103     A                                      s Recht); 26 (Transport von Sendung-
001559170103     A                                      en, die unter das italienische Gese-
001560170103     A                                      tz Nr. 136/2010).'
001561170103     A*%%***********************************************************************
001562170103     A*%%SS
001563170103     A*%%***********************************************************************
001564170103     A          R TA50PFIN
001565170103     A*%%***********************************************************************
001566170103     A*%%RI 00000
001567170103     A*%%FS 063
001568170103     A*%%***********************************************************************
001569170103     A                                      SKIPB(064)
001570170103     A                                    53
001571170103     A                                      'FORTSETZUNG AUF SEITE'
001572170103     A            PAGE           4S 0O    +1
001573170103     A                                      EDTCDE(Z)
001574170103     A*%%***********************************************************************
001575170103     A*%%SS
001576170103     A*%%***********************************************************************
001577170103     A          R TA50PFINE
001578170103     A*%%***********************************************************************
001579170103     A*%%RI 00000
001580170103     A*%%FS 063
001581170103     A*%%***********************************************************************
001582170103     A                                      SKIPB(064)
001583170103     A                                    53
001584170103     A                                      'SEITE'
001585170103     A            PAGE           4S 0O    +1
001586170103     A                                      EDTCDE(Z)
001587170103     A*%%***********************************************************************
001588170103     A*%%SS
001589170103     A*%%***********************************************************************
001590170103     A          R TA50PERR
001591170103     A*%%***********************************************************************
001592170103     A*%%RI 00000
001593170103     A*%%FS 001
001594170103     A*%%***********************************************************************
001595170103     A                                      SPACEB(002)
001596170103     A                                     1
001597170103     A                                      '====>  TARIFFA/OFFERTA NON STAMPAB-
001598170103     A                                      ILE IN MODO CORRETTO  <===='
001599170103     A            ERRMSG        78A        1
001600170103     A                                      SPACEB(001)
001601170103     A*%%***********************************************************************
001602170103     A*%%SS
001603170103     A*%%CL 001
001604170103     A*%%CP+999CRTPRTF
001605170103     A*%%CP+    FILE(GAITRAFIL/TNTA50P4)
001606170103     A*%%CP+    DEVTYPE(*SCS)
001607170103     A*%%CP+    PAGESIZE(*N 124)
001608170103     A*%%CP+    CPI(16,7)
001609170103     A*%%CP     OVRFLW(65)
001610170103     A*%%CS+999CRTPRTF
001611170103     A*%%CS+    FILE(QTEMP/QPRDRPT)
001612170103     A*%%CS+    DEVTYPE(*SCS)
001613170103     A*%%CS     PAGESIZE(*N 132)
001614170103     A*%%***********************************************************************
