000100041116      *--------------------------------------------------------------*
000200041116      *                                                              *
000300041116      *      DS PER PASSAGGIO PARAMETRI                              *
000400041116      *                                                              *
000500041116      *--------------------------------------------------------------*
000600041116      *
000700041116     A                                      REF(CNDIZION)
000800050712     A          R TA25TADR                  TEXT('DS PER PASS.PAR.')
000900050712
001000050712     A            TA25LNPR       3S 0       TEXT('TADLNP')
001100050712     A            TA25CTSR       2          TEXT('TADCTS')
001200050712     A            TA25NAZR       3          TEXT('TADNAZ')
001300050712     A            TA25CAPR       9          TEXT('TADCAP')
001400050712     A            TA25SGLR      13S 3       TEXT('TADSGL')
001500050712     A            TA25ITRR      11S 3       TEXT('TADITR')
001600050712     A            TA25INOR      11S 3       TEXT('TADINO')
001700050712     A            TA25RPVR       3S 1       TEXT('TADRPV')
001800050712     A            TA25ORPR       5          TEXT('TADORP')
001900050712     A            TA25MINR      11S 3       TEXT('TADMIN')
002000050712     A            TA25MAXR      11S 3       TEXT('TADMAX')
002100050920     A            TA25LNPRN      3S 0       TEXT('TADLNP NEW')
