000100040108      *--------------------------------------------------------------*
000200091008      * PARAMETRI X CONTROLLO APP. E COMM. SU TRATTATIVA             *
000300040108      *--------------------------------------------------------------*
000400091008     A          R D45REC                    TEXT('DS PER CONTROLLO -
000500091008     A                                      APP. E COMM. SU TRATTATIVA')
000600040108      *
000700091007      * C A M P I   D I   I N P U T
000800091007      *
000900091008     A            ITA45TIP       1A         TEXT('A=CONTROLLO APPUNTAMENTO -
001000091008     A                                      C=CONTROLLO COMMERCIALE')
001100091008     A            ITA45NRV       7S 0       TEXT('NUMERO TRATTATIVA')
001200091008     A            ITA45CMM       7S 0       TEXT('COMMERCIALE')
001300091007      *
001400091007      * C A M P I   D I   O U T P U T
001500091007      *
001600091009     A            OTA45CMM       7S 0       TEXT('COMMERCIALE TRATTATIVA')
001700091009     A            OTA45ERR       1A         TEXT('A=ERRORE APP. C=ERRORE COMM. -
001800091009     A                                      1=ERRORE 9=DATI NON PASSATI')
001900091009     A            OTA45MSG      78A         TEXT('MESSAGGIO DI ERRORE')
