000100040108      *--------------------------------------------------------------*
000200091209      * PARAMETRI X GESTIONE ESITAZIONE OFFERTE                      *
000300040108      *--------------------------------------------------------------*
000400090717     A                                      REF(CNDIZION)
000500091209     A          R D56REC                    TEXT('DS PER ESITAZIONE O-
000600091209     A                                      FFERTE')
000700040108      *
000800040108      ****************************************************************
000900040130      * C A M P I   D I   I N P U T
001000040108      ****************************************************************
001100040108      *
001200091209     A            ITA56CMT       1A         TEXT('COMMIT S/N')
001300090609      ****************************************************************
001400090609      * F L A G    E L A B O R A Z I O N E
001500090609      ****************************************************************
001600040108      *
001700091209      * - "G"   = Gestione Esitazione Offerte
001800090320      *
001900091209     A            ITA56FLE       1A         TEXT('FLAG ELABORAZIONE')
002000090610
002100091016      ****************************************************************
002200091016      * F L A G    P R O V E N I E N Z A
002300091016      ****************************************************************
002400091016      *
002500091016      * - "A"   = Gestione Attività
002600091016      *
002700091209      * - " "   = Da menu
002800091209      *
002900091209     A            ITA56FPR       1A         TEXT('FLAG PGM DI PROVENIENZA')
003000090423     A*
003100040108      ******
003200100111      * CHIAVE DELLA TRATTATIVA
003300040108      ******
003400091209     A            ITA56NRV  R               REFFLD($NRV)
003500100111      ******
003600100111      * CHIAVE DELLA ATTIVITA' CHE RICHIAMA IL PROGRAMMA
003700100111      ******
003800100111     A            ITA56TAT       1A         TEXT('TIPO ATTIVITA')
003900100111     A            ITA56ATN  R               REFFLD($ATN)
004000100111     A            ITA56ATNP R               REFFLD($ATNP)
004100100225
004200100225     A            ITA56COM  R               REFFLD($CMM)
004300100225     A                                      TEXT('COMMERCIALE DA PROPORRE')
004400100225     A            ITA56COMD     25A         TEXT('DECODIFICA COMM. DA PROPORRE')
004500040217      *
004600040130      ****************************************************************
004700040130      * C A M P I   D I   O U T P U T
004800040130      ****************************************************************
004900040130      *
005000040108      *
005100091209     A            OTA56F12       1A         TEXT('S=PREMUTO F12')
005200091209     A            OTA56ERR       1A         TEXT('CODICE DI ERRORE')
005300091209     A            OTA56MSG      78A         TEXT('MESSAGGIO DI ERRORE')
