000100100719      *--------------------------------------------------------------*
000200100719      * PARAMETRI X INTERROGAZIONE ANAGRAFICA CLIENTI                *
000300100719      *--------------------------------------------------------------*
000400041116     A                                      REF(CNDIZION)
000500100719     A          R DI1REC                    TEXT('DS PER INTERROGAZIONE -
000600100719     A                                      CLIENTI')
000700100719      ****************************************************************
000800050705      * C A M P I   I N   I N P U T
000900100719      ****************************************************************
001000100927     A            ITAI1RIC       1A         TEXT('A=ATTIVITA, T=TRATTATIVA, -
001100100927     A                                      S=SELEZIONE')
001200100722     A            ITAI1ABI       2A         TEXT('CODICE ABILITAZIONE')
001300100722     A            ITAI1AUT       2A         TEXT('AUT. X COMMERCIALE')
001400100722     A            ITAI1COM       7S 0       TEXT('COMM. DA PROPORRE')
001500100722     A            ITAI1COMD     25A         TEXT('DES. COMM. DA PROPORRE')
001600100719      ****************************************************************
001700050705      * C A M P I   I N   O U T P U T:
001800100719      ****************************************************************
001900100927     A            OTAI1KSC       7S 0       TEXT('CLIENTE SCELTO')
002000100722     A            OTAI1F03       1A         TEXT('1=PREMUTO F03')
002100100722     A            OTAI1F12       1A         TEXT('1=PREMUTO F12')
002200100722     A            OTAI1ERR       1A         TEXT('1=ERRORE')
002300100722     A            OTAI1MSG      78A         TEXT('MESSAGGIO DI ERRORE')
