000100040108      *--------------------------------------------------------------*
000200170125      * PARAMETRI X CONTEGGIO CLIENTI PER SUPPORTO DA TITAS          *
000300040108      *--------------------------------------------------------------*
000400170125     A          R TASCBREC                  TEXT('DS PER CONTEGGIO CLIENTI -
000500170125     A                                      X SUPPORTO DA TITAS')
000600100524
000700170125     A            ISCBDATAI      8S 0       TEXT('PERIODO DAL')
000800170125     A            ISCBDATAF      8S 0       TEXT('PERIODO AL')
000900170125     A            ISCBLNA        3S 0       TEXT('LINEA ARRIVO')
