000001170109     A*%%***********************************************************************
000002170109     A*%%TS  RD  20170109  113948  EDPGA       REL-V7R1M0  5770-WDS
000003170109     A*%%FI+10661100000000010000000000000000000000000000000000000000
000004170109     A*%%FI       0000000000000000000000000000000000000000000000000
000005170109     A*%%***********************************************************************
000006170109     A          R TA50PPP
000007170109     A*%%***********************************************************************
000008170109     A*%%RI 00000
000009170109     A*%%FS 009
000010170109     A*%%***********************************************************************
000011170109     A                                      SKIPB(010)
000012170109     A            BIANCO         1A  O     1
000013170109     A*%%***********************************************************************
000014170109     A*%%SS
000015170109     A*%%***********************************************************************
000016170109     A          R TA50P01
000017170109     A*%%***********************************************************************
000018170109     A*%%RI 00000
000019170109     A*%%***********************************************************************
000020170109     A                                      SPACEB(001)
000021170109     A                                     1
000022170109     A                                      'Filiale de:'
000023170109     A            TD1FIL        20A  O     1
000024170109     A                                      SPACEB(001)
000025170109     A            TD1VIA        25A  O     1
000026170109     A                                      SPACEB(001)
000027170109     A            TD1CAP         5S 0O     1
000028170109     A                                      SPACEB(001)
000029170109     A                                      EDTCDE(Z)
000030170109     A            TD1LOC        25A  O    +1
000031170109     A            TD1PRV         2A  O    +1
000032170109     A                                   +28
000033170109     A                                      '        '
000034170109     A                                     1
000035170109     A                                      'TEL.'
000036170109     A                                      SPACEB(001)
000037170109     A            TD2TEL        13A  O    +1
000038170109     A                                    +1
000039170109     A                                      'FAX.'
000040170109     A            TD2TFX        13A  O    +1
000041170109     A            PICRAG        48A  O   +25
000042170109     A            PICIND        35A  O    63
000043170109     A                                      SPACEB(001)
000044170109     A            PICCAP         9A  O    63
000045170109     A                                      SPACEB(001)
000046170109     A            PICLOC        30A  O    +1
000047170109     A            PICPRO         2A  O    +1
000048170109     A            DESNAR        25A  O    63
000049170109     A                                      SPACEB(001)
000050170109     A            PICDAL        35A  O     1
000051170109     A                                      SPACEB(001)
000052170109     A  73                               +10
000053170109     A                                      'A l''attention de'
000054170109     A  73        RESPTRA       60A  O    +1
000055170109     A                                      HIGHLIGHT
000056170109     A                                     1
000057170109     A                                      'ns.Réf.'
000058170109     A                                      SPACEB(001)
000059170109     A            PICNR1         2A  O    +1
000060170109     A                                    +1
000061170109     A                                      '/'
000062170109     A            PICNR2         2A  O    +1
000063170109     A  77        RESPTRA2      60A  O    +1
000064170109     A                                      HIGHLIGHT
000065170109     A                                     1
000066170109     A                                      'Au téléphon, demander M.'
000067170109     A                                      SPACEB(001)
000068170109     A            DESCOM        25A  O    +1
000069170109     A            DESTAR        35A  O    47
000070170109     A                                      SPACEB(001)
000071170109     A                                      HIGHLIGHT
000072170109     A                                     1
000073170109     A                                      SPACEB(002)
000074170109     A                                      'Suite à nos accords, nous vuous pr-
000075170109     A                                      oposons notre cotation en'
000076170109     A            DESDIV         5A  O    +1
000077170109     A                                    +0
000078170109     A                                      ' pour les marchandises dont le tra-
000079170109     A                                      nsport est à'
000080170109     A                                     1
000081170109     A                                      SPACEB(001)
000082170109     A                                      'votre charge:'
000083170109     A*%%***********************************************************************
000084170109     A*%%SS
000085170109     A*%%CL 001
000086170109     A*%%CL 001
000087170109     A*%%CL 001
000088170109     A*%%CL 001
000089170109     A*%%CL 001
000090170109     A*%%CL 001
000091170109     A*%%CL 001
000092170109     A*%%CL 001
000093170109     A*%%CL 001
000094170109     A*%%CL 001
000095170109     A*%%CL 001
000096170109     A*%%CL 002
000097170109     A*%%CL 001
000098170109     A*%%***********************************************************************
000099170109     A          R TA50P02A
000100170109     A*%%***********************************************************************
000101170109     A*%%RI 00000
000102170109     A*%%***********************************************************************
000103170109     A                                      SPACEB(001)
000104170109     A            PRTLNP        80A  O     1
000105170109     A                                      HIGHLIGHT
000106170109     A*%%***********************************************************************
000107170109     A*%%SS
000108170109     A*%%***********************************************************************
000109170109     A          R TA50P02
000110170109     A*%%***********************************************************************
000111170109     A*%%RI 00000
000112170109     A*%%***********************************************************************
000113170109     A                                      SPACEB(001)
000114170109     A                                     1
000115170109     A                                      '-----------------------------------
000116170109     A                                      ------------------------------------
000117170109     A                                      ------------------------------------
000118170109     A                                      ------------------- '
000119170109     A                                      HIGHLIGHT
000120170109     A                                     2
000121170109     A                                      'De'
000122170109     A                                      SPACEB(001)
000123170109     A                                    +1
000124170109     A                                      'Votre entrepôt pour :'
000125170109     A                                      HIGHLIGHT
000126170109     A            DZONA1        10A  O    36
000127170109     A                                      HIGHLIGHT
000128170109     A            DZONA2        10A  O    49
000129170109     A                                      HIGHLIGHT
000130170109     A            DZONA3        10A  O    62
000131170109     A                                      HIGHLIGHT
000132170109     A            DZONA4        10A  O    75
000133170109     A                                      HIGHLIGHT
000134170109     A            DZONA5        10A  O    88
000135170109     A                                      HIGHLIGHT
000136170109     A            DZONA6        10A  O   101
000137170109     A                                      HIGHLIGHT
000138170109     A            DZONA7        10A  O   114
000139170109     A                                      HIGHLIGHT
000140170109     A            DESUM         10A  O     2
000141170109     A                                      SPACEB(001)
000142170109     A                                     1
000143170109     A                                      '-----------------------------------
000144170109     A                                      ------------------------------------
000145170109     A                                      ------------------------------------
000146170109     A                                      ------------------- '
000147170109     A                                      SPACEB(001)
000148170109     A                                      HIGHLIGHT
000149170109     A*%%***********************************************************************
000150170109     A*%%SS
000151170109     A*%%CL 001
000152170109     A*%%CL 001
000153170109     A*%%CL 001
000154170109     A*%%***********************************************************************
000155170109     A          R TA50P02B
000156170109     A*%%***********************************************************************
000157170109     A*%%RI 00000
000158170109     A*%%***********************************************************************
000159170109     A                                      SPACEB(001)
000160170109     A                                     1
000161170109     A                                      '-----------------------------------
000162170109     A                                      ------------------------------------
000163170109     A                                      ------------------------------------
000164170109     A                                      ------------------- '
000165170109     A                                      HIGHLIGHT
000166170109     A N78                                 2
000167170109     A                                      'De'
000168170109     A                                      SPACEB(001)
000169170109     A N78                                +1
000170170109     A                                      'Votre entrepôt'
000171170109     A                                      HIGHLIGHT
000172170109     A            DESUM         10A  O   +12
000173170109     A                                      HIGHLIGHT
000174170109     A  78                                  SPACEB(001)
000175170109     A            DISSCA        80A  O    +1
000176170109     A                                      HIGHLIGHT
000177170109     A N78                                 2
000178170109     A                                      'pour:'
000179170109     A                                      HIGHLIGHT
000180170109     A                                      SPACEB(001)
000181170109     A N79        PRTATF        80A  O    44
000182170109     A                                      HIGHLIGHT
000183170109     A  78N79                               SPACEB(001)
000184170109     A                                     1
000185170109     A                                      '-----------------------------------
000186170109     A                                      ------------------------------------
000187170109     A                                      ------------------------------------
000188170109     A                                      ------------------- '
000189170109     A                                      SPACEB(001)
000190170109     A                                      HIGHLIGHT
000191170109     A*%%***********************************************************************
000192170109     A*%%SS
000193170109     A*%%CL 001
000194170109     A*%%CL 001
000195170109     A*%%CL 001
000196170109     A*%%***********************************************************************
000197170109     A          R TA50P03A
000198170109     A*%%***********************************************************************
000199170109     A*%%RI 00000
000200170109     A*%%***********************************************************************
000201170109     A                                      SPACEB(001)
000202170109     A                                     1
000203170109     A                                      'AU DELA DE'
000204170109     A                                      HIGHLIGHT
000205170109     A            P03ATA         7S 2O    +1
000206170109     A                                      HIGHLIGHT
000207170109     A                                      EDTCDE(4)
000208170109     A                                    +1
000209170109     A                                      'KG - Tarif au kg à multiplier par -
000210170109     A                                      le poids total de l''envoi'
000211170109     A                                      HIGHLIGHT
000212170109     A*%%***********************************************************************
000213170109     A*%%SS
000214170109     A*%%***********************************************************************
000215170109     A          R TA50P03
000216170109     A*%%***********************************************************************
000217170109     A*%%RI 00000
000218170109     A*%%***********************************************************************
000219170109     A                                      SPACEB(001)
000220170109     A            TAR01          7S 3O    37
000221170109     A                                      EDTCDE(4)
000222170109     A            TAR02          7S 3O    50
000223170109     A                                      EDTCDE(4)
000224170109     A            TAR03          7S 3O    63
000225170109     A                                      EDTCDE(4)
000226170109     A            TAR04          7S 3O    76
000227170109     A                                      EDTCDE(4)
000228170109     A            TAR05          7S 3O    89
000229170109     A                                      EDTCDE(4)
000230170109     A            TAR06          7S 3O   102
000231170109     A                                      EDTCDE(4)
000232170109     A            TAR07          7S 3O   115
000233170109     A                                      EDTCDE(4)
000234170109     A            P03SGLD        8A  O     4
000235170109     A  50                                13
000236170109     A                                      '-'
000237170109     A  50        P03SGLA        8A  O    15
000238170109     A*%%***********************************************************************
000239170109     A*%%SS
000240170109     A*%%***********************************************************************
000241170109     A          R TA50P03B
000242170109     A*%%***********************************************************************
000243170109     A*%%RI 00000
000244170109     A*%%***********************************************************************
000245170109     A                                      SPACEB(001)
000246170109     A            P03DES        42A  O     1
000247170109     A  61        TAR01P         6S 3O    +4
000248170109     A                                      EDTWRD(' 0 ,   ')
000249170109     A            PER01          1A  O    +1
000250170109     A  62        TAR02P         6S 3O    +4
000251170109     A                                      EDTWRD(' 0 ,   ')
000252170109     A            PER02          1A  O    +1
000253170109     A  63        TAR03P         6S 3O    +4
000254170109     A                                      EDTWRD(' 0 ,   ')
000255170109     A            PER03          1A  O    +1
000256170109     A  64        TAR04P         6S 3O    +4
000257170109     A                                      EDTWRD(' 0 ,   ')
000258170109     A            PER04          1A  O    +1
000259170109     A  65        TAR05P         6S 3O    +4
000260170109     A                                      EDTWRD(' 0 ,   ')
000261170109     A            PER05          1A  O    +1
000262170109     A  66        TAR06P         6S 3O    +4
000263170109     A                                      EDTWRD(' 0 ,   ')
000264170109     A            PER06          1A  O    +1
000265170109     A*%%***********************************************************************
000266170109     A*%%SS
000267170109     A*%%***********************************************************************
000268170109     A          R TA50P06
000269170109     A*%%***********************************************************************
000270170109     A*%%RI 00000
000271170109     A*%%FS 001
000272170109     A*%%***********************************************************************
000273170109     A                                      SPACEB(002)
000274170109     A                                     1
000275170109     A                                      'Volume de merchandises pour la tax-
000276170109     A                                      ation: kg par'
000277170109     A            P06RPV         4  0O    +1
000278170109     A                                      EDTCDE(2)
000279170109     A                                    +1
000280170109     A                                      'm³'
000281170109     A*%%***********************************************************************
000282170109     A*%%SS
000283170109     A*%%***********************************************************************
000284170109     A          R TA50P05
000285170109     A*%%***********************************************************************
000286170109     A*%%RI 00000
000287170109     A*%%***********************************************************************
000288170109     A                                      SPACEB(001)
000289170109     A                                     1
000290170109     A                                      'Arrondissements:'
000291170109     A            P05AR1        45A  O    +1
000292170109     A            P05AR2        45A  O    18
000293170109     A                                      SPACEB(001)
000294170109     A*%%***********************************************************************
000295170109     A*%%SS
000296170109     A*%%CL 001
000297170109     A*%%***********************************************************************
000298170109     A          R TA50P07
000299170109     A*%%***********************************************************************
000300170109     A*%%RI 00000
000301170109     A*%%FS 001
000302170109     A*%%***********************************************************************
000303170109     A                                      SPACEB(002)
000304170109     A                                     1
000305170109     A                                      'Code Client:'
000306170109     A                                      HIGHLIGHT
000307170109     A                                      UNDERLINE
000308170109     A            P07KSC         7S 0O    +1
000309170109     A                                      HIGHLIGHT
000310170109     A                                      UNDERLINE
000311170109     A  98                                +2
000312170109     A                                      'Off. N.:'
000313170109     A                                      HIGHLIGHT
000314170109     A  98N85     P07NRV         6S 0O    32
000315170109     A                                      EDTCDE(Z)
000316170109     A                                      HIGHLIGHT
000317170109     A  98N85                             39
000318170109     A                                      '-'
000319170109     A                                      HIGHLIGHT
000320170109     A  98N85     P07PRV         1S 0O    41
000321170109     A                                      EDTCDE(Z)
000322170109     A                                      HIGHLIGHT
000323170109     A  85        P07NTRA        7S 0O    32
000324170109     A                                      EDTCDE(Z)
000325170109     A                                      HIGHLIGHT
000326170109     A                                     1
000327170109     A                                      'Tarif:'
000328170109     A                                      SPACEB(001)
000329170109     A                                      HIGHLIGHT
000330170109     A            DESCTR        13A  O    +1
000331170109     A                                      HIGHLIGHT
000332170109     A                                    +1
000333170109     A                                      '-'
000334170109     A                                      HIGHLIGHT
000335170109     A N85        PTARIFFA      12A  O    25
000336170109     A  85        PTRATTA       14A  O    24
000337170109     A                                    +1
000338170109     A                                      '-'
000339170109     A                                      HIGHLIGHT
000340170109     A            P07DES        47A  O    +1
000341170109     A                                      HIGHLIGHT
000342170109     A*%%***********************************************************************
000343170109     A*%%SS
000344170109     A*%%CL 001
000345170109     A*%%***********************************************************************
000346170109     A          R TA50P07S
000347170109     A*%%***********************************************************************
000348170109     A*%%RI 00000
000349170109     A*%%***********************************************************************
000350170109     A                                      SPACEB(001)
000351170109     A                                      HIGHLIGHT
000352170109     A                                     1
000353170109     A                                      'Application : Dégressif'
000354170109     A*%%***********************************************************************
000355170109     A*%%SS
000356170109     A*%%***********************************************************************
000357170109     A          R TA50P07G
000358170109     A*%%***********************************************************************
000359170109     A*%%RI 00000
000360170109     A*%%***********************************************************************
000361170109     A                                      SPACEB(001)
000362170109     A                                      HIGHLIGHT
000363170109     A                                     1
000364170109     A                                      'Application : Echelon précédant ma-
000365170109     A                                      ximum'
000366170109     A*%%***********************************************************************
000367170109     A*%%SS
000368170109     A*%%***********************************************************************
000369170109     A          R TA50P08
000370170109     A*%%***********************************************************************
000371170109     A*%%RI 00000
000372170109     A*%%***********************************************************************
000373170109     A                                      SPACEB(001)
000374170109     A                                     1
000375170109     A                                      'Type de service concerné par le ta-
000376170109     A                                      rif: description et limites.'
000377170109     A*%%***********************************************************************
000378170109     A*%%SS
000379170109     A*%%***********************************************************************
000380170109     A          R TA50P08E
000381170109     A*%%***********************************************************************
000382170109     A*%%RI 00000
000383170109     A*%%***********************************************************************
000384170109     A                                      SPACEB(001)
000385170109     A                                     1
000386170109     A                                      'Express    : envois d''un ou plusi-
000387170109     A                                      eurs colis n''excédant pas 68 kg ch-
000388170109     A                                      acun.'
000389170109     A                                     1
000390170109     A                                      '             Dimensions maxi accep-
000391170109     A                                      tables pour chaque colis express: l-
000392170109     A                                      ongueur maxi du côté le plus long 2-
000393170109     A                                      74 cm.'
000394170109     A                                      SPACEB(001)
000395170109     A                                     1
000396170109     A                                      '             Dimensions maxi de lo-
000397170109     A                                      ngueur plus circonférence 330 cm.'
000398170109     A                                      SPACEB(001)
000399170109     A                                     1
000400170109     A                                      '             Valeur maxi déclarabl-
000401170109     A                                      e pour la douane: 50.000 dollars U.-
000402170109     A                                      S.'
000403170109     A                                      SPACEB(001)
000404170109     A*%%***********************************************************************
000405170109     A*%%SS
000406170109     A*%%CL 001
000407170109     A*%%CL 001
000408170109     A*%%CL 001
000409170109     A*%%***********************************************************************
000410170109     A          R TA50P08M
000411170109     A*%%***********************************************************************
000412170109     A*%%RI 00000
000413170109     A*%%***********************************************************************
000414170109     A                                      SPACEB(001)
000415170109     A                                     1
000416170109     A                                      'Messaggerie: envoi d''au moins un -
000417170109     A                                      colis de poids excédant les 68 kg.'
000418170109     A                                     1
000419170109     A                                      '             Dimensions maxi accep-
000420170109     A                                      tables pour chaque colis de message-
000421170109     A                                      rie: longueur maxi du côté le plus -
000422170109     A                                      long 302 cm. '
000423170109     A                                      SPACEB(001)
000424170109     A                                     1
000425170109     A                                      '             Dimensions maxi de lo-
000426170109     A                                      ngueur plus circonférence 762 cm. '
000427170109     A                                      SPACEB(001)
000428170109     A                                     1
000429170109     A                                      '             Valeur maxi déclarabl-
000430170109     A                                      e pour la douane: 100.000 dollars U-
000431170109     A                                      .S.'
000432170109     A                                      SPACEB(001)
000433170109     A                                     1
000434170109     A                                      '             Le service messagerie-
000435170109     A                                       n''est pas en vigueur dans le zone-
000436170109     A                                      s F et G. Il peut être limité dans -
000437170109     A                                      d''autres zones:'
000438170109     A                                      SPACEB(001)
000439170109     A                                     1
000440170109     A                                      '             contacter le service -
000441170109     A                                      clients pour des renseignements plu-
000442170109     A                                      s précis.'
000443170109     A                                      SPACEB(001)
000444170109     A*%%***********************************************************************
000445170109     A*%%SS
000446170109     A*%%CL 001
000447170109     A*%%CL 001
000448170109     A*%%CL 001
000449170109     A*%%CL 001
000450170109     A*%%CL 001
000451170109     A*%%***********************************************************************
000452170109     A          R TA50P08D
000453170109     A*%%***********************************************************************
000454170109     A*%%RI 00000
000455170109     A*%%***********************************************************************
000456170109     A                                      SPACEB(001)
000457170109     A                                     1
000458170109     A                                      'Documents  : envois n''excédant pa-
000459170109     A                                      s les 2,5 kg.'
000460170109     A                                     1
000461170109     A                                      '             Valeur maxi déclarabl-
000462170109     A                                      e pour la douane: 100 dollars U.S.'
000463170109     A                                      SPACEB(001)
000464170109     A*%%***********************************************************************
000465170109     A*%%SS
000466170109     A*%%CL 001
000467170109     A*%%***********************************************************************
000468170109     A          R TA50P08Z
000469170109     A*%%***********************************************************************
000470170109     A*%%RI 00000
000471170109     A*%%FS 001
000472170109     A*%%***********************************************************************
000473170109     A                                      SPACEB(002)
000474170109     A                                     1
000475170109     A                                      'CONTRE REMBOURSEMENT: SERVICE NON -
000476170109     A                                      PRÉVU'
000477170109     A                                      HIGHLIGHT
000478170109     A                                     1
000479170109     A                                      'PORT DÛ: SERVICE NON PRÉVU'
000480170109     A                                      HIGHLIGHT
000481170109     A                                      SPACEB(001)
000482170109     A*%%***********************************************************************
000483170109     A*%%SS
000484170109     A*%%CL 001
000485170109     A*%%***********************************************************************
000486170109     A          R TA50P09
000487170109     A*%%***********************************************************************
000488170109     A*%%RI 00000
000489170109     A*%%FS 001
000490170109     A*%%***********************************************************************
000491170109     A                                      SPACEB(002)
000492170109     A                                     1
000493170109     A                                      'Tarif valable du'
000494170109     A                                      HIGHLIGHT
000495170109     A            STADDT        10A  O    +1
000496170109     A                                      HIGHLIGHT
000497170109     A                                    +1
000498170109     A                                      'au'
000499170109     A                                      HIGHLIGHT
000500170109     A            STADST        10A  O    +1
000501170109     A                                      HIGHLIGHT
000502170109     A  26                                +2
000503170109     A                                      'pour:'
000504170109     A                                      HIGHLIGHT
000505170109     A*%%***********************************************************************
000506170109     A*%%SS
000507170109     A*%%***********************************************************************
000508170109     A          R TA50P09A
000509170109     A*%%***********************************************************************
000510170109     A*%%RI 00000
000511170109     A*%%***********************************************************************
000512170109     A                                      SPACEB(001)
000513170109     A                                     1
000514170109     A                                      'Envois annuels: minimum'
000515170109     A            COMLRC         7S 0O    +1
000516170109     A                                      EDTCDE(Z)
000517170109     A                                    +1
000518170109     A                                      'maximum'
000519170109     A            COMLAS         7S 0O    +1
000520170109     A                                      EDTCDE(Z)
000521170109     A*%%***********************************************************************
000522170109     A*%%SS
000523170109     A*%%***********************************************************************
000524170109     A          R TA50P09B
000525170109     A*%%***********************************************************************
000526170109     A*%%RI 00000
000527170109     A*%%***********************************************************************
000528170109     A                                      SPACEB(001)
000529170109     A                                     1
000530170109     A                                      'Marchandise de poids spécifique mo-
000531170109     A                                      yen de'
000532170109     A            COMKPM         5S 1O    +1
000533170109     A                                      EDTWRD('  0 , ')
000534170109     A                                    +1
000535170109     A                                      'kg par mètre cube'
000536170109     A*%%***********************************************************************
000537170109     A*%%SS
000538170109     A*%%***********************************************************************
000539170109     A          R TA50P09C
000540170109     A*%%***********************************************************************
000541170109     A*%%RI 00000
000542170109     A*%%***********************************************************************
000543170109     A                                      SPACEB(001)
000544170109     A                                     1
000545170109     A                                      'Marchandises dont le volume par co-
000546170109     A                                      lis est égal à'
000547170109     A            COMCKM         5S 1O    +1
000548170109     A                                      EDTWRD('0 ,   ')
000549170109     A                                    +1
000550170109     A                                      'm³'
000551170109     A*%%***********************************************************************
000552170109     A*%%SS
000553170109     A*%%***********************************************************************
000554170109     A          R TA50P09S
000555170109     A*%%***********************************************************************
000556170109     A*%%RI 00000
000557170109     A*%%***********************************************************************
000558170109     A                                      SPACEB(001)
000559170109     A*%%***********************************************************************
000560170109     A*%%SS
000561170109     A*%%***********************************************************************
000562170109     A          R TA50P10
000563170109     A*%%***********************************************************************
000564170109     A*%%RI 00000
000565170109     A*%%***********************************************************************
000566170109     A                                      SPACEB(001)
000567170109     A            COMNOT        60A  O     1
000568170109     A*%%***********************************************************************
000569170109     A*%%SS
000570170109     A*%%***********************************************************************
000571170109     A          R TA50P11
000572170109     A*%%***********************************************************************
000573170109     A*%%RI 00000
000574170109     A*%%FS 001
000575170109     A*%%***********************************************************************
000576170109     A                                      SPACEB(002)
000577170109     A                                     1
000578170109     A                                      'DROITS ET COMPÉTENCES SUPPLÉMENTAI-
000579170109     A                                      RES:'
000580170109     A                                      HIGHLIGHT
000581170109     A                                     1
000582170109     A                                      'Droits légaux : T.V.A. en vigueur'
000583170109     A                                      SPACEB(001)
000584170109     A                                    +2
000585170109     A                                      '-'
000586170109     A  27        COMDAG        50A  O    +2
000587170109     A  27        COMCAG         5S 2O    +1
000588170109     A                                      EDTWRD(' 0 ,  ')
000589170109     A  27                                +1
000590170109     A                                      '%'
000591170109     A  29        COMDAG1       50A  O    39
000592170109     A                                      SPACEB(001)
000593170109     A  29        COMCAG1        5S 2O    +1
000594170109     A                                      EDTWRD(' 0 ,  ')
000595170109     A  29                                +1
000596170109     A                                      '%'
000597170109     A*%%***********************************************************************
000598170109     A*%%SS
000599170109     A*%%CL 001
000600170109     A*%%***********************************************************************
000601170109     A          R TA50PIST
000602170109     A*%%***********************************************************************
000603170109     A*%%RI 00000
000604170109     A*%%***********************************************************************
000605170109     A                                      SPACEB(001)
000606170109     A                                     1
000607170109     A                                      'Les tarifs sont ajustés annuelleme-
000608170109     A                                      nt à compter du'
000609170109     A            DTAIST         8S 0O    +1
000610170109     A                                      EDTWRD('  /  /    ')
000611170109      *
000612170109     A  11                                +1
000613170109     A                                      '(dans la mesure de'
000614170109     A  11        TAMPRI         5S 2O    +1
000615170109     A                                      EDTCDE(L)
000616170109     A  11                                +0
000617170109     A                                      '%) en raison de l''augmentation'
000618170109     A  11                                 1
000619170109     A                                      'des prix enregistrée au cours de l-
000620170109     A                                      ''année précédente. L''ampleur de l-
000621170109     A                                      a variation annuelle des prix est p-
000622170109     A                                      roportionnée à'
000623170109     A                                      SPACEB(001)
000624170109     A  11                                 1
000625170109     A                                      'l''indice NIC (indice national ita-
000626170109     A                                      lien des prix a consommation pour l-
000627170109     A                                      ''ensemble des ménages), établi com-
000628170109     A                                      me moyenne des'
000629170109     A                                      SPACEB(001)
000630170109     A  11                                 1
000631170109     A                                      '12 relevés mensuels, dont la valeu-
000632170109     A                                      r est publiée sur le site de l''IST-
000633170109     A                                      AT (Institut national de statistiqu-
000634170109     A                                      e italien)'
000635170109     A                                      SPACEB(001)
000636170109     A  11                                 1
000637170109     A                                      '(www.istat.it).'
000638170109     A                                      SPACEB(001)
000639170109      *
000640170109     A N11                                62
000641170109     A                                      'en raison de l''augmentation des p-
000642170109     A                                      rix enregistrée au'
000643170109     A N11                                 1
000644170109     A                                      'cours de l''année précédente. L''a-
000645170109     A                                      mpleur de la variation annuelle des-
000646170109     A                                       prix est proportionnée à l''indice-
000647170109     A                                       NIC (indice   '
000648170109     A                                      SPACEB(001)
000649170109     A N11                                 1
000650170109     A                                      'national italien des prix a consom-
000651170109     A                                      mation pour l''ensemble des ménages-
000652170109     A                                      ), établi comme moyenne des 12 rele-
000653170109     A                                      vés mensuels,'
000654170109     A                                      SPACEB(001)
000655170109     A N11                                 1
000656170109     A                                      'dont la valeur est publiée sur le -
000657170109     A                                      site de l''ISTAT (Institut national-
000658170109     A                                       de statistique italien) (www.istat-
000659170109     A                                      .it).'
000660170109     A                                      SPACEB(001)
000661170109     A*%%***********************************************************************
000662170109     A*%%SS
000663170109     A*%%CL 001
000664170109     A*%%CL 001
000665170109     A*%%CL 001
000666170109     A*%%***********************************************************************
000667170109     A          R TA50PSTD
000668170109     A*%%***********************************************************************
000669170109     A*%%RI 00000
000670170109     A*%%***********************************************************************
000671170109     A                                      SPACEB(001)
000672170109     A            COMSTD        31A  O     1
000673170109     A                                      HIGHLIGHT
000674170109     A            COMDSTD       83A  O    33
000675170109     A*%%***********************************************************************
000676170109     A*%%SS
000677170109     A*%%***********************************************************************
000678170109     A          R TA50PSE2
000679170109     A*%%***********************************************************************
000680170109     A*%%RI 00000
000681170109     A*%%***********************************************************************
000682170109     A                                      SPACEB(001)
000683170109     A                                     1
000684170109     A                                      'Pour les livraisons expresses, ind-
000685170109     A                                      iquer sur le document la mention "e-
000686170109     A                                      xpress" ou coller l''étiquette adhé-
000687170109     A                                      sive'
000688170109     A                                     1
000689170109     A                                      'que nous vous avons fournie.'
000690170109     A                                      SPACEB(001)
000691170109     A*%%***********************************************************************
000692170109     A*%%SS
000693170109     A*%%CL 001
000694170109     A*%%***********************************************************************
000695170109     A          R TA50PTP
000696170109     A*%%***********************************************************************
000697170109     A*%%RI 00000
000698170109     A*%%***********************************************************************
000699170109     A                                      SPACEB(001)
000700170109     A  08                                 1
000701170109     A                                      'Minimum taxable :'
000702170109     A  08        COMMTS         3S 0O    +1
000703170109     A                                      EDTCDE(Z)
000704170109     A  08                                +1
000705170109     A                                      'kg.'
000706170109     A  18                                +3
000707170109     A                                      'Arrondissments:'
000708170109     A  18        ARROT1        45A  O    +1
000709170109     A  18 20     ARROT2        45A  O    45
000710170109     A  20                                  SPACEB(001)
000711170109     A  19                                 1
000712170109     A                                      'Aux fins de la taxation, le volume-
000713170109     A                                       des marchandises sera considéré co-
000714170109     A                                      mme égal à'
000715170109     A                                      SPACEB(001)
000716170109     A  19        COMRPV         4S 0O    +1
000717170109     A                                      EDTCDE(2)
000718170109     A  19                                +1
000719170109     A                                      'kg. pour chaque mètre cube.'
000720170109     A*%%***********************************************************************
000721170109     A*%%SS                                                   :
000722170109     A*%%***********************************************************************
000723170109     A          R TA50POR2
000724170109     A*%%***********************************************************************
000725170109     A*%%RI 00000
000726170109     A*%%***********************************************************************
000727170109     A                                      SPACEB(001)
000728170109     A                                     1
000729170109     A                                      'Pour les envois en entrée dans vot-
000730170109     A                                      re entrepôt.'
000731170109     A*%%***********************************************************************
000732170109     A*%%SS
000733170109     A*%%***********************************************************************
000734170109     A          R TA50PPC1
000735170109     A*%%***********************************************************************
000736170109     A*%%RI 00000
000737170109     A*%%***********************************************************************
000738170109     A                                      SPACEB(001)
000739170109     A                                     1
000740170109     A                                      'Paiement par chèque au nom du'
000741170109     A            COMINT        20A  O    +1
000742170109     A                                      HIGHLIGHT
000743170109     A*%%***********************************************************************
000744170109     A*%%SS
000745170109     A*%%***********************************************************************
000746170109     A          R TA50PPC2
000747170109     A*%%***********************************************************************
000748170109     A*%%RI 00000
000749170109     A*%%***********************************************************************
000750170109     A                                      SPACEB(001)
000751170109     A                                     1
000752170109     A                                      'Conditions de remboursement:'
000753170109     A            COMAAS         9A  O    +1
000754170109     A                                    +1
000755170109     A                                      'IBAN:'
000756170109     A            COMBAB1        4A  O    +1
000757170109     A            COMBAB2        4A  O    +1
000758170109     A            COMBAB3        4A  O    +1
000759170109     A            COMBAB4        4A  O    +1
000760170109     A            COMBAB5        4A  O    +1
000761170109     A            COMBAB6        4A  O    +1
000762170109     A            COMBAB7        4A  O    +1
000763170109     A            COMBAB8        4A  O    +1
000764170109     A*%%***********************************************************************
000765170109     A*%%SS
000766170109     A*%%***********************************************************************
000767170109     A          R TA50PTAM
000768170109     A*%%***********************************************************************
000769170109     A*%%RI 00000
000770170109     A*%%***********************************************************************
000771170109     A                                      SPACEB(001)
000772170109     A                                      HIGHLIGHT
000773170109     A                                     1
000774170109     A                                      'ASSURANCE MARCHANDISES :'
000775170109     A*%%***********************************************************************
000776170109     A*%%SS
000777170109     A*%%***********************************************************************
000778170109     A          R TA50PEL
000779170109     A*%%***********************************************************************
000780170109     A*%%RI 00000
000781170109     A*%%***********************************************************************
000782170109     A                                      SPACEB(001)
000783170109     A                                     1
000784170109     A                                      'Recouvrement des coûts       '
000785170109     A            STPPER         7A  O    +3
000786170109     A                                    +1
000787170109     A                                      '% sul valore eccedente i'
000788170109     A            COMLRP         5S 3O    +1
000789170109     A                                      EDTCDE(2)
000790170109     A            DESDIV         5A  O    +1
000791170109     A                                    +1
000792170109     A                                      'a kg.'
000793170109     A*%%***********************************************************************
000794170109     A*%%SS
000795170109     A*%%***********************************************************************
000796170109     A          R TA50PEL1
000797170109     A*%%***********************************************************************
000798170109     A*%%RI 00000
000799170109     A*%%***********************************************************************
000800170109     A                                      SPACEB(001)
000801170109     A                                      HIGHLIGHT
000802170109     A                                     1
000803170109     A                                      'MANDATO INTEGRATIVO AD ELEVARE IL -
000804170109     A                                      LIMITE DI RISARCIMENTO A'
000805170109     A            DESDIV         5A  O    +1
000806170109     A            COMELR         7S 3O    +1
000807170109     A                                      EDTCDE(2)
000808170109     A                                    +1
000809170109     A                                      'A KG.'
000810170109     A*%%***********************************************************************
000811170109     A*%%SS
000812170109     A*%%***********************************************************************
000813170109     A          R TA50PEL2
000814170109     A*%%***********************************************************************
000815170109     A*%%RI 00000
000816170109     A*%%***********************************************************************
000817170109     A                                      SPACEB(001)
000818170109     A                                      HIGHLIGHT
000819170109     A                                     1
000820170109     A                                      'COPERTURA ASSICURATIVA PER RESPONS-
000821170109     A                                      ABILITA'' VETTORIALE (LEGGE 450/85)'
000822170109     A*%%***********************************************************************
000823170109     A*%%SS
000824170109     A*%%***********************************************************************
000825170109     A          R TA50PMA
000826170109     A*%%***********************************************************************
000827170109     A*%%RI 00000
000828170109     A*%%***********************************************************************
000829170109     A                                      SPACEB(001)
000830170109     A                                     1
000831170109     A                                      'Recouvrement des coûts '
000832170109     A            COMMA         83A  O    +9
000833170109     A*%%***********************************************************************
000834170109     A*%%SS
000835170109     A*%%***********************************************************************
000836170109     A          R TA50PMA1
000837170109     A*%%***********************************************************************
000838170109     A*%%RI 00000
000839170109     A*%%***********************************************************************
000840170109     A                                      SPACEB(001)
000841170109     A                                      HIGHLIGHT
000842170109     A                                     1
000843170109     A                                      'POLICE D''ASSURANCE ALL RISK - AC -
000844170109     A                                      PLUS, POUR LES MARCHANDISES DONT LA-
000845170109     A                                       VALEUR FIXÉE S''ÉLÈVE À'
000846170109     A            COMVLM        11S 3O    +1
000847170109     A                                      EDTCDE(3)
000848170109     A                                    +1
000849170109     A                                      'EURO PAR'
000850170109     A            DESFVM        10A  O    +1
000851170109     A*%%***********************************************************************
000852170109     A*%%SS
000853170109     A*%%***********************************************************************
000854170109     A          R TA50PMA2
000855170109     A*%%***********************************************************************
000856170109     A*%%RI 00000
000857170109     A*%%***********************************************************************
000858170109     A                                      SPACEB(001)
000859170109     A                                      HIGHLIGHT
000860170109     A                                     1
000861170109     A                                      'POLICE D''ASSURANCE ALL RISK - AC -
000862170109     A                                      BASE, POUR COUVERTURE JUSQU''À UN P-
000863170109     A                                      LAFOND D''INDEMNISATION DE'
000864170109     A            COMVLM        11S 3O    +1
000865170109     A                                      EDTCDE(3)
000866170109     A                                     1
000867170109     A                                      'EURO PAR'
000868170109     A                                      SPACEB(001)
000869170109     A            DESFVM        10A  O    +1
000870170109     A*%%***********************************************************************
000871170109     A*%%SS
000872170109     A*%%CL 001
000873170109     A*%%***********************************************************************
000874170109     A          R TA50PMAV
000875170109     A*%%***********************************************************************
000876170109     A*%%RI 00000
000877170109     A*%%***********************************************************************
000878170109     A                                      SPACEB(001)
000879170109     A                                      HIGHLIGHT
000880170109     A                                     1
000881170109     A                                      'POLICE D''ASSURANCE ALL RISK - AC -
000882170109     A                                      PLUS, AVEC LA VALEUR À GARANTIR CLA-
000883170109     A                                      IREMENT INDIQUÉE SUR LE DOCUMENT DE-
000884170109     A                                       TRANSPORT.'
000885170109     A*%%***********************************************************************
000886170109     A*%%SS
000887170109     A*%%***********************************************************************
000888170109     A          R TA50PMAF1
000889170109     A*%%***********************************************************************
000890170109     A*%%RI 00000
000891170109     A*%%***********************************************************************
000892170109     A                                      SPACEB(001)
000893170109     A                                      HIGHLIGHT
000894170109     A                                     1
000895170109     A                                      'ASSURANCE PAR ENVOI - INDIQUER CLA-
000896170109     A                                      IREMENT LA VALEUR À GARANTIR SUR LE-
000897170109     A                                       DOCUMENT DE TRANSPORT.'
000898170109     A*%%***********************************************************************
000899170109     A*%%SS
000900170109     A*%%***********************************************************************
000901170109     A          R TA50PVMA
000902170109     A*%%***********************************************************************
000903170109     A*%%RI 00000
000904170109     A*%%***********************************************************************
000905170109     A                                      SPACEB(001)
000906170109     A                                     1
000907170109     A                                      'Valable pour les envois en'
000908170109     A            COMVMA        22A  O    +1
000909170109     A*%%***********************************************************************
000910170109     A*%%SS
000911170109     A*%%***********************************************************************
000912170109     A          R TA50PEST
000913170109     A*%%***********************************************************************
000914170109     A*%%RI 00000
000915170109     A*%%***********************************************************************
000916170109     A                                      SPACEB(001)
000917170109     A            COMEST        83A  O    33
000918170109     A*%%***********************************************************************
000919170109     A*%%SS
000920170109     A*%%***********************************************************************
000921170109     A          R TA50PSTD1
000922170109     A*%%***********************************************************************
000923170109     A*%%RI 00000
000924170109     A*%%***********************************************************************
000925170109     A                                      SPACEB(001)
000926170109     A            COMSTDA1      31A  O     1
000927170109     A                                      HIGHLIGHT
000928170109     A            COMSTDB1      25A  O    32
000929170109     A            COMSTDA2      31A  O    60
000930170109     A                                      HIGHLIGHT
000931170109     A            COMSTDB2      25A  O    91
000932170109     A*%%***********************************************************************
000933170109     A*%%SS
000934170109     A*%%***********************************************************************
000935170109     A          R TA50PSTDC
000936170109     A*%%***********************************************************************
000937170109     A*%%RI 00000
000938170109     A*%%***********************************************************************
000939170109     A                                      SPACEB(001)
000940170109     A            COMSTDC      105A  O     1
000941170109     A                                      HIGHLIGHT
000942170109     A            COMSTDC1      10A  O    +0
000943170109     A*%%***********************************************************************
000944170109     A*%%SS
000945170109     A*%%***********************************************************************
000946170109     A          R TA50PGI
000947170109     A*%%***********************************************************************
000948170109     A*%%RI 00000
000949170109     A*%%FS 001
000950170109     A*%%***********************************************************************
000951170109     A                                      SPACEB(002)
000952170109     A                                     1
000953170109     A                                      'MISES EN SOUFFRANCE:'
000954170109     A                                      HIGHLIGHT
000955170109     A                                    +1
000956170109     A                                      'Frais de dossier         :'
000957170109     A            COMSGD        11S 3O    +5
000958170109     A                                      EDTCDE(2)
000959170109     A  28                                +3
000960170109     A                                      'Frais divers'
000961170109     A  28        COMSGV        11S 3O    +2
000962170109     A                                      EDTCDE(2)
000963170109     A  28                                +1
000964170109     A                                      'par envoi'
000965170109     A                                     1
000966170109     A                                      SPACEB(001)
000967170109     A                                      'Frais de nouvelle livraison en vil-
000968170109     A                                      le par 100   '
000969170109     A                                     1
000970170109     A                                      'kg indivisible                    -
000971170109     A                                                  :'
000972170109     A                                      SPACEB(001)
000973170109     A            COMSGR        11S 3O    +5
000974170109     A                                      EDTCDE(2)
000975170109     A                                    +3
000976170109     A                                      'en Province'
000977170109     A            COMSGP        11S 3O    +1
000978170109     A                                      EDTCDE(2)
000979170109     A                                    +1
000980170109     A                                      'par 100 kg indivisible'
000981170109     A                                     1
000982170109     A                                      'Frais d''arrêt par 100 kg indivisi-
000983170109     A                                      ble          :'
000984170109     A                                      SPACEB(001)
000985170109     A            COMST1        11S 3O    +5
000986170109     A                                      EDTCDE(2)
000987170109     A                                    +3
000988170109     A                                      'par jour pour les'
000989170109     A            COMSG1         3S 0O    +1
000990170109     A                                      EDTCDE(Z)
000991170109     A                                    +1
000992170109     A                                      'premiers jours;'
000993170109     A                                     1
000994170109     A                                      SPACEB(001)
000995170109     A                                      'pour les suivants                 -
000996170109     A                                                  :'
000997170109     A            COMST2        11S 3O    +5
000998170109     A                                      EDTCDE(2)
000999170109     A                                    +3
001000170109     A                                      'par jour, avec un minimum de'
001001170109     A            COMSTM        11S 3O    +2
001002170109     A                                      EDTCDE(2)
001003170109     A                                     1
001004170109     A                                      SPACEB(001)
001005170109     A                                      'Jours de retour convenus          -
001006170109     A                                                  :'
001007170109     A            COMGGR         2S 0O   +17
001008170109     A                                      EDTCDE(Z)
001009170109     A                                    +3
001010170109     A                                      'Volume pour la taxation égal à'
001011170109     A            COMGPV         4S 0O    +1
001012170109     A                                      EDTCDE(2)
001013170109     A                                    +1
001014170109     A                                      'kg par mètre cube'
001015170109     A*%%***********************************************************************
001016170109     A*%%SS
001017170109     A*%%CL 001
001018170109     A*%%CL 001
001019170109     A*%%CL 001
001020170109     A*%%CL 001
001021170109     A*%%CL 001
001022170109     A*%%***********************************************************************
001023170109     A          R TA50PGIF
001024170109     A*%%***********************************************************************
001025170109     A*%%RI 00000
001026170109     A*%%***********************************************************************
001027170109     A                                      SPACEB(001)
001028170109     A                                     1
001029170109     A                                      'Jours de franchise                -
001030170109     A                                                  :'
001031170109     A            COMSGF         2S 0O   +17
001032170109     A                                      EDTCDE(Z)
001033170109     A                                    +3
001034170109     A                                      'Application franchise :'
001035170109     A            COMAPF        54A  O    70
001036170109     A                                      SPACEB(001)
001037170109     A*%%***********************************************************************
001038170109     A*%%SS
001039170109     A*%%CL 001
001040170109     A*%%***********************************************************************
001041170109     A          R TA50PGI1
001042170109     A*%%***********************************************************************
001043170109     A*%%RI 00000
001044170109     A*%%***********************************************************************
001045170109     A                                      SPACEB(001)
001046170109     A                                     1
001047170109     A                                      'Après le'
001048170109     A            COMNAV         1S 0O    +1
001049170109     A            COMNAVD        4A  O    +0
001050170109     A                                    +1
001051170109     A                                      'avis, en cas de résultat négatif d-
001052170109     A                                      e la mise en souffrance, la marchan-
001053170109     A                                      dise sera retournée à l''expéditeur-
001054170109     A                                       à ses'
001055170109     A                                     1
001056170109     A                                      'risques et périls, avec facturatio-
001057170109     A                                      n de tous les frais.'
001058170109     A                                      SPACEB(001)
001059170109     A*%%***********************************************************************
001060170109     A*%%SS
001061170109     A*%%CL 001
001062170109     A*%%***********************************************************************
001063170109     A          R TA50PCON
001064170109     A*%%***********************************************************************
001065170109     A*%%RI 00000
001066170109     A*%%FS 001
001067170109     A*%%***********************************************************************
001068170109     A                                      SPACEB(002)
001069170109     A                                     1
001070170109     A                                      'CONDITIONS DE PAIEMENT:'
001071170109     A                                      HIGHLIGHT
001072170109     A            DESCDP        28A  O    +1
001073170109     A  72                               +16
001074170109     A                                      'Frais d''envoi de facture à domici-
001075170109     A                                      le:'
001076170109     A  72        VALSIN         5S 3O    +1
001077170109     A                                      EDTCDE(2)
001078170109     A*%%***********************************************************************
001079170109     A*%%SS
001080170109     A*%%***********************************************************************
001081170109     A          R TA50PCON1
001082170109     A*%%***********************************************************************
001083170109     A*%%RI 00000
001084170109     A*%%***********************************************************************
001085170109     A                                      SPACEB(001)
001086170109     A                                     1
001087170109     A                                      'Banque:'
001088170109     A            PCABI          5S 0O   +17
001089170109     A                                      EDTCDE(Z)
001090170109     A            PCCAB          5S 0O    +1
001091170109     A                                      EDTCDE(Z)
001092170109     A            DESBNA        36A  O    +2
001093170109     A*%%***********************************************************************
001094170109     A*%%SS
001095170109     A*%%***********************************************************************
001096170109     A          R TA50PAM
001097170109     A*%%***********************************************************************
001098170109     A*%%RI 00000
001099170109     A*%%FS 001
001100170109     A*%%***********************************************************************
001101170109     A                                      SPACEB(002)
001102170109     A                                     1
001103170109     A                                      'ASSURANCE MARCHANDISES'
001104170109     A                                      HIGHLIGHT
001105170109     A                                     1
001106170109     A                                      'L''éventuelle couverture d''assura-
001107170109     A                                      nce ALL RISK, avec mandat d''assura-
001108170109     A                                      nce spécifique AC PLUS ou avec la v-
001109170109     A                                      aleur des marchandises'
001110170109     A                                      SPACEB(001)
001111170109     A                                     1
001112170109     A                                      'indiquée dans le D.d.t, fixe, en t-
001113170109     A                                      out cas, un plafond de dommage inde-
001114170109     A                                      mnisable de 100 000,00 Euros pour t-
001115170109     A                                      outes les'
001116170109     A                                      SPACEB(001)
001117170109     A                                     1
001118170109     A                                      'expéditions directes à chaque dest-
001119170109     A                                      inataire effectuées le même jour.'
001120170109     A                                      SPACEB(001)
001121170109     A*%%***********************************************************************
001122170109     A*%%SS
001123170109     A*%%CL 001
001124170109     A*%%CL 001
001125170109     A*%%CL 001
001126170109     A*%%***********************************************************************
001127170109     A          R TA50PTE
001128170109     A*%%***********************************************************************
001129170109     A*%%RI 00000
001130170109     A*%%FS 001
001131170109     A*%%***********************************************************************
001132170109     A                                      SPACEB(002)
001133170109     A                                     1
001134170109     A                                      'NUMÉRO DE TÉLÉPHONE DU DESTINATAIR-
001135170109     A                                      E'
001136170109     A                                      HIGHLIGHT
001137170109     A                                     1
001138170109     A                                      'Pour tous les envois, le numéro de-
001139170109     A                                       téléphone du destinataire doit obl-
001140170109     A                                      igatoirement être indiqué.'
001141170109     A                                      SPACEB(001)
001142170109     A                                     1
001143170109     A                                      'A défaut, l''envoi pourrait subir -
001144170109     A                                      des retards de livraison.'
001145170109     A                                      SPACEB(001)
001146170109     A*%%***********************************************************************
001147170109     A*%%SS
001148170109     A*%%CL 001
001149170109     A*%%CL 001
001150170109     A*%%***********************************************************************
001151170109     A          R TA50PSC
001152170109     A*%%***********************************************************************
001153170109     A*%%RI 00000
001154170109     A*%%***********************************************************************
001155170109     A                                      SPACEB(001)
001156170109     A                                     1
001157170109     A                                      'BRT se réserve le droit d''appliqu-
001158170109     A                                      er (et de modifier dans le temps) u-
001159170109     A                                      n supplément sur tous les envois Fe-
001160170109     A                                      dEx en'
001161170109     A*%%***********************************************************************
001162170109     A*%%SS
001163170109     A*%%***********************************************************************
001164170109     A          R TA50PSC1
001165170109     A*%%***********************************************************************
001166170109     A*%%RI 00000
001167170109     A*%%***********************************************************************
001168170109     A                                      SPACEB(001)
001169170109     A                                     1
001170170109     A                                      'fonction de la variation du prix d-
001171170109     A                                      u carburant JetA1.'
001172170109     A*%%***********************************************************************
001173170109     A*%%SS
001174170109     A*%%***********************************************************************
001175170109     A          R TA50PSC2
001176170109     A*%%***********************************************************************
001177170109     A*%%RI 00000
001178170109     A*%%***********************************************************************
001179170109     A                                      SPACEB(001)
001180170109     A                                     1
001181170109     A                                      'Les suppléments appliqués sont aff-
001182170109     A                                      ichés sur le site Internet. Toute v-
001183170109     A                                      ariation sera affichée au moins 15 -
001184170109     A                                      jours'
001185170109     A*%%***********************************************************************
001186170109     A*%%SS
001187170109     A*%%***********************************************************************
001188170109     A          R TA50PSC3
001189170109     A*%%***********************************************************************
001190170109     A*%%RI 00000
001191170109     A*%%***********************************************************************
001192170109     A                                      SPACEB(001)
001193170109     A                                     1
001194170109     A                                      'avant la date d''entrée en vigueur-
001195170109     A                                      . '
001196170109     A*%%***********************************************************************
001197170109     A*%%SS
001198170109     A*%%***********************************************************************
001199170109     A          R TA50PEMA
001200170109     A*%%***********************************************************************
001201170109     A*%%RI 00000
001202170109     A*%%FS 001
001203170109     A*%%***********************************************************************
001204170109     A                                      SPACEB(002)
001205170109     A                                     1
001206170109     A                                      'SERVICES EN LIGNE ET COMMUNICATION-
001207170109     A                                       PAR COURRIER ÉLECTRONIQUE'
001208170109     A                                      HIGHLIGHT
001209170109     A*%%***********************************************************************
001210170109     A*%%SS
001211170109     A*%%***********************************************************************
001212170109     A          R TA50PEMA1
001213170109     A*%%***********************************************************************
001214170109     A*%%RI 00000
001215170109     A*%%***********************************************************************
001216170109     A                                      SPACEB(001)
001217170109     A                                     1
001218170109     A                                      'Pour bénéficier de nos "Services E-
001219170109     A                                      N LIGNE" (Demander un retrait-Suivr-
001220170109     A                                      e un envoi-Gérer les mises en souff-
001221170109     A                                      rance-POD),'
001222170109      *----
001223170109     A                                     1
001224170109     A                                      SPACEB(001)
001225170109     A                                      'nous vous prions de bien vouloir n-
001226170109     A                                      ous communiquer l''adresse e-mail d-
001227170109     A                                      e la personne à laquelle envoyer le-
001228170109     A                                       mot de passe'
001229170109      *----
001230170109     A                                     1
001231170109     A                                      SPACEB(001)
001232170109     A                                      'et qui sera responsable de son uti-
001233170109     A                                      lisation à bon escient :'
001234170109      *----
001235170109     A                                     1
001236170109     A                                      SPACEB(001)
001237170109     A                                      'Nom'
001238170109     A                                      HIGHLIGHT
001239170109     A                                    +1
001240170109     A                                      '__________________________________-
001241170109     A                                      _______________'
001242170109     A                                    +2
001243170109     A                                      'Adresse E-Mail'
001244170109     A                                      HIGHLIGHT
001245170109     A                                    +1
001246170109     A                                      '__________________________________-
001247170109     A                                      ________________'
001248170109     A*%%***********************************************************************
001249170109     A*%%SS
001250170109     A*%%CL 001
001251170109     A*%%CL 001
001252170109     A*%%CL 001
001253170109     A*%%***********************************************************************
001254170109     A          R TA50PEMA2
001255170109     A*%%***********************************************************************
001256170109     A*%%RI 00000
001257170109     A*%%***********************************************************************
001258170109     A                                      SPACEB(001)
001259170109     A                                     1
001260170109     A                                      'Si vous souhaitez recevoir la docu-
001261170109     A                                      mentation suivante par courrier éle-
001262170109     A                                      ctronique, nous vous prions de nous-
001263170109     A                                       indiquer'
001264170109     A                                     1
001265170109     A                                      'les adresses correspondantes :'
001266170109     A                                      SPACEB(001)
001267170109     A*%%***********************************************************************
001268170109     A*%%SS
001269170109     A*%%CL 001
001270170109     A*%%***********************************************************************
001271170109     A          R TA50PEMA3
001272170109     A*%%***********************************************************************
001273170109     A*%%RI 00000
001274170109     A*%%***********************************************************************
001275170109     A                                      SPACEB(001)
001276170109     A                                     1
001277170109     A                                      'Envoi du détail du virement bancai-
001278170109     A                                      re pour le paiement des contre-remb-
001279170109     A                                      oursements: Adresse E-Mail_________-
001280170109     A                                      _______________'
001281170109     A*%%***********************************************************************
001282170109     A*%%SS
001283170109     A*%%***********************************************************************
001284170109     A          R TA50PEMA4
001285170109     A*%%***********************************************************************
001286170109     A*%%RI 00000
001287170109     A*%%***********************************************************************
001288170109     A                                      SPACEB(001)
001289170109     A                                     1
001290170109     A                                      'Envoi de la communication d''avis -
001291170109     A                                      de mise en souffrance: Adresse E-ma-
001292170109     A                                      il_________________________________-
001293170109     A                                      ________________'
001294170109     A*%%***********************************************************************
001295170109     A*%%SS
001296170109     A*%%***********************************************************************
001297170109     A          R TA50PEMA5
001298170109     A*%%***********************************************************************
001299170109     A*%%RI 00000
001300170109     A*%%***********************************************************************
001301170109     A                                      SPACEB(001)
001302170109     A                                     1
001303170109     A                                      'Envoi de la communication d''avis -
001304170109     A                                      de dommage: Adresse E-mail ________-
001305170109     A                                      ___________________________________-
001306170109     A                                      ________________'
001307170109     A*%%***********************************************************************
001308170109     A*%%SS
001309170109     A*%%***********************************************************************
001310170109     A          R TA50PEMA7
001311170109     A*%%***********************************************************************
001312170109     A*%%RI 00000
001313170109     A*%%***********************************************************************
001314170109     A                                      SPACEB(001)
001315170109     A                                     1
001316170109     A                                      'Envoi de la facture au format pdf:-
001317170109     A                                       Adresse E-mail ___________________-
001318170109     A                                      ___________________________________-
001319170109     A                                      _______________'
001320170109     A*%%***********************************************************************
001321170109     A*%%SS
001322170109     A*%%***********************************************************************
001323170109     A          R TA50PEMA8
001324170109     A*%%***********************************************************************
001325170109     A*%%RI 00000
001326170109     A*%%***********************************************************************
001327170109     A                                      SPACEB(001)
001328170109     A                                     1
001329170109     A                                      'Envoi de communications administra-
001330170109     A                                      tives: Adresse E-mail _____________-
001331170109     A                                      ___________________________________-
001332170109     A                                      _______________'
001333170109     A*%%***********************************************************************
001334170109     A*%%SS
001335170109     A*%%***********************************************************************
001336170109     A          R TA50PEMA6
001337170109     A*%%***********************************************************************
001338170109     A*%%RI 00000
001339170109     A*%%***********************************************************************
001340170109     A                                      SPACEB(001)
001341170109     A                                     1
001342170109     A                                      'AUTORISATION AU TRAITEMENT DES DON-
001343170109     A                                      NÉES PERSONNELLES'
001344170109      *---
001345170109     A                                     1
001346170109     A                                      SPACEB(001)
001347170109     A                                      'Les données ci-dessus seront utili-
001348170109     A                                      sées afin de fournir l''accès aux S-
001349170109     A                                      ervices EN LIGNE ainsi que pour l''-
001350170109     A                                      envoi des'
001351170109      *---
001352170109     A                                     1
001353170109     A                                      SPACEB(001)
001354170109     A                                      'communications, commerciales ou au-
001355170109     A                                      tres, par fax ou courrier électroni-
001356170109     A                                      que.'
001357170109      *---
001358170109     A                                     1
001359170109     A                                      SPACEB(001)
001360170109     A                                      'Les droits visés à l''article 7 du-
001361170109     A                                       décret législatif 196/2003 pourron-
001362170109     A                                      t être exercés à tout moment.'
001363170109     A*%%***********************************************************************
001364170109     A*%%SS
001365170109     A*%%CL 001
001366170109     A*%%CL 001
001367170109     A*%%CL 001
001368170109     A*%%***********************************************************************
001369170109     A          R TA50PE1
001370170109     A*%%***********************************************************************
001371170109     A*%%RI 00000
001372170109     A*%%FS 001
001373170109     A*%%***********************************************************************
001374170109     A                                      SPACEB(002)
001375170109     A                                     1
001376170109     A                                      'LES CONDITIONS GÉNÉRALES MOD.'
001377170109     A                                      HIGHLIGHT
001378170109     A            STPMOD         3S 0O    +1
001379170109     A                                      EDTCDE(Z)
001380170109     A                                      HIGHLIGHT
001381170109     A                                    +1
001382170109     A                                      '/'
001383170109     A                                      HIGHLIGHT
001384170109     A            STPANNO        4S 0O    +1
001385170109     A                                      HIGHLIGHT
001386170109     A                                    +1
001387170109     A                                      'ET LA DÉCLARATION SUR LA PROTECTIO-
001388170109     A                                      N DE LA VIE PRIVÉE MOD.'
001389170109     A                                      HIGHLIGHT
001390170109     A            STPMODI        3S 0O    +1
001391170109     A                                      HIGHLIGHT
001392170109     A                                      EDTWRD('0  ')
001393170109     A                                    +1
001394170109     A                                      '/'
001395170109     A                                      HIGHLIGHT
001396170109     A            STPANNOI       4S 0O    +1
001397170109     A                                      HIGHLIGHT
001398170109     A                                    +1
001399170109     A                                      'CONFORMÉMENT'
001400170109     A                                      HIGHLIGHT
001401170109     A                                     1
001402170109     A                                      'ET POUR LES EFFETS DE L''ART. 13 D-
001403170109     A                                      U DÉCRET LÉGISLATIF N° 196/2003 EN -
001404170109     A                                      ANNEXE, QUE LE MANDANT DÉCLARE AVOI-
001405170109     A                                      R REÇUES ET LUES,'
001406170109     A                                      HIGHLIGHT
001407170109     A                                      SPACEB(001)
001408170109     A                                     1
001409170109     A                                      'FONT, POUR TOUS LES EFFETS DE LOI,-
001410170109     A                                       PARTIE INTÉGRANTE DU PRÉSENT CONTR-
001411170109     A                                      AT TARIFAIRE À SIGNER PAR LES PARTI-
001412170109     A                                      ES.'
001413170109     A                                      HIGHLIGHT
001414170109     A                                      SPACEB(001)
001415170109     A                                     1
001416170109     A                                      'LES DEUX DOCUMENTS SONT PAR AILLEU-
001417170109     A                                      RS DISPONIBLES SUR LE SITE WWW.BRT.-
001418170109     A                                      IT'
001419170109     A                                      HIGHLIGHT
001420170109     A                                      SPACEB(001)
001421170109     A*%%***********************************************************************
001422170109     A*%%SS
001423170109     A*%%CL 001
001424170109     A*%%CL 001
001425170109     A*%%CL 001
001426170109     A*%%***********************************************************************
001427170109     A          R TA50PFI
001428170109     A*%%***********************************************************************
001429170109     A*%%RI 00000
001430170109     A*%%FS 001
001431170109     A*%%***********************************************************************
001432170109     A                                      SPACEB(002)
001433170109     A                                     1
001434170109     A                                      'Le Transporteur express'
001435170109     A            RSUTOLD       20A  O    +3
001436170109     A                                    65
001437170109     A                                      'Le donneur d''ordre'
001438170109     A                                    +1
001439170109     A                                      '__________________________________-
001440170109     A                                      _____'
001441170109     A                                    64
001442170109     A                                      'cachet et signature'
001443170109     A                                      SPACEB(001)
001444170109     A*%%***********************************************************************
001445170109     A*%%SS
001446170109     A*%%CL 001
001447170109     A*%%***********************************************************************
001448170109     A          R TA50PE2
001449170109     A*%%***********************************************************************
001450170109     A*%%RI 00000
001451170109     A*%%FS 001
001452170109     A*%%***********************************************************************
001453170109     A                                      SPACEB(002)
001454170109     A                                     1
001455170109     A                                      'CONDITIONS PARTICULIERES SUJETTES -
001456170109     A                                      A ACCEPTATION: Selon les termes et -
001457170109     A                                      les modalités des articles 1341 et -
001458170109     A                                      1342 du C. civ.'
001459170109     A*%%***********************************************************************
001460170109     A*%%SS
001461170109     A*%%***********************************************************************
001462170109     A          R TA50PE2B
001463170109     A*%%***********************************************************************
001464170109     A*%%RI 00000
001465170109     A*%%***********************************************************************
001466170109     A                                      SPACEB(001)
001467170109     A                                     1
001468170109     A                                      'italien, je déclare avoir pris con-
001469170109     A                                      naissance, avoir attentivement exam-
001470170109     A                                      iné et approuvé tout spécifiquement-
001471170109     A                                       les clauses'
001472170109     A*%%***********************************************************************
001473170109     A*%%SS
001474170109     A*%%***********************************************************************
001475170109     A          R TA50PE2C
001476170109     A*%%***********************************************************************
001477170109     A*%%RI 00000
001478170109     A*%%***********************************************************************
001479170109     A                                      SPACEB(001)
001480170109     A                                     1
001481170109     A                                      'suivantes des conditions générales-
001482170109     A                                       et particulières: 1 (Conditions gé-
001483170109     A                                      nérales); 3 (Conditions de paiement-
001484170109     A                                      -compensation);'
001485170109     A*%%***********************************************************************
001486170109     A*%%SS
001487170109     A*%%***********************************************************************
001488170109     A          R TA50PE2D
001489170109     A*%%***********************************************************************
001490170109     A*%%RI 00000
001491170109     A*%%***********************************************************************
001492170109     A                                      SPACEB(001)
001493170109     A                                     1
001494170109     A                                      '4 (Responsabilité du transporteur)-
001495170109     A                                      ;  5 (Assurance dmarchandises);  6 -
001496170109     A                                      (Présomption de cas fortuit);  7 (C-
001497170109     A                                      onditions de'
001498170109     A*%%***********************************************************************
001499170109     A*%%SS
001500170109     A*%%***********************************************************************
001501170109     A          R TA50PE2E
001502170109     A*%%***********************************************************************
001503170109     A*%%RI 00000
001504170109     A*%%***********************************************************************
001505170109     A                                      SPACEB(001)
001506170109     A                                     1
001507170109     A                                      'livraison); 8 (Mise en souffrance)-
001508170109     A                                      ; 9 (Validité de l''offre-Clause ré-
001509170109     A                                      solutoire expresse); 10 (Marchandis-
001510170109     A                                      es dangereuses);'
001511170109     A*%%***********************************************************************
001512170109     A*%%SS
001513170109     A*%%***********************************************************************
001514170109     A          R TA50PE2F
001515170109     A*%%***********************************************************************
001516170109     A*%%RI 00000
001517170109     A*%%***********************************************************************
001518170109     A                                      SPACEB(001)
001519170109     A                                     1
001520170109     A                                      '11 (Contre remboursement); 12 (Mar-
001521170109     A                                      chandises ne pouvant être acceptées-
001522170109     A                                       par le transporteur); 16 (Document-
001523170109     A                                      s de transport);'
001524170109     A*%%***********************************************************************
001525170109     A*%%SS
001526170109     A*%%***********************************************************************
001527170109     A          R TA50PE2G
001528170109     A*%%***********************************************************************
001529170109     A*%%RI 00000
001530170109     A*%%***********************************************************************
001531170109     A                                      SPACEB(001)
001532170109     A                                     1
001533170109     A                                      '17 (Droit de rétention); 19 (Tribu-
001534170109     A                                      naux compétents); 24 (Loi applicabl-
001535170109     A                                      e); 26 (Transport d''expéditions so-
001536170109     A                                      umises à la'
001537170109     A                                     1
001538170109     A                                      'loi 136/2010).'
001539170109     A                                      SPACEB(001)
001540170109     A*%%***********************************************************************
001541170109     A*%%SS
001542170109     A*%%CL 001
001543170109     A*%%***********************************************************************
001544170109     A          R TA50PFIN
001545170109     A*%%***********************************************************************
001546170109     A*%%RI 00000
001547170109     A*%%FS 063
001548170109     A*%%***********************************************************************
001549170109     A                                      SKIPB(064)
001550170109     A                                    53
001551170109     A                                      'SUITE PAGE'
001552170109     A            PAGE           4S 0O    +1
001553170109     A                                      EDTCDE(Z)
001554170109     A*%%***********************************************************************
001555170109     A*%%SS
001556170109     A*%%***********************************************************************
001557170109     A          R TA50PFINE
001558170109     A*%%***********************************************************************
001559170109     A*%%RI 00000
001560170109     A*%%FS 063
001561170109     A*%%***********************************************************************
001562170109     A                                      SKIPB(064)
001563170109     A                                    53
001564170109     A                                      'PAGE'
001565170109     A            PAGE           4S 0O    +1
001566170109     A                                      EDTCDE(Z)
001567170109     A*%%***********************************************************************
001568170109     A*%%SS
001569170109     A*%%***********************************************************************
001570170109     A          R TA50PERR
001571170109     A*%%***********************************************************************
001572170109     A*%%RI 00000
001573170109     A*%%FS 001
001574170109     A*%%***********************************************************************
001575170109     A                                      SPACEB(002)
001576170109     A                                     1
001577170109     A                                      '====>  TARIFFA/OFFERTA NON STAMPAB-
001578170109     A                                      ILE IN MODO CORRETTO  <===='
001579170109     A            ERRMSG        78A        1
001580170109     A                                      SPACEB(001)
001581170109     A*%%***********************************************************************
001582170109     A*%%SS
001583170109     A*%%CL 001
001584170109     A*%%CP+999CRTPRTF
001585170109     A*%%CP+    FILE(GAITRAFIL/TNTA50P3)
001586170109     A*%%CP+    DEVTYPE(*SCS)
001587170109     A*%%CP+    PAGESIZE(*N 124)
001588170109     A*%%CP+    CPI(16,7)
001589170109     A*%%CP     OVRFLW(65)
001590170109     A*%%CS+999CRTPRTF
001591170109     A*%%CS+    FILE(QTEMP/QPRDRPT)
001592170109     A*%%CS+    DEVTYPE(*SCS)
001593170109     A*%%CS     PAGESIZE(*N 132)
001594170109     A*%%***********************************************************************
