000010041122     A*%%TS  SD  20041122  145342  EDPRM       REL-V4R4M0  5769-PW1
000020041122     A*%%EC
000030041122     A                                      DSPSIZ(24 80 *DS3)
000040041122     A                                      CHGINPDFT(HI UL)
000050041122     A                                      PRINT
000060041122     A          R TA71D01
000070041122     A*%%TS  SD  20041122  145342  EDPRM       REL-V4R4M0  5769-PW1
000080041122     A                                      CA03
000090041122     A                                      CF06
000100041122     A  28        VIDMSG        78   M
000110041122     A            RSUT          20A  O  1  2
000120041122     A                                  1 24'* Lista tipi invio anagrafica clie-
000130041122     A                                      nti *'
000140041122     A                                      DSPATR(RI)
000150041122     A                                      DSPATR(UL)
000160041122     A                                  1 64'TNTA71R'
000170041122     A                                  1 73DATE
000180041122     A                                      EDTCDE(Y)
000190041122     A            KNSIF         10A  O  2  2
000200041122     A            KNMUS         10A  O  2 13
000210041122     A                                  2 73TIME
000220041122     A            V1CPOP         3Y 0B  4 34DSPATR(HI)
000230041122     A                                      CHECK(RZ)
000240041122     A                                      EDTCDE(Z)
000250041122     A  01                                  DSPATR(PR)
000260041122     A  08                                  DSPATR(PC)
000270041122     A            V1DPOP        20A  O  4 38
000280041122     A                                 24  2'F3=Fine'
000290041122     A N92N15                          24 11'F6=CONFERMA'
000300041122     A                                  7  4'COMUNICAZIONE DI APERTURA GIACENZA-
000310041122     A                                            '
000320041122     A                                  9  6'Stampa solo anomalie'
000330041122     A                                 11  4'COMUNICAZIONE DI CESSATA GIACENZA'
000340041122     A                                 13  6'Stampa solo anomalie'
000350041122     A                                 15  4'AVVISO DI BONIFICO PER RIMESSA C/A-
000360041122     A                                      SSEGNI'
000370041122     A                                 16 35'Stampa solo eccezioni'
000380041122     A                                 18  4'PREAVVISO/AVVISO DI DANNO'
000390041122     A                                 19  6'Tipo invio . . . . .'
000400041122     A                                 21  4'TESTI LETTERA'
000410041122     A                                  8  6'Tipo invio . . . . .'
000420041122     A            V1CTAG         1A  B  8 28
000430041122     A  02                                  DSPATR(PC)
000440041122     A                                      VALUES('E' '§' 'F' 'L' 'T' ' ')
000450041122     A            V1CEC0         1A  B  9 57VALUES('S' 'N')
000460041122     A  10                                  DSPATR(PC)
000470041122     A            V1CAN1         1A  B  9 28VALUES('S' 'N')
000480041122     A            V1CTCG         1A  B 12 28
000490041122     A  03                                  DSPATR(PC)
000500041122     A                                      VALUES('E' '§' 'F' 'L' 'T' ' ')
000510041122     A            V1CAN2         1A  B 13 28VALUES('S' 'N')
000520041122     A            V1CTCA         1A  B 16 28
000530041122     A  04                                  DSPATR(PC)
000540041122     A                                      VALUES('E' '§' 'L' 'T' ' ')
000550041122     A            V1CEC2         1A  B 16 57VALUES('S' 'N')
000560041122     A                                 16 59'(S/N)'
000570041122     A            V1CTPD         1A  B 19 28
000580041122     A  05                                  DSPATR(PC)
000590041122     A                                      VALUES('E' 'F' 'L' '§' 'T' ' ')
000600041122     A                                 19 35'Stampa solo eccezioni'
000610041122     A            V1CTTX         1A  B 22 28
000620041122     A  07                                  DSPATR(PC)
000630041122     A                                      VALUES('E' 'F' 'L' '§' 'T' ' ')
000640041122     A                                 16  6'Tipo invio . . . . .'
000650041122     A                                 22  6'Tipo invio . . . . .'
000660041122     A            V1CEC3         1A  B 19 57VALUES('S' 'N')
000670041122     A                                 19 59'(S/N)'
000680041122     A                                 12  6'Tipo invio . . . . .'
000690041122     A N01                              4 59'(000=Tutti)'
000700041122     A            V1CSL4         1A  B 21  2VALUES('X' ' ')
000710041122     A  16                                  DSPATR(PC)
000720041122     A            V1CSL3         1A  B 18  2VALUES('X' ' ')
000730041122     A  14                                  DSPATR(PC)
000740041122     A            V1CSL2         1A  B 15  2VALUES('X' ' ')
000750041122     A  13                                  DSPATR(PC)
000760041122     A            V1CSL1         1A  B 11  2VALUES('X' ' ')
000770041122     A  12                                  DSPATR(PC)
000780041122     A            V1CSL0         1A  B  7  2VALUES('X' ' ')
000790041122     A  09                                  DSPATR(PC)
000800041122     A                                  4 18'Punto Operativo'
000810041122     A                                  6  2'X=Selezione tipi comunicazione'
000820041122     A                                      DSPATR(HI)
000830041122     A                                 24 27'Tipo invio:E=EMail;§=No EMail;F=Fa-
000840041122     A                                      x;L=Lettera;T=Tutti'
000850041122     A                                      DSPATR(HI)
000860041122     A                                  9 35'Stampa solo eccezioni'
000870041122     A                                  9 59'(S/N)'
000880041122     A                                 13 35'Stampa solo eccezioni'
000890041122     A            V1CEC1         1A  B 13 57VALUES('S' 'N')
000900041122     A  11                                  DSPATR(PC)
000910041122     A                                 13 59'(S/N)'
