000100170421     A*%%TS  SD  20170421  122709  EDPMB       REL-V7R2M0  5770-WDS
000200170421     A*%%EC
000300170421     A                                      DSPSIZ(24 80 *DS3)
000400170421     A                                      CHGINPDFT(HI UL)
000500170421     A                                      PRINT
000600000000     A*-------------------------------------------------------*
000700060203     A          R TA60T01
000800060203     A*%%TS  SD  20060203  143756  EDPMB       REL-V5R3M0  5722-WDS
000900060203     A            RSUT          20A  O  1  2
001000060203     A N06N07     VTCTIT        35A  O  1 25DSPATR(RI)
001100060203     A                                      DSPATR(UL)
001200060203     A  06        VTCTITV       35A  O  1 25DSPATR(RI)
001300060203     A                                      DSPATR(UL)
001400060203     A  07        VTCTITC       35A  O  1 24DSPATR(RI)
001500060203     A                                      DSPATR(UL)
001600060203     A            VTCPGM        10A  O  1 62
001700060203     A                                  1 73DATE
001800060203     A                                      EDTCDE(Y)
001900060203     A            KNSIF         10A  O  2  2
002000060203     A            KNMUS         10A  O  2 13
002100060203     A            VTCMOD        15A  O  2 33
002200060203     A                                  2 73TIME
002300000000     A*-------------------------------------------------------*
002400100406     A          R TA60D01
002500100406     A*%%TS  SD  20100406  130406  EDPMB       REL-V5R4M0  5722-WDS
002600100406     A                                      CF03
002700100406     A                                      CSRLOC(H1RIGA     H1COLO)
002800100406     A                                      OVERLAY
002900100406     A            H1RIGA         3S 0H
003000100406     A            H1COLO         3S 0H
003100100406     A  28        V1CMSG        78   M
003200100406     A                                  4  1'Chiave Di Ricerca'
003300100406     A                                      DSPATR(UL)
003400100406     A                                  6  1'Cc'
003500171005     A            V1CKCC    R     Y  O  6  4REFFLD(CNACO000/ACOKCC *LIBL/CNACO0-
003600100406     A                                      0F)
003800100406     A                                      EDTCDE(Z)
003900100406     A                                      TEXT('CODICE CAPOCONTO')
003901171005     A                                      DSPATR(HI)
003902171005     A                                      DSPATR(UL)
004000100406     A                                  6  9'Sc'
004100100406     A            V1CKSC    R     Y  B  6 12REFFLD(CNACO000/ACOKSC *LIBL/CNACO0-
004200100406     A                                      0F)
004300100406     A                                      CHECK(RB)
004400100406     A                                      EDTCDE(Z)
004500100406     A                                      TEXT('Codice cliente')
004600100406     A N28N90                               DSPATR(PC)
004700100406     A                                  6 20'Alfabetica.:'
004800100406     A            V1CRAG    R        B  6 33REFFLD(CNACO000/ACORAG *LIBL/CNACO0-
004900100406     A                                      0F)
005000100406     A                                      TEXT('Ragione sociale')
005100100406     A                                  7 20'Punti Oper?:'
005200100406     A            V1CF01         3A  B  7 33CHECK(RZ)
005300100406     A  41                                  DSPATR(PC)
005400100406     A            V1CF02         3A  B  7 37CHECK(RZ)
005500100406     A  42                                  DSPATR(PC)
005600100406     A            V1CF03         3A  B  7 41CHECK(RZ)
005700100406     A  43                                  DSPATR(PC)
005800100406     A            V1CF04         3A  B  7 45CHECK(RZ)
005900100406     A  44                                  DSPATR(PC)
006000100406     A            V1CF05         3A  B  7 49CHECK(RZ)
006100100406     A  45                                  DSPATR(PC)
006200100406     A            V1CF06         3A  B  7 53CHECK(RZ)
006300100406     A  46                                  DSPATR(PC)
006400100406     A            V1CF07         3A  B  7 57CHECK(RZ)
006500100406     A  47                                  DSPATR(PC)
006600100406     A            V1CF08         3A  B  7 61CHECK(RZ)
006700100406     A  48                                  DSPATR(PC)
006800100406     A            V1CF09         3A  B  7 65CHECK(RZ)
006900100406     A  49                                  DSPATR(PC)
007000100406     A            V1CF10         3A  B  7 69CHECK(RZ)
007100100406     A  50                                  DSPATR(PC)
007200100406     A            V1CF11         3A  B  7 73CHECK(RZ)
007300100406     A  51                                  DSPATR(PC)
007400100406     A            V1CF12         3A  B  7 77CHECK(RZ)
007500100406     A  52                                  DSPATR(PC)
007600100406     A            V1CF13         3A  B  8 33CHECK(RZ)
007700100406     A  53                                  DSPATR(PC)
007800100406     A            V1CF14         3A  B  8 37CHECK(RZ)
007900100406     A  54                                  DSPATR(PC)
008000100406     A            V1CF15         3A  B  8 41CHECK(RZ)
008100100406     A  55                                  DSPATR(PC)
008200100406     A            V1CF16         3A  B  8 45CHECK(RZ)
008300100406     A  56                                  DSPATR(PC)
008400100406     A            V1CF17         3A  B  8 49CHECK(RZ)
008500100406     A  57                                  DSPATR(PC)
008600100406     A            V1CF18         3A  B  8 53CHECK(RZ)
008700100406     A  58                                  DSPATR(PC)
008800100406     A            V1CF19         3A  B  8 57CHECK(RZ)
008900100406     A  59                                  DSPATR(PC)
009000100406     A            V1CF20         3A  B  8 61CHECK(RZ)
009100100406     A  60                                  DSPATR(PC)
009200100406     A            V1CF21         3A  B  8 65CHECK(RZ)
009300100406     A  61                                  DSPATR(PC)
009400100406     A            V1CF22         3A  B  8 69CHECK(RZ)
009500100406     A  62                                  DSPATR(PC)
009600100406     A            V1CF23         3A  B  8 73CHECK(RZ)
009700100406     A  63                                  DSPATR(PC)
009800100406     A            V1CF24         3A  B  8 77CHECK(RZ)
009900100406     A  64                                  DSPATR(PC)
010000100406     A                                  9 20'Cod.Fiscale:'
010100100406     A            V1CCDF        16A  B  9 33
010200100406     A                                 10 20'Partita IVA:'
010300100406     A            V1IVAIT       14A  B 10 33
010400100406     A            V1IVAEU        2A  B 10 48
010500100406     A N05                             21 20'PASSWORD'
010600100406     A                                      DSPATR(UL)
010700100406     A                                      DSPATR(HI)
010800100406     A N05        V1CPWD        10A  B 21 29TEXT('Password x eliminare contr.su-
010900100406     A                                       conti gest.da P.O.')
011000100406     A                                      DSPATR(ND)
011100100406     A                                 23  2'F3=Fine'
011200051107     A*-------------------------------------------------------*
011300130322     A          R TA60D02
011400130322     A*%%TS  SD  20130322  112309  EDPMB       REL-V6R1M0  5761-WDS
011500130322     A N06                                  CF02
011600130322     A N07                                  CF03
011700130322     A  78                                  CF04
011800130322     A  67                                  CF05
011900130322     A N05                                  CF06
012000130322     A N06                                  CF07
012100130322     A N06                                  CF11
012200130322     A  06N29
012300130322     AO 07N29
012400130322     AON06N07                               CF12
012500130322     A N06                                  CF14
012600130322     A N06                                  CF15
012700130322     A N06                                  CF17
012800130322     A N06                                  CF18
012900130322     A N06                                  CF19
013000130322     A N65N06                               CF20
013100130322     A N06N07N09                            CF21
013200130322     A N06N07N09                            CF22
013300130322     A                                      CF24
013400130322     A                                      CSRLOC(H2RIGA     H2COLO)
013500130322     A                                      OVERLAY
013600130322     A            H2RIGA         3S 0H
013700130322     A            H2COLO         3S 0H
013800130322     A            V2HFLS         1A  H
013900130322     A  28        V2CMSG        78   M
014000130322     A            V2COPZ    R        H      REFFLD(CNACO000/ACOOPZ *LIBL/CNACO0-
014100130322     A                                      0F)
014200130322     A            V2CTIC    R        H      REFFLD(CNACO000/ACOTIC *LIBL/CNACO0-
014300130322     A                                      0F)
014400130322     A            V2CLIN    R        H      REFFLD(CNIND000/INDLIN *LIBL/CNIND0-
014500130322     A                                      0F)
014600130322     A N06                              4  2'Cc.'
014700130322     A N06        V1CKCC    R        O  4  6REFFLD(CNACO000/ACOKCC *LIBL/CNACO0-
014800130322     A                                      0F)
014900130322     A  06                              4 10'Nr.'
015000130322     A N06                              4 11'Sc.'
015100130322     A  06        V1CNRV         7Y 0O  4 14EDTCDE(Z)
015200130322     A N06        V1CKSC    R        O  4 15REFFLD(CNACO000/ACOKSC *LIBL/CNACO0-
015300130322     A                                      0F)
015400130322     A                                      TEXT('Codice cliente')
015500130322     A N06N01                           4 30'Ultima Var.'
015600130322     A N06N01     V2CDUV         6Y 0O  4 42EDTCDE(Y)
015700130322     A N06N01     V2DDTR        16A  O  4 55
015800130322     A N06N01     V2CDTR         6Y 0O  4 72EDTCDE(Y)
015900130322     A                                  6  2'DATI ANAGRAFICI:'
016000130322     A                                      DSPATR(HI)
016100130322     A                                      DSPATR(UL)
016200130322     A                                  7  3'Ragione Sociale .......:'
016300130322     A            V2CRAG    R        B  7 28REFFLD(CNACO000/ACORAG *LIBL/CNACO0-
016400130322     A                                      0F)
016500130322     A  05                                  DSPATR(PR)
016600130322     A                                      TEXT('Ragione sociale')
016700130322     A                                  8  3'Indirizzo..............:'
016800130322     A            V2CVIA    R        B  8 28REFFLD(CNIND000/INDVIA *LIBL/CNIND0-
016900130322     A                                      0F)
017000130322     A  05                                  DSPATR(PR)
017100130322     A            V2CCAE    R        B  9 18REFFLD(CNIND000/INDCAE *LIBL/CNIND0-
017200130322     A                                      0F)
017300130322     A  05                                  DSPATR(PR)
017400130322     A            V2CCIT    R        B  9 28REFFLD(CNIND000/INDCIT *LIBL/CNIND0-
017500130322     A                                      0F)
017600130322     A  05                                  DSPATR(PR)
017700130322     A                                      TEXT('LOCALITA')
017800130322     A            V2CPRV    R        B  9 59REFFLD(CNIND000/INDPRV *LIBL/CNIND0-
017900130322     A                                      0F)
018000130322     A  05                                  DSPATR(PR)
018100130322     A            V2CSTA    R        B  9 62REFFLD(CNIND000/INDSTA *LIBL/CNIND0-
018200130322     A                                      0F)
018300130322     A  05                                  DSPATR(PR)
018400130322     A                                 11  3'Telefono...............:'
018500130322     A            V2CTEL    R        B 11 28REFFLD(CNIND000/INDTEL *LIBL/CNIND0-
018600130322     A                                      0F)
018700130322     A  05                                  DSPATR(PR)
018800130322     A                                 11 45'Fax..:'
018900130322     A            V2CTLF    R        B 11 52REFFLD(CNIND000/INDTLF *LIBL/CNIND0-
019000130322     A                                      0F)
019100130322     A  05                                  DSPATR(PR)
019200130322     A                                 12  3'Codice Fiscale.........:'
019300130322     A            V2CCDF    R        B 12 28REFFLD(CNIND000/INDCDF *LIBL/CNIND0-
019400130322     A                                      0F)
019500130322     A  05                                  DSPATR(PR)
019600130322     A                                 12 45'P.IVA:'
019700130322     A            V2IVAIT   R   -2   B 12 52REFFLD(CNIND000/INDIVA *LIBL/CNIND0-
019800130322     A                                      0F)
019900130322     A  05                                  DSPATR(PR)
020000130322     A                                      TEXT('COD.PARTITA IVA -lg.14-')
020100130322     A            V2IVAEU   R  -14   B 12 67REFFLD(CNIND000/INDIVA *LIBL/CNIND0-
020200130322     A                                      0F)
020300130322     A  05                                  DSPATR(PR)
020400130322     A                                      TEXT('COD.PARTITA IVA -iso-')
020500130322     A  39                                  DSPATR(BL)
020600130322     A                                 14  3'Cod.Cliente potenziale.:'
020700130322     A            V2CCPO    R     Y  B 14 28REFFLD(CNACO000/ACOLIB *LIBL/CNACO0-
020800130322     A                                      0F)
020900130322     A  05
021000130322     AO 06                                  DSPATR(PR)
021100130322     A                                      CHECK(RB)
021200130322     A                                      TEXT('Codice potenziale')
021300130322     A            V2DCPO        30A  O 14 40
021400130322     A                                 15  3'Descrizione codice.....:'
021500130322     A            V2NTCDC       48A  B 15 28
021600130322     A  05                                  DSPATR(PR)
021700130322     A                                      CHECK(LC)
021800130322     A                                 16  2'BLOCCO CLIENTE:'
021900130322     A                                      DSPATR(HI)
022000130322     A                                      DSPATR(UL)
022100130322     A                                 17  3'Stato del credito.....?:'
022200130322     A            V2CCON    R   -1   B 17 28REFFLD(CNCLP000/CLPCON *LIBL/CNCLP0-
022300130322     A                                      0F)
022400130322     A  05
022500130322     AO 19                                  DSPATR(PR)
022600130322     A                                      TEXT('Stato del credito')
022700130322     A            V2DCON        25A  O 17 31
022800130322     A                                 18  3'Tipo Blocco............:'
022900130322     A            V2CABL    R        B 18 28REFFLD(CNACO000/ACOABL *LIBL/CNACO0-
023000130322     A                                      0F)
023100130322     A  05
023200130322     AO 79                                  DSPATR(PR)
023300130322     A                                      VALUES(' ' '8')
023400130322     A                                 18 31'Causale ?:'
023500130322     A            V2CBLC    R        B 18 42REFFLD(CNCLP000/CLPNAR *LIBL/CNCLP0-
023600130322     A                                      0F)
023700130322     A  05
023800130322     AO 79                                  DSPATR(PR)
023900130322     A                                      TEXT('Causale blocco cliente')
024000130322     A                                      CHECK(RZ)
024100130322     A            V2DBLC        25A  O 18 46
024200130322     A  20        V2CABLEDP      1A  O 18 73COLOR(PNK)
024300130322     A                                 19  3'Cliente da sollecitare.:'
024400130322     A            V2CSOL         1A  B 19 28TEXT('Cliente da sollecitare')
024500130322     A  05                                  DSPATR(PR)
024600130322     A                                      VALUES('S' 'N')
024700130322     A                                 19 31'(S/N)'
024800130322     A                                 19 39'Sollecito in inglese:'
024900130322     A            V2FSOL         1A  B 19 61TEXT('Comunicazione sollecito in in-
025000130322     A                                      glese')
025100130322     A  05                                  DSPATR(PR)
025200130322     A                                      VALUES('S' ' ')
025300130322     A                                 19 63'(S=Sì)'
025400130322     A  20                             20  3'Cliente Annullabile....:'
025500130322     A  20        V2TB02         1A  B 20 28TEXT('Codice annullabile')
025600130322     A  05                                  DSPATR(PR)
025700130322     A                                      VALUES(' ' 'N')
025800130322     A  20                             20 31'(" "=Sì N=No)'
025900051130     A*-------------------------------------------------------*
026000110908     A          R TA60D03
026100110908     A*%%TS  SD  20110908  085033  EDPMB       REL-V6R1M0  5761-WDS
026200110908     A N06                                  CF02
026300110908     A N07                                  CF03
026400111007     A  78                                  CF04
026500110908     A  67                                  CF05
026600110908     A N05                                  CF06
026700110908     A N06                                  CF07
026800110908     A N06                                  CF11
026900110908     A                                      CF12
027000110908     A N06                                  CF14
027100110908     A N06                                  CF15
027200110908     A N06                                  CF17
027300110908     A N06                                  CF18
027400110908     A N06                                  CF19
027500110908     A N06N07N09                            CF21
027600110908     A N06N07N09                            CF22
027700110908     A                                      CF24
027800110908     A                                      CSRLOC(H3RIGA     H3COLO)
027900110908     A                                      OVERLAY
028000110908     A            H3RIGA         3S 0H
028100110908     A            H3COLO         3S 0H
028200110908     A  28        V3CMSG        78   M
028300140709      *
028400110908     A N06                              4  2'Cc.'
028500110908     A N06        V1CKCC    R        O  4  6REFFLD(CNACO000/ACOKCC *LIBL/CNACO0-
028600110908     A                                      0F)
028700110908     A  06                              4 10'Nr.'
028800110908     A N06                              4 11'Sc.'
028900110908     A  06        V1CNRV         7Y 0O  4 14EDTCDE(Z)
029000110908     A N06        V1CKSC    R        O  4 15REFFLD(CNACO000/ACOKSC *LIBL/CNACO0-
029100110908     A                                      0F)
029200110908     A                                      TEXT('Codice Cliente')
029300110908     A            V3CRAG    R   -8   O  4 23REFFLD(CNACO000/ACORAG *LIBL/CNACO0-
029400110908     A                                      0F)
029500110908     A                                      TEXT('Ragione sociale')
029600110908     A                                  6  2'DATI COMMERCIALI:'
029700110908     A                                      DSPATR(HI)
029800110908     A                                      DSPATR(UL)
029900110908     A                                  7  3'Codice Commerciale....?:'
030000110908     A            V3CAGE         7A  B  7 28TEXT('Codice commerciale')
030100110908     A  05                                  DSPATR(PR)
030200110908     A                                      CHECK(RZ)
030300110908     A            V3DAGE        25A  O  7 36
030400110908     A                                  8  3'Cod.Importanza Cliente?:'
030500110908     A            V3CCLV    R        B  8 28REFFLD(CNCLP000/CLPCLV *LIBL/CNCLP0-
030600110908     A                                      0F)
030700110908     A  05                                  DSPATR(PR)
030800110908     A            V3DCLV        30A  O  8 36
030900110908     A                                  9  3'Categoria Merceologica?:'
031000110908     A            V3CITC         5A  B  9 28TEXT('Cod.categoria merceologica')
031100110908     A  05                                  DSPATR(PR)
031200110908     A                                      CHECK(RZ)
031300110908     A            V3DITC        30A  O  9 36
031400110908     A  01                             10  3'Cliente Non Nuovo......:'
031500110908     A  01        V3CNEW         1A  B 10 28VALUES(' ' 'S')
031600110908     A  01                             10 30'(S=Si)'
031700140709      *- - - - - - - - - - - - - - - - - - - - - - - - - - - -*
031800140709     A*//                              12 35'X = Selezione'
031900140709     A                                 13 35'X = Selezione'
032000140709     A*//         V3DNT02       31A  O 13  3
032100140709     A*/24                                  DSPATR(RI)
032200140709     A*//         V3CNT02        1A  B 13 35VALUES('X' ' ')
032300140709     A*//         V3DNT03       31A  O 14  3
032400140709     A*/25                                  DSPATR(RI)
032500140709     A*//         V3CNT03        1A  B 14 35VALUES('X' ' ')
032600140711     A                                 15  3'NEWS NOMINATIVO       '
032700140709     A  24                                  DSPATR(RI)
032800140709     A            V3CNT02        1A  B 15 35VALUES('X' ' ')
032900140709     A*//         V3DNT05       31A  O 16  3
033000140709     A*/26                                  DSPATR(RI)
033100140709     A*//         V3CNT05        1A  B 16 35VALUES('X' ' ')
033200140709     A*//         V3DNT06       31A  O 17  3
033300140709     A*/27                                  DSPATR(RI)
033400140709     A*//         V3CNT06        1A  B 17 35VALUES('X' ' ')
033500140709     A                                 17  3'RESPONSABILE TRASPORTI'
033600140709     A  26                                  DSPATR(RI)
033700140709     A            V3CNT05        1A  B 17 35VALUES('X' ' ')
033800140709     A*//         V3DNT07       31A  O 19  3
033900140709     A*/31                                  DSPATR(RI)
034000140709     A*//         V3CNT07        1A  B 19 35VALUES('X' ' ')
034100140709     A*//         V3DNT08       31A  O 20  3
034200140709     A*/32                                  DSPATR(RI)
034300140709     A*//         V3CNT08        1A  B 20 35VALUES('X' ' ')
034400140709     A                                 19  3'RESPONSABILE LOGISTICA'
034500140709     A  31                                  DSPATR(RI)
034600140709     A            V3CNT07        1A  B 19 35VALUES('X' ' ')
034700051107     A*-------------------------------------------------------*
034800121227     A          R TA60D04
034900121227     A*%%TS  SD  20121227  114829  EDPES       REL-V6R1M0  5761-WDS
035000121227     A N06                                  CF02
035100121227     A N07                                  CF03
035200121227     A  78                                  CF04
035300121227     A  67                                  CF05
035400121227     A N05                                  CF06
035500121227     A N06                                  CF07
035600121227     A N06                                  CF11
035700121227     A                                      CF12
035800121227     A N06                                  CF14
035900121227     A N06                                  CF15
036000121227     A N06                                  CF17
036100121227     A N06                                  CF18
036200121227     A N06                                  CF19
036300121227     A N06N07N09                            CF21
036400121227     A N06N07N09                            CF22
036500121227     A                                      CF24
036600121227     A                                      CSRLOC(H4RIGA     H4COLO)
036700121227     A                                      OVERLAY
036800121227     A            H4RIGA         3S 0H
036900121227     A            H4COLO         3S 0H
037000121227     A  28        V4CMSG        78   M
037100121227     A N06                              4  2'Cc.'
037200121227     A N06        V1CKCC    R        O  4  6REFFLD(CNACO000/ACOKCC *LIBL/CNACO0-
037300121227     A                                      0F)
037400121227     A  06                              4 10'Nr.'
037500121227     A N06                              4 11'Sc.'
037600121227     A  06        V1CNRV         7Y 0O  4 14EDTCDE(Z)
037700121227     A N06        V1CKSC    R        O  4 15REFFLD(CNACO000/ACOKSC *LIBL/CNACO0-
037800121227     A                                      0F)
037900121227     A                                      TEXT('Codice Cliente')
038000121227     A            V3CRAG    R   -8   O  4 23REFFLD(CNACO000/ACORAG *LIBL/CNACO0-
038100121227     A                                      0F)
038200121227     A                                      TEXT('Ragione sociale')
038300121227     A                                  6  2'DATI FATTURAZIONE:'
038400121227     A                                      DSPATR(HI)
038500121227     A                                      DSPATR(UL)
038600121227     A                                  7  3'Sottoconto int. fattura.......?:'
038700121227     A            V4CSCF         7A  B  7 36TEXT('Codice intestazione fattura')
038800121227     A  05                                  DSPATR(PR)
038900121227     A                                      CHECK(RZ)
039000121227     A            V4DSCF        30A  O  7 44
039100121227     A                                  8  3'Fattura unificata .............:'
039200121227     A            V4CUNI    R   -9   B  8 36REFFLD(FNCLS000/CLSFLO *LIBL/FNCLS0-
039300121227     A                                      0F)
039400121227     A  05                                  DSPATR(PR)
039500121227     A                                      TEXT('Fattura unificata')
039600121227     A                                      VALUES(' ' 'S')
039700121227     A                                  8 44'(S=Si)'
039800121227     A                                  9  3'Tipo fattura..................?:'
039900121227     A            V4CTFT         1A  B  9 36
040000121227     A  05                                  DSPATR(PR)
040100121227     A                                      TEXT('Tipo fattura')
040200121227     A                                      CHECK(RZ)
040300121227     A            V4DTFT        15A  O  9 44
040400121227     A                                 10  3'Frequenza fattura.............?:'
040500121227     A            V4CFFT         1A  B 10 36
040600170317     A  05
040700170317     AO 83                                  DSPATR(PR)
040800121227     A                                      TEXT('Frequenza fattura')
040900121227     A                                      CHECK(RZ)
041000121227     A            V4DFFT        30A  O 10 44
041100121227     A                                 11  3'Tipo data fattura.............?:'
041200121227     A            V4CTDF    R   -2   B 11 36REFFLD(CNCLP000/CLPFUN *LIBL/CNCLP0-
041300121227     A                                      0F)
041400121227     A  05                                  DSPATR(PR)
041500121227     A                                      TEXT('Tipo data fattura')
041600121227     A            V4DTDF        20A  O 11 44
041700121227     A                                 12  3'Spese invio fattura............:'
041800121227     A            V4CSIN    R     Y+3B 12 36REFFLD(CNIND000/INDSIN *LIBL/CNIND0-
041900121227     A                                      0F)
042000121227     A                                      CHECK(RB)
042100121227     A                                      EDTCDE(2)
042200121227     A  05                                  DSPATR(PR)
042300121227     A                                      TEXT('Spese invio fattura')
042400121227     A                                 12 44'EURO'
042500121227     A  20                             12 57'Stp.Mitt.Orig.:'
042600121227     A  20        V4CSTM    R   -9   B 12 73REFFLD(FNCLS000/CLSFLO *LIBL/FNCLS0-
042700121227     A                                      0F)
042800121227     A  05
042900121227     AON20                                  DSPATR(PR)
043000121227     A                                      TEXT('Stampa mittente originale')
043100121227     A                                      VALUES(' ' 'S')
043200121227     A  20                             12 75'(S=Si)'
043300121227     A                                 13  3'Codice Pagamento..............?:'
043400121227     A            V4CCDP    R   -3   B 13 36REFFLD(CNIND000/INDCDP *LIBL/CNIND0-
043500121227     A                                      0F)
043600170317     A  05
043700170320     AO 84                                  DSPATR(PR)
043800121227     A                                      CHECK(RZ)
043900121227     A            V4DCDP        30A  O 13 44
044000121227     A                                 14  3'Banca Appoggio ...............?:'
044100121227     A            V4CBNA    R        B 14 36REFFLD(CNIND000/INDBNA *LIBL/CNIND0-
044200121227     A                                      0F)
044300150415     A  82
044400150415     AO 05                                  DSPATR(PR)
044500121227     A                                 15  3'Abi/Cab........................:'
044600121227     A            V4CABI    R     Y  B 15 36REFFLD(CNIND000/INDABI *LIBL/CNIND0-
044700121227     A                                      0F)
044800121227     A                                      EDTCDE(Z)
044900150415     A  82
045000150415     AO 05                                  DSPATR(PR)
045100121227     A                                      CHECK(RB)
045200121227     A            V4CCAB    R     Y  B 15 42REFFLD(CNIND000/INDCAB *LIBL/CNIND0-
045300121227     A                                      0F)
045400121227     A                                      EDTCDE(Z)
045500150415     A  82
045600150415     AO 05                                  DSPATR(PR)
045700121227     A                                      CHECK(RB)
045800121227     A                                 16  3'Tassazione POST Fatturazione...:'
045900121227     A            V4CTPF         1A  B 16 36VALUES(' ' 'N')
046000121227     A  05                                  DSPATR(PR)
046100121227     A                                 16 44'("_"=Si N=No)'
046200121227     A                                 17  3'Data spedizione fatturata:'
046300121227     A                                 17 30'Prima'
046400121227     A            V4CDPS    R     Y  O 17 36REFFLD(CNCLP000/CLPDPS *LIBL/CNCLP0-
046500121227     A                                      0F)
046600121227     A                                      EDTCDE(Y)
046700121227     A                                      DSPATR(HI)
046800121227     A                                 17 45'Ultima'
046900121227     A            V4CDUS    R     Y  O 17 52REFFLD(CNCLP000/CLPDUS *LIBL/CNCLP0-
047000121227     A                                      0F)
047100121227     A                                      EDTCDE(Y)
047200121227     A                                      DSPATR(HI)
047300121227     A                                 19  3'Nr.Prot. int.'
047400121227     A            V4CNPN    R        O 19 17REFFLD(CNIND000/INDNPN *LIBL/CNIND0-
047500121227     A                                      0F)
047600121227     A                                      EDTCDE(Z)
047700121227     A                                      DSPATR(HI)
047800121227     A                                 19 26'Nr. Prot. Cl.'
047900121227     A            V4CNPR    R        O 19 40REFFLD(CNIND000/INDNPR *LIBL/CNIND0-
048000121227     A                                      0F)
048100121227     A                                      EDTCDE(Z)
048200121227     A                                      DSPATR(HI)
048300121227     A                                 19 49'Data Prot. Cl.'
048400121227     A            V4CDPR    R        O 19 64REFFLD(CNIND000/INDDPR *LIBL/CNIND0-
048500121227     A                                      0F)
048600121227     A                                      EDTCDE(Y)
048700121227     A                                      DSPATR(HI)
048800121227     A                                 20 35'X = Selezione'
048900121227     A N06
049000121227     AO 70        V4DL001       31A  O 21  3
049100121227     A  10                                  DSPATR(RI)
049200121227     A N06
049300121227     AO 70        V4CL001        1A  B 21 35VALUES('X' ' ')
049400121227     A            V4DNT84       31A  O 21 38
049500121227     A  21                                  DSPATR(RI)
049600121227     A            V4CNT84        1A  B 21 70VALUES('X' ' ')
049700051107     A*-------------------------------------------------------*
049800130322     A          R TA60D05
049900130322     A*%%TS  SD  20130322  112309  EDPMB       REL-V6R1M0  5761-WDS
050000130322     A N06                                  CF02
050100130322     A N07                                  CF03
050200130322     A  78                                  CF04
050300130322     A  67                                  CF05
050400130322     A N05                                  CF06
050500130322     A N06                                  CF07
050600130322     A N06                                  CF11
050700130322     A                                      CF12
050800130322     A N06                                  CF14
050900130322     A N06                                  CF15
051000130322     A N06                                  CF17
051100130322     A N06                                  CF18
051200130322     A N06                                  CF19
051300130322     A N06N07N09                            CF21
051400130322     A N06N07N09                            CF22
051500130322     A                                      CF24
051600130322     A                                      CSRLOC(H5RIGA     H5COLO)
051700130322     A                                      OVERLAY
051800130322     A            H5RIGA         3S 0H
051900130322     A            H5COLO         3S 0H
052000130322     A  28        V5CMSG        78   M
052100130322     A N06                              4  2'Cc.'
052200130322     A N06        V1CKCC    R        O  4  6REFFLD(CNACO000/ACOKCC *LIBL/CNACO0-
052300130322     A                                      0F)
052400130322     A  06                              4 10'Nr.'
052500130322     A N06                              4 11'Sc.'
052600130322     A  06        V1CNRV         7Y 0O  4 14EDTCDE(Z)
052700130322     A N06        V1CKSC    R        O  4 15REFFLD(CNACO000/ACOKSC *LIBL/CNACO0-
052800130322     A                                      0F)
052900130322     A                                      TEXT('Cocice Cliente')
053000130322     A            V3CRAG    R   -8   O  4 23REFFLD(CNACO000/ACORAG *LIBL/CNACO0-
053100130322     A                                      0F)
053200130322     A                                      TEXT('Ragione Sociale')
053300130322     A                                  6  2'PAGAMENTI'
053400130322     A                                      DSPATR(UL)
053500130322     A                                      DSPATR(HI)
053600130322     A                                  7  2'Blocco.......:'
053700130322     A            V5CBLP         2A  B  7 17DSPATR(HI)
053800130322     A                                      TEXT('Blocco pagamenti')
053900130322     A                                      VALUES('SI' 'NO')
054000130322     A  05
054100130322     AO 81                                  DSPATR(PR)
054200130322     A                                  7 20'(SI/NO)'
054300130322     A  20        V5CBLPEDP      1A  O  7 29COLOR(PNK)
054400130322     A                                  9  3'Contrassegni.:'
054500130322     A                                      DSPATR(UL)
054600130322     A                                  9 18'Tipo Pagamento ?:'
054700130322     A            V5CFPC    R        B  9 36REFFLD(CNCLP000/CLPFPC *LIBL/CNCLP0-
054800130322     A                                      0F)
054900130322     A  05                                  DSPATR(PR)
055000130322     A            V5DFPC        25A  O  9 38
055100130322     A N22                             10  4'Bonifico Bancario:'
055200130322     A N22                             10 23'IBAN:'
055300130322     A N22        V5CIBAN1       4A  B 10 29TEXT('CODICE IBAN 1')
055400130322     A  05
055500130322     AO 23                                  DSPATR(PR)
055600130322     A N22        V5CIBAN2       4A  B 10 34TEXT('CODICE IBAN 2')
055700130322     A  05
055800130322     AO 23                                  DSPATR(PR)
055900130322     A N22        V5CIBAN3       4A  B 10 39TEXT('CODICE IBAN 3')
056000130322     A  05
056100130322     AO 23                                  DSPATR(PR)
056200130322     A N22        V5CIBAN4       4A  B 10 44TEXT('CODICE IBAN 4')
056300130322     A  05
056400130322     AO 23                                  DSPATR(PR)
056500130322     A N22        V5CIBAN5       4A  B 10 49TEXT('CODICE IBAN 5')
056600130322     A  05
056700130322     AO 23                                  DSPATR(PR)
056800130322     A N22        V5CIBAN6       4A  B 10 54TEXT('CODICE IBAN 6')
056900130322     A  05
057000130322     AO 23                                  DSPATR(PR)
057100130322     A N22        V5CIBAN7       4A  B 10 59TEXT('CODICE IBAN 7')
057200130322     A  05
057300130322     AO 23                                  DSPATR(PR)
057400130322     A N22        V5CIBAN8       4A  B 10 64TEXT('CODICE IBAN 7')
057500130322     A  05
057600130322     AO 23                                  DSPATR(PR)
057700130322     A N75N22                          11  5'BIC:'
057800130322     A N75N22     V5BICCA       11A  O 11 10DSPATR(HI)
057900130322     A N22        V5CBAB        36A  O 11 29TEXT('BANCA APPOGGIO BONIFICO C/ASS-
058000130322     A                                      EGNO')
058100150424     A                                 12  3'Danni........:'
058200130322     A                                      DSPATR(UL)
058300150424     A                                 12 18'Tipo Pagamento ?:'
058400150424     A            V5TPDN    R        B 12 36REFFLD(CNCLP000/CLPFPC *LIBL/CNCLP0-
058500130322     A                                      0F)
058600130322     A  05                                  DSPATR(PR)
058700150424     A            V5DPDN        25A  O 12 38
058800150424     A N71                             13  4'Bonifico Bancario:'
058900150424     A N71                             13 23'IBAN:'
059000150424     A N71        V5IBANDN1      4A  B 13 29TEXT('CODICE IBAN 1')
059100130322     A  05
059200130322     AO 72                                  DSPATR(PR)
059300150424     A N71        V5IBANDN2      4A  B 13 34TEXT('CODICE IBAN 2')
059400130322     A  05
059500130322     AO 72                                  DSPATR(PR)
059600150424     A N71        V5IBANDN3      4A  B 13 39TEXT('CODICE IBAN 3')
059700130322     A  05
059800130322     AO 72                                  DSPATR(PR)
059900150424     A N71        V5IBANDN4      4A  B 13 44TEXT('CODICE IBAN 4')
060000130322     A  05
060100130322     AO 72                                  DSPATR(PR)
060200150424     A N71        V5IBANDN5      4A  B 13 49TEXT('CODICE IBAN 5')
060300130322     A  05
060400130322     AO 72                                  DSPATR(PR)
060500150424     A N71        V5IBANDN6      4A  B 13 54TEXT('CODICE IBAN 6')
060600130322     A  05
060700130322     AO 72                                  DSPATR(PR)
060800150424     A N71        V5IBANDN7      4A  B 13 59TEXT('CODICE IBAN 7')
060900130322     A  05
061000130322     AO 72                                  DSPATR(PR)
061100150424     A N71        V5IBANDN8      4A  B 13 64TEXT('CODICE IBAN 7')
061200130322     A  05
061300130322     AO 72                                  DSPATR(PR)
061400150424     A N71   N76                       14  5'BIC:'
061500150424     A N71   N76  V5BICDN       11A  O 14 10DSPATR(HI)
061600150424     A N71        V5BABDN       36A  O 14 29TEXT('BANCA APPOGGIO BONIFICO C/ASS-
061700130322     A                                      EGNO')
061800150424     A                                 15  3'Note Accredito:'
061900130322     A                                      DSPATR(UL)
062000150424     A                                 15 19'Tipo Pagamento ?:'
062100150424     A            V5TPNA    R        B 15 37REFFLD(CNCLP000/CLPFPC *LIBL/CNCLP0-
062200130322     A                                      0F)
062300130322     A  05                                  DSPATR(PR)
062400150424     A            V5DPNA        25A  O 15 39
062500150424     A N73                             16  4'Bonifico Bancario:'
062600150424     A N73                             16 23'IBAN:'
062700150424     A N73        V5IBANNA1      4A  B 16 29TEXT('CODICE IBAN 1')
062800130322     A  05
062900130322     AO 74                                  DSPATR(PR)
063000150424     A N73        V5IBANNA2      4A  B 16 34TEXT('CODICE IBAN 2')
063100130322     A  05
063200130322     AO 74                                  DSPATR(PR)
063300150424     A N73        V5IBANNA3      4A  B 16 39TEXT('CODICE IBAN 3')
063400130322     A  05
063500130322     AO 74                                  DSPATR(PR)
063600150424     A N73        V5IBANNA4      4A  B 16 44TEXT('CODICE IBAN 4')
063700130322     A  05
063800130322     AO 74                                  DSPATR(PR)
063900150424     A N73        V5IBANNA5      4A  B 16 49TEXT('CODICE IBAN 5')
064000130322     A  05
064100130322     AO 74                                  DSPATR(PR)
064200150424     A N73        V5IBANNA6      4A  B 16 54TEXT('CODICE IBAN 6')
064300130322     A  05
064400130322     AO 74                                  DSPATR(PR)
064500150424     A N73        V5IBANNA7      4A  B 16 59TEXT('CODICE IBAN 7')
064600130322     A  05
064700130322     AO 74                                  DSPATR(PR)
064800150424     A N73        V5IBANNA8      4A  B 16 64TEXT('CODICE IBAN 7')
064900130322     A  05
065000130322     AO 74                                  DSPATR(PR)
065100150424     A N73   N77                       17  5'BIC:'
065200150424     A N73   N77  V5BICNA       11A  O 17 10DSPATR(HI)
065300150424     A N73        V5BABNA       36A  O 17 29TEXT('BANCA APPOGGIO BONIFICO C/ASS-
065400130322     A                                      EGNO')
065500130322     A                                 18 35'X = Selezione'
065600130322     A N06
065700130322     AO 70        V5DL555       31A  O 19  3
065800130322     A  11                                  DSPATR(RI)
065900130322     A N06
066000130322     AO 70        V5CL555        1A  B 19 35VALUES('X' ' ')
066100130322     A            V5DNT85       31A  O 19 39
066200130322     A  13                                  DSPATR(RI)
066300130322     A            V5CNT85        1A  B 19 71VALUES('X' ' ')
066400130322     A N06
066500130322     AO 70        V5DL666       31A  O 20  3
066600130322     A  12                                  DSPATR(RI)
066700130322     A N06
066800130322     AO 70        V5CL666        1A  B 20 35VALUES('X' ' ')
066900130322     A            V5DNT89       31A  O 20 39
067000130322     A  40                                  DSPATR(RI)
067100130322     A            V5CNT89        1A  B 20 71VALUES('X' ' ')
067200150424     A            V5DNT82       31A  O 21 39
067300130322     A  68                                  DSPATR(RI)
067400150424     A            V5CNT82        1A  B 21 71VALUES('X' ' ')
067500051107     A*-------------------------------------------------------*
067600170421     A          R TA60D06
067700170421     A*%%TS  SD  20170421  122709  EDPMB       REL-V7R2M0  5770-WDS
067800170421     A N06                                  CF02
067900170421     A N07                                  CF03
068000170421     A  78                                  CF04
068100170421     A  67                                  CF05
068200170421     A N05                                  CF06
068300170421     A N06                                  CF07
068400170421     A N06                                  CF11
068500170421     A                                      CF12
068600170421     A N06                                  CF14
068700170421     A N06                                  CF15
068800170421     A N06                                  CF17
068900170421     A N06                                  CF18
069000170421     A N06                                  CF19
069100170421     A N06N07N09                            CF21
069200170421     A N06N07N09                            CF22
069300170421     A                                      CF24
069400170421     A                                      CSRLOC(H6RIGA     H6COLO)
069500170421     A                                      OVERLAY
069600170421     A            H6RIGA         3S 0H
069700170421     A            H6COLO         3S 0H
069800170421     A  28        V6CMSG        78   M
069900170421     A N06                              4  2'Cc.'
070000170421     A N06        V1CKCC    R        O  4  6REFFLD(CNACO000/ACOKCC *LIBL/CNACO0-
070100170421     A                                      0F)
070200170421     A  06                              4 10'Nr.'
070300170421     A N06                              4 11'Sc.'
070400170421     A  06        V1CNRV         7Y 0O  4 14EDTCDE(Z)
070500170421     A N06        V1CKSC    R        O  4 15REFFLD(CNACO000/ACOKSC *LIBL/CNACO0-
070600170421     A                                      0F)
070700170421     A                                      TEXT('Cocice Cliente')
070800170421     A            V3CRAG    R   -8   O  4 23REFFLD(CNACO000/ACORAG *LIBL/CNACO0-
070900170421     A                                      0F)
071000170421     A                                      TEXT('Ragione Sociale')
071100170421     A                                  6  2'GESTIONE GIACENZE:'
071200170421     A                                      DSPATR(HI)
071300170421     A                                      DSPATR(UL)
071400170421     A                                  7  3'Tipo Comunicazione al Mittente..?:'
071500170421     A            V6CTCM    R   -9   B  7 38REFFLD(FNCLS000/CLSFLO *LIBL/FNCLS0-
071600170421     A                                      0F)
071700170421     A  05
071800170421     AO 85                                  DSPATR(PR)
071900170421     A                                      TEXT('Tipo comunicazione al mittent-
072000170421     A                                      e')
072100170421     A            V6DTCM        15A  O  7 41
072200170421     A                                  8  3'Tipo Comunicazione Fine Giacenza?:'
072300170421     A            V6CTCF    R   -9   B  8 38REFFLD(FNCLS000/CLSFLO *LIBL/FNCLS0-
072400170421     A                                      0F)
072500170421     A  85
072600170421     AO 05                                  DSPATR(PR)
072700170421     A                                      TEXT('Tipo comunicazione fine giace-
072800170421     A                                      nza')
072900170421     A            V6DTCF        15A  O  8 41
073000170421     A                                  9  3'Apertura Automatica Giacenza....?:'
073100170421     A            V6CAPG    R   -9   B  9 38REFFLD(FNCLS000/CLSFLO *LIBL/FNCLS0-
073200170421     A                                      0F)
073300170421     A  85
073400170421     AO 05                                  DSPATR(PR)
073500170421     A                                      TEXT('Apertura automatica giacenza')
073600170421     A            V6DAPG        25A  O  9 41
073700170421     A                                 10  3'Disposizioni mittente in arrivo..:'
073800170421     A            V6CDMG         2A  B 10 38
073900170421     A  85
074000170421     AO 05                                  DSPATR(PR)
074100170421     A                                      TEXT('DISP.MITTENTE IN ARRIVO 0=SI/-
074200170421     A                                      1=NO')
074300170421     A                                      VALUES('SI' 'NO')
074400170421     A                                 10 41'(SI/NO)'
074500170421     A                                 11  3'Chiusura Automatica Giacenza.....:'
074600170421     A            V6CCAG         2A  B 11 38
074700170421     A  85
074800170421     AO 05                                  DSPATR(PR)
074900170421     A                                      TEXT('CHIU.AUTOM.GIACENZA 0=SI/1=NO-
075000170421     A                                      ')
075100170421     A                                      VALUES('SI' 'NO')
075200170421     A                                 11 41'(SI/NO)'
075300170421     A                                 12 35'X = Selezione'
075400170421     A N06
075500170421     AO 70        V6DL005       31A  O 13  3
075600170421     A  14                                  DSPATR(RI)
075700170421     A N06
075800170421     AO 70        V6CL005        1A  B 13 35VALUES('X' ' ')
075900170421     A            V6DNT88       31A  O 14  3
076000170421     A  15                                  DSPATR(RI)
076100170421     A            V6CNT88        1A  B 14 35VALUES('X' ' ')
076200170421     A N06
076300170421     AO 70        V6DL300       31A  O 15  3
076400170421     A  33                                  DSPATR(RI)
076500170421     A N06
076600170421     AO 70        V6CL300        1A  B 15 35VALUES('X' ' ')
076700051107     A*-------------------------------------------------------*
076800120705     A          R TA60D07
076900120705     A*%%TS  SD  20120705  121236  EDPMB       REL-V6R1M0  5761-WDS
077000120705     A N06                                  CF02
077100120705     A N07                                  CF03
077200120705     A  78                                  CF04
077300120705     A  67                                  CF05
077400120705     A N05                                  CF06
077500120705     A N06                                  CF07
077600120705     A N06                                  CF11
077700120705     A                                      CF12
077800120705     A N06                                  CF14
077900120705     A N06                                  CF15
078000120705     A N06                                  CF17
078100120705     A N06                                  CF18
078200120705     A N06                                  CF19
078300120705     A N06N07N09                            CF21
078400120705     A N06N07N09                            CF22
078500120705     A                                      CF24
078600120705     A                                      CSRLOC(H7RIGA     H7COLO)
078700120705     A                                      OVERLAY
078800120705     A            H7RIGA         3S 0H
078900120705     A            H7COLO         3S 0H
079000120705     A  28        V7CMSG        78   M
079100120705     A N06                              4  2'Cc.'
079200120705     A N06        V1CKCC    R        O  4  6REFFLD(CNACO000/ACOKCC *LIBL/CNACO0-
079300120705     A                                      0F)
079400120705     A  06                              4 10'Nr.'
079500120705     A N06                              4 11'Sc.'
079600120705     A  06        V1CNRV         7Y 0O  4 14EDTCDE(Z)
079700120705     A N06        V1CKSC    R        O  4 15REFFLD(CNACO000/ACOKSC *LIBL/CNACO0-
079800120705     A                                      0F)
079900120705     A                                      TEXT('Cocice Cliente')
080000120705     A            V3CRAG    R   -8   O  4 23REFFLD(CNACO000/ACORAG *LIBL/CNACO0-
080100120705     A                                      0F)
080200120705     A                                      TEXT('Ragione Sociale')
080300120705     A                                  6  2'GESTIONE DANNI:'
080400120705     A                                      DSPATR(HI)
080500120705     A                                      DSPATR(UL)
080600120705     A                                  7  3'Stampa copia denuncia al cliente:'
080700120705     A            V7CSDN    R   -9   B  7 37REFFLD(FNCLS000/CLSFLO *LIBL/FNCLS0-
080800120705     A                                      0F)
080900120705     A  05                                  DSPATR(PR)
081000120705     A                                      TEXT('Stampa copia denuncia al clie-
081100120705     A                                      nte')
081200120705     A                                      VALUES(' ' 'S')
081300120705     A                                  7 39'(S=Si)'
081400120705     A                                  8  3'Comunicazioni in inglese........:'
081500120705     A            V7CSIN    R   -9   B  8 37REFFLD(FNCLS000/CLSFLO *LIBL/FNCLS0-
081600120705     A                                      0F)
081700120705     A  05                                  DSPATR(PR)
081800120705     A                                      TEXT('Comunicazioni in inglese')
081900120705     A                                      VALUES(' ' 'S')
082000120705     A                                  8 39'(S=Si)'
082100120705     A                                 11 35'X = Selezione'
082200120705     A N06
082300120705     AO 70        V7DL006       31A  O 12  3
082400120705     A  16                                  DSPATR(RI)
082500120705     A N06
082600120705     AO 70        V7CL006        1A  B 12 35VALUES('X' ' ')
082700120705     A            V7DNT87       31A  O 13  3
082800120705     A  18                                  DSPATR(RI)
082900120705     A            V7CNT87        1A  B 13 35VALUES('X' ' ')
083000120705     A N06
083100120705     AO 70        V7DL008       31A  O 14  3
083200120705     A  17                                  DSPATR(RI)
083300120705     A N06
083400120705     AO 70        V7CL008        1A  B 14 35VALUES('X' ' ')
083500120705     A                                 16  2'GESTIONE OPERATIVA:'
083600120705     A                                      DSPATR(HI)
083700120705     A                                      DSPATR(UL)
083800120705     A                                 17  3'Escludi da tassazione diretta...:'
083900120705     A            V7CTPA    R   -9   B 17 37REFFLD(FNCLS000/CLSFLO *LIBL/FNCLS0-
084000120705     A                                      0F)
084100120705     A  05                                  DSPATR(PR)
084200120705     A                                      TEXT('Esclusione da tassazione dire-
084300120705     A                                      tta p.a.')
084400120705     A                                      VALUES(' ' 'S')
084500120705     A                                 17 39'(S=Si)'
084600120705     A                                 18  3'Numero STOP per Ritiro..........:'
084700120705     A            V7CSTP    R     Y  B 18 37REFFLD(FNCLS000/CLSSTP *LIBL/FNCLS0-
084800120705     A                                      0F)
084900120705     A  05                                  DSPATR(PR)
085000120705     A                                      CHECK(RZ)
085100120705     A                                      EDTCDE(2)
085200120705     A                                 19 35'X = Selezione'
085300120705     A N06
085400120705     AO 70        V7DL002       31A  O 20  3
085500120705     A  35                                  DSPATR(RI)
085600120705     A N06
085700120705     AO 70        V7CL002        1A  B 20 35VALUES('X' ' ')
085800120705     A N06
085900120705     AO 70        V7DL200       31A  O 20 40
086000120705     A  37                                  DSPATR(RI)
086100120705     A N06
086200120705     AO 70        V7CL200        1A  B 20 72VALUES('X' ' ')
086300120705     A            V7DNT83       31A  O 21  3
086400120705     A  34                                  DSPATR(RI)
086500120705     A            V7CNT83        1A  B 21 35VALUES('X' ' ')
086600120705     A            V7DNT86       31A  O 21 40
086700120705     A  36                                  DSPATR(RI)
086800120705     A            V7CNT86        1A  B 21 72VALUES('X' ' ')
086900051212     A*-------------------------------------------------------*
087000090914     A          R TA60Z01
087100090914     A*%%TS  SD  20090914  135615  EDPMB       REL-V5R4M0  5722-WDS
087200090914     A                                      OVERLAY
087300090914     A N07                             23  1'F3=Fine'
087400090914     A N05                             23 12'F6=Conferma'
087500090914     A                                      DSPATR(HI)
087600090914     A N06                             23 27'F7=Unificante'
087700100806     A N06                             23 44'F18=Note'
087800090914     A N06                             23 68'F11=Luoghi'
087900090914     A            VZFD01        62A  O 24  1
088000090914     A            VZFD02        16A  O 24 64
088100100806     A N06                             23 55'F2=Rubrica'
088200051212     A*-------------------------------------------------------*
088300060208     A          R TA60W01
088400060208     A*%%TS  SD  20060208  110844  EDPMB       REL-V5R3M0  5722-WDS
088500060208     A                                      KEEP
088600060208     A                                      OVERLAY
088700060208     A                                      WINDOW(10 10 8 55)
088800060208     A                                  2  1'ATTENZIONE:'
088900060208     A                                      DSPATR(UL)
089000060208     A                                      DSPATR(HI)
089100060208     A                                  2 14'E'' stato cambiato il codice poten-
089200060208     A                                      ziale'
089300060208     A                                      DSPATR(HI)
089400060208     A                                  4  1'Tutte le azioni del vecchio codice-
089500060208     A                                       saranno spostate sul'
089600060208     A                                  5  1'nuovo codice potenziale. Continuar-
089700060208     A                                      e?'
089800060208     A            W01COK         2A  B  5 38DSPATR(UL)
089900060208     A                                      DSPATR(HI)
090000060208     A                                      VALUES('SI' 'NO')
090100060208     A                                  5 42'(si/no)'
090200060208     A                                  7 21'Enter x avanzare'
090300060208     A                                      DSPATR(HI)
090400051220     A*-------------------------------------------------------*
090500051220     A          R TA60W02
090600051220     A*%%TS  SD  20051003  083221  EDPMB       REL-V4R4M0  5769-PW1
090700051220     A                                      OVERLAY
090800051220     A                                      WINDOW(10 10 8 55)
090900051220     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
091000051220     A                                          '))
091100051220     A                                  2  1'ATTENZIONE:'
091200051220     A                                      DSPATR(UL)
091300051220     A                                      DSPATR(HI)
091400051220     A            W02TES        30A  O  2 14DSPATR(HI)
091500051220     A            W02MSG        54A  O  4  1
091600051220     A                                  7 21'Enter x avanzare'
091700051220     A                                      DSPATR(HI)
091800100507     A*-------------------------------------------------------*
091900060217     A          R TA60W03
092000060217     A*%%TS  SD  20060217  090947  EDPMB       REL-V5R3M0  5722-WDS
092100060217     A                                      KEEP
092200060217     A                                      OVERLAY
092300060217     A                                      WINDOW(10 20 8 30)
092400060217     A                                  2 10'ATTENZIONE:'
092500060217     A                                      DSPATR(UL)
092600060217     A                                      DSPATR(HI)
092700060217     A                                  4  1'I dati immessi andranno persi'
092800060217     A                                  5  4'Continuare?'
092900060217     A            W03COK         2A  B  5 17DSPATR(UL)
093000060217     A                                      DSPATR(HI)
093100060217     A                                      VALUES('SI' 'NO')
093200060217     A                                  5 21'(si/no)'
093300060217     A                                  7  8'Enter x avanzare'
093400060217     A                                      DSPATR(HI)
093500100507     A*-------------------------------------------------------*
093600101014     A          R TA60W04
093700101014     A*%%TS  SD  20101014  085143  EDPMB       REL-V6R1M0  5761-WDS
093800101014     A                                      CF12
093900101014     A                                      KEEP
094000101014     A                                      OVERLAY
094100101014     A                                      WINDOW(10 15 9 40 *NOMSGLIN)
094200101014     A                                  1 16'ATTENZIONE'
094300101014     A                                      DSPATR(HI)
094400101014     A                                  3  2'Inviare una mail all''ufficio'
094500101014     A            W04UFFSEDE    35A  O  4  2
094600101014     A                                  5  2'indicando i seguenti dati del clie-
094700101014     A                                      nte:'
094800101014     A                                  6  2'- il codice IBAN'
094900101014     A                                  7  2'- il codice BIC'
095000101014     A                                  9 15'F12 = Ritorno'
095100101014     A                                      DSPATR(HI)
095200100507     A*-------------------------------------------------------*
095300090803     A          R TA60W05
095400090803     A*%%TS  SD  20090803  120315  EDPMB       REL-V5R4M0  5722-WDS
095500090803     A                                      CF06
095600090803     A                                      KEEP
095700090803     A                                      OVERLAY
095800090803     A                                      WINDOW(10 10 8 45)
095900090803     A                                  2 19'ATTENZIONE'
096000090803     A                                      DSPATR(UL)
096100090803     A                                      DSPATR(HI)
096200090803     A                                  4  2'Con la stessa partita IVA esiste u-
096300090803     A                                      n cliente'
096400090803     A                                  5  2'in stato'
096500090803     A            W5CCON         2   O  5 11
096600090803     A            W5DCON        25   O  5 14
096700090803     A                                  7 18'F06=Conferma'
096800090803     A                                      DSPATR(HI)
096900150424     A*-------------------------------------------------------*
097000150424     A          R TA60W06
097100150424     A*%%TS  SD  20150424  135644  EDPMB       REL-V7R1M0  5770-WDS
097200150424     A                                      CF06
097300150424     A                                      KEEP
097400150424     A                                      OVERLAY
097500150424     A                                      WINDOW(10 10 8 50)
097600150424     A                                  2 19'ATTENZIONE'
097700150424     A                                      DSPATR(UL)
097800150424     A                                      DSPATR(HI)
097900150424     A                                  4  1'Coordinate bancarie spalmate su tu-
098000150424     A                                      tti i pagamenti'
098100150424     A                                  7 18'F06=Conferma'
098200150424     A                                      DSPATR(HI)
