000010091209     A*%%TS  SD  20091209  133448  EDPMB       REL-V5R4M0  5722-WDS
000020091209     A*%%EC
000030091209     A                                      DSPSIZ(24 80 *DS3)
000040091209     A                                      CHGINPDFT(HI UL)
000050091209     A                                      PRINT
000060041221     A*---------------------------------------------------------------*
000070091209     A          R TA8101D
000080091209     A*%%TS  SD  20091209  133448  EDPMB       REL-V5R4M0  5722-WDS
000090091209     A                                      CA03
000100091209     A  01
000110091209     AO 02
000120091209     AO 03                                  CF06
000130091209     A  14                                  CF07
000140091209     A                                      CF12
000150091209     A  02                                  CF16
000160091209     A                                      CF02
000170091209     A  28        V1CMSG        78   M
000180091209     A            RSUT          20A  O  1  2
000190091209     A            VTCTIT        34A  O  1 25DSPATR(RI)
000200091209     A                                      DSPATR(UL)
000210091209     A            VTCPGM        10A  O  1 61
000220091209     A                                  1 72DATE
000230091209     A                                      EDTCDE(Y)
000240091209     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000250091209     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000260091209     A            V1MOD         15A  O  2 33DSPATR(HI)
000270091209     A                                      DSPATR(UL)
000280091209     A                                  2 72TIME
000290091209     A                                  5  3'Codice Luogo .........?..:'
000300091209     A            V1CCOD         3A  B  5 32CHECK(RZ)
000310091209     A  05
000320091209     AO 02
000330091209     AO 06                                  DSPATR(PR)
000340091209     A  40                                  DSPATR(PC)
000350091209     A            V1DCOD        30A  O  5 40TEXT('decodif. codice luogo')
000360091209     A                                  6  3'Codice Cliente ..........:'
000370091209     A            V1CCLI         7Y 0B  6 32CHECK(RZ)
000380091209     A                                      EDTWRD('      0')
000390091209     A  05
000400091209     AO 02
000410091209     AO 07                                  DSPATR(PR)
000420091209     A  41                                  DSPATR(PC)
000430091209     A            V1DCLI        35A  O  6 40
000440091209     A            V1CIND1       35A  O  7  6
000450091209     A                                  7 42'Fax'
000460091209     A            V1CFAX1       16A  O  7 46
000470091209     A            V1CCAP1        9A  O  8  6
000480091209     A            V1CLOC1       35A  O  8 16
000490091209     A            V1CPRO1        2A  O  8 52
000500091209     A            V1CNAZ1        3A  O  8 55
000510091209     A                                 10  3'Ragione Sociale .........:'
000520091209     A            V1CRAG        35A  B 10 32
000530091209     A  05                                  DSPATR(PR)
000540091209     A  42                                  DSPATR(PC)
000550091209     A                                 11  3'Indirizzo ...............:'
000560091209     A            V1CIND        35A  B 11 32
000570091209     A  05                                  DSPATR(PR)
000580091209     A  43                                  DSPATR(PC)
000590091209     A                                 12  3'C.A.P. ..................:'
000600091209     A            V1CCAP         9A  B 12 32
000610091209     A  05                                  DSPATR(PR)
000620091209     A  44                                  DSPATR(PC)
000630091209     A                                 13  3'Località..............? .:'
000640091209     A            V1CLOC        35A  B 13 32
000650091209     A  05                                  DSPATR(PR)
000660091209     A  45                                  DSPATR(PC)
000670091209     A                                 14  3'Sigla Provincia .........:'
000680091209     A            V1CPRO         2A  B 14 32
000690091209     A  05                                  DSPATR(PR)
000700091209     A  46                                  DSPATR(PC)
000710091209     A                                 15  3'Sigla Nazione ........? .:'
000720091209     A            V1CNAZ         3A  B 15 32
000730091209     A  05                                  DSPATR(PR)
000740091209     A  47                                  DSPATR(PC)
000750091209     A                                 16  3'Numero Telefono .........:'
000760091209     A            V1CTEL        16A  B 16 32
000770091209     A  05                                  DSPATR(PR)
000780091209     A  48                                  DSPATR(PC)
000790091209     A                                 17  3'Numero Fax...............:'
000800091209     A            V1CFAX        16A  B 17 32
000810091209     A  05                                  DSPATR(PR)
000820091209     A  49                                  DSPATR(PC)
000830091209     A                                 18  3'Rivolgersi a ............:'
000840091209     A            V1CPER        35A  B 18 32
000850091209     A  05                                  DSPATR(PR)
000860091209     A                                 19  3'Partita IVA .............:'
000870091209     A            V1IVAIT   R   -2   B 19 32REFFLD(FNSPE000/SPEPIV *LIBL/FNSPE0-
000880091209     A                                      0F)
000890091209     A  05                                  DSPATR(PR)
000900091209     A  50                                  DSPATR(PC)
000910091209     A            V1IVAEU   R  -14   B 19 47REFFLD(FNSPE000/SPEPIV *LIBL/FNSPE0-
000920091209     A                                      0F)
000930091209     A  05                                  DSPATR(PR)
000940091209     A  39                                  DSPATR(BL)
000950091209     A                                 20  3'Ind.e-mail....:'
000960091209     A            V1CMAIL       60A  B 20 20CHECK(LC)
000970091209     A                                      CHECK(FE)
000980091209     A  05
000990091209     AO 15                                  DSPATR(PR)
001000091209     A  51                                  DSPATR(PC)
001010091209     A                                 24  2'F3=Fine'
001020091209     A  01
001030091209     AO 02
001040091209     AO 03                             24 16'F6=Conferma'
001050091209     A  02                             24 34'F16=Annulla'
001060091209     A                                 24 69'F12=Ritorno'
001070091209     A  14                             23  2'F7=Personalizza per Filiale arrivo-
001080091209     A                                       forzata'
001090091209     A  13                                  DSPATR(HI)
001100091209     A                                 24 52'F2=Rubrica'
001110041117     A*---------------------------------------------------------------*
001120041117     A          R TA8102W
001130041117     A*%%TS  SD  20041117  121744  EDPMB       REL-V4R4M0  5769-PW1
001140041117     A                                      WINDOW(10 20 8 40)
001150041117     A                                      OVERLAY
001160041117     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
001170041117     A                                          '))
001180041117     A                                  2  2'Luogo..:'
001190041117     A            V2CCOD         3A  O  2 11
001200041117     A            V2DCOD        25A  O  2 15
001210041117     A                                  3  2'Cliente:'
001220041117     A            V2CCLI         7S 0O  3 11
001230041117     A                                  5  9'In uso ad un altro utente'
001240041117     A                                      DSPATR(HI)
001250041117     A                                  7 11'ENTER PER CONTINUARE'
001260041117     A                                      DSPATR(HI)
001270041117     A                                      DSPATR(UL)
001280041221     A*---------------------------------------------------------------*
001290070316     A          R TA8103S                   SFL
001300070316     A*%%TS  SD  20070316  144423  EDPMB       REL-V5R3M0  5722-WDS
001310070316     A            V3SCPP         3Y 0B  4  2CHECK(RZ)
001320070316     A  52                                  DSPATR(PC)
001330070316     A  05
001340070316     AON10                                  DSPATR(PR)
001350070316     A                                      EDTCDE(4)
001360070316     A            V3SDPP        12A  O  4  6
001370070316     A            V3SCPA         3Y 0B  4 19CHECK(RZ)
001380070316     A  53                                  DSPATR(PC)
001390070316     A  05
001400070316     AON10                                  DSPATR(PR)
001410070316     A                                      EDTCDE(4)
001420070316     A            V3SDPA        12A  O  4 23
001430070316     A            V3SCPZ         2Y 0B  4 36CHECK(RZ)
001440070316     A  54                                  DSPATR(PC)
001450070316     A  05
001460070316     AON10                                  DSPATR(PR)
001470070316     A                                      EDTCDE(4)
001480070316     A            V3SCGI        10A  B  4 39
001490070316     A  55                                  DSPATR(PC)
001500070316     A  05
001510070316     AON10                                  DSPATR(PR)
001520070316     A            V3SDCGI       30A  O  4 50
001530041221     A*---------------------------------------------------------------*
001540070316     A          R TA8103C                   SFLCTL(TA8103S)
001550070316     A*%%TS  SD  20070316  095149  EDPMB       REL-V5R3M0  5722-WDS
001560070316     A                                      SFLSIZ(0021)
001570070316     A                                      SFLPAG(0020)
001580070316     A                                      CF12
001590070316     A                                      OVERLAY
001600070316     A  20                                  SFLDSP
001610070316     A  21                                  SFLDSPCTL
001620070316     A N21                                  SFLCLR
001630070316     A  20                                  SFLEND
001640070316     A            REC            4S 0H      SFLRCDNBR
001650070316     A  28        V1CMSG        78   M
001660070316     A            RSUT          20A  O  1  2
001670070316     A            VTCTIT        34A  O  1 25DSPATR(RI)
001680070316     A                                      DSPATR(UL)
001690070316     A            VTCPGM        10A  O  1 61
001700070316     A                                  1 72DATE
001710070316     A                                      EDTCDE(Y)
001720070316     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
001730070316     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
001740070316     A            V1MOD         15A  O  2 33DSPATR(HI)
001750070316     A                                      DSPATR(UL)
001760070316     A                                  2 72TIME
001770070316     A                                  3  2'Fil.Partenza     Fil.Arr.Forzata  -
001780070316     A                                      Zn Giro Consegna                   -
001790070316     A                                               '
001800070316     A                                      DSPATR(UL)
001810041221     A*---------------------------------------------------------------*
001820041221     A          R TA8103Z
001830041221     A*%%TS  SD  20041221  125219  EDPMB       REL-V4R4M0  5769-PW1
001840041221     A                                      OVERLAY
001850041221     A                                 24 69'F12=Ritorno'
001860041221     A                                 24  2'Enter=Conferma dati'
