000100040108      *--------------------------------------------------------------*
000200091201      * PARAMETRI X  AFFIANCAMENTO ATTITÀ COMMERCIALE                *
000300040108      *--------------------------------------------------------------*
000400091201     A                                      REF(TIATC00F)
000500091201     A          R D22REC                    TEXT('DS PER AFFIANCAMENTO')
000600040108      *
000700040108      ****************************************************************
000800040130      * C A M P I   D I   I N P U T
000900040108      ****************************************************************
001000040108      *
001100091215     A            IMK22FCMT      1A         TEXT('FILE IN COMMIT 1=SI 0=NO')
001200091215     A            IMK22CMT       1A         TEXT('ESEGUE COMMIT S/N')
001300091201     A            IMK22FMT       1A         TEXT('TIPO FORMATO;3=80 -
001400090929     A                                      COLONNE;4=132 COLONNE')
001500091201      *
001600091201      ****************************************************************
001700091201      * F L A G    E L A B O R A Z I O N E
001800091201      ****************************************************************
001900091201      *
002000091201      * - "G"   = Gestione attività
002100091201      *
002200091201      * - "I"   = Immissione attività
002300091201      *
002400091201      * - "5"   = Visualizzaizone
002500091201      *
002600091201      * - "2"   = Manutenzione
002700091201      *
002800091201      *
002900091201     A            IMK22FLE       1A         TEXT('FLAG ELABORAZIONE')
003000090611      *
003100091201     A            IMK22CMM  R               REFFLD(ATCCMM)
003200091201     A                                      TEXT('COMMERCIALE')
003300091201     A            IMK22DAD  R               REFFLD(ATCDAD)
003400091201     A                                      TEXT('DATA')
003500091201     A            IMK22HDA  R               REFFLD(ATCHDA)
003600091201     A                                      TEXT('ORA')
003700091201     A            IMK22OII  R               REFFLD(ATCOII)
003800091201     A                                      TEXT('ORA INIZIO')
003900091201     A            IMK22OFI  R               REFFLD(ATCOFI)
004000091201     A                                      TEXT('ORA FINE')
004100091201     A            IMK22CAC  R               REFFLD(ATCCAC)
004200091201     A                                      TEXT('CAUSALE')
004300100114     A            IMK22ESI  R               REFFLD(ATCEST)
004400100114     A                                      TEXT('ESITO')
004500091201      *
004600091201      ****************************************************************
004700091201      * C A M P I   C H I A V E
004800091201      ****************************************************************
004900091201      *
005000091203     A            IMK22TAT  R               REFFLD(ATCTAT)
005100091201     A            IMK22ATN  R               REFFLD(ATCATN)
005200091201     A            IMK22ATNP R               REFFLD(ATCATNP)
005300040217      *
005400040130      ****************************************************************
005500040130      * C A M P I   D I   O U T P U T
005600040130      ****************************************************************
005700040130      *
005800091201     A            OMK22F12       1A         TEXT('S=PREMUTO F12')
005900091201     A            OMK22ERR       1A         TEXT('CODICE DI ERRORE')
006000091201     A            OMK22MSG      78A         TEXT('MESSAGGIO DI ERRORE')
