000100000000             PGM        PARM(&KPJBA)
000200000000             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
000300120802
000400120810
000500141007/* Pulizia file zoppi CRM */
000600141007                        CALL PGM(TNTAD3R) PARM(&KPJBA)
000700141007
000800141007
000900141007/* Controllo Piano dei Conti */
001000141007                        CALL PGM(TNTAD4R) PARM(&KPJBA)
001100090703
001200141007
001300120810 END:        ENDPGM
