000001170103     A*%%***********************************************************************
000002170103     A*%%TS  RD  20170103  111830  EDPGA       REL-V7R1M0  5770-WDS
000003170103     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004170103     A*%%FI       0000000000000000000000000000000000000000000000000
000005170103     A*%%***********************************************************************
000006170103     A          R TA49PPP
000007170103     A*%%***********************************************************************
000008170103     A*%%RI 00000
000009170103     A*%%FS 009
000010170103     A*%%***********************************************************************
000011170103     A                                      SKIPB(010)
000012170103     A            BIANCO         1A  O     1
000013170103     A*%%***********************************************************************
000014170103     A*%%SS
000015170103     A*%%***********************************************************************
000016170103     A          R TA49P01
000017170103     A*%%***********************************************************************
000018170103     A*%%RI 00000
000019170103     A*%%***********************************************************************
000020170103     A                                      SPACEB(001)
000021170103     A                                     1
000022170103     A                                      'Filiale di:'
000023170103     A            TD1FIL        20A  O     1
000024170103     A                                      SPACEB(001)
000025170103     A            TD1VIA        25A  O     1
000026170103     A                                      SPACEB(001)
000027170103     A            TD1CAP         5S 0O     1
000028170103     A                                      SPACEB(001)
000029170103     A                                      EDTCDE(Z)
000030170103     A            TD1LOC        25A  O    +1
000031170103     A            TD1PRV         2A  O    +1
000032170103     A                                   +28
000033170103     A                                      'SPETT.LE'
000034170103     A                                     1
000035170103     A                                      'TEL.'
000036170103     A                                      SPACEB(001)
000037170103     A            TD2TEL        13A  O    +1
000038170103     A                                    +1
000039170103     A                                      'FAX.'
000040170103     A            TD2TFX        13A  O    +1
000041170103     A            PICRAG        48A  O   +25
000042170103     A            PICIND        35A  O    63
000043170103     A                                      SPACEB(001)
000044170103     A            PICCAP         9A  O    63
000045170103     A                                      SPACEB(001)
000046170103     A            PICLOC        30A  O    +1
000047170103     A            PICPRO         2A  O    +1
000048170103     A            DESNAR        25A  O    63
000049170103     A                                      SPACEB(001)
000050170103     A            PICDAL        35A  O     1
000051170103     A                                      SPACEB(001)
000052170103     A  73                               +17
000053170103     A                                      'Alla C.A.'
000054170103     A  73        RESPTRA       60A  O    +1
000055170103     A                                      HIGHLIGHT
000056170103     A                                     1
000057170103     A                                      'ns.rif.'
000058170103     A                                      SPACEB(001)
000059170103     A            PICNR1         2A  O    +1
000060170103     A                                    +1
000061170103     A                                      '/'
000062170103     A            PICNR2         2A  O    +1
000063170103     A  77        RESPTRA2      60A  O   +47
000064170103     A                                      HIGHLIGHT
000065170103     A                                     1
000066170103     A                                      'Telefonando chiedere di'
000067170103     A                                      SPACEB(001)
000068170103     A            DESCOM        25A  O    +1
000069170103     A            DESTAR        30A  O    49
000070170103     A                                      SPACEB(001)
000071170103     A                                      HIGHLIGHT
000072170103     A                                     1
000073170103     A                                      SPACEB(002)
000074170103     A                                      'Con riferimento agli accordi inter-
000075170103     A                                      corsi, siamo ad offrirVi le ns. mig-
000076170103     A                                      liori quotazioni in'
000077170103     A            DESDIV         5A  O    +1
000078170103     A                                    +0
000079170103     A                                      ', per le merci il cui'
000080170103     A                                     1
000081170103     A                                      SPACEB(001)
000082170103     A                                      'trasporto è a Vs. carico:'
000083170103     A*%%***********************************************************************
000084170103     A*%%SS
000085170103     A*%%CL 001
000086170103     A*%%CL 001
000087170103     A*%%CL 001
000088170103     A*%%CL 001
000089170103     A*%%CL 001
000090170103     A*%%CL 001
000091170103     A*%%CL 001
000092170103     A*%%CL 001
000093170103     A*%%CL 001
000094170103     A*%%CL 001
000095170103     A*%%CL 001
000096170103     A*%%CL 002
000097170103     A*%%CL 001
000098170103     A*%%***********************************************************************
000099170103     A          R TA49P02A
000100170103     A*%%***********************************************************************
000101170103     A*%%RI 00000
000102170103     A*%%***********************************************************************
000103170103     A                                      SPACEB(001)
000104170103     A            PRTLNP        80A  O     1
000105170103     A                                      HIGHLIGHT
000106170103     A*%%***********************************************************************
000107170103     A*%%SS
000108170103     A*%%***********************************************************************
000109170103     A          R TA49P02
000110170103     A*%%***********************************************************************
000111170103     A*%%RI 00000
000112170103     A*%%***********************************************************************
000113170103     A                                      SPACEB(001)
000114170103     A                                     1
000115170103     A                                      '-----------------------------------
000116170103     A                                      ------------------------------------
000117170103     A                                      ------------------------------------
000118170103     A                                      ------------------- '
000119170103     A                                      HIGHLIGHT
000120170103     A N78                                 2
000121170103     A                                      'Da'
000122170103     A                                      SPACEB(001)
000123170103     A N78                                +1
000124170103     A                                      'Vostro Magazzino'
000125170103     A                                      HIGHLIGHT
000126170103     A N12        DESUM         10A  O    33
000127170103     A                                      HIGHLIGHT
000128170103     A  78                                  SPACEB(001)
000129170103     A  12        DESUMF        26A  O    17
000130170103     A                                      HIGHLIGHT
000131170103     A  78                                  SPACEB(001)
000132170103     A            DISSCA        80A  O    +1
000133170103     A                                      HIGHLIGHT
000134170103     A N78                                 2
000135170103     A                                      'per :'
000136170103     A                                      HIGHLIGHT
000137170103     A                                      SPACEB(001)
000138170103     A N79        PRTATF        80A  O    44
000139170103     A                                      HIGHLIGHT
000140170103     A  78N79                               SPACEB(001)
000141170103     A                                     1
000142170103     A                                      '-----------------------------------
000143170103     A                                      ------------------------------------
000144170103     A                                      ------------------------------------
000145170103     A                                      ------------------- '
000146170103     A                                      SPACEB(001)
000147170103     A                                      HIGHLIGHT
000148170103     A*%%***********************************************************************
000149170103     A*%%SS
000150170103     A*%%CL 001
000151170103     A*%%CL 001
000152170103     A*%%CL 001
000153170103     A*%%CL 001
000154170103     A*%%CL 001
000155170103     A*%%CL 001
000156170103     A*%%***********************************************************************
000157170103     A          R TA49P03
000158170103     A*%%***********************************************************************
000159170103     A*%%RI 00000
000160170103     A*%%***********************************************************************
000161170103     A                                      SPACEB(001)
000162170103     A            P03DES        42A  O     1
000163170103     A  61        TAR01          7S 3O    +3
000164170103     A                                      EDTWRD('  0 ,   ')
000165170103     A            PER01          1A  O    +1
000166170103     A  62        TAR02          7S 3O    +3
000167170103     A                                      EDTWRD('  0 ,   ')
000168170103     A            PER02          1A  O    +1
000169170103     A  63        TAR03          7S 3O    +3
000170170103     A                                      EDTWRD('  0 ,   ')
000171170103     A            PER03          1A  O    +1
000172170103     A  64        TAR04          7S 3O    +3
000173170103     A                                      EDTWRD('  0 ,   ')
000174170103     A            PER04          1A  O    +1
000175170103     A  65        TAR05          7S 3O    +3
000176170103     A                                      EDTWRD('  0 ,   ')
000177170103     A            PER05          1A  O    +1
000178170103     A  66        TAR06          7S 3O    +3
000179170103     A                                      EDTWRD('  0 ,   ')
000180170103     A            PER06          1A  O    +1
000181170103     A*%%***********************************************************************
000182170103     A*%%SS
000183170103     A*%%***********************************************************************
000184170103     A          R TA49P06
000185170103     A*%%***********************************************************************
000186170103     A*%%RI 00000
000187170103     A*%%FS 001
000188170103     A*%%***********************************************************************
000189170103     A                                      SPACEB(002)
000190170103     A                                     1
000191170103     A                                      'Volume merci per la tassazione : k-
000192170103     A                                      g.per mc'
000193170103     A            VOLSCA        80A  O    +1
000194170103     A*%%***********************************************************************
000195170103     A*%%SS
000196170103     A*%%***********************************************************************
000197170103     A          R TA49P06B
000198170103     A*%%***********************************************************************
000199170103     A*%%RI 00000
000200170103     A*%%***********************************************************************
000201170103     A                                      SPACEB(001)
000202170103     A                                     1
000203170103     A                                      'Volume merci compreso in tariffa'
000204170103     A                                      HIGHLIGHT
000205170103     A*%%***********************************************************************
000206170103     A*%%SS
000207170103     A*%%***********************************************************************
000208170103     A          R TA49P05
000209170103     A*%%***********************************************************************
000210170103     A*%%RI 00000
000211170103     A*%%***********************************************************************
000212170103     A                                      SPACEB(001)
000213170103     A                                     1
000214170103     A                                      'Arrotondamenti:'
000215170103     A            P05AR1        45A  O    +1
000216170103     A            P05AR2        45A  O    17
000217170103     A                                      SPACEB(001)
000218170103     A*%%***********************************************************************
000219170103     A*%%SS
000220170103     A*%%CL 001
000221170103     A*%%***********************************************************************
000222170103     A          R TA49P07
000223170103     A*%%***********************************************************************
000224170103     A*%%RI 00000
000225170103     A*%%FS 001
000226170103     A*%%***********************************************************************
000227170103     A                                      SPACEB(002)
000228170103     A                                     1
000229170103     A                                      'Codice Cliente:'
000230170103     A                                      HIGHLIGHT
000231170103     A                                      UNDERLINE
000232170103     A            P07KSC         7S 0O    +1
000233170103     A                                      HIGHLIGHT
000234170103     A                                      UNDERLINE
000235170103     A  98                                +2
000236170103     A                                      'Off. N.:'
000237170103     A                                      HIGHLIGHT
000238170103     A  98N85     P07NRV         6S 0O    35
000239170103     A                                      EDTCDE(Z)
000240170103     A                                      HIGHLIGHT
000241170103     A  98N85                             42
000242170103     A                                      '-'
000243170103     A                                      HIGHLIGHT
000244170103     A  98N85     P07PRV         1S 0O    44
000245170103     A                                      EDTCDE(Z)
000246170103     A                                      HIGHLIGHT
000247170103     A  85        P07NTRA        7S 0O    35
000248170103     A                                      EDTCDE(Z)
000249170103     A                                      HIGHLIGHT
000250170103     A                                     1
000251170103     A                                      'Tariffa:'
000252170103     A                                      SPACEB(001)
000253170103     A                                      HIGHLIGHT
000254170103     A            DESCTR        13A  O    +1
000255170103     A                                      HIGHLIGHT
000256170103     A                                    +1
000257170103     A                                      '-'
000258170103     A                                      HIGHLIGHT
000259170103     A N85        PTARIFFA      12A  O    27
000260170103     A  85        PTRATTA       14A  O    26
000261170103     A                                    +1
000262170103     A                                      '-'
000263170103     A                                      HIGHLIGHT
000264170103     A            P07DES        50A  O    +1
000265170103     A                                      HIGHLIGHT
000266170103     A*%%***********************************************************************
000267170103     A*%%SS
000268170103     A*%%CL 001
000269170103     A*%%***********************************************************************
000270170103     A          R TA49P07S
000271170103     A*%%***********************************************************************
000272170103     A*%%RI 00000
000273170103     A*%%***********************************************************************
000274170103     A                                      SPACEB(001)
000275170103     A                                      HIGHLIGHT
000276170103     A                                     1
000277170103     A                                      'Applicazione : A scalare'
000278170103     A*%%***********************************************************************
000279170103     A*%%SS
000280170103     A*%%***********************************************************************
000281170103     A          R TA49P07G
000282170103     A*%%***********************************************************************
000283170103     A*%%RI 00000
000284170103     A*%%***********************************************************************
000285170103     A                                      SPACEB(001)
000286170103     A                                      HIGHLIGHT
000287170103     A                                     1
000288170103     A                                      'Applicazione : Massimo scaglione p-
000289170103     A                                      recedente'
000290170103     A*%%***********************************************************************
000291170103     A*%%SS
000292170103     A*%%***********************************************************************
000293170103     A          R TA49P08
000294170103     A*%%***********************************************************************
000295170103     A*%%RI 00000
000296170103     A*%%***********************************************************************
000297170103     A                                      SPACEB(001)
000298170103     A                                     1
000299170103     A                                      'CONTRASSEGNO: SERVIZIO NON PREVIST-
000300170103     A                                      O'
000301170103     A                                      HIGHLIGHT
000302170103     A                                     1
000303170103     A                                      'PORTO ASSEGNATO: SERVIZIO NON PREV-
000304170103     A                                      ISTO'
000305170103     A                                      SPACEB(001)
000306170103     A                                      HIGHLIGHT
000307170103     A                                     1
000308170103     A                                      '1 COLLO PER SPEDIZIONE'
000309170103     A                                      SPACEB(001)
000310170103     A                                      HIGHLIGHT
000311170103     A            COM08A        90A  O     1
000312170103     A                                      SPACEB(001)
000313170103     A                                      HIGHLIGHT
000314170103     A            COM08B       120A  O     1
000315170103     A                                      SPACEB(001)
000316170103     A                                      HIGHLIGHT
000317170103     A*%%***********************************************************************
000318170103     A*%%SS
000319170103     A*%%CL 001
000320170103     A*%%CL 001
000321170103     A*%%CL 001
000322170103     A*%%CL 001
000323170103     A*%%***********************************************************************
000324170103     A          R TA49P09
000325170103     A*%%***********************************************************************
000326170103     A*%%RI 00000
000327170103     A*%%FS 001
000328170103     A*%%***********************************************************************
000329170103     A                                      SPACEB(002)
000330170103     A                                     1
000331170103     A                                      'Tariffa valida dal'
000332170103     A                                      HIGHLIGHT
000333170103     A            STADDT        10A  O    +1
000334170103     A                                      HIGHLIGHT
000335170103     A                                    +1
000336170103     A                                      'al'
000337170103     A                                      HIGHLIGHT
000338170103     A            STADST        10A  O    +1
000339170103     A                                      HIGHLIGHT
000340170103     A  26                                +2
000341170103     A                                      'per:'
000342170103     A                                      HIGHLIGHT
000343170103     A*%%***********************************************************************
000344170103     A*%%SS
000345170103     A*%%***********************************************************************
000346170103     A          R TA49P09A
000347170103     A*%%***********************************************************************
000348170103     A*%%RI 00000
000349170103     A*%%***********************************************************************
000350170103     A                                      SPACEB(001)
000351170103     A                                     1
000352170103     A                                      'Spedizioni annue: minimo'
000353170103     A            COMLRC         7S 0O    +1
000354170103     A                                      EDTCDE(Z)
000355170103     A                                    +1
000356170103     A                                      'massimo'
000357170103     A            COMLAS         7S 0O    +1
000358170103     A                                      EDTCDE(Z)
000359170103     A*%%***********************************************************************
000360170103     A*%%SS
000361170103     A*%%***********************************************************************
000362170103     A          R TA49P09B
000363170103     A*%%***********************************************************************
000364170103     A*%%RI 00000
000365170103     A*%%***********************************************************************
000366170103     A                                      SPACEB(001)
000367170103     A                                     1
000368170103     A                                      'Merce di peso specifico medio di k-
000369170103     A                                      g.'
000370170103     A            COMKPM         5S 1O    +1
000371170103     A                                      EDTWRD('  0 , ')
000372170103     A                                    +1
000373170103     A                                      'a metro cubo'
000374170103     A*%%***********************************************************************
000375170103     A*%%SS
000376170103     A*%%***********************************************************************
000377170103     A          R TA49P09C
000378170103     A*%%***********************************************************************
000379170103     A*%%RI 00000
000380170103     A*%%***********************************************************************
000381170103     A                                      SPACEB(001)
000382170103     A                                     1
000383170103     A                                      'Merci il cui volume a collo è pari-
000384170103     A                                       a mc'
000385170103     A            COMCKM         5S 1O    +1
000386170103     A                                      EDTWRD('0 ,   ')
000387170103     A*%%***********************************************************************
000388170103     A*%%SS
000389170103     A*%%***********************************************************************
000390170103     A          R TA49P09S
000391170103     A*%%***********************************************************************
000392170103     A*%%RI 00000
000393170103     A*%%***********************************************************************
000394170103     A                                      SPACEB(001)
000395170103     A*%%***********************************************************************
000396170103     A*%%SS
000397170103     A*%%***********************************************************************
000398170103     A          R TA49P10
000399170103     A*%%***********************************************************************
000400170103     A*%%RI 00000
000401170103     A*%%***********************************************************************
000402170103     A                                      SPACEB(001)
000403170103     A            COMNOT        60A  O     1
000404170103     A*%%***********************************************************************
000405170103     A*%%SS
000406170103     A*%%***********************************************************************
000407170103     A          R TA49P11
000408170103     A*%%***********************************************************************
000409170103     A*%%RI 00000
000410170103     A*%%FS 001
000411170103     A*%%***********************************************************************
000412170103     A                                      SPACEB(002)
000413170103     A                                     1
000414170103     A                                      'DIRITTI E COMPETENZE AGGIUNTIVE:'
000415170103     A                                      HIGHLIGHT
000416170103     A                                     1
000417170103     A                                      'Diritti di Legge : I.V.A. vigente'
000418170103     A                                      SPACEB(001)
000419170103     A                                    +2
000420170103     A                                      '-'
000421170103     A  27        COMDAG        50A  O    +2
000422170103     A  27        COMCAG         5S 2O    +1
000423170103     A                                      EDTWRD(' 0 ,  ')
000424170103     A  27                                +1
000425170103     A                                      '%'
000426170103     A  29        COMDAG1       50A  O    39
000427170103     A                                      SPACEB(001)
000428170103     A  29        COMCAG1        5S 2O    +1
000429170103     A                                      EDTWRD(' 0 ,  ')
000430170103     A  29                                +1
000431170103     A                                      '%'
000432170103     A*%%***********************************************************************
000433170103     A*%%SS
000434170103     A*%%CL 001
000435170103     A*%%CL 001
000436170103     A*%%***********************************************************************
000437170103     A          R TA49PIST
000438170103     A*%%***********************************************************************
000439170103     A*%%RI 00000
000440170103     A*%%***********************************************************************
000441170103     A                                      SPACEB(001)
000442170103     A                                     1
000443170103     A                                      'Le tariffe vengono adeguate annual-
000444170103     A                                      mente con decorrenza'
000445170103     A            DTAIST         8S 0O    +1
000446170103     A                                      EDTWRD('  /  /    ')
000447170103     A  11                                +1
000448170103     A                                      '(nella misura del'
000449170103     A  11        TAMPRI         5S 2O    +1
000450170103     A                                      EDTCDE(L)
000451170103     A  11                                +0
000452170103     A                                      '%)'
000453170103     A  11                                +1
000454170103     A                                      'in ragione dell''incremento'
000455170103     A N11                                67
000456170103     A                                      'in ragione dell''incremento dei pr-
000457170103     A                                      ezzi registrato'
000458170103     A  11                                 1
000459170103     A                                      'dei  prezzi  registrato  nel  cors-
000460170103     A                                      o  del precedente anno.  L''entità -
000461170103     A                                      della variazione  annuale  dei prez-
000462170103     A                                      zi  è commisurata'
000463170103     A                                      SPACEB(001)
000464170103     A N11                                 1
000465170103     A                                      'nel  corso del precedente  anno. L-
000466170103     A                                      ''entità della variazione  annuale -
000467170103     A                                      dei prezzi è commisurata all''indic-
000468170103     A                                      e NIC (indice'
000469170103     A                                      SPACEB(001)
000470170103     A  11                                 1
000471170103     A                                      SPACEB(001)
000472170103     A                                      'all''indice NIC (indice nazionale -
000473170103     A                                      di prezzi al consumo per l''intera -
000474170103     A                                      collettività), inteso come media de-
000475170103     A                                      lle 12 rilevazioni'
000476170103     A N11                                 1
000477170103     A                                      'nazionale dei prezzi al consumo pe-
000478170103     A                                      r l''intera collettività), inteso c-
000479170103     A                                      ome media delle 12 rilevazioni mens-
000480170103     A                                      ili, il cui'
000481170103     A                                      SPACEB(001)
000482170103     A  11                                 1
000483170103     A                                      'mensili, il cui valore viene pubbl-
000484170103     A                                      icato sul sito ISTAT (www.istat.it)-
000485170103     A                                      .'
000486170103     A                                      SPACEB(001)
000487170103     A N11                                 1
000488170103     A                                      'valore viene pubblicato sul sito I-
000489170103     A                                      STAT (www.istat.it).'
000490170103     A                                      SPACEB(001)
000491170103     A*%%***********************************************************************
000492170103     A*%%SS
000493170103     A*%%CL 001
000494170103     A*%%CL 001
000495170103     A*%%CL 001
000496170103     A*%%CL 001
000497170103     A*%%CL 001
000498170103     A*%%CL 001
000499170103     A*%%***********************************************************************
000500170103     A          R TA49PSTD
000501170103     A*%%***********************************************************************
000502170103     A*%%RI 00000
000503170103     A*%%***********************************************************************
000504170103     A                                      SPACEB(001)
000505170103     A            COMSTD        31A  O     1
000506170103     A                                      HIGHLIGHT
000507170103     A            COMDSTD       83A  O    33
000508170103     A*%%***********************************************************************
000509170103     A*%%SS
000510170103     A*%%***********************************************************************
000511170103     A          R TA49PSH2
000512170103     A*%%***********************************************************************
000513170103     A*%%RI 00000
000514170103     A*%%***********************************************************************
000515170103     A                                      SPACEB(001)
000516170103     A            RIGA1H1030   120A  O     1
000517170103     A            RIGA2H1030   120A  O     1
000518170103     A                                      SPACEB(001)
000519170103     A****************                     1
000520170103     A****************                      'Il "SERVIZIO 10:30" sarà effettuat-
000521170103     A****************                      o esclusivamente per spedizioni con-
000522170103     A****************                       volume massimo di 1 mc e di peso m-
000523170103     A****************                      assimo di'
000524170103     A****************                     1
000525170103     A****************                      'Kg. 250, destinate unicamente alle-
000526170103     A****************                       località indicate sul sito Interne-
000527170103     A****************                      t www.BRT.it'
000528170103     A****************                      SPACEB(001)
000529170103     A                                     1
000530170103     A                                      'Le spedizioni che non rientrano ne-
000531170103     A                                      gli standard di cui sopra e/o siano-
000532170103     A                                       destinate a località diverse da qu-
000533170103     A                                      elle'
000534170103     A                                      SPACEB(001)
000535170103     A                                     1
000536170103     A                                      'servite, saranno effettuate second-
000537170103     A                                      o il servizio "PRIORITY".'
000538170103     A                                      SPACEB(001)
000539170103     A                                     1
000540170103     A                                      'Per consegna con il "SERVIZIO 10:3-
000541170103     A                                      0" evidenziare sul documento la dic-
000542170103     A                                      itura "SERVIZIO 10:30" o apporre l'-
000543170103     A                                      'apposito'
000544170103     A                                      SPACEB(001)
000545170103     A                                     1
000546170103     A                                      'adesivo da noi fornito.'
000547170103     A                                      SPACEB(001)
000548170103     A*%%***********************************************************************
000549170103     A*%%SS
000550170103     A*%%CL 001
000551170103     A*%%CL 001
000552170103     A*%%CL 001
000553170103     A*%%CL 001
000554170103     A*%%CL 001
000555170103     A*%%***********************************************************************
000556170103     A          R TA49PSE2
000557170103     A*%%***********************************************************************
000558170103     A*%%RI 00000
000559170103     A*%%***********************************************************************
000560170103     A                                      SPACEB(001)
000561170103     A                                     1
000562170103     A                                      'Per consegna con il servizio "PRIO-
000563170103     A                                      RITY" evidenziare sul documento la -
000564170103     A                                      dicitura "PRIORITY" o apporre l''ap-
000565170103     A                                      posito'
000566170103     A                                     1
000567170103     A                                      'adesivo da noi fornito.'
000568170103     A                                      SPACEB(001)
000569170103     A*%%***********************************************************************
000570170103     A*%%SS
000571170103     A*%%CL 001
000572170103     A*%%***********************************************************************
000573170103     A          R TA49PTP
000574170103     A*%%***********************************************************************
000575170103     A*%%RI 00000
000576170103     A*%%***********************************************************************
000577170103     A                                      SPACEB(001)
000578170103     A  08                                 1
000579170103     A                                      'Minimo tassabile: kg.'
000580170103     A  08        COMMTS         3S 0O    +1
000581170103     A                                      EDTCDE(Z)
000582170103     A  18                                +7
000583170103     A                                      'Arrotondamenti:'
000584170103     A  18        ARROT1        45A  O    +1
000585170103     A  18 20     ARROT2        45A  O    49
000586170103     A  20                                  SPACEB(001)
000587170103     A  19                                 1
000588170103     A                                      'Il volume delle merci, ai fini del-
000589170103     A                                      la tassazione, sarà considerato par-
000590170103     A                                      i a kg.'
000591170103     A                                      SPACEB(001)
000592170103     A  19        COMRPV         4S 0O    +1
000593170103     A                                      EDTCDE(2)
000594170103     A  19                                +1
000595170103     A                                      'per ogni metro cubo.'
000596170103     A*%%***********************************************************************
000597170103     A*%%SS
000598170103     A*%%CL 001
000599170103     A*%%CL 001
000600170103     A*%%***********************************************************************
000601170103     A          R TA49POR2
000602170103     A*%%***********************************************************************
000603170103     A*%%RI 00000
000604170103     A*%%***********************************************************************
000605170103     A                                      SPACEB(001)
000606170103     A                                     1
000607170103     A                                      'Per spedizioni in arrivo al Vostro-
000608170103     A                                       magazzino.'
000609170103     A*%%***********************************************************************
000610170103     A*%%SS
000611170103     A*%%***********************************************************************
000612170103     A          R TA49PPC1
000613170103     A*%%***********************************************************************
000614170103     A*%%RI 00000
000615170103     A*%%***********************************************************************
000616170103     A                                      SPACEB(001)
000617170103     A                                     1
000618170103     A                                      'Riscossione con assegno intestato -
000619170103     A                                      al'
000620170103     A            COMINT        20A  O    +1
000621170103     A                                      HIGHLIGHT
000622170103     A*%%***********************************************************************
000623170103     A*%%SS
000624170103     A*%%***********************************************************************
000625170103     A          R TA49PPC2
000626170103     A*%%***********************************************************************
000627170103     A*%%RI 00000
000628170103     A*%%***********************************************************************
000629170103     A                                      SPACEB(001)
000630170103     A                                     1
000631170103     A                                      'Condizioni di Rimborso :'
000632170103     A            COMAAS         9A  O    +1
000633170103     A                                    +1
000634170103     A                                      'IBAN:'
000635170103     A            COMBAB1        4A  O    +1
000636170103     A            COMBAB2        4A  O    +1
000637170103     A            COMBAB3        4A  O    +1
000638170103     A            COMBAB4        4A  O    +1
000639170103     A            COMBAB5        4A  O    +1
000640170103     A            COMBAB6        4A  O    +1
000641170103     A            COMBAB7        4A  O    +1
000642170103     A            COMBAB8        4A  O    +1
000643170103     A*%%***********************************************************************
000644170103     A*%%SS
000645170103     A*%%***********************************************************************
000646170103     A          R TA49PTAM
000647170103     A*%%***********************************************************************
000648170103     A*%%RI 00000
000649170103     A*%%***********************************************************************
000650170103     A                                      SPACEB(001)
000651170103     A                                      HIGHLIGHT
000652170103     A                                     1
000653170103     A                                      'ASSICURAZIONE MERCI :'
000654170103     A*%%***********************************************************************
000655170103     A*%%SS
000656170103     A*%%***********************************************************************
000657170103     A          R TA49PEL
000658170103     A*%%***********************************************************************
000659170103     A*%%RI 00000
000660170103     A*%%***********************************************************************
000661170103     A                                      SPACEB(001)
000662170103     A                                     1
000663170103     A                                      'Recupero Costi               '
000664170103     A            STPPER         7A  O    +3
000665170103     A                                    +1
000666170103     A                                      '% sul valore eccedente i'
000667170103     A            COMLRP         5S 3O    +1
000668170103     A                                      EDTCDE(2)
000669170103     A            DESDIV         5A  O    +1
000670170103     A                                    +1
000671170103     A                                      'a kg.'
000672170103     A*%%***********************************************************************
000673170103     A*%%SS
000674170103     A*%%***********************************************************************
000675170103     A          R TA49PEL1
000676170103     A*%%***********************************************************************
000677170103     A*%%RI 00000
000678170103     A*%%***********************************************************************
000679170103     A                                      SPACEB(001)
000680170103     A                                      HIGHLIGHT
000681170103     A                                     1
000682170103     A                                      'MANDATO INTEGRATIVO AD ELEVARE IL -
000683170103     A                                      LIMITE DI RISARCIMENTO A'
000684170103     A            DESDIV         5A  O    +1
000685170103     A            COMELR         7S 3O    +1
000686170103     A                                      EDTCDE(2)
000687170103     A                                    +1
000688170103     A                                      'A KG.'
000689170103     A*%%***********************************************************************
000690170103     A*%%SS
000691170103     A*%%***********************************************************************
000692170103     A          R TA49PEL2
000693170103     A*%%***********************************************************************
000694170103     A*%%RI 00000
000695170103     A*%%***********************************************************************
000696170103     A                                      SPACEB(001)
000697170103     A                                      HIGHLIGHT
000698170103     A                                     1
000699170103     A                                      'COPERTURA ASSICURATIVA PER RESPONS-
000700170103     A                                      ABILITA'' VETTORIALE (LEGGE 450/85)'
000701170103     A*%%***********************************************************************
000702170103     A*%%SS
000703170103     A*%%***********************************************************************
000704170103     A          R TA49PMA
000705170103     A*%%***********************************************************************
000706170103     A*%%RI 00000
000707170103     A*%%***********************************************************************
000708170103     A                                      SPACEB(001)
000709170103     A                                     1
000710170103     A                                      'Recupero Costi       '
000711170103     A            COMMA         83A  O   +11
000712170103     A*%%***********************************************************************
000713170103     A*%%SS
000714170103     A*%%***********************************************************************
000715170103     A          R TA49PMA1
000716170103     A*%%***********************************************************************
000717170103     A*%%RI 00000
000718170103     A*%%***********************************************************************
000719170103     A                                      SPACEB(001)
000720170103     A                                      HIGHLIGHT
000721170103     A                                     1
000722170103     A                                      'MANDATO ASSICURATIVO ALL RISK - AC-
000723170103     A                                       PLUS, PER MERCE IL CUI VALORE STAB-
000724170103     A                                      ILITO E'' PARI A EURO'
000725170103     A            COMVLM        11S 3O    +1
000726170103     A                                      EDTCDE(3)
000727170103     A                                    +1
000728170103     A                                      'A'
000729170103     A            DESFVM        10A  O    +1
000730170103     A*%%***********************************************************************
000731170103     A*%%SS
000732170103     A*%%***********************************************************************
000733170103     A          R TA49PMA2
000734170103     A*%%***********************************************************************
000735170103     A*%%RI 00000
000736170103     A*%%***********************************************************************
000737170103     A                                      SPACEB(001)
000738170103     A                                      HIGHLIGHT
000739170103     A                                     1
000740170103     A                                      'MANDATO ASSICURATIVO ALL RISK - AC-
000741170103     A                                       BASE, PER COPERTURA FINO AD UN MAS-
000742170103     A                                      SIMO RISARCIBILE DI EURO'
000743170103     A            COMVLM        11S 3O    +1
000744170103     A                                      EDTCDE(3)
000745170103     A                                    +1
000746170103     A                                      'A'
000747170103     A            DESFVM        10A  O    +1
000748170103     A*%%***********************************************************************
000749170103     A*%%SS
000750170103     A*%%***********************************************************************
000751170103     A          R TA49PMAV
000752170103     A*%%***********************************************************************
000753170103     A*%%RI 00000
000754170103     A*%%***********************************************************************
000755170103     A                                      SPACEB(001)
000756170103     A                                      HIGHLIGHT
000757170103     A                                     1
000758170103     A                                      'MANDATO ASSICURATIVO ALL RISK - AC-
000759170103     A                                       PLUS, A FRONTE DI CHIARA ESPOSIZIO-
000760170103     A                                      NE DEL VALORE DA ASSICURARE SUL DOC-
000761170103     A                                      UMENTO DI TRASPORTO.'
000762170103     A*%%***********************************************************************
000763170103     A*%%SS
000764170103     A*%%***********************************************************************
000765170103     A          R TA49PMAF1
000766170103     A*%%***********************************************************************
000767170103     A*%%RI 00000
000768170103     A*%%***********************************************************************
000769170103     A                                      SPACEB(001)
000770170103     A                                      HIGHLIGHT
000771170103     A                                     1
000772170103     A                                      'COPERTURA ASSICURATIVA A SPEDIZION-
000773170103     A                                      E A FRONTE DI CHIARA ESPOSIZIONE DE-
000774170103     A                                      L VALORE DA ASSICURARE SUL DOCUMENT-
000775170103     A                                      O DI TRASPORTO.'
000776170103     A*%%***********************************************************************
000777170103     A*%%SS
000778170103     A*%%***********************************************************************
000779170103     A          R TA49PVMA
000780170103     A*%%***********************************************************************
000781170103     A*%%RI 00000
000782170103     A*%%***********************************************************************
000783170103     A                                      SPACEB(001)
000784170103     A                                     1
000785170103     A                                      'Valido per le spedizioni in'
000786170103     A            COMVMA        22A  O    +1
000787170103     A*%%***********************************************************************
000788170103     A*%%SS
000789170103     A*%%***********************************************************************
000790170103     A          R TA49PEST
000791170103     A*%%***********************************************************************
000792170103     A*%%RI 00000
000793170103     A*%%***********************************************************************
000794170103     A                                      SPACEB(001)
000795170103     A            COMEST        83A  O    33
000796170103     A*%%***********************************************************************
000797170103     A*%%SS
000798170103     A*%%***********************************************************************
000799170103     A          R TA49PSTD1
000800170103     A*%%***********************************************************************
000801170103     A*%%RI 00000
000802170103     A*%%***********************************************************************
000803170103     A                                      SPACEB(001)
000804170103     A            COMSTDA1      31A  O     1
000805170103     A                                      HIGHLIGHT
000806170103     A            COMSTDB1      25A  O    32
000807170103     A            COMSTDA2      31A  O    60
000808170103     A                                      HIGHLIGHT
000809170103     A            COMSTDB2      25A  O    91
000810170103     A*%%***********************************************************************
000811170103     A*%%SS
000812170103     A*%%***********************************************************************
000813170103     A          R TA49PSTDC
000814170103     A*%%***********************************************************************
000815170103     A*%%RI 00000
000816170103     A*%%***********************************************************************
000817170103     A                                      SPACEB(001)
000818170103     A            COMSTDC      105A  O     1
000819170103     A                                      HIGHLIGHT
000820170103     A            COMSTDC1      10A  O    +0
000821170103     A*%%***********************************************************************
000822170103     A*%%SS
000823170103     A*%%***********************************************************************
000824170103     A          R TA49PTF
000825170103     A*%%***********************************************************************
000826170103     A*%%RI 00000
000827170103     A*%%***********************************************************************
000828170103     A                                      SPACEB(001)
000829170103     A                                     1
000830170103     A                                      'SUPPLEMENTO CARBURANTE (FUEL SURCH-
000831170103     A                                      ARGE)'
000832170103     A                                      HIGHLIGHT
000833170103     A*%%***********************************************************************
000834170103     A*%%SS
000835170103     A*%%***********************************************************************
000836170103     A          R TA49PTF1
000837170103     A*%%***********************************************************************
000838170103     A*%%RI 00000
000839170103     A*%%***********************************************************************
000840170103     A                                      SPACEB(001)
000841170103     A                                     1
000842170103     A                                      'BRT si riserva il diritto di appli-
000843170103     A                                      care un supplemento su tutte le spe-
000844170103     A                                      dizioni in base all''incremento del-
000845170103     A                                       prezzo medio'
000846170103     A                                     1
000847170103     A                                      'del gasolio al consumo rispetto al-
000848170103     A                                       valore di Euro'
000849170103     A                                      SPACEB(001)
000850170103     A            COMFPMG        4S 3O    +1
000851170103     A                                      EDTCDE(4)
000852170103     A                                    +0
000853170103     A                                      '.'
000854170103     A*%%***********************************************************************
000855170103     A*%%SS
000856170103     A*%%CL 001
000857170103     A*%%***********************************************************************
000858170103     A          R TA49PTF2
000859170103     A*%%***********************************************************************
000860170103     A*%%RI 00000
000861170103     A*%%***********************************************************************
000862170103     A                                      SPACEB(001)
000863170103     A                                     1
000864170103     A                                      'Il supplemento verrà applicato nel-
000865170103     A                                      la misura dello'
000866170103     A            COMFITR        5S 3O    +1
000867170103     A                                      EDTWRD('0 ,   ')
000868170103     A                                    +1
000869170103     A                                      '%'
000870170103     A                                    +1
000871170103     A                                      'al superamento di ogni scaglione.'
000872170103     A*%%***********************************************************************
000873170103     A*%%SS
000874170103     A*%%***********************************************************************
000875170103     A          R TA49PTF4
000876170103     A*%%***********************************************************************
000877170103     A*%%RI 00000
000878170103     A*%%***********************************************************************
000879170103     A                                      SPACEB(001)
000880170103     A                                     1
000881170103     A                                      'Il supplemento verrà calcolato in -
000882170103     A                                      funzione del numero di scaglioni, d-
000883170103     A                                      el prezzo del gasolio al consumo e -
000884170103     A                                      della'
000885170103     A                                     1
000886170103     A                                      'relativa % di applicazione:'
000887170103     A                                      SPACEB(001)
000888170103     A*%%***********************************************************************
000889170103     A*%%SS
000890170103     A*%%CL 001
000891170103     A*%%***********************************************************************
000892170103     A          R TA49PTF5
000893170103     A*%%***********************************************************************
000894170103     A*%%RI 00000
000895170103     A*%%***********************************************************************
000896170103     A                                      SPACEB(001)
000897170103     A                                     1
000898170103     A                                      'Minimo:'
000899170103     A            COMPMA         5S 3O    +1
000900170103     A                                      EDTWRD('0 ,   ')
000901170103     A                                    +1
000902170103     A                                      '%'
000903170103     A*%%***********************************************************************
000904170103     A*%%SS
000905170103     A*%%***********************************************************************
000906170103     A          R TA49PTF3
000907170103     A*%%***********************************************************************
000908170103     A*%%RI 00000
000909170103     A*%%***********************************************************************
000910170103     A                                      SPACEB(001)
000911170103     A                                     1
000912170103     A                                      'Sul nostro sito Internet www.BRT.i-
000913170103     A                                      t sono visualizzabili: i "Prezzi me-
000914170103     A                                      di del gasolio", la tabella degli "-
000915170103     A                                      Incrementi/'
000916170103     A                                     1
000917170103     A                                      'decrementi del prezzo del gasolio"-
000918170103     A                                       e il Valore Minimo di Applicazione-
000919170103     A                                       (V.M.A.), che il committente dichi-
000920170103     A                                      ara di accettare.'
000921170103     A                                      SPACEB(001)
000922170103     A*%%***********************************************************************
000923170103     A*%%SS
000924170103     A*%%CL 001
000925170103     A*%%***********************************************************************
000926170103     A          R TA49PTF6
000927170103     A*%%***********************************************************************
000928170103     A*%%RI 00000
000929170103     A*%%***********************************************************************
000930170103     A                                      SPACEB(001)
000931170103     A                                     1
000932170103     A                                      'Sul nostro sito Internet www.BRT.i-
000933170103     A                                      t sono visualizzabili: i "Prezzi me-
000934170103     A                                      di del gasolio", la tabella degli "-
000935170103     A                                      Incrementi/'
000936170103     A                                     1
000937170103     A                                      'decrementi del prezzo del gasolio"-
000938170103     A                                      , che il committente dichiara di ac-
000939170103     A                                      cettare.'
000940170103     A                                      SPACEB(001)
000941170103     A*%%***********************************************************************
000942170103     A*%%SS
000943170103     A*%%CL 001
000944170103     A*%%***********************************************************************
000945170103     A          R TA49PGI
000946170103     A*%%***********************************************************************
000947170103     A*%%RI 00000
000948170103     A*%%FS 001
000949170103     A*%%***********************************************************************
000950170103     A                                      SPACEB(002)
000951170103     A                                     1
000952170103     A                                      'GIACENZE:'
000953170103     A                                      HIGHLIGHT
000954170103     A                                    +1
000955170103     A                                      'Spese di Dossier                  -
000956170103     A                                        :'
000957170103     A            COMSGD        11S 3O    +1
000958170103     A                                      EDTCDE(2)
000959170103     A  28                                +1
000960170103     A                                      'Spese varie'
000961170103     A  28        COMSGV        11S 3O    +2
000962170103     A                                      EDTCDE(2)
000963170103     A  28                                +1
000964170103     A                                      'a spedizione'
000965170103     A                                     1
000966170103     A                                      SPACEB(001)
000967170103     A                                      'Spese Riconsegna in Città a q.le i-
000968170103     A                                      ndivisibile :'
000969170103     A            COMSGR        11S 3O    +1
000970170103     A                                      EDTCDE(2)
000971170103     A                                    +1
000972170103     A                                      'in Provincia'
000973170103     A            COMSGP        11S 3O    +1
000974170103     A                                      EDTCDE(2)
000975170103     A                                    +1
000976170103     A                                      'a q.le indivisibile'
000977170103     A                                     1
000978170103     A                                      'Spese di sosta a q.le indivisibile-
000979170103     A                                                  :'
000980170103     A                                      SPACEB(001)
000981170103     A            COMST1        11S 3O    +1
000982170103     A                                      EDTCDE(2)
000983170103     A                                    +1
000984170103     A                                      'al giorno per i primi'
000985170103     A            COMSG1         3S 0O    +1
000986170103     A                                      EDTCDE(Z)
000987170103     A                                    +1
000988170103     A                                      'gg.;'
000989170103     A                                     1
000990170103     A                                      SPACEB(001)
000991170103     A                                      'per i successivi                  -
000992170103     A                                                  :'
000993170103     A            COMST2        11S 3O    +1
000994170103     A                                      EDTCDE(2)
000995170103     A                                    +1
000996170103     A                                      'al giorno, con un minimo di'
000997170103     A            COMSTM        11S 3O    +2
000998170103     A                                      EDTCDE(2)
000999170103     A                                     1
001000170103     A                                      SPACEB(001)
001001170103     A                                      'Giorni di rientro convenuti       -
001002170103     A                                                  :'
001003170103     A            COMGGR         2S 0O   +13
001004170103     A                                      EDTCDE(Z)
001005170103     A                                    +1
001006170103     A                                      'Volume per la tassazione pari a kg-
001007170103     A                                      .'
001008170103     A            COMGPV         4S 0O    +1
001009170103     A                                      EDTCDE(2)
001010170103     A                                    +1
001011170103     A                                      'a metro cubo'
001012170103     A*%%***********************************************************************
001013170103     A*%%SS
001014170103     A*%%CL 001
001015170103     A*%%CL 001
001016170103     A*%%CL 001
001017170103     A*%%CL 001
001018170103     A*%%***********************************************************************
001019170103     A          R TA49PGIF
001020170103     A*%%***********************************************************************
001021170103     A*%%RI 00000
001022170103     A*%%***********************************************************************
001023170103     A                                      SPACEB(001)
001024170103     A                                     1
001025170103     A                                      'Giorni Franchigia                 -
001026170103     A                                                  :'
001027170103     A            COMSGF         2S 0O   +13
001028170103     A                                      EDTCDE(Z)
001029170103     A                                    +1
001030170103     A                                      'Applicazione Franchigia :'
001031170103     A            COMAPF        54A  O    64
001032170103     A                                      SPACEB(001)
001033170103     A*%%***********************************************************************
001034170103     A*%%SS
001035170103     A*%%CL 001
001036170103     A*%%***********************************************************************
001037170103     A          R TA49PGI1
001038170103     A*%%***********************************************************************
001039170103     A*%%RI 00000
001040170103     A*%%***********************************************************************
001041170103     A                                      SPACEB(001)
001042170103     A                                     1
001043170103     A                                      'Dopo il'
001044170103     A            COMNAV         1S 0O    +1
001045170103     A                                    +0
001046170103     A                                      '° avviso, in caso di mancata risol-
001047170103     A                                      uzione positiva della giacenza, la -
001048170103     A                                      merce sarà ritornata al mittente a -
001049170103     A                                      suo'
001050170103     A            COMNAVD        4A  O    +1
001051170103     A                                     1
001052170103     A                                      'rischio e con addebito di ogni spe-
001053170103     A                                      sa'
001054170103     A                                      SPACEB(001)
001055170103     A*%%***********************************************************************
001056170103     A*%%SS
001057170103     A*%%CL 001
001058170103     A*%%***********************************************************************
001059170103     A          R TA49PCON
001060170103     A*%%***********************************************************************
001061170103     A*%%RI 00000
001062170103     A*%%FS 001
001063170103     A*%%***********************************************************************
001064170103     A                                      SPACEB(002)
001065170103     A                                     1
001066170103     A                                      'CONDIZIONI DI PAGAMENTO:'
001067170103     A                                      HIGHLIGHT
001068170103     A            DESCDP        28A  O    +1
001069170103     A  72                               +16
001070170103     A                                      'Spese invio fattura a domicilio:'
001071170103     A  72        VALSIN         5S 3O    +1
001072170103     A                                      EDTCDE(2)
001073170103     A*%%***********************************************************************
001074170103     A*%%SS
001075170103     A*%%***********************************************************************
001076170103     A          R TA49PCON1
001077170103     A*%%***********************************************************************
001078170103     A*%%RI 00000
001079170103     A*%%***********************************************************************
001080170103     A                                      SPACEB(001)
001081170103     A                                     1
001082170103     A                                      'Banca di appoggio:'
001083170103     A            PCABI          5S 0O    +7
001084170103     A                                      EDTCDE(Z)
001085170103     A            PCCAB          5S 0O    +1
001086170103     A                                      EDTCDE(Z)
001087170103     A            DESBNA        36A  O    +2
001088170103     A*%%***********************************************************************
001089170103     A*%%SS
001090170103     A*%%***********************************************************************
001091170103     A          R TA49PAM
001092170103     A*%%***********************************************************************
001093170103     A*%%RI 00000
001094170103     A*%%FS 001
001095170103     A*%%***********************************************************************
001096170103     A                                      SPACEB(002)
001097170103     A                                     1
001098170103     A                                      'ASSICURAZIONE MERCI'
001099170103     A                                      HIGHLIGHT
001100170103     A                                     1
001101170103     A                                      'La eventuale copertura assicurativ-
001102170103     A                                      a ALL RISK, con apposito mandato as-
001103170103     A                                      sicurativo AC PLUS o con valore mer-
001104170103     A                                      ci  '
001105170103     A                                      SPACEB(001)
001106170103     A                                     1
001107170103     A                                      'esposto nel D.d.t., prevede in ogn-
001108170103     A                                      i caso il limite risarcibile massim-
001109170103     A                                      o di Euro 100.000,00 per tutte le s-
001110170103     A                                      pedizioni'
001111170103     A                                      SPACEB(001)
001112170103     A                                     1
001113170103     A                                      'dirette ad ogni singolo destinatar-
001114170103     A                                      io nello stesso giorno.'
001115170103     A                                      SPACEB(001)
001116170103     A*%%***********************************************************************
001117170103     A*%%SS
001118170103     A*%%CL 001
001119170103     A*%%CL 001
001120170103     A*%%CL 001
001121170103     A*%%***********************************************************************
001122170103     A          R TA49PAM1
001123170103     A*%%***********************************************************************
001124170103     A*%%RI 00000
001125170103     A*%%***********************************************************************
001126170103     A                                      SPACEB(001)
001127170103     A                                     1
001128170103     A                                      'La eventuale copertura assicurativ-
001129170103     A                                      a ALL RISK, con apposito mandato as-
001130170103     A                                      sicurativo AC BASE, prevede in ogni'
001131170103     A                                     1
001132170103     A                                      'caso il limite risarcibile massimo-
001133170103     A                                       di Euro 6,20 al Kg.'
001134170103     A                                      SPACEB(001)
001135170103     A*%%***********************************************************************
001136170103     A*%%SS
001137170103     A*%%CL 001
001138170103     A*%%***********************************************************************
001139170103     A          R TA49PTE
001140170103     A*%%***********************************************************************
001141170103     A*%%RI 00000
001142170103     A*%%FS 001
001143170103     A*%%***********************************************************************
001144170103     A                                      SPACEB(002)
001145170103     A                                     1
001146170103     A                                      'NUMERO TELEFONICO DEL DESTINATARIO'
001147170103     A                                      HIGHLIGHT
001148170103     A                                     1
001149170103     A                                      'E'' obbligatorio indicare il numer-
001150170103     A                                      o di telefono del destinatario in t-
001151170103     A                                      utte le spedizioni dirette a client-
001152170103     A                                      i privati'
001153170103     A                                      SPACEB(001)
001154170103     A                                     1
001155170103     A                                      'e per le consegne su appuntamento.'
001156170103     A                                      SPACEB(001)
001157170103     A                                     1
001158170103     A                                      'Se il numero di telefono non è pre-
001159170103     A                                      sente, per le spedizioni dirette ai-
001160170103     A                                       clienti privati dopo il 2° lasciat-
001161170103     A                                      o avviso'
001162170103     A                                      SPACEB(001)
001163170103     A                                     1
001164170103     A                                      'non provvederemo a contattare il d-
001165170103     A                                      estinatario e per le consegne su ap-
001166170103     A                                      puntamento provvederemo ad effettua-
001167170103     A                                      re la'
001168170103     A                                      SPACEB(001)
001169170103     A                                     1
001170170103     A                                      'consegna alla data richiesta oppur-
001171170103     A                                      e secondo i termini di resa concord-
001172170103     A                                      ati senza preventiva telefonata.'
001173170103     A                                      SPACEB(001)
001174170103     A*%%***********************************************************************
001175170103     A*%%SS
001176170103     A*%%CL 001
001177170103     A*%%CL 001
001178170103     A*%%CL 001
001179170103     A*%%CL 001
001180170103     A*%%CL 001
001181170103     A*%%***********************************************************************
001182170103     A          R TA49PTEE
001183170103     A*%%***********************************************************************
001184170103     A*%%RI 00000
001185170103     A*%%FS 001
001186170103     A*%%***********************************************************************
001187170103     A                                      SPACEB(002)
001188170103     A                                     1
001189170103     A                                      'NUMERO TELEFONICO DEL DESTINATARIO'
001190170103     A                                      HIGHLIGHT
001191170103     A                                     1
001192170103     A                                      'E'' obbligatorio indicare il nomin-
001193170103     A                                      ativo ed il numero di telefono del -
001194170103     A                                      destinatario da contattare per l''i-
001195170103     A                                      ncasso'
001196170103     A                                      SPACEB(001)
001197170103     A                                     1
001198170103     A                                      'del contrassegno e del porto asseg-
001199170103     A                                      nato. Diversamente la spedizione po-
001200170103     A                                      trebbe subire ritardi di consegna.'
001201170103     A                                      SPACEB(001)
001202170103     A*%%***********************************************************************
001203170103     A*%%SS
001204170103     A*%%CL 001
001205170103     A*%%CL 001
001206170103     A*%%***********************************************************************
001207170103     A          R TA49PEE
001208170103     A*%%***********************************************************************
001209170103     A*%%RI 00000
001210170103     A*%%FS 001
001211170103     A*%%***********************************************************************
001212170103     A                                      SPACEB(002)
001213170103     A                                     1
001214170103     A                                      'SPEDIZIONI EXPORT IN ASSEGNATO'
001215170103     A                                      HIGHLIGHT
001216170103     A                                     1
001217170103     A                                      'Per eventuali porti assegnati expo-
001218170103     A                                      rt non pagati dal destinatario, sar-
001219170103     A                                      à prevista l''inversione di porto'
001220170103     A                                      SPACEB(001)
001221170103     A                                     1
001222170103     A                                      'con addebito in fattura al mittent-
001223170103     A                                      e.'
001224170103     A                                      SPACEB(001)
001225170103     A*%%***********************************************************************
001226170103     A*%%SS
001227170103     A*%%CL 001
001228170103     A*%%CL 001
001229170103     A*%%***********************************************************************
001230170103     A          R TA49PEE1
001231170103     A*%%***********************************************************************
001232170103     A*%%RI 00000
001233170103     A*%%FS 001
001234170103     A*%%***********************************************************************
001235170103     A                                      SPACEB(002)
001236170103     A                                     1
001237170103     A                                      'CONTRASSEGNI EXPORT'
001238170103     A                                      HIGHLIGHT
001239170103     A                                     1
001240170103     A                                      'Si accettano solo titoli (assegni -
001241170103     A                                      di c/c intestati al mittente) per i-
001242170103     A                                       quali è esclusa ogni responsabilit-
001243170103     A                                      à.'
001244170103     A                                      SPACEB(001)
001245170103     A                                     1
001246170103     A                                      'Non si accettano importi superiori-
001247170103     A                                       a Euro'
001248170103     A                                      SPACEB(001)
001249170103     A            STALCA        13S 3O    +1
001250170103     A                                      EDTCDE(4)
001251170103     A                                    +0
001252170103     A                                      '. Il servizio contrassegni è dispo-
001253170103     A                                      nibile nelle nazioni:'
001254170103     A                                     1
001255170103     A                                      'Austria, Benelux, Francia (inclusa-
001256170103     A                                       la Corsica), Germania, Spagna (inc-
001257170103     A                                      luse le isole Baleari), Portogallo -
001258170103     A                                      (incluse'
001259170103     A                                      SPACEB(001)
001260170103     A                                     1
001261170103     A                                      'le isole Azzorre e Madera), Princi-
001262170103     A                                      pato di Monaco e Svizzera.'
001263170103     A                                      SPACEB(001)
001264170103     A                                     1
001265170103     A                                      'Non è disponibile in: Irlanda (Eir-
001266170103     A                                      e + Ulster), Gran Bretagna, Polonia-
001267170103     A                                      , Repubblica Ceca, Repubblica Slova-
001268170103     A                                      cca, Slovenia,'
001269170103     A                                      SPACEB(001)
001270170103     A                                     1
001271170103     A                                      'Ungheria, Ceuta/Melilla, Isole Can-
001272170103     A                                      arie, Andorra, Gibilterra, Finlandi-
001273170103     A                                      a, Estonia, Lettonia, Lituania e No-
001274170103     A                                      rvegia.'
001275170103     A                                      SPACEB(001)
001276170103     A*%%***********************************************************************
001277170103     A*%%SS
001278170103     A*%%CL 001
001279170103     A*%%CL 001
001280170103     A*%%CL 001
001281170103     A*%%CL 001
001282170103     A*%%CL 001
001283170103     A*%%CL 001
001284170103     A*%%***********************************************************************
001285170103     A          R TA49PEMA
001286170103     A*%%***********************************************************************
001287170103     A*%%RI 00000
001288170103     A*%%FS 001
001289170103     A*%%***********************************************************************
001290170103     A                                      SPACEB(002)
001291170103     A                                     1
001292170103     A                                      'SERVIZI ON LINE E COMUNICAZIONI VI-
001293170103     A                                      A E-MAIL'
001294170103     A                                      HIGHLIGHT
001295170103     A*%%***********************************************************************
001296170103     A*%%SS
001297170103     A*%%***********************************************************************
001298170103     A          R TA49PEMA1
001299170103     A*%%***********************************************************************
001300170103     A*%%RI 00000
001301170103     A*%%***********************************************************************
001302170103     A                                      SPACEB(001)
001303170103     A                                     1
001304170103     A                                      'Per usufruire dei nostri "Servizi -
001305170103     A                                      ON LINE" (Richiesta Ritiro-Rintracc-
001306170103     A                                      ia la spedizione-Gestione Giacenze--
001307170103     A                                      POD Image)'
001308170103      *----
001309170103     A                                     1
001310170103     A                                      SPACEB(001)
001311170103     A                                      'vi invitiamo a comunicarci l''indi-
001312170103     A                                      rizzo e-mail della persona a cui in-
001313170103     A                                      viare la password e che sarà garant-
001314170103     A                                      e del'
001315170103      *----
001316170103     A                                     1
001317170103     A                                      SPACEB(001)
001318170103     A                                      'corretto utilizzo:'
001319170103      *----
001320170103     A                                     1
001321170103     A                                      SPACEB(001)
001322170103     A                                      'Nominativo'
001323170103     A                                      HIGHLIGHT
001324170103     A                                    +1
001325170103     A                                      '__________________________________-
001326170103     A                                      _______________'
001327170103     A                                    +2
001328170103     A                                      'E-Mail'
001329170103     A                                      HIGHLIGHT
001330170103     A                                    +1
001331170103     A                                      '__________________________________-
001332170103     A                                      ________________'
001333170103     A*%%***********************************************************************
001334170103     A*%%SS
001335170103     A*%%CL 001
001336170103     A*%%CL 001
001337170103     A*%%CL 001
001338170103     A*%%***********************************************************************
001339170103     A          R TA49PEMA2
001340170103     A*%%***********************************************************************
001341170103     A*%%RI 00000
001342170103     A*%%***********************************************************************
001343170103     A                                      SPACEB(001)
001344170103     A                                     1
001345170103     A                                      'Se desiderate ricevere le seguenti-
001346170103     A                                       documentazioni via e-mail Vi pregh-
001347170103     A                                      iamo di indicarci i relativi indiri-
001348170103     A                                      zzi:'
001349170103     A*%%***********************************************************************
001350170103     A*%%SS
001351170103     A*%%***********************************************************************
001352170103     A          R TA49PEMA3
001353170103     A*%%***********************************************************************
001354170103     A*%%RI 00000
001355170103     A*%%***********************************************************************
001356170103     A                                      SPACEB(001)
001357170103     A                                     1
001358170103     A                                      'Invio dettaglio del bonifico banca-
001359170103     A                                      rio per la rimessa c/assegni: E-Mai-
001360170103     A                                      l _________________________________-
001361170103     A                                      _______________'
001362170103     A*%%***********************************************************************
001363170103     A*%%SS
001364170103     A*%%***********************************************************************
001365170103     A          R TA49PEMA4
001366170103     A*%%***********************************************************************
001367170103     A*%%RI 00000
001368170103     A*%%***********************************************************************
001369170103     A                                      SPACEB(001)
001370170103     A                                     1
001371170103     A                                      'Invio comunicazione avviso giacenz-
001372170103     A                                      a: E-Mail _________________________-
001373170103     A                                      ___________________________________-
001374170103     A                                      _______________'
001375170103     A*%%***********************************************************************
001376170103     A*%%SS
001377170103     A*%%***********************************************************************
001378170103     A          R TA49PEMA5
001379170103     A*%%***********************************************************************
001380170103     A*%%RI 00000
001381170103     A*%%***********************************************************************
001382170103     A                                      SPACEB(001)
001383170103     A                                     1
001384170103     A                                      'Invio comunicazione avviso di dann-
001385170103     A                                      o: E-Mail _________________________-
001386170103     A                                      ___________________________________-
001387170103     A                                      _______________'
001388170103     A*%%***********************************************************************
001389170103     A*%%SS
001390170103     A*%%***********************************************************************
001391170103     A          R TA49PEMA7
001392170103     A*%%***********************************************************************
001393170103     A*%%RI 00000
001394170103     A*%%***********************************************************************
001395170103     A                                      SPACEB(001)
001396170103     A                                     1
001397170103     A                                      'Invio fattura in formato pdf: E-Ma-
001398170103     A                                      il ________________________________-
001399170103     A                                      ___________________________________-
001400170103     A                                      _______________'
001401170103     A*%%***********************************************************************
001402170103     A*%%SS
001403170103     A*%%***********************************************************************
001404170103     A          R TA49PEMA8
001405170103     A*%%***********************************************************************
001406170103     A*%%RI 00000
001407170103     A*%%***********************************************************************
001408170103     A                                      SPACEB(001)
001409170103     A                                     1
001410170103     A                                      'Invio comunicazioni amministrative-
001411170103     A                                      : E-Mail __________________________-
001412170103     A                                      ___________________________________-
001413170103     A                                      _______________'
001414170103     A*%%***********************************************************************
001415170103     A*%%SS
001416170103     A*%%***********************************************************************
001417170103     A          R TA49PEMA6
001418170103     A*%%***********************************************************************
001419170103     A*%%RI 00000
001420170103     A*%%***********************************************************************
001421170103     A                                      SPACEB(001)
001422170103     A                                     1
001423170103     A                                      'CONSENSO AL TRATTAMENTO DEI DATI P-
001424170103     A                                      ERSONALI'
001425170103      *---
001426170103     A                                     1
001427170103     A                                      SPACEB(001)
001428170103     A                                      'I dati sopra indicati saranno util-
001429170103     A                                      izzati al fine di fornire l''access-
001430170103     A                                      o ai Servizi ON LINE nonchè per l''-
001431170103     A                                      invio di'
001432170103      *---
001433170103     A                                     1
001434170103     A                                      SPACEB(001)
001435170103     A                                      'comunicazioni anche commerciali, v-
001436170103     A                                      ia fax o e-mail.'
001437170103      *---
001438170103     A                                     1
001439170103     A                                      SPACEB(001)
001440170103     A                                      'In qualsiasi momento potranno esse-
001441170103     A                                      re esercitati i diritti sanciti dal-
001442170103     A                                      l''articolo 7 del D.Lgs 196/2003.'
001443170103     A*%%***********************************************************************
001444170103     A*%%SS
001445170103     A*%%CL 001
001446170103     A*%%CL 001
001447170103     A*%%CL 001
001448170103     A*%%***********************************************************************
001449170103     A          R TA49PE1
001450170103     A*%%***********************************************************************
001451170103     A*%%RI 00000
001452170103     A*%%FS 001
001453170103     A*%%***********************************************************************
001454170103     A                                      SPACEB(002)
001455170103     A                                     1
001456170103     A                                      'LE CONDIZIONI GENERALI MOD.'
001457170103     A                                      HIGHLIGHT
001458170103     A            STPMOD         3S 0O    +1
001459170103     A                                      EDTCDE(Z)
001460170103     A                                      HIGHLIGHT
001461170103     A                                    +1
001462170103     A                                      '/'
001463170103     A                                      HIGHLIGHT
001464170103     A            STPANNO        4S 0O    +1
001465170103     A                                      HIGHLIGHT
001466170103     A                                    +1
001467170103     A                                      'E L''INFORMATIVA PRIVACY MOD.'
001468170103     A                                      HIGHLIGHT
001469170103     A            STPMODI        3S 0O    +1
001470170103     A                                      HIGHLIGHT
001471170103     A                                      EDTWRD('0  ')
001472170103     A                                    +1
001473170103     A                                      '/'
001474170103     A                                      HIGHLIGHT
001475170103     A            STPANNOI       4S 0O    +1
001476170103     A                                      HIGHLIGHT
001477170103     A                                    +1
001478170103     A                                      'RESA AI SENSI E PER GLI EFFETTI'
001479170103     A                                      HIGHLIGHT
001480170103     A                                     1
001481170103     A                                      'DELL''ART.13 DEL D.LGS.196/2003 AL-
001482170103     A                                      LEGATE, DI CUI IL COMMITTENTE DA'' -
001483170103     A                                      CONFERMA DI RICEZIONE E PRESA VISIO-
001484170103     A                                      NE, SONO'
001485170103     A                                      HIGHLIGHT
001486170103     A                                      SPACEB(001)
001487170103     A                                     1
001488170103     A                                      'A TUTTI GLI EFFETTI PARTE INTEGRAN-
001489170103     A                                      TE DEL PRESENTE  CONTRATTO TARIFFAR-
001490170103     A                                      IO DA SOTTOSCRIVERE DALLE PARTI. EN-
001491170103     A                                      TRAMBI'
001492170103     A                                      HIGHLIGHT
001493170103     A                                      SPACEB(001)
001494170103     A                                     1
001495170103     A                                      'I DOCUMENTI SONO ANCHE DISPONIBILI-
001496170103     A                                       NEL SITO WWW.BRT.IT '
001497170103     A                                      HIGHLIGHT
001498170103     A                                      SPACEB(001)
001499170103     A*%%***********************************************************************
001500170103     A*%%SS
001501170103     A*%%CL 001
001502170103     A*%%CL 001
001503170103     A*%%CL 001
001504170103     A*%%***********************************************************************
001505170103     A          R TA49PFI
001506170103     A*%%***********************************************************************
001507170103     A*%%RI 00000
001508170103     A*%%FS 001
001509170103     A*%%***********************************************************************
001510170103     A                                      SPACEB(002)
001511170103     A                                     1
001512170103     A                                      'Il Corriere'
001513170103     A            RSUTOLD       20A  O    +3
001514170103     A                                   +30
001515170103     A                                      'Il Committente'
001516170103     A                                    +1
001517170103     A                                      '__________________________________-
001518170103     A                                      _____'
001519170103     A                                    65
001520170103     A                                      'timbro e firma'
001521170103     A                                      SPACEB(001)
001522170103     A*%%***********************************************************************
001523170103     A*%%SS
001524170103     A*%%CL 001
001525170103     A*%%***********************************************************************
001526170103     A          R TA49PE2
001527170103     A*%%***********************************************************************
001528170103     A*%%RI 00000
001529170103     A*%%FS 001
001530170103     A*%%***********************************************************************
001531170103     A                                      SPACEB(002)
001532170103     A                                     1
001533170103     A                                      'CONDIZIONI DA APPROVARSI SPECIFICA-
001534170103     A                                      TAMENTE: Ai sensi e per gli effetti-
001535170103     A                                       di cui agli artt. 1341 e 1342 c.c.-
001536170103     A                                      , si dichiara di'
001537170103     A*%%***********************************************************************
001538170103     A*%%SS
001539170103     A*%%***********************************************************************
001540170103     A          R TA49PE2B
001541170103     A*%%***********************************************************************
001542170103     A*%%RI 00000
001543170103     A*%%***********************************************************************
001544170103     A                                      SPACEB(001)
001545170103     A                                     1
001546170103     A                                      'aver preso visione, di avere atten-
001547170103     A                                      tamente esaminato e di approvare sp-
001548170103     A                                      ecificatamente, le seguenti clausol-
001549170103     A                                      e delle Condizioni'
001550170103     A*%%***********************************************************************
001551170103     A*%%SS
001552170103     A*%%***********************************************************************
001553170103     A          R TA49PE2C
001554170103     A*%%***********************************************************************
001555170103     A*%%RI 00000
001556170103     A*%%***********************************************************************
001557170103     A                                      SPACEB(001)
001558170103     A                                     1
001559170103     A                                      'generali e Particolari:  1 (Condiz-
001560170103     A                                      ioni Generali);  3 (Condizioni di p-
001561170103     A                                      agamento - compensazione);  4 (Resp-
001562170103     A                                      onsabilità del'
001563170103     A*%%***********************************************************************
001564170103     A*%%SS
001565170103     A*%%***********************************************************************
001566170103     A          R TA49PE2D
001567170103     A*%%***********************************************************************
001568170103     A*%%RI 00000
001569170103     A*%%***********************************************************************
001570170103     A                                      SPACEB(001)
001571170103     A                                     1
001572170103     A                                      'vettore); 5 (Assicurazione merci);-
001573170103     A                                       6 (Presunzione di fortuito); 7 (Te-
001574170103     A                                      rmini di resa); 8 (Giacenza); 9 (Va-
001575170103     A                                      lidità della'
001576170103     A*%%***********************************************************************
001577170103     A*%%SS
001578170103     A*%%***********************************************************************
001579170103     A          R TA49PE2E
001580170103     A*%%***********************************************************************
001581170103     A*%%RI 00000
001582170103     A*%%***********************************************************************
001583170103     A                                      SPACEB(001)
001584170103     A                                     1
001585170103     A                                      'offerta - Clausola risolutiva espr-
001586170103     A                                      essa); 10 (Merci pericolose); 11 (C-
001587170103     A                                      ontrassegno); 12 C (Merci non accet-
001588170103     A                                      tabili dalla'
001589170103     A*%%***********************************************************************
001590170103     A*%%SS
001591170103     A*%%***********************************************************************
001592170103     A          R TA49PE2F
001593170103     A*%%***********************************************************************
001594170103     A*%%RI 00000
001595170103     A*%%***********************************************************************
001596170103     A                                      SPACEB(001)
001597170103     A                                     1
001598170103     A                                      'Organizzazione del vettore); 16 (D-
001599170103     A                                      ocumenti di trasporto); 17 (Diritto-
001600170103     A                                       di ritenzione); 19 (Fori competent-
001601170103     A                                      i); 24 (Legge'
001602170103     A*%%***********************************************************************
001603170103     A*%%SS
001604170103     A*%%***********************************************************************
001605170103     A          R TA49PE2G
001606170103     A*%%***********************************************************************
001607170103     A*%%RI 00000
001608170103     A*%%***********************************************************************
001609170103     A                                      SPACEB(001)
001610170103     A                                     1
001611170103     A                                      'applicabile); 26 (Trasporto di spe-
001612170103     A                                      dizioni soggette alla legge 136/201-
001613170103     A                                      0).'
001614170103     A*%%***********************************************************************
001615170103     A*%%SS
001616170103     A*%%***********************************************************************
001617170103     A          R TA49PFIN
001618170103     A*%%***********************************************************************
001619170103     A*%%RI 00000
001620170103     A*%%FS 063
001621170103     A*%%***********************************************************************
001622170103     A                                      SKIPB(064)
001623170103     A                                    53
001624170103     A                                      'SEGUE A PAGINA'
001625170103     A            PAGE           4S 0O    +1
001626170103     A                                      EDTCDE(Z)
001627170103     A*%%***********************************************************************
001628170103     A*%%SS
001629170103     A*%%***********************************************************************
001630170103     A          R TA49PFINE
001631170103     A*%%***********************************************************************
001632170103     A*%%RI 00000
001633170103     A*%%FS 063
001634170103     A*%%***********************************************************************
001635170103     A                                      SKIPB(064)
001636170103     A                                    53
001637170103     A                                      'PAGINA'
001638170103     A            PAGE           4S 0O    +1
001639170103     A                                      EDTCDE(Z)
001640170103     A*%%***********************************************************************
001641170103     A*%%SS
001642170103     A*%%***********************************************************************
001643170103     A          R TA49PERR
001644170103     A*%%***********************************************************************
001645170103     A*%%RI 00000
001646170103     A*%%FS 001
001647170103     A*%%***********************************************************************
001648170103     A                                      SPACEB(002)
001649170103     A                                     1
001650170103     A                                      '====>  TARIFFA/OFFERTA NON STAMPAB-
001651170103     A                                      ILE IN MODO CORRETTO  <===='
001652170103     A            ERRMSG        78A        1
001653170103     A                                      SPACEB(001)
001654170103     A*%%***********************************************************************
001655170103     A*%%SS
001656170103     A*%%CL 001
001657170103     A*%%CP+999CRTPRTF
001658170103     A*%%CP+    FILE(GAITRAFIL/TNTA49P)
001659170103     A*%%CP+    DEVTYPE(*SCS)
001660170103     A*%%CP+    PAGESIZE(*N 124)
001661170103     A*%%CP+    CPI(16,7)
001662170103     A*%%CP     OVRFLW(65)
001663170103     A*%%CS+999CRTPRTF
001664170103     A*%%CS+    FILE(QTEMP/QPRDRPT)
001665170103     A*%%CS+    DEVTYPE(*SCS)
001666170103     A*%%CS     PAGESIZE(*N 132)
001667170103     A*%%***********************************************************************
