000100041116      *--------------------------------------------------------------*
000200041116      *                                                              *
000300041116      *      DS PER PASSAGGIO PARAMETRI                              *
000400041116      *                                                              *
000500041116      *--------------------------------------------------------------*
000600041116      *
000700041116     A                                      REF(CNDIZION)
000800051201     A          R TA12REC                   TEXT('DS PER PASS.PAR.')
000900041116      *
001000050705      * C A M P I   I N   I N P U T
001100051201     A            TA12RIC        1          TEXT('TIPO RICHIAMO')
001200090915     A            TA12APL        1          TEXT('TIPO APPLICAZIONE C/P/V/T')
001300051201     A            TA12KSC        7S 0       TEXT('CODICE CLIENTE')
001400051201     A            TA12POT       11S 0       TEXT('CODICE POTENZIALE')
001500051201     A            TA12NRV        7S 0       TEXT('NR.VISITA')
001600060217     A            TA12RAG       35          TEXT('RAGIONE SOCIALE')
001700051201     A            TA12TNT        2          TEXT('TIPO NOTA')
001800051206     A            TA12NOTE       1          TEXT('RICHIAMATO DA GESTIONE NOTE')
001900060216     A            TA12GCLI       1          TEXT('RICHIAMATO DA ANAGR.CLI')
002000060216     A            TA12ICLI       1          TEXT('RICHIAMATO DA IMM.ANAGR.CLI')
002100060306     A            TA12CMM        7S 0       TEXT('CODICE COMMERCIALE')
002200041118      *
002300050705      * C A M P I   I N   O U T P U T:
002400051201     A            TA12F03        1          TEXT('1=PREMUTO F3')
002500051201     A            TA12ERR        1          TEXT('1=ERRORE')
002600060215     A            TA12MSG       78          TEXT('MESSAGGIO DI ERRORE')
