000100100409             PGM        PARM(&KPJBA)
000200091218
000300091218             DCL        VAR(&KPJBA) TYPE(*CHAR) LEN(502)
000400091218
000500091218/* Richiamo programma */
000600120315             CALL       PGM(TNTA01R) PARM(&KPJBA)
000700091218
000800091218             ENDPGM
