000010090715     A*%%TS  SD  20090715  141604  EDPMB       REL-V5R4M0  5722-WDS
000020090715     A*%%EC
000030090715     A                                      DSPSIZ(24 80 *DS3)
000040090715     A                                      CHGINPDFT(HI UL)
000050090715     A                                      PRINT
000060041221     A*---------------------------------------------------------------*
000070090715     A          R TA8101D
000080090715     A*%%TS  SD  20090715  141604  EDPMB       REL-V5R4M0  5722-WDS
000090090715     A                                      CA03
000100090715     A  01
000110090715     AO 02
000120090715     AO 03                                  CF06
000130090715     A  14                                  CF07
000140090715     A                                      CF12
000150090715     A  02                                  CF16
000160090715     A                                      CF18
000170090715     A                                      CF02
000180090715     A  28        V1CMSG        78   M
000190090715     A            RSUT          20A  O  1  2
000200090715     A            VTCTIT        34A  O  1 25DSPATR(RI)
000210090715     A                                      DSPATR(UL)
000220090715     A            VTCPGM        10A  O  1 61
000230090715     A                                  1 72DATE
000240090715     A                                      EDTCDE(Y)
000250090715     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000260090715     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000270090715     A            V1MOD         15A  O  2 33DSPATR(HI)
000280090715     A                                      DSPATR(UL)
000290090715     A                                  2 72TIME
000300090715     A                                  5  3'Codice Luogo .........?..:'
000310090715     A            V1CCOD         3A  B  5 32CHECK(RZ)
000320090715     A  05
000330090715     AO 02
000340090715     AO 06                                  DSPATR(PR)
000350090715     A  40                                  DSPATR(PC)
000360090715     A            V1DCOD        30A  O  5 40TEXT('decodif. codice luogo')
000370090715     A                                  6  3'Codice Cliente ..........:'
000380090715     A            V1CCLI         7Y 0B  6 32CHECK(RZ)
000390090715     A                                      EDTWRD('      0')
000400090715     A  05
000410090715     AO 02
000420090715     AO 07                                  DSPATR(PR)
000430090715     A  41                                  DSPATR(PC)
000440090715     A            V1DCLI        35A  O  6 40
000450090715     A            V1CIND1       35A  O  7  6
000460090715     A                                  7 42'Fax'
000470090715     A            V1CFAX1       16A  O  7 46
000480090715     A            V1CCAP1        9A  O  8  6
000490090715     A            V1CLOC1       35A  O  8 16
000500090715     A            V1CPRO1        2A  O  8 52
000510090715     A            V1CNAZ1        3A  O  8 55
000520090715     A                                 10  3'Ragione Sociale .........:'
000530090715     A            V1CRAG        35A  B 10 32
000540090715     A  05                                  DSPATR(PR)
000550090715     A  42                                  DSPATR(PC)
000560090715     A                                 11  3'Indirizzo ...............:'
000570090715     A            V1CIND        35A  B 11 32
000580090715     A  05                                  DSPATR(PR)
000590090715     A  43                                  DSPATR(PC)
000600090715     A                                 12  3'C.A.P. ..................:'
000610090715     A            V1CCAP         9A  B 12 32
000620090715     A  05                                  DSPATR(PR)
000630090715     A  44                                  DSPATR(PC)
000640090715     A                                 13  3'Località..............? .:'
000650090715     A            V1CLOC        35A  B 13 32
000660090715     A  05                                  DSPATR(PR)
000670090715     A  45                                  DSPATR(PC)
000680090715     A                                 14  3'Sigla Provincia .........:'
000690090715     A            V1CPRO         2A  B 14 32
000700090715     A  05                                  DSPATR(PR)
000710090715     A  46                                  DSPATR(PC)
000720090715     A                                 15  3'Sigla Nazione ........? .:'
000730090715     A            V1CNAZ         3A  B 15 32
000740090715     A  05                                  DSPATR(PR)
000750090715     A  47                                  DSPATR(PC)
000760090715     A                                 16  3'Numero Telefono .........:'
000770090715     A            V1CTEL        16A  B 16 32
000780090715     A  05                                  DSPATR(PR)
000790090715     A  48                                  DSPATR(PC)
000800090715     A                                 17  3'Numero Fax...............:'
000810090715     A            V1CFAX        16A  B 17 32
000820090715     A  05                                  DSPATR(PR)
000830090715     A  49                                  DSPATR(PC)
000840090715     A                                 18  3'Rivolgersi a ............:'
000850090715     A            V1CPER        35A  B 18 32
000860090715     A  05                                  DSPATR(PR)
000870090715     A                                 19  3'Partita IVA .............:'
000880090715     A            V1IVAIT   R   -2   B 19 32REFFLD(FNSPE000/SPEPIV *LIBL/FNSPE0-
000890090715     A                                      0F)
000900090715     A  05                                  DSPATR(PR)
000910090715     A  50                                  DSPATR(PC)
000920090715     A            V1IVAEU   R  -14   B 19 47REFFLD(FNSPE000/SPEPIV *LIBL/FNSPE0-
000930090715     A                                      0F)
000940090715     A  05                                  DSPATR(PR)
000950090715     A  39                                  DSPATR(BL)
000960090715     A                                 20  3'Ind.e-mail....:'
000970090715     A            V1CMAIL       60A  B 20 20CHECK(LC)
000980090715     A                                      CHECK(FE)
000990090715     A  05
001000090715     AO 15                                  DSPATR(PR)
001010090715     A  51                                  DSPATR(PC)
001020090715     A                                 24  2'F3=Fine'
001030090715     A  01
001040090715     AO 02
001050090715     AO 03                             24 15'F6=Conferma'
001060090715     A  02                             24 32'F16=Annulla'
001070090715     A                                 24 69'F12=Ritorno'
001080090715     A                                 24 47'F18=Note'
001090090715     A  14                             23  2'F7=Personalizza per Filiale arrivo-
001100090715     A                                       forzata'
001110090715     A  13                                  DSPATR(HI)
001120090715     A                                 24 56'F2=Rubrica'
001130041117     A*---------------------------------------------------------------*
001140041117     A          R TA8102W
001150041117     A*%%TS  SD  20041117  121744  EDPMB       REL-V4R4M0  5769-PW1
001160041117     A                                      WINDOW(10 20 8 40)
001170041117     A                                      OVERLAY
001180041117     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
001190041117     A                                          '))
001200041117     A                                  2  2'Luogo..:'
001210041117     A            V2CCOD         3A  O  2 11
001220041117     A            V2DCOD        25A  O  2 15
001230041117     A                                  3  2'Cliente:'
001240041117     A            V2CCLI         7S 0O  3 11
001250041117     A                                  5  9'In uso ad un altro utente'
001260041117     A                                      DSPATR(HI)
001270041117     A                                  7 11'ENTER PER CONTINUARE'
001280041117     A                                      DSPATR(HI)
001290041117     A                                      DSPATR(UL)
001300041221     A*---------------------------------------------------------------*
001310070316     A          R TA8103S                   SFL
001320070316     A*%%TS  SD  20070316  144423  EDPMB       REL-V5R3M0  5722-WDS
001330070316     A            V3SCPP         3Y 0B  4  2CHECK(RZ)
001340070316     A  52                                  DSPATR(PC)
001350070316     A  05
001360070316     AON10                                  DSPATR(PR)
001370070316     A                                      EDTCDE(4)
001380070316     A            V3SDPP        12A  O  4  6
001390070316     A            V3SCPA         3Y 0B  4 19CHECK(RZ)
001400070316     A  53                                  DSPATR(PC)
001410070316     A  05
001420070316     AON10                                  DSPATR(PR)
001430070316     A                                      EDTCDE(4)
001440070316     A            V3SDPA        12A  O  4 23
001450070316     A            V3SCPZ         2Y 0B  4 36CHECK(RZ)
001460070316     A  54                                  DSPATR(PC)
001470070316     A  05
001480070316     AON10                                  DSPATR(PR)
001490070316     A                                      EDTCDE(4)
001500070316     A            V3SCGI        10A  B  4 39
001510070316     A  55                                  DSPATR(PC)
001520070316     A  05
001530070316     AON10                                  DSPATR(PR)
001540070316     A            V3SDCGI       30A  O  4 50
001550041221     A*---------------------------------------------------------------*
001560070316     A          R TA8103C                   SFLCTL(TA8103S)
001570070316     A*%%TS  SD  20070316  095149  EDPMB       REL-V5R3M0  5722-WDS
001580070316     A                                      SFLSIZ(0021)
001590070316     A                                      SFLPAG(0020)
001600070316     A                                      CF12
001610070316     A                                      OVERLAY
001620070316     A  20                                  SFLDSP
001630070316     A  21                                  SFLDSPCTL
001640070316     A N21                                  SFLCLR
001650070316     A  20                                  SFLEND
001660070316     A            REC            4S 0H      SFLRCDNBR
001670070316     A  28        V1CMSG        78   M
001680070316     A            RSUT          20A  O  1  2
001690070316     A            VTCTIT        34A  O  1 25DSPATR(RI)
001700070316     A                                      DSPATR(UL)
001710070316     A            VTCPGM        10A  O  1 61
001720070316     A                                  1 72DATE
001730070316     A                                      EDTCDE(Y)
001740070316     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
001750070316     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
001760070316     A            V1MOD         15A  O  2 33DSPATR(HI)
001770070316     A                                      DSPATR(UL)
001780070316     A                                  2 72TIME
001790070316     A                                  3  2'Fil.Partenza     Fil.Arr.Forzata  -
001800070316     A                                      Zn Giro Consegna                   -
001810070316     A                                               '
001820070316     A                                      DSPATR(UL)
001830041221     A*---------------------------------------------------------------*
001840041221     A          R TA8103Z
001850041221     A*%%TS  SD  20041221  125219  EDPMB       REL-V4R4M0  5769-PW1
001860041221     A                                      OVERLAY
001870041221     A                                 24 69'F12=Ritorno'
001880041221     A                                 24  2'Enter=Conferma dati'
