000100120227     A*%%TS  SD  20120227  101128  EDPMB       REL-V6R1M0  5761-WDS
000200120227     A*%%EC
000300120227     A                                      DSPSIZ(24 80 *DS3)
000400120227     A                                      CHGINPDFT(HI UL)
000500120227     A                                      PRINT
000600120227     A                                      INDARA
000700000000     A*-------------------------------------------------------*
000800060405     A          R TA61T01
000900060405     A*%%TS  SD  20060405  143227  EDPMB       REL-V5R3M0  5722-WDS
001000060405     A            RSUT          20A  O  1  2
001100110616     A            VT1TIT        24A  O  1 29DSPATR(RI)
001200060405     A                                      DSPATR(UL)
001300110616     A            VT1PGM        10A  O  1 62
001400060405     A                                  1 73DATE
001500060405     A                                      EDTCDE(Y)
001600060405     A            KNSIF         10A  O  2  2
001700060405     A            KNMUS         10A  O  2 13
001800060405     A                                  2 73TIME
001900060124     A*---------------------------------------------------------------*
002000120227     A          R TA61D01
002100120227     A*%%TS  SD  20120227  101128  EDPMB       REL-V6R1M0  5761-WDS
002200120227     A  03                                  CF03
002300120227     A                                      OVERLAY
002400120227     A  28        V1CMSG        78   M
002500120227     A                                 11 10'Cliente ?:'
002600120227     A            V01KSC         7A  B 11 21
002700120227     A  51                                  DSPATR(PC)
002800120227     A                                      CHECK(RZ)
002900120227     A            V1DKSC        35A  O 11 29
003000120227     A  03                             24  2'F3=Fine'
003100120227     A                                      COLOR(BLU)
003200060118     A*--------------------------------------------------------------**
003300110810     A          R TA61S01                   SFL
003400110810     A*%%TS  SD  20110810  133647  EDPMB       REL-V6R1M0  5761-WDS
003500110810     A  32                                  SFLNXTCHG
003600110810     A            V1HKEY        15A  H
003700110810     A            V1HPGM        10A  H
003800110810     A            V1HIPERS       1A  H
003900110810     A            V1HIN40        1A  H
004000110810     A            V1HPART        2A  H
004100110810     A            V1SOPZ         1A  B  7  3
004200110810     A  50                                  DSPATR(PC)
004300110810     A  50                                  COLOR(RED)
004400110810     A  40                                  DSPATR(PR)
004500110810     A N40                                  DSPATR(UL)
004600110810     A N40                                  DSPATR(HI)
004700110810     A            V1SDES        54A  O  7  5DSPATR(HI)
004800110810     A            V1SAUT        20A  O  7 60
004900060118     A*--------------------------------------------------------------**
005000111027     A          R TA61C01                   SFLCTL(TA61S01)
005100111027     A*%%TS  SD  20111027  140702  EDPMB       REL-V6R1M0  5761-WDS
005200111027     A                                      ROLLUP
005300111027     A  03                                  CF03
005400111027     A  12                                  CF12
005500111027     A                                      CF08
005600111027     A                                      OVERLAY
005700111027     A N30                                  SFLDSP
005800111027     A N31                                  SFLDSPCTL
005900111027     A  30 31                               SFLCLR
006000111027     A  33                                  SFLEND(*MORE)
006100111027     A                                      SFLSIZ(9999)
006200111027     A                                      SFLPAG(0016)
006300111027     A            V1CRCD         4S 0H      SFLRCDNBR(CURSOR)
006400111027     A            V1CCSR         5S 0H
006500111027     A  28        V1CMSG        78   M
006600111027     A                                  4  3'Cliente:'
006700111027     A            V1CKSC         7Y 0O  4 12EDTCDE(Z)
006800111027     A                                      DSPATR(HI)
006900111027     A            V1DKSC        35A  O  4 20DSPATR(HI)
007000111027     A                                  6  3'O Abilitazioni                    -
007100111027     A                                                             Richiedere A-
007200111027     A                                      :       '
007300111027     A                                      DSPATR(UL)
007400111027     A                                  5  3'Opzioni: 5=Visualizza'
007500111027     A                                      COLOR(BLU)
007600060118     A**-------------------------------------------------------------**
007700111027     A          R TA61Z01
007800111027     A*%%TS  SD  20111027  140702  EDPMB       REL-V6R1M0  5761-WDS
007900111027     A                                      OVERLAY
008000111027     A  03                             24  2'F3=Fine'
008100111027     A                                      COLOR(BLU)
008200111027     A  12                             24 68'F12=Ritorno'
008300111027     A                                      COLOR(BLU)
008400111027     A                                 24 36'F8=Stampa'
008500111027     A                                      COLOR(BLU)
