000010151217     A*%%TS  SD  20151217  130640  EDPMB       REL-V7R1M0  5770-WDS
000020060116     A** FILE : TNTA01D2 --------------------------------------------**
000030060116     A**           MANUTENZIONE  TARIFFE  CLIENTI                    **
000040060116     A**-------------------------------------------------------------**
000050151217     A*%%EC
000060151217     A                                      DSPSIZ(24 80 *DS3)
000070151217     A                                      CHGINPDFT(HI UL)
000080151217     A                                      PRINT
000090151217     A                                      CA12
000100060116     A**-------------------------------------------------------------**
000110151016     A          R TA01D01
000120151016     A*%%TS  SD  20151016  122435  EDPMB       REL-V7R1M0  5770-WDS
000130151016     A  97                                  CF01
000140151016     A                                      CF03
000150151016     A  10 18                               CF02
000160151016     A  10                                  CF04
000170151016     A  10N15                               CF06
000180151016     A  10N50                               CF07
000190151016     A  10 18                               CF08
000200151016     A  10                                  CF10
000210151016     A  10                                  CF14
000220151016     A  31                                  CF16
000230151016     A  10 18N50                            CF18
000240151016     A  10                                  CF21
000250151016     A                                      CF24
000260151016     A                                      OVERLAY
000270151016     A***         ATRTPR         1A  P
000280151016     A  28        V1CMSG        78   M
000290151016     A            V1CRSU        20A  O  1  2
000300151016     A            V1CTES        34A  O  1 24DSPATR(RI)
000310151016     A                                      DSPATR(UL)
000320151016     A            V1CPGM        10A  O  1 60
000330151016     A                                  1 72DATE
000340151016     A                                      EDTCDE(Y)
000350151016     A            KNSIF         10A  O  2  2
000360151016     A            KNMUS         10A  O  2 13
000370151016     A  10N15                           2 34'AGGIORNAMENTO'
000380151016     A  01N15                           2 35'IMMISSIONE'
000390151016     A                                  2 72TIME
000400151016     A N50                              4  1'Cliente'
000410151016     A  50N85                           4  1'Visita '
000420151016     A  85                              4  1'Trattativa'
000430151016     A N50        V1CKSC         7S 0O  4 12TEXT('Codice Cliente')
000440151016     A                                      DSPATR(RI)
000450151016     A  50N85     V1CNRV         7Y 0O  4 12TEXT('Numero Visita')
000460151016     A                                      DSPATR(RI)
000470151016     A                                      EDTWRD('      / ')
000480151016     A  85        V1CNRVT        7Y 0O  4 12TEXT('Numero Visita')
000490151016     A                                      DSPATR(RI)
000500151016     A                                      EDTCDE(Z)
000510151016     A            V1DKSC        48A  O  4 21TEXT('Ragione Sociale')
000520151016     A                                      DSPATR(RI)
000530151016     A N50                              4 72'PRG'
000540151016     A  85                              4 72'VER'
000550151016     A  85
000560151016     AON50        V1CPRG         3S 0O  4 77TEXT('Progressivo Tariffa')
000570151016     A                                      DSPATR(HI)
000580151016     A            V1CDIV         3A  O  5 77
000590151016     A                                  6  1'Decorrenza'
000600151016     A            V1CDDT         8Y 0B  6 13TEXT('Data Decorrenza Tariffa')
000610151016     A  15                                  DSPATR(PR)
000620151016     A  40                                  DSPATR(PC)
000630151016     A                                      CHECK(RB)
000640151016     A                                      EDTCDE(8)
000650151016     A                                  6 27'Scadenza'
000660151016     A            V1CDST         8Y 0B  6 37TEXT('Data Scadenza Tariffa')
000670151016     A  15                                  DSPATR(PR)
000680151016     A  41                                  DSPATR(PC)
000690151016     A                                      CHECK(RB)
000700151016     A                                      EDTCDE(8)
000710151016     A  10
000720151016     AO 15                              6 52'Ultima variazione'
000730151016     A  10
000740151016     AO 15        V1CDUV         8Y 0O  6 70TEXT('Data Ultima Variazione')
000750151016     A                                      EDTCDE(8)
000760151016     A                                  7  1'Tariffa Italia/Estero ...:'
000770151016     A            V1CFIE         1A  B  7 28TEXT('Flag Italia/Estero')
000780151016     A  15                                  DSPATR(PR)
000790151016     A  87                                  DSPATR(PC)
000800151016     A                                  7 30'(I/E)'
000810151016     A                                  7 37'ISTAT:'
000820151016     A            V1CRCT         3Y 0B  7 44TEXT('Scatto ISTAT')
000830151016     A  15
000840151016     AO 17                                  DSPATR(PR)
000850151016     A  43                                  DSPATR(PC)
000860151016     A                                      CHECK(RB)
000870151016     A                                      EDTCDE(Z)
000880151016     A                                  7 48'%'
000890151016     A            V1CPRI         5Y 2B  7 50TEXT('Percentuale Addebito ISTAT')
000900151016     A  42                                  DSPATR(PC)
000910151016     A  15
000920151016     AO 17                                  DSPATR(PR)
000930151016     A                                      CHECK(RB)
000940151016     A                                      EDTCDE(2)
000950151016     A                                  7 59'decorrenza'
000960151016     A            V1DIST         8Y 0O  7 70EDTCDE(8)
000970151016     A                                  8  1'Cod. Tar.:'
000980151016     A            V1CCTR         3S 0O  8 13TEXT('Codice Tariffa')
000990151016     A                                      DSPATR(HI)
001000151016     A            V1DCTR        10A  O  8 17TEXT('Decodifica Codice Tariffa')
001010151016     A            V1CDCV        15A  B  8 28TEXT('Descrizione Codice Tariffa')
001020151016     A  15                                  DSPATR(PR)
001030151016     A                                  8 45'Tipo Servizio ?:'
001040151016     A            V1CTSP         1A  B  8 63TEXT('Tipo Servizio')
001050151016     A  15                                  DSPATR(PR)
001060151016     A  54                                  DSPATR(PC)
001070151016     A            V1DTSP        10A  O  8 65TEXT('Decodifica Tipo Servizio')
001080151016     A                                  9  1'% Addizionale Gestione ..:'
001090151016     A                                  9 28'Corrente'
001100151016     A            V1CPPA         5Y 2B  9 37TEXT('Percentuale Addizionale Gesti-
001110151016     A                                      one')
001120151016     A  15
001130151016     AO 10 17                               DSPATR(PR)
001140151016     A                                      CHECK(RB)
001150151016     A                                      EDTCDE(2)
001160151016     A                                  9 45'Anni precedenti'
001170151016     A            V1CPAG         5Y 2B  9 61TEXT('Percentuale Addizionale Gesti-
001180151016     A                                      one')
001190151016     A  15
001200151016     AO 10 17                               DSPATR(PR)
001210151016     A                                      CHECK(RB)
001220151016     A                                      EDTCDE(2)
001230151016     A                                 10  1'Modo Applicazione Tariffa .:'
001240151016     A            V1CMAT         1A  B 10 35TEXT('Modo appliazione tariffa')
001250151016     A                                      DSPATR(MDT)
001260151016     A  15
001270151016     AO 10 17                               DSPATR(PR)
001280151016     A                                      VALUES(' ' 'S' 'G')
001290151016     A                                 10 38'( " " = Normale     "S" = A scalar-
001300151016     A                                      e  '
001310151016     A                                 11 38'"G"=Garantito massimo scaglione pr-
001320151016     A                                      eceden.)'
001330151016     A                                 12  1'Tariffa Preferenziale .....:'
001340151016     A            V1CFTP         1A  B 12 35TEXT('Flag Tariffa Preferenziale')
001350151016     A  86                                  DSPATR(PC)
001360151016     A  15                                  DSPATR(PR)
001370151016     A                                      DSPATR(MDT)
001380151016     A                                      VALUES(' ' 'P')
001390151016     A                                 12 38'Tariffa Part/Arr/Bloc ...:'
001400151016     A            V1CBAP         1A  B 12 65TEXT('Flag Tariffa Part/Arr/Blocc.')
001410151016     A  15                                  DSPATR(PR)
001420151016     A                                      DSPATR(MDT)
001430151016     A                                      VALUES(' ' 'P' 'B' 'A')
001440151016     A                                 12 70'(P/A/B/ )'
001450151016     A                                 13  1'Network DPD o FedEx .......:'
001460151016     A            V1CNET         1A  B 13 35VALUES(' ' 'D' 'F')
001470151016     A  15                                  DSPATR(PR)
001480151016     A  45                                  DSPATR(PC)
001490151016     A                                 13 38'("D" = DPD  "F" = FedEx)'
001500151016     A                                 14  1'Calc.Provv.Contrassegno ...:'
001510151016     A            V1CPCA         1A  B 14 35TEXT('Flag calcolo provvigioni cont-
001520151016     A                                      rassegni')
001530151016     A                                      DSPATR(MDT)
001540151016     A  15
001550151016     AO 10 17                               DSPATR(PR)
001560151016     A                                      VALUES(' ' 'N')
001570151016     A                                 14 38'(" "=Sempre "N"=No su contrass. an-
001580151016     A                                      nullati)'
001590151016     A                                 15  1'Calc.Vol.Autom.Kg.STD x mc :'
001600151016     A            V1CKPM         5Y 1B 15 30TEXT('Rapporto Peso Volume')
001610151016     A  15                                  DSPATR(PR)
001620151016     A  46                                  DSPATR(PC)
001630151016     A                                      CHECK(RB)
001640151016     A                                      EDTCDE(4)
001650151016     A                                 15 38'Calc.Vol.Autom.mc x Collo:'
001660151016     A            V1CMPC         5Y 3B 15 65CHECK(RB)
001670151016     A  15                                  DSPATR(PR)
001680151016     A                                      EDTCDE(2)
001690151016     A                                 16  1'Utilizzo Peso VDL .... ....:'
001700151016     A            V1CTAP         1A  B 16 35TEXT('Tipo applicazione peso')
001710151016     A                                      DSPATR(MDT)
001720151016     A  15
001730151016     AO 10 17                               DSPATR(PR)
001740151016     A  60                                  DSPATR(PC)
001750151016     A                                      VALUES(' ' 'S' 'M')
001760151016     A                                 16 38'(" "=VDL solo se > del peso in bol-
001770151016     A                                      la;'
001780151016     A                                 17 38' "S"=Sempre VDL ; "M"=Mai VDL)'
001790151016     A  53                             18  1'Applicazione Peso Desunto .:'
001800151016     A  53        V1CTPR         1A  B 18 35VALUES(' ' 'N')
001810151016     A  15
001820151016     AO 18                                  DSPATR(PR)
001830151016     A                                      DSPATR(HI)
001840151016     A                                      DSPATR(UL)
001850151016     A  53                             18 38'(" "=Sempre;"N"=No)'
001860151016     A                                 19  1'Tipo Inserimento Volume ...:'
001870151016     A            V1COVB         1A  B 19 35TEXT('Tipo inserimento volume  in b-
001880151016     A                                      olla')
001890151016     A                                      DSPATR(MDT)
001900151016     A  15                                  DSPATR(PR)
001910151016     A                                      VALUES(' ' 'M' 'O')
001920151016     A                                 19 38'(" "=Automatico;"M"=Manuale;"O"=Op-
001930151016     A                                      zionale)'
001940151016     A                                 20  1'Applicazione Tariffa Finita :  Fin-
001950151016     A                                      o a ..:'
001960151016     A            V1CATA        13Y 3B 20 44TEXT('Applicazione Tariffa Finita')
001970151016     A  15
001980151016     AO 10 17                               DSPATR(PR)
001990151016     A  47                                  DSPATR(PC)
002000151016     A                                      CHECK(RB)
002010151016     A                                      EDTCDE(4)
002020151016     A                                 21  1'Arrotondam. > Minimo Tassab :  Fin-
002030151016     A                                      o a ..:'
002040151016     A                                      DSPATR(UL)
002050151016     A            V1CARL         7Y 3B 21 44TEXT('Arrotondamento Limite')
002060151016     A  15
002070151016     AO 10 17                               DSPATR(PR)
002080151016     A  48                                  DSPATR(PC)
002090151016     A                                      CHECK(RB)
002100151016     A                                      EDTCDE(4)
002110151016     A                                 21 53'-'
002120151016     A            V1CARF         7Y 3B 21 55TEXT('Arrotondamento Fino Al Limite-
002130151016     A                                      ')
002140151016     A  15
002150151016     AO 10 17                               DSPATR(PR)
002160151016     A                                      CHECK(RB)
002170151016     A                                      EDTCDE(4)
002180151016     A                                 21 66'Oltre'
002190151016     A            V1CARO         7Y 3B 21 72TEXT('Arrotondamento Oltre Limite')
002200151016     A  15
002210151016     AO 10 17                               DSPATR(PR)
002220151016     A                                      CHECK(RB)
002230151016     A                                      EDTCDE(4)
002240151016     A                                 22  1'Spedizioni annue ...........:'
002250151016     A                                 22 32'Minimo...:'
002260151016     A            V1CMIS         7Y 0B 22 44TEXT('Minimo numero spedizioni')
002270151016     A                                      CHECK(RB)
002280151016     A                                      EDTCDE(Z)
002290151016     A  51                                  DSPATR(PC)
002300151016     A  15
002310151016     AO 10 17                               DSPATR(PR)
002320151016     A                                 22 53'Massimo...:'
002330151016     A            V1CMAS         7Y 0B 22 65TEXT('Massimo numero spedizione')
002340151016     A                                      CHECK(RB)
002350151016     A                                      EDTCDE(Z)
002360151016     A  15
002370151016     AO 10 17                               DSPATR(PR)
002380120315     A*-------------------------------------------------------*
002390120315     A          R TA01Z01
002400120315     A*%%TS  SD  20120315  151302  EDPMB       REL-V6R1M0  5761-WDS
002410120315     A                                      OVERLAY
002420120315     A  10N15                          23  2'F6=Aggiorna'
002430120315     A  10                             23 18'F21=T.Partic.'
002440120315     A  10 95                               DSPATR(HI)
002450120315     A  10                             23 37'F14=T.Giac.'
002460120315     A  10 96                               DSPATR(HI)
002470120315     A  10                             23 54'F4=ISTAT'
002480120315     A  10N50                          23 67'F7=Variazioni'
002490120315     A            VZFD01        61A  O 24  2
002500120315     A            VZFD02        16A  O 24 64
002510060116     A**-------------------------------------------------------------**
002520060116     A** N.B.  RICORDARSI DI PROTEGGERE IL CAMPO V2CGCA PER 15 O 23
002530060116     A**
002540151217     A          R TA01D02
002550151217     A*%%TS  SD  20151217  130640  EDPMB       REL-V7R1M0  5770-WDS
002560151217     A  97                                  CF01
002570151217     A                                      CF03
002580151217     A N15                                  CF06
002590151217     A  10N50                               CF07
002600151217     A  31                                  CF16
002610151217     A                                      CF10
002620151217     A                                      CF14
002630151217     A  18N50                               CF18
002640151217     A                                      CF21
002650151217     A  18                                  CF02
002660151217     A  18                                  CF08
002670151217     A                                      CF24
002680151217     A                                      CSRLOC(H2RIGA     H2COLO)
002690151217     A                                      OVERLAY
002700151217     A            H2RIGA         3S 0H
002710151217     A            H2COLO         3S 0H
002720151217     A            AT2FMP         1A  P
002730151217     A  28        V1CMSG        78   M
002740151217     A            V1CRSU        20A  O  1  2
002750151217     A            V1CTES        34A  O  1 24DSPATR(RI)
002760151217     A                                      DSPATR(UL)
002770151217     A            V1CPGM        10A  O  1 60
002780151217     A                                  1 72DATE
002790151217     A                                      EDTCDE(Y)
002800151217     A            KNSIF         10A  O  2  2
002810151217     A            KNMUS         10A  O  2 13
002820151217     A  10N15                           2 34'AGGIORNAMENTO'
002830151217     A  01N15                           2 35'IMMISSIONE'
002840151217     A                                  2 72TIME
002850151217     A N50                              4  1'Cliente'
002860151217     A  50N85                           4  1'Visita '
002870151217     A  85                              4  1'Trattativa'
002880151217     A N50        V1CKSC         7S 0O  4 12TEXT('Codice Cliente')
002890151217     A                                      DSPATR(RI)
002900151217     A  50N85     V1CNRV         7Y 0O  4 12TEXT('Numero Visita')
002910151217     A                                      DSPATR(RI)
002920151217     A                                      EDTWRD('      / ')
002930151217     A  85        V1CNRVT        7Y 0O  4 12TEXT('Numero Visita')
002940151217     A                                      DSPATR(RI)
002950151217     A                                      EDTCDE(Z)
002960151217     A            V1DKSC        48A  O  4 21TEXT('Ragione Sociale')
002970151217     A                                      DSPATR(RI)
002980151217     A  85                              4 72'VER'
002990151217     A N50                              4 72'PRG'
003000151217     A  85
003010151217     AON50        V1CPRG         3S 0O  4 77TEXT('Progressivo Tariffa')
003020151217     A                                      DSPATR(HI)
003030151217     A                                  5 21'Codice Tariffa:'
003040151217     A            V1CCTR         3Y 0O  5 37TEXT('Codice Tariffa')
003050151217     A            V1DCTR        10A  O  5 42TEXT('Decodifica Codice Tariffa')
003060151217     A            V1CDCV        15A  O  5 53TEXT('Descrizione Codice Tariffa')
003070151217     A            VICDIV         3A  O  5 77
003080151217     A                                  6  1'Decorrenza'
003090151217     A            V1CDDT         8Y 0O  6 13TEXT('Data Decorrenza Tariffa')
003100151217     A                                      EDTCDE(8)
003110151217     A                                  6 26'Scadenza'
003120151217     A            V1CDST         8Y 0O  6 36TEXT('Data Scadenza Tariffa')
003130151217     A                                      EDTCDE(8)
003140151217     A  10
003150151217     AO 15                              6 52'Ultima variazione'
003160151217     A  10
003170151217     AO 15        V1CDUV         8Y 0O  6 70TEXT('Data Ultima Variazione')
003180151217     A                                      EDTCDE(8)
003190151217     A                                  8  1'Natura Merce:'
003200151217     A            V2CNAS        15A  B  8 15TEXT('Natura Merce')
003210151217     A  82                                  DSPATR(PC)
003220151217     A  15
003230151217     AO 39                                  DSPATR(PR)
003240151217     A                                  8 39'Note:'
003250151217     A            V2CNOT        35A  B  8 45TEXT('Disposizioni/Note')
003260151217     A  15                                  DSPATR(PR)
003270151217     A                                  9  1'Tipo Merce .:'
003280151217     A            V2CBVA         1A  B  9 15VALUES(' ' 'V')
003290151217     A  15                                  DSPATR(PR)
003300151217     A                                  9 20'(V=Valore)'
003310151217     A                                  9 39'Utilizzo in Internet:'
003320151217     A            V2INTERNET     2A  B  9 61VALUES('  ' 'NO')
003330151217     A  15                                  DSPATR(PR)
003340151217     A                                  9 64'("  ";NO)'
003350151217     A N23                             10  1'Rinuncia AC BASE:'
003360151217     A N23        V2CFMP         1A  B 10 19VALUES(' ' 'S')
003370151217     A                                      DSPATR(&AT2FMP)
003380151217     A  15
003390151217     AO 10 17                               DSPATR(PR)
003400151217     A N23                             10 21'(S=Si)'
003410151217     A                                 11  1'Gestione Importo da Assicurare .:'
003420151217     A            V2CFIS         1Y 0B 11 36TEXT('Flag Importo da Assicurare')
003430151217     A                                      DSPATR(MDT)
003440151217     A                                      VALUES(0 1 2 3)
003450151217     A  15
003460151217     AO 23                                  DSPATR(PR)
003470151217     A                                 11 39'(0-Inserim.opzionale 1-Obblig.forz-
003480151217     A                                      abile'
003490151217     A                                 12 40'2-Non inseribile    3-Obblig.non f-
003500151217     A                                      orzab)'
003510151217     A  16                             13  1'Gestione Valore da Fatturare ...:'
003520151217     A  16        V2CFVD         1A  B 13 36TEXT('Flag Valore Merce Dichiarato')
003530151217     A                                      DSPATR(MDT)
003540151217     A  15                                  DSPATR(PR)
003550151217     A                                      VALUES(' ' '1' '2' '3' '4')
003560151217     A  16                             13 39'(1-Assumere importo da assic.se no-
003570151217     A                                      n inser.'
003580151217     A  16                             14 40'2-Inserire in bollettazione,    st-
003590151217     A                                      ampare'
003600151217     A  16                             15 39' 3-Assumere sempre importo da assi-
003610151217     A                                      curare'
003620151217     A  16                             16 40'4-Inserire in bollettazione,non st-
003630151217     A                                      ampare)'
003640151217     A                                 17 20'C/Assegno'
003650151217     A                                 17 34'Giacenza'
003660151217     A                                 17 47'Consegna'
003670151217     A                                 17 61'Varie'
003680151217     A                                 18  1'PARTICOLARITA'':'
003690151217     A                                      DSPATR(UL)
003700151217     A N15
003710151217     AO 15 13                          18 21'?'
003720151217     A N15
003730151217     AO 15 13     V2CGCR         1A  B 18 23VALUES(' ' '?')
003740151217     A                                      DSPATR(PR)
003750151217     A            V2CGCA         2A  B 18 26TEXT('Particolarita'' C/Assegno')
003760151217     A  77                                  DSPATR(PC)
003770151217     A                                      DSPATR(PR)
003780151217     A N15
003790151217     AO 15 63                          18 34'?'
003800151217     A N15
003810151217     AO 15 63     V2CGGR         1A  B 18 36VALUES(' ' '?')
003820151217     A            V2CGGA         2A  B 18 39TEXT('Particolarita'' Giacenza')
003830151217     A  78                                  DSPATR(PC)
003840151217     A  15
003850151217     AO 23                                  DSPATR(PR)
003860151217     A N15
003870151217     AO 15 19                          18 47'?'
003880151217     A N15
003890151217     AO 15 19     V2CGMR         1A  B 18 49VALUES(' ' '?')
003900151217     A            V2CGMA         2A  B 18 52TEXT('Particolarita'' Consegna')
003910151217     A  79                                  DSPATR(PC)
003920151217     A  15
003930151217     AO 23                                  DSPATR(PR)
003940151217     A N15
003950151217     AO 15 24                          18 60'?'
003960151217     A N15
003970151217     AO 15 24     V2CGVR         1A  B 18 62VALUES(' ' '?')
003980151217     A            V2CGVA         2A  B 18 65TEXT('Particolarita'' Varie')
003990151217     A  80                                  DSPATR(PC)
004000151217     A  15
004010151217     AO 23                                  DSPATR(PR)
004020151217     A                                 20  1'Tassazione con Tariffa Mittente :'
004030151217     A            V2CFTM         1A  B 20 36TEXT('Flag Tassazione con Tariffa M-
004040151217     A                                      ittente')
004050151217     A  15
004060151217     AO 23                                  DSPATR(PR)
004070151217     A                                      DSPATR(MDT)
004080151217     A                                      VALUES('S' ' ')
004090151217     A                                 20 40'(S/ )'
004100151217     A                                 20 47'Consegna D D T...:'
004110151217     A            V2CBAM         1A  B 20 66TEXT('Allega BAM (Si/No)')
004120151217     A                                      DSPATR(MDT)
004130151217     A                                      VALUES('S' 'N')
004140151217     A  15                                  DSPATR(PR)
004150151217     A  49                                  DSPATR(PC)
004160151217     A                                 20 69'(S/N)'
004170151217     A                                 21  1'Copia Firmata Offerta ..........:'
004180151217     A N50        V2CSIS         1A  B 21 36TEXT('Copia Firmata Offerta (si/no)-
004190151217     A                                      ')
004200151217     A                                      DSPATR(MDT)
004210151217     A                                      VALUES('S' ' ')
004220151217     A  15
004230151217     AO 23                                  DSPATR(PR)
004240151217     A N50                             21 40'(S/ )'
004250151217     A                                 22  1'Tassazione  Assegnati ..........:'
004260151217     A            V2CFTS         1A  B 22 36TEXT('Flag Tassazione Assegnati')
004270151217     A  15
004280151217     AO 23                                  DSPATR(PR)
004290151217     A                                      DSPATR(MDT)
004300151217     A                                      VALUES('1' '2')
004310151217     A                                 22 40'(1-Segue Fatt 2-Fatt.Imm)'
004320120315     A*-------------------------------------------------------*
004330120906     A          R TA01Z02
004340120906     A*%%TS  SD  20120906  114008  EDPMB       REL-V6R1M0  5761-WDS
004350120906     A                                      OVERLAY
004360120906     A N15                             23  2'F6=Aggiorna'
004370120906     A                                 23 18'F21=T.Partic.'
004380120906     A  95                                  DSPATR(HI)
004390120906     A                                 23 37'F14=T.Giac.'
004400120906     A  96                                  DSPATR(HI)
004410120906     A  10N50                          23 67'F7=Variazioni'
004420120906     A            VZFD01        61A  O 24  2
004430120906     A            VZFD02        16A  O 24 64
004440060116      **-------------------------------------------------------------**
004450060116      ** SUBFILE RECORD  DI   A G G I O R N A M E N T O
004460060116      **
004470020624     A          R TA01S03                   SFL
004480020624     A  22                                  SFLNXTCHG
004490130124     A            ATATB          1A  P
004500130124     A            ATITR          1A  P
004510130124     A            ATINO          1A  P
004520130124     A            ATRPV          1A  P
004530130124     A            ATMIN          1A  P
004540130124     A            ATMAX          1A  P
004550020624     A            AT0CTS         1A  P
004560020624     A            TADORP         5A  H
004570020624     A            SAVRPV         3Y 1H
004580020624     A            TADATB         1A  B  7  2TEXT('Flag Annullamento')
004590130124     A N15                                  DSPATR(&ATATB)
004600020624     A  15                                  DSPATR(PR)
004610020624     A                                      DSPATR(MDT)
004620020624     A                                      VALUES('A' ' ')
004630020624     A            TADLNP         3S 0O  7  4TEXT('Linea Partenza')
004640020624     A            TADCTS         2A  O  7  8TEXT('Codice Tassazione')
004650020624     A                                      DSPATR(&AT0CTS)
004660020624     A            DESCTS        10A  O  7 11TEXT('Decodifica Codice Tassazione')
004670020624     A            TADCAP         9A  O  7 22TEXT('Paese di Arrivo (C.A.P.)')
004680020624     A            TADSGL        13Y 3O  7 32TEXT('Scaglione Tariffa in kg')
004690020624     A                                      EDTCDE(4)
004700020624     A            TADITR        11Y 3B  7 47TEXT('Tariffa Capoluogo')
004710130124     A N15                                  DSPATR(&ATITR)
004720020624     A  15                                  DSPATR(PR)
004730020624     A  59                                  DSPATR(PC)
004740020624     A                                      CHECK(RB)
004750020624     A                                      EDTCDE(4)
004760020624     A            TADINO        11Y 3B  7 61TEXT('Tariffa Inoltro')
004770130124     A N15                                  DSPATR(&ATINO)
004780020624     A  15                                  DSPATR(PR)
004790020624     A  61                                  DSPATR(PC)
004800020624     A                                      CHECK(RB)
004810020624     A                                      EDTCDE(4)
004820020624     A                                  7 74'M'
004830020624     A                                      DSPATR(HI)
004840020624     A N13                                  DSPATR(ND)
004850020624     A            TADRPV         3Y 1B  7 77TEXT('Rapporto Peso/Volume')
004860130124     A N15                                  DSPATR(&ATRPV)
004870020624     A  89                                  DSPATR(PC)
004880020624     A  15                                  DSPATR(PR)
004890020624     A                                      CHECK(RB)
004900020624     A                                      EDTCDE(2)
004910020624     A                                  8 14'Nazione'
004920020624     A            TADNAZ         3A  O  8 22
004930020624     A            DESNAZ        15A  O  8 26TEXT('Decodifica della nazione')
004940020624     A                                  8 43'Min'
004950020624     A                                      DSPATR(UL)
004960020624     A            TADMIN        11Y 3B  8 47TEXT('Importo Minimo Tariffa')
004970020624     A                                      CHECK(RB)
004980020624     A                                      EDTCDE(4)
004990130124     A N15                                  DSPATR(&ATMIN)
005000020624     A  52                                  DSPATR(PC)
005010020624     A            TADMAX        11Y 3B  8 61TEXT('Importo Massimo Tariffa')
005020130124     A N15                                  DSPATR(&ATMAX)
005030020624     A  62                                  DSPATR(PC)
005040020624     A                                      CHECK(RB)
005050020624     A                                      EDTCDE(4)
005060020624     A                                  8 74'Max'
005070020624     A                                      DSPATR(UL)
005080060116     A**-------------------------------------------------------------**
005090060116     A** SUBFILE CONTROL DI   A G G I O R N A M E N T O
005100060116     A**
005110130124     A          R TA01C03                   SFLCTL(TA01S03)
005120130124     A*%%TS  SD  20130124  140035  EDPMB       REL-V6R1M0  5761-WDS
005130130124     A  97                                  CF01
005140130124     A                                      CF03
005150130124     A N15N17                               CF08
005160130124     A N15                                  CF06
005170130124     A N15                                  CF09
005180130124     A                                      CF10
005190130124     A N15                                  CF13
005200130124     A  50                                  CF15
005210130124     A                                      CF17
005220130124     A                                      ROLLUP(25)
005230130124     A                                      CF11
005240130124     A                                      CF24
005250130124     A                                      OVERLAY
005260130124     A N94N93                               SFLDSP
005270130124     A N94N93                               SFLDSPCTL
005280130124     A  93                                  SFLDLT
005290130124     A  94                                  SFLCLR
005300130124     A                                      SFLDROP(CF11)
005310130124     A                                      SFLSIZ(0009)
005320130124     A                                      SFLPAG(0008)
005330130124     A            REC            4S 0H      SFLRCDNBR
005340130124     A  28        VCCMSG        78   M
005350130124     A            V1CRSU        20A  O  1  2
005360130124     A            V1CTES        34A  O  1 24DSPATR(RI)
005370130124     A                                      DSPATR(UL)
005380130124     A            V1CPGM        10A  O  1 60
005390130124     A                                  1 72DATE
005400130124     A                                      EDTCDE(Y)
005410130124     A            KNSIF         10A  O  2  2
005420130124     A            KNMUS         10A  O  2 13
005430130124     A N15                              2 34'AGGIORNAMENTO'
005440130124     A                                  2 72TIME
005450130124     A N50                              4  1'Cliente'
005460130124     A  50N85                           4  1'Visita '
005470130124     A  85                              4  1'Trattativa'
005480130124     A N50        V1CKSC         7S 0O  4 12TEXT('Codice Cliente')
005490130124     A                                      DSPATR(RI)
005500130124     A  50N85     V1CNRV         7Y 0O  4 12TEXT('Numero Visita')
005510130124     A                                      DSPATR(RI)
005520130124     A                                      EDTWRD('      / ')
005530130124     A  85        V1CNRVT        7Y 0O  4 12TEXT('Numero Visita')
005540130124     A                                      DSPATR(RI)
005550130124     A                                      EDTCDE(Z)
005560130124     A            V1DKSC        48A  O  4 21TEXT('Ragione Sociale')
005570130124     A                                      DSPATR(RI)
005580130124     A  85                              4 72'VER'
005590130124     A N50                              4 72'PRG'
005600130124     A  85
005610130124     AON50        V1CPRG         3S 0O  4 77TEXT('Progressivo Tariffa')
005620130124     A                                      DSPATR(HI)
005630130124     A                                  5 21'Codice Tariffa:'
005640130124     A            TAMCTR         3S 0O  5 37TEXT('Codice Tariffa')
005650130124     A            V1DCTR        10A  O  5 42TEXT('Descrizione Codice Tariffa')
005660130124     A            TAMDCV        15A  O  5 53TEXT('Descrizione Codice Tariffa')
005670130124     A                                  5 66'Ricerca'
005680130124     A                                      DSPATR(UL)
005690130124     A                                      DSPATR(HI)
005700130124     A            V1CRDA         3Y 0B  5 72DSPATR(PC)
005710130124     A                                      CHECK(RB)
005720130124     A                                      EDTCDE(Z)
005730130124     A            V1CRA          2A  B  5 78CHECK(ER)
005740130124     A                                  6  2'A'
005750130124     A                                      DSPATR(UL)
005760130124     A                                  6  4'Par'
005770130124     A                                      DSPATR(UL)
005780130124     A                                  6  8'Arrivo       '
005790130124     A                                      DSPATR(UL)
005800130124     A                                  6 22'C.a.p.   '
005810130124     A                                      DSPATR(UL)
005820130124     A                                  6 32'Scaglione     '
005830130124     A                                      DSPATR(UL)
005840130124     A N88                              6 47'Citta''      '
005850130124     A                                      DSPATR(UL)
005860130124     A  88                              6 47'Citta''   %  '
005870130124     A                                      DSPATR(UL)
005880130124     A N88                              6 61'Provincia   '
005890130124     A                                      DSPATR(UL)
005900130124     A  88                              6 61'Provincia % '
005910130124     A                                      DSPATR(UL)
005920130124     A                                  6 78'P/V'
005930130124     A                                      DSPATR(UL)
005940130124     A                                  5 76'?'
005950060116     A**-------------------------------------------------------------**
005960130124     A          R TA01Z04
005970130124     A*%%TS  SD  20130124  140035  EDPMB       REL-V6R1M0  5761-WDS
005980130124     A                                      OVERLAY
005990130124     A  50                             23  2'F15=Porto'
006000130124     A                                 23 16'F17=Delta'
006010130124     A N15                             23 30'F13=Dupl.dett.'
006020130124     A N15N17                          23 49'F8=Manipolaz.'
006030130124     A N15                             23 66'F9=Inserimento'
006040130124     A            VZFD01        61A  O 24  2
006050130124     A            VZFD02        16A  O 24 64
006060060116     A**-------------------------------------------------------------**
006070060116     A** SUBFILE RECORD  DI   I M M I S S I O N E
006080060116     A**
006090120713     A          R TA01S05                   SFL
006100120713     A*%%TS  SD  20120713  121318  EDPMB       REL-V6R1M0  5761-WDS
006110120713     A  22                                  SFLNXTCHG
006120120713     A            TADORP         5A  H
006130120713     A            SAVRPV         3Y 1H
006140120713     A            TADLNP         3Y 0B  7  5TEXT('Linea Partenza')
006150120713     A  55                                  DSPATR(PC)
006160120713     A                                      EDTCDE(Z)
006170120713     A                                      DUP(02)
006180120713     A                                      CHECK(RZ)
006190120713     A            TADCTS         2A  B  7 10TEXT('Codice Tassazione')
006200120713     A  56                                  DSPATR(PC)
006210120713     A                                      DUP(03)
006220120713     A            DESCTS        10A  O  7 13TEXT('Decodifica Codice Tassazione')
006230120713     A            TADCAP         9A  B  7 24TEXT('Paese di Arrivo (C.A.P.)')
006240120713     A  57                                  DSPATR(PC)
006250120713     A                                      DUP(04)
006260120713     A            TADSGL        13Y 3B  7 34TEXT('Scaglione Tariffa in kg')
006270120713     A  58                                  DSPATR(PC)
006280120713     A                                      CHECK(RB)
006290120713     A                                      EDTCDE(4)
006300120713     A                                      DUP(05)
006310120713     A            TADITR        11Y 3B  7 49TEXT('Tariffa Capoluogo')
006320120713     A  59                                  DSPATR(PC)
006330120713     A                                      CHECK(RB)
006340120713     A                                      EDTCDE(4)
006350120713     A                                      DUP(06)
006360120713     A            TADINO        11Y 3B  7 64TEXT('Tariffa Inoltro')
006370120713     A  61                                  DSPATR(PC)
006380120713     A                                      CHECK(RB)
006390120713     A                                      EDTCDE(4)
006400120713     A                                      DUP(07)
006410120713     A            TADRPV         3Y 1B  7 77TEXT('Rapporto Peso/Volume')
006420120713     A  89                                  DSPATR(PC)
006430120713     A                                      CHECK(RB)
006440120713     A                                      EDTCDE(2)
006450120713     A                                      DUP(08)
006460120713     A                                  8 16'Nazione'
006470120713     A            TADNAZ         3A  B  8 24TEXT('Nazione di arrivo')
006480120713     A  38                                  DSPATR(PC)
006490120713     A                                      DUP(44)
006500120713     A            DESNAZ        15A  O  8 28TEXT('Descrizione Nazione')
006510120713     A                                  8 45'Min'
006520120713     A                                      DSPATR(UL)
006530120713     A                                      DSPATR(HI)
006540120713     A            TADMIN        11Y 3B  8 49TEXT('Importo Minimo Tariffa')
006550120713     A                                      CHECK(RB)
006560120713     A                                      EDTCDE(4)
006570120713     A                                      DUP(09)
006580120713     A  52                                  DSPATR(PC)
006590120713     A            TADMAX        11Y 3B  8 64TEXT('Importo Massimo Tariffa')
006600120713     A  62                                  DSPATR(PC)
006610120713     A                                      CHECK(RB)
006620120713     A                                      EDTCDE(4)
006630120713     A                                      DUP(11)
006640120713     A                                  8 77'Max'
006650120713     A                                      DSPATR(UL)
006660120713     A                                      DSPATR(HI)
006670060116     A**-------------------------------------------------------------**
006680060116     A** SUBFILE CONTROL DI   I M M I S S I O N E
006690060116     A**
006700120713     A          R TA01C05                   SFLCTL(TA01S05)
006710120713     A*%%TS  SD  20120713  121318  EDPMB       REL-V6R1M0  5761-WDS
006720120713     A                                      SFLSIZ(0120)
006730120713     A                                      SFLPAG(0007)
006740120713     A  97                                  CF01
006750120713     A                                      CF03
006760120713     A                                      CF07
006770120713     A                                      CF06
006780120713     A  50N21                               CF15
006790120713     A                                      CF11
006800120713     A                                      CF24
006810120713     A                                      OVERLAY
006820120713     A N84N83                               SFLDSP
006830120713     A N84N83                               SFLDSPCTL
006840120713     A  83                                  SFLDLT
006850120713     A  84                                  SFLCLR
006860120713     A N84N83                               SFLEND
006870120713     A                                      SFLDROP(CF11)
006880120713     A            REC1           4S 0H      SFLRCDNBR
006890120713     A  28        $MSG          78   M
006900120713     A            V1CRSU        20A  O  1  2
006910120713     A            V1CTES        34A  O  1 24DSPATR(RI)
006920120713     A                                      DSPATR(UL)
006930120713     A            V1CPGM        10A  O  1 60
006940120713     A                                  1 72DATE
006950120713     A                                      EDTCDE(Y)
006960120713     A            KNSIF         10A  O  2  2
006970120713     A            KNMUS         10A  O  2 13
006980120713     A                                  2 35'IMMISSIONE'
006990120713     A                                  2 72TIME
007000120713     A N50                              4  1'Cliente'
007010120713     A  50N85                           4  1'Visita '
007020120713     A  85                              4  1'Trattativa'
007030120713     A N50        V1CKSC         7S 0O  4 12TEXT('Codice Cliente')
007040120713     A                                      DSPATR(RI)
007050120713     A  50N85     V1CNRV         7Y 0O  4 12TEXT('Numero Visita')
007060120713     A                                      DSPATR(RI)
007070120713     A                                      EDTWRD('      / ')
007080120713     A  85        V1CNRVT        7Y 0O  4 12TEXT('Numero Visita')
007090120713     A                                      DSPATR(RI)
007100120713     A                                      EDTCDE(Z)
007110120713     A            V1DKSC        48A  O  4 21TEXT('Ragione Sociale')
007120120713     A                                      DSPATR(RI)
007130120713     A  85                              4 72'VER'
007140120713     A N50                              4 72'PRG'
007150120713     A  85
007160120713     AON50        V1CPRG         3S 0O  4 77TEXT('Progressivo Tariffa')
007170120713     A                                      DSPATR(HI)
007180120713     A                                  5 21'Codice Tariffa'
007190120713     A            TAMCTR         3S 0O  5 37TEXT('Codice Tariffa')
007200120713     A            V1DCTR        10A  O  5 42TEXT('Descrizione Codice Tariffa')
007210120713     A            TAMDCV        15A  O  5 53TEXT('Descrizione Codice Tariffa')
007220120713     A                                  6  5'Par'
007230120713     A                                      DSPATR(UL)
007240120713     A                                      DSPATR(HI)
007250120713     A                                  6 10'Arrivo ?     '
007260120713     A                                      DSPATR(UL)
007270120713     A                                      DSPATR(HI)
007280120713     A                                  6 24'C.a.p.   '
007290120713     A                                      DSPATR(UL)
007300120713     A                                      DSPATR(HI)
007310120713     A                                  6 34'Scaglione     '
007320120713     A                                      DSPATR(UL)
007330120713     A                                      DSPATR(HI)
007340120713     A N88                              6 49'Citta''      '
007350120713     A                                      DSPATR(UL)
007360120713     A                                      DSPATR(HI)
007370120713     A  88                              6 49'Citta''   %  '
007380120713     A                                      DSPATR(UL)
007390120713     A                                      DSPATR(HI)
007400120713     A N88                              6 64'Provincia   '
007410120713     A                                      DSPATR(UL)
007420120713     A                                      DSPATR(HI)
007430120713     A  88                              6 64'Provincia % '
007440120713     A                                      DSPATR(UL)
007450120713     A                                      DSPATR(HI)
007460120713     A                                  6 78'P/V'
007470120713     A                                      DSPATR(UL)
007480120713     A            VICDIV         3A  O  5 77
007490060116     A**-------------------------------------------------------------**
007500120315     A          R TA01Z06
007510120315     A*%%TS  SD  20120315  151302  EDPMB       REL-V6R1M0  5761-WDS
007520120315     A                                      OVERLAY
007530120315     A  50N21                          23  2'F15=Porto'
007540120315     A                                 23 24'F7=Altro inserimento'
007550120315     A                                 23 57'F6=Aggiornamento e fine'
007560120315     A            VZFD01        61A  O 24  2
007570120315     A            VZFD02        16A  O 24 64
007580060116     A**-------------------------------------------------------------**
007590120713     A          R TA01D07
007600120713     A*%%TS  SD  20120713  121318  EDPMB       REL-V6R1M0  5761-WDS
007610120713     A                                      CF06
007620120713     A                                      CSRLOC(H7RIGA     H7COLO)
007630120713     A  28        V6CMSG        78   M
007640120713     A            PROSAD         1A  P
007650120713     A            H7RIGA         3S 0H
007660120713     A            H7COLO         3S 0H
007670120713     A            V1CRSU        20A  O  1  2
007680120713     A            V1CTES        34A  O  1 24DSPATR(RI)
007690120713     A                                      DSPATR(UL)
007700120713     A            V1CPGM        10A  O  1 60
007710120713     A                                  1 72DATE
007720120713     A                                      EDTCDE(Y)
007730120713     A            KNSIF         10A  O  2  2
007740120713     A            KNMUS         10A  O  2 13
007750120713     A N15                              2 34'AGGIORNAMENTO'
007760120713     A                                  2 72TIME
007770120713     A N50                              4  1'Cliente'
007780120713     A  50N85                           4  1'Visita '
007790120713     A  85                              4  1'Trattativa'
007800120713     A N50        V1CKSC         7S 0O  4 12TEXT('Codice Cliente')
007810120713     A                                      DSPATR(RI)
007820120713     A  50N85     V1CNRV         7Y 0O  4 12TEXT('Numero Visita')
007830120713     A                                      DSPATR(RI)
007840120713     A                                      EDTWRD('      / ')
007850120713     A  85        V1CNRVT        7Y 0O  4 12TEXT('Numero Visita')
007860120713     A                                      DSPATR(RI)
007870120713     A                                      EDTCDE(Z)
007880120713     A            V1DKSC        48A  O  4 21TEXT('Ragione Sociale')
007890120713     A                                      DSPATR(RI)
007900120713     A                                  5 21'Codice Tariffa:'
007910120713     A            TAMCTR         3S 0O  5 37TEXT('Codice Tariffa')
007920120713     A            V1DCTR        10A  O  5 42TEXT('Descrizione Codice Tariffa')
007930120713     A            TAMDCV        15A  O  5 53TEXT('Descrizione Codice Tariffa')
007940120713     A                                  6  1'                                  -
007950120713     A                                                                         -
007960120713     A                                                 '
007970120713     A                                      DSPATR(UL)
007980120713     A                                  7 30'MANIPOLAZIONE TARIFFA'
007990120713     A                                      DSPATR(HI)
008000120713     A                                  8  1'Manipolazione dettaglio tariffe'
008010120713     A            VIDTAD         2A  B  8 35VALUES('SI' 'NO')
008020120713     A  24                                  DSPATR(PC)
008030120713     A                                  8 38'(SI/NO)'
008040120713     A                                  9  1'Manipolazione tariffe particolari'
008050120713     A            VIDTPT         2A  B  9 35VALUES('SI' 'NO')
008060120713     A  82                                  DSPATR(PC)
008070120713     A                                  9 38'(SI/NO)'
008080120713     A                                 10  1'Manipolazione tariffe di giacenza'
008090120713     A            VIDTGC         2A  B 10 35VALUES('SI' 'NO')
008100120713     A                                 10 38'(SI/NO)'
008110120713     A                                 11  1'Aumento/Diminuzione'
008120120713     A            VIDAD          1A  B 11 21TEXT('Aumento/Diminuz. Dettaglio Ta-
008130120713     A                                      riffa')
008140120713     A                                      DSPATR(MDT)
008150120713     A                                      VALUES('+' '-')
008160120713     A                                 11 23'(+/-)'
008170120713     A            VIDLIR        11Y 3B 11 29
008180120713     A  63                                  DSPATR(PC)
008190120713     A                                      CHECK(RB)
008200120713     A                                      EDTWRD('      0 ,   ')
008210120713     A            DIVISA         3A  O 11 43TEXT('Divisa')
008220120713     A                                 11 48'oppure  %'
008230120713     A            VIDPEI         5Y 2B 11 58CHECK(RB)
008240120713     A                                      EDTCDE(2)
008250120713     A                                 12  1'Arrotondamento dei valori ottenuti-
008260120713     A                                       per Difetto/Eccesso:'
008270120713     A            VIDADE         1A  B 12 58VALUES('D' 'E')
008280120713     A                                      DSPATR(MDT)
008290120713     A                                 12 60'(D/E)'
008300120713     A            VIDALI         8Y 3B 12 67CHECK(RB)
008310120713     A  86                                  DSPATR(PC)
008320120713     A                                      EDTWRD('   0 ,   ')
008330120713     A            TAMDIV         3A  O 12 78TEXT('Divisa della tariffa')
008340120713     A                                 13  2' "  "  "  "    "   "  "  "  "  "  -
008350120713     A                                      al  Decimale ......:'
008360120713     A                                      DSPATR(&PROSAD)
008370120713     A            VIDSAD         1A  B 13 58VALUES(' ' 'S')
008380120713     A                                      DSPATR(&PROSAD)
008390120713     A                                 13 60'(Si)'
008400120713     A                                      DSPATR(&PROSAD)
008410120713     A            VIDDEC         1Y 0B 13 71EDTCDE(Z)
008420120713     A                                      VALUES(0 1 2)
008430120713     A                                      DSPATR(&PROSAD)
008440120713     A                                 13 74'(0/1/2)'
008450120713     A                                      DSPATR(&PROSAD)
008460120713     A                                 14 22'MANIPOLAZIONE  RAPPORTO  PESO/VOLU-
008470120713     A                                      ME'
008480120713     A                                      DSPATR(HI)
008490120713     A                                 15  1'Aumento/Diminuzione'
008500120713     A            VIDRAD         1A  B 15 21TEXT('Aumento/Diminuz. Rapp. Peso/V-
008510120713     A                                      olume')
008520120713     A                                      VALUES('+' '-')
008530120713     A                                      DSPATR(MDT)
008540120713     A                                 15 23'(+/-)'
008550120713     A            VIDVRR         3Y 1B 15 29TEXT('Rapporto Peso/Volume')
008560120713     A                                      CHECK(RB)
008570120713     A                                      EDTCDE(2)
008580120713     A                                 15 35'oppure'
008590120713     A                                 15 43'Annulla'
008600120713     A            VIDARR         2A  B 15 51VALUES('  ' 'SI')
008610120713     A                                 15 54'(SI)'
008620120713     A                                 15 59'oppure'
008630120713     A                                 15 67'Inserisci'
008640120713     A            VIDIRR         3Y 1B 15 77TEXT('Rapporto Peso/Volume da inser-
008650120713     A                                      ire')
008660120713     A                                      CHECK(RB)
008670120713     A                                      EDTCDE(2)
008680120713     A                                 16 28'INCLUSIONI / OMISSIONI'
008690120713     A                                      DSPATR(HI)
008700120713     A                                 17  1'Linea Partenza ...:'
008710120713     A            VIDIOP         1A  B 17 21TEXT('Inclusione/Omissione Linee Pa-
008720120713     A                                      rtenza')
008730120713     A                                      DSPATR(MDT)
008740120713     A                                      VALUES('I' 'O')
008750120713     A                                 17 23'(I/O)'
008760120713     A            VIDMP1         3Y 0B 17 33CHECK(RZ)
008770120713     A  90                                  DSPATR(PC)
008780120713     A                                      EDTCDE(Z)
008790120713     A            VIDMP2         3Y 0B 17 38CHECK(RZ)
008800120713     A                                      EDTCDE(Z)
008810120713     A            VIDMP3         3Y 0B 17 43CHECK(RZ)
008820120713     A                                      EDTCDE(Z)
008830120713     A            VIDMP4         3Y 0B 17 48CHECK(RZ)
008840120713     A                                      EDTCDE(Z)
008850120713     A            VIDMP5         3Y 0B 17 53CHECK(RZ)
008860120713     A                                      EDTCDE(Z)
008870120713     A                                 18  1'Codici tassazione :'
008880120713     A            VIDIO          1A  B 18 21TEXT('Inclusione/Omissione Codici T-
008890120713     A                                      assazione')
008900120713     A                                      DSPATR(MDT)
008910120713     A                                      VALUES('I' 'O')
008920120713     A                                 18 23'(I/O)'
008930120713     A            VIDMC1         2A  B 18 33
008940120713     A  66                                  DSPATR(PC)
008950120713     A            VIDMC2         2A  B 18 38
008960120713     A  67                                  DSPATR(PC)
008970120713     A            VIDMC3         2A  B 18 43
008980120713     A  68                                  DSPATR(PC)
008990120713     A            VIDMC4         2A  B 18 48
009000120713     A  69                                  DSPATR(PC)
009010120713     A            VIDMC5         2A  B 18 53
009020120713     A  70                                  DSPATR(PC)
009030120713     A            VIDMC6         2A  B 18 58
009040120713     A  71                                  DSPATR(PC)
009050120713     A            VIDMC7         2A  B 18 63
009060120713     A  72                                  DSPATR(PC)
009070120713     A            VIDMC8         2A  B 18 68
009080120713     A  73                                  DSPATR(PC)
009090120713     A            VIDMC9         2A  B 18 73
009100120713     A  74                                  DSPATR(PC)
009110120713     A            VIDMC0         2A  B 18 78
009120120713     A  75                                  DSPATR(PC)
009130120713     A                                 19  1'Scaglione ........:'
009140120713     A            VIDIO2         1A  B 19 21TEXT('Inclusione/Omissione Scaglion-
009150120713     A                                      e')
009160120713     A                                      DSPATR(MDT)
009170120713     A                                      VALUES('I' 'O')
009180120713     A                                 19 23'(I/O)'
009190120713     A            VIDSGL        13Y 3B 19 33TEXT('Scaglione Tariffa')
009200120713     A  65                                  DSPATR(PC)
009210120713     A                                      CHECK(RB)
009220120713     A                                      EDTCDE(4)
009230120713     A                                 20  1'Tar.particolari ..:'
009240120713     A            VIDIOFTC       1A  B 20 21TEXT('Inclusione/Omissione Scaglion-
009250120713     A                                      e')
009260120713     A                                      DSPATR(MDT)
009270120713     A                                      VALUES('I' 'O')
009280120713     A                                 20 23'(I/O)'
009290120713     A            VIDFTC1        1A  B 20 33
009300120713     A  64                                  DSPATR(PC)
009310120713     A            VIDFTC2        1A  B 20 36
009320120713     A            VIDFTC3        1A  B 20 39
009330120713     A            VIDFTC4        1A  B 20 42
009340120713     A            VIDFTC5        1A  B 20 45
009350120713     A                                 21  3'Variazione Tar. Citta'' (S/N):'
009360120713     A            VIDVTC         1A  B 21 33TEXT('Variazione Tariffa Citta'' ')
009370120713     A  76                                  DSPATR(PC)
009380120713     A                                      DSPATR(MDT)
009390120713     A                                      VALUES('S' 'N')
009400120713     A                                 21 39'Variazione Tar. Provincia (S/N):'
009410120713     A            VIDVTP         1A  B 21 72TEXT('Variazione Tariffa Provincia')
009420120713     A                                      DSPATR(MDT)
009430120713     A                                      VALUES('S' 'N')
009440120713     A                                 22  3'Variazione Minimo      (S/N):'
009450120713     A            VIDVMN         1A  B 22 33TEXT('Variazione Importo Minimo')
009460120713     A                                      VALUES('S' 'N')
009470120713     A                                      DSPATR(MDT)
009480120713     A                                 22 39'Variazione Massimo        (S/N):'
009490120713     A            VIDVMX         1A  B 22 72TEXT('Variazione Importo Massimo')
009500120713     A                                      VALUES('S' 'N')
009510120713     A                                      DSPATR(MDT)
009520120713     A                                 24  2'F6=Aggiornamento'
009530120713     A                                 24 64'F12=Ritorno'
009540120713     A                                 20 29'(?)'
009550120713     A                                  9 46'Escluse AC BASE e FUEL'
009560120713     A                                      DSPATR(HI)
009570120713     A                                 18 29'(?)'
009580060116     A**-------------------------------------------------------------**
009590120713     A          R TA01D08
009600120713     A*%%TS  SD  20120713  121318  EDPMB       REL-V6R1M0  5761-WDS
009610120713     A                                      CF06
009620120713     A  23                                  CF19
009630120713     A  28        V8CMSG        78   M
009640120713     A            V1CRSU        20A  O  1  2
009650120713     A            V1CTES        34A  O  1 24DSPATR(RI)
009660120713     A                                      DSPATR(UL)
009670120713     A            V1CPGM        10A  O  1 60
009680120713     A                                  1 72DATE
009690120713     A                                      EDTCDE(Y)
009700120713     A            KNSIF         10A  O  2  2
009710120713     A            KNMUS         10A  O  2 13
009720120713     A N15                              2 34'AGGIORNAMENTO'
009730120713     A                                  2 72TIME
009740120713     A N50                              4  1'Cliente'
009750120713     A  50N85                           4  1'Visita '
009760120713     A  85                              4  1'Trattativa'
009770120713     A N50        V1CKSC         7S 0O  4 12TEXT('Codice Cliente')
009780120713     A                                      DSPATR(RI)
009790120713     A  50N85     V1CNRV         7Y 0O  4 12TEXT('Numero Visita')
009800120713     A                                      DSPATR(RI)
009810120713     A                                      EDTWRD('      / ')
009820120713     A  85        V1CNRVT        7Y 0O  4 12TEXT('Numero Visita')
009830120713     A                                      DSPATR(RI)
009840120713     A                                      EDTCDE(Z)
009850120713     A            V1DKSC        48A  O  4 21TEXT('Ragione Sociale')
009860120713     A                                      DSPATR(RI)
009870120713     A                                  5 21'Codice Tariffa:'
009880120713     A            TAMCTR         3S 0O  5 37TEXT('Codice Tariffa')
009890120713     A            V1DCTR        10A  O  5 42TEXT('Descrizione Codice Tariffa')
009900120713     A            TAMDCV        15A  O  5 53TEXT('Descrizione Codice Tariffa')
009910120713     A                                  6  1'                                  -
009920120713     A                                                                         -
009930120713     A                                                 '
009940120713     A                                      DSPATR(UL)
009950120713     A                                  9 22'CREAZIONE DETTAGLIO TARIFFA CON :'
009960120713     A                                 11 24'Linea Partenza ......:'
009970120713     A            V8CLNN         3Y 0B 11 48TEXT('Linea partenza da creare')
009980120713     A                                      CHECK(RZ)
009990120713     A                                      EDTCDE(Z)
010000120713     A  71                                  DSPATR(PC)
010010120713     A                                 13 24'Codice tassazione .?.:'
010020120713     A            V8CCTN         2A  B 13 48TEXT('Codice tassazione da creare')
010030120713     A  72                                  DSPATR(PC)
010040120713     A                                 16 18'DUPLICANDOLO DAL DETTAGLIO GIA'' E-
010050120713     A                                      SISTENTE :'
010060120713     A                                 18 24'Linea Partenza ......:'
010070120713     A            V8CLNP         3Y 0B 18 48TEXT('Linea partenza da cui copiare-
010080120713     A                                      ')
010090120713     A                                      CHECK(RZ)
010100120713     A                                      EDTCDE(Z)
010110120713     A  73                                  DSPATR(PC)
010120120713     A                                 20 24'Codice tassazione .?.:'
010130120713     A            V8CCTS         2A  B 20 48TEXT('Codice tassazione da cui copi-
010140120713     A                                      are')
010150120713     A  74                                  DSPATR(PC)
010160120713     A                                 22  1'                                  -
010170120713     A                                                                         -
010180120713     A                                                 '
010190120713     A                                      DSPATR(UL)
010200120713     A                                 24  2'F6=Aggiornamento'
010210120713     A                                 24 64'F12=Ritorno'
010220120713     A  23                             24 29'F19=Linee partenza da creare'
010230120713     A  23        LINPAR        25A  O 11 56
010240060116      **-------------------------------------------------------------**
010250041222     A          R TA01S09                   SFL
010260041222     A  22                                  SFLNXTCHG
010270041222     A            TADORP         5A  H
010280041222     A            SAVRPV         3Y 1H
010290041222     A            VS9LNP         3Y 0B  7  5TEXT('Linea Partenza')
010300041222     A  98                                  DSPATR(PC)
010310041222     A                                      EDTCDE(Z)
010320041222     A                                      DUP
010330041222     A                                      CHECK(RZ)
010340041222     A            DESLNP        20A  O  7 10TEXT('Decodifica Codice Tassazione')
010350060116      **-------------------------------------------------------------**
010360041222     A          R TA01C09                   SFLCTL(TA01S09)
010370041222     A                                      CF06
010380041222     A                                      OVERLAY
010390041222     A N26                                  SFLDSP
010400041222     A N26                                  SFLDSPCTL
010410041222     A  26                                  SFLINZ
010420041222     A                                      SFLSIZ(0120)
010430041222     A                                      SFLPAG(0014)
010440041222     A            REC2           4S 0H      SFLRCDNBR
010450120315     A  28        $MSG          78   M
010460041222     A            V1CRSU        20A  O  1  2
010470041222     A            V1CTES        34A  O  1 24DSPATR(RI)
010480041222     A                                      DSPATR(UL)
010490051128     A            V1CPGM        10A  O  1 60
010500051128     A                                  1 72DATE
010510041222     A                                      EDTCDE(Y)
010520041222     A            KNSIF         10A  O  2  2
010530041222     A            KNMUS         10A  O  2 13
010540051128     A                                  2 72TIME
010550041222     A N50                              4  1'Cliente'
010560090916     A  50N85                           4  1'Visita '
010570090916     A  85                              4  1'Trattativa'
010580090916     A N50        V1CKSC         7S 0O  4 12TEXT('Codice Cliente')
010590041222     A                                      DSPATR(RI)
010600090916     A  50N85     V1CNRV         7Y 0O  4 12TEXT('Numero Visita')
010610041222     A                                      DSPATR(RI)
010620041222     A                                      EDTWRD('      / ')
010630090916     A  85        V1CNRVT        7Y 0O  4 12TEXT('Numero Visita')
010640090916     A                                      DSPATR(RI)
010650090917     A                                      EDTCDE(Z)
010660090916     A            V1DKSC        48A  O  4 21TEXT('Ragione Sociale')
010670041222     A                                      DSPATR(RI)
010680100211     A  85                              4 72'VER'
010690100211     A N50                              4 72'PRG'
010700090916     A  85
010710090916     AON50        V1CPRG         3S 0O  4 77TEXT('Progressivo Tariffa')
010720041222     A                                      DSPATR(HI)
010730090916     A                                  5 21'Codice Tariffa'
010740090916     A            TAMCTR         3S 0O  5 37TEXT('Codice Tariffa')
010750090916     A            V1DCTR        10A  O  5 42TEXT('Descrizione Codice Tariffa')
010760090916     A            TAMDCV        15A  O  5 53TEXT('Descrizione Codice Tariffa')
010770041222     A                                  6  5'Par'
010780041222     A                                      DSPATR(UL)
010790041222     A                                      DSPATR(HI)
010800041222     A                                  6 10'DESCRIZIONE  '
010810041222     A                                      DSPATR(UL)
010820041222     A                                      DSPATR(HI)
010830041222     A            VICDIV         3A  O  5 77
010840060116      **-------------------------------------------------------------**
010850041223     A          R TA01Z10
010860041223     A                                      OVERLAY
010870041223     A                                 24  2'F6=Conferma'
010880041223     A                                 24 67'F12=Ritorno'
010890060116      **-------------------------------------------------------------**
010900051108     A          R TA01W11
010910051108     A                                      WINDOW(10 20 7 41)
010920051108     A                                      CF06
010930051108     A                                      OVERLAY
010940051108     A                                  1  2'E'' stato richiesto l''annullament-
010950051108     A                                      o della'
010960051108     A                                      DSPATR(HI)
010970051108     A                                      DSPATR(UL)
010980051108     A            W11TIP         7A  O  2 18DSPATR(HI)
010990051108     A                                      DSPATR(UL)
011000051108     A                                  4  2'Conferma annullamento:'
011010051108     A            W11SINO        2A  B  4 25VALUES('SI' 'NO')
011020051108     A                                  4 28'(SI/NO)'
011030051108     A                                  6  2'F6=Conferma'
011040120315      **-------------------------------------------------------------**
011050120314     A          R TA01W01
011060120314     A*%%TS  SD  20120312  085151  EDPMB       REL-V6R1M0  5761-WDS
011070120314     A                                      OVERLAY
011080120314     A                                      WINDOW(10 2 8 73 *NOMSGLIN)
011090120314     A                                      WDWBORDER((*COLOR PNK))
011100120314     A                                  1 29'Dati Manca Tariffa'
011110120314     A                                      DSPATR(HI)
011120120314     A                                  3  1'Data Spedizione:'
011130120314     A                                      DSPATR(HI)
011140120314     A            W01DSP         8Y 0O  3 18EDTCDE(Y)
011150120314     A                                  3 31'Tipo Bolla:'
011160120314     A                                      DSPATR(HI)
011170120314     A            W01TBL         2A  O  3 43
011180120314     A                                  3 48'LnP:'
011190120314     A                                      DSPATR(HI)
011200120314     A            W01LNP         3S 0O  3 53
011210120314     A                                  3 59'LnA:'
011220120314     A                                      DSPATR(HI)
011230120314     A            W01LNA         3S 0O  3 64
011240120314     A                                  4  1'Cod.Tassazione :'
011250120314     A                                      DSPATR(HI)
011260120314     A            W01PRO         2A  O  4 18
011270120314     A            W01CTS         2A  O  4 22
011280120314     A                                  4 31'Tariffa ..:'
011290120314     A                                      DSPATR(HI)
011300120314     A            W01CTR         3S 0O  4 43
011310120314     A                                  5  1'Colli .........:'
011320120314     A                                      DSPATR(HI)
011330120314     A            W01NCL         5Y 0O  5 18EDTCDE(Z)
011340120314     A                                  5 31'Peso .....:'
011350120314     A                                      DSPATR(HI)
011360120314     A            W01PKF         7Y 1O  5 43EDTWRD('    0 , ')
011370120314     A                                  5 56'Volume:'
011380120314     A                                      DSPATR(HI)
011390120314     A            W01VLF         5Y 3O  5 64EDTWRD('0 ,   ')
011400120314     A                                  8 63'F12=Ritorno'
011410120314     A                                      COLOR(BLU)
011420120314     A            W01ERR        50   O  6 18
011430120314     A                                  6  1'Errore ........:'
011440120314     A                                      DSPATR(HI)
