000001070312     A*%%***********************************************************************
000002070312     A*%%TS  RD  20070312  143051  EDPMB       REL-V5R3M0  5722-WDS
000003070312     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004070312     A*%%FI       0000000000000000000000000000000000000000000000000
000005070312     A*%%***********************************************************************
000006070312     A          R TA52PPP
000007070312     A*%%***********************************************************************
000008070312     A*%%RI 00000
000009070312     A*%%FS 009
000010070312     A*%%***********************************************************************
000011070312     A                                      SKIPB(010)
000012070312     A            BIANCO         1A  O     1
000013070312     A*%%***********************************************************************
000014070312     A*%%SS
000015070312     A*%%***********************************************************************
000016070312     A          R TA52P01
000017070312     A*%%***********************************************************************
000018070312     A*%%RI 00000
000019070312     A*%%***********************************************************************
000020070312     A                                      SPACEB(001)
000021070312     A                                    10
000022070312     A                                      'Filiale di:'
000023070312     A            TD1FIL        20A  O    10
000024070312     A                                      SPACEB(001)
000025070312     A            TD1VIA        25A  O    10
000026070312     A                                      SPACEB(001)
000027070312     A            TD1CAP         5S 0O    10
000028070312     A                                      SPACEB(001)
000029070312     A                                      EDTCDE(Z)
000030070312     A            TD1LOC        25A  O    16
000031070312     A            TD1PRV         2A  O    42
000032070312     A                                    71
000033070312     A                                      'Spett.le'
000034070312     A                                    10
000035070312     A                                      'Tel.'
000036070312     A                                      SPACEB(001)
000037070312     A            TD2TEL        13A  O    15
000038070312     A                                    29
000039070312     A                                      'Fax.'
000040070312     A            TD2TFX        13A  O    34
000041070312     A            PICRAG        48A  O    71
000042070312     A            PICIND        35A  O    71
000043070312     A                                      SPACEB(001)
000044070312     A            PICCAP         9A  O    71
000045070312     A                                      SPACEB(001)
000046070312     A            PICLOC        30A  O    81
000047070312     A            PICPRO         2A  O   112
000048070312     A  70                                10
000049070312     A                                      'Ns.Rif.'
000050070312     A                                      SPACEB(001)
000051070312     A  70        PICNR1         2A  O    18
000052070312     A  70                                21
000053070312     A                                      '/'
000054070312     A  70        PICNR2         2A  O    23
000055070312     A            DESNAR        25A  O    71
000056070312     A  73                                61
000057070312     A                                      'Alla C.A.'
000058070312     A                                      SPACEB(002)
000059070312     A  73        RESPTRA       50A  O    71
000060070312     A  77        RESPTRA2      50A  O    71
000061070312     A                                      SPACEB(001)
000062070312     A                                    10
000063070312     A                                      'Telefonando chiedere del Sig.'
000064070312     A                                      SPACEB(002)
000065070312     A            DESCOM        20A  O    40
000066070312     A            PICDAL        35A  O    10
000067070312     A                                      SPACEB(002)
000068070312     A                                    15
000069070312     A                                      SPACEB(003)
000070070312     A                                      'Oggetto: Assegnazione codice clien-
000071070312     A                                      te'
000072070312     A                                      HIGHLIGHT
000073070312     A                                    15
000074070312     A                                      SPACEB(003)
000075070312     A                                      'Gentile cliente,'
000076070312     A                                    15
000077070312     A                                      SPACEB(002)
000078070312     A                                      'La  ringraziamo per la fiducia  ac-
000079070312     A                                      cordataci con la scelta  di affidar-
000080070312     A                                      ci  la distribuzione  delle sue'
000081070312     A                                    15
000082070312     A                                      SPACEB(001)
000083070312     A                                      'spedizioni.'
000084070312     A                                    15
000085070312     A                                      SPACEB(002)
000086070312     A                                      'Abbiamo il piacere di comunicarle -
000087070312     A                                      che il suo codice cliente identific-
000088070312     A                                      ativo é:'
000089070312     A                                      HIGHLIGHT
000090070312     A            PARSKS         7S 0O    93
000091070312     A                                      HIGHLIGHT
000092070312     A                                    15
000093070312     A                                      SPACEB(002)
000094070312     A                                      'In allegato le inviamo:'
000095070312     A                                    15
000096070312     A                                      SPACEB(002)
000097070312     A                                      'a. la guida sintetica "Istruzioni -
000098070312     A                                      per spedire" in cui potrà trovare t-
000099070312     A                                      utte le informazioni necessarie'
000100070312     A                                      HIGHLIGHT
000101070312     A                                    15
000102070312     A                                      SPACEB(001)
000103070312     A                                      '   per poter utilizzare i servizi -
000104070312     A                                      Bartolini'
000105070312     A                                      HIGHLIGHT
000106070312     A                                    15
000107070312     A                                      SPACEB(001)
000108070312     A                                      'b. organigramma con nominativi e m-
000109070312     A                                      ansioni delle persone da contattare-
000110070312     A                                       per ogni necessità'
000111070312     A                                      HIGHLIGHT
000112070312     A                                    15
000113070312     A                                      SPACEB(002)
000114070312     A                                      'La informiamo che all''interno del-
000115070312     A                                       sito Internet (www.bartolini.it) s-
000116070312     A                                      ono a sua disposizione ulteriori'
000117070312     A                                    15
000118070312     A                                      SPACEB(001)
000119070312     A                                      'informazioni relative ai servizi o-
000120070312     A                                      fferti e al loro utilizzo.'
000121070312     A                                    15
000122070312     A                                      SPACEB(002)
000123070312     A                                      'Le inviamo anche una prima fornitu-
000124070312     A                                      ra di buste porta DDT ed etichette -
000125070312     A                                      per le sue prossime spedizioni.'
000126070312     A                                    15
000127070312     A                                      SPACEB(002)
000128070312     A                                      'Il nostro servizio assistenza clie-
000129070312     A                                      nti è a sua completa  disposizione -
000130070312     A                                      per ogni ulteriore chiarimento.'
000131070312     A                                    15
000132070312     A                                      SPACEB(002)
000133070312     A                                      'Nel ribadire il nostro  impegno pe-
000134070312     A                                      r garantirle i migliori  livelli di-
000135070312     A                                       servizio, cogliamo l''occasione'
000136070312     A                                    15
000137070312     A                                      SPACEB(001)
000138070312     A                                      'per inviarle i nostri più cordiali-
000139070312     A                                       saluti.'
000140070312     A            RSUTOLD       20A  O    71
000141070312     A                                      SPACEB(003)
000142070312     A                                    71
000143070312     A                                      'Filiale di'
000144070312     A                                      SPACEB(001)
000145070312     A            PD1FIL        20A  O    +1
000146070312     A                                    10
000147070312     A                                      SPACEB(009)
000148070312     A                                      'D.LGS 196/2003: il trattamento dei-
000149070312     A                                       dati che Vi riguardano, ai fini di-
000150070312     A                                       iniziative promozionali, viene eff-
000151070312     A                                      ettuato'
000152070312     A                                    10
000153070312     A                                      SPACEB(001)
000154070312     A                                      'nel rispetto della legge, fatti sa-
000155070312     A                                      lvi i diritti di cui all''art. 7'
000156070312     A*%%***********************************************************************
000157070312     A*%%SS
000158070312     A*%%CL 001
000159070312     A*%%CL 001
000160070312     A*%%CL 001
000161070312     A*%%CL 001
000162070312     A*%%CL 001
000163070312     A*%%CL 001
000164070312     A*%%CL 001
000165070312     A*%%CL 002
000166070312     A*%%CL 001
000167070312     A*%%CL 002
000168070312     A*%%CL 002
000169070312     A*%%CL 003
000170070312     A*%%CL 003
000171070312     A*%%CL 002
000172070312     A*%%CL 001
000173070312     A*%%CL 002
000174070312     A*%%CL 002
000175070312     A*%%CL 002
000176070312     A*%%CL 001
000177070312     A*%%CL 001
000178070312     A*%%CL 002
000179070312     A*%%CL 001
000180070312     A*%%CL 002
000181070312     A*%%CL 002
000182070312     A*%%CL 002
000183070312     A*%%CL 001
000184070312     A*%%CL 003
000185070312     A*%%CL 001
000186070312     A*%%CL 009
000187070312     A*%%CL 001
000188070312     A*%%FL 001
000189070312     A*%%CP+999CRTPRTF
000190070312     A*%%CP+    FILE(GAITRAFIL/TNTA52P)
000191070312     A*%%CP+    DEVTYPE(*SCS)
000192070312     A*%%CP+    PAGESIZE(*N 124)
000193070312     A*%%CP+    CPI(16,7)
000194070312     A*%%CP     OVRFLW(65)
000195070312     A*%%CS+999CRTPRTF
000196070312     A*%%CS+    FILE(QTEMP/QPRDRPT)
000197070312     A*%%CS+    DEVTYPE(*SCS)
000198070312     A*%%CS     PAGESIZE(*N 132)
000199070312     A*%%***********************************************************************
