000100040917      *--------------------------------------------------------------*
000200040917      *  DS PER PGM DI STAMPA TARIFFE GIACENZE
000300040917      *--------------------------------------------------------------*
000400040917     A                                      REF(CNDIZION)
000500040917     A          R D23REC                    TEXT('DS X STP.TARIFFE GIACENZE')
000600040917      *********************************
000700040917      * C A M P  I   D I    I N P U T
000800040917      *********************************
000900040917      *
001000041012     A            D23FIL         3S 0       TEXT('PUNTO OPERATIVO')
001100041012     A            D23DPO        20A         TEXT('DECODIFICA P.O.')
001200040917     A            D23TCM         1A         TEXT('TIPO COM. MITTENTE')
001300040920     A            D23DCM        20A         TEXT('DECODIFICA TIPO COM.MITTENTE')
001400040917     A            D23TFG         1A         TEXT('TIPO COM. FINE GIAC.')
001500040920     A            D23DFG        20A         TEXT('DECOD. TIPO COM FINE GIACENZ')
001600041012     A            D23ABI         2A         TEXT('ABILITAZIONE UTENTE')
001700041012     A            D23CDI         1A         TEXT('DISTRETTO')
001800041012     A            D23CAR         3S 0       TEXT('AREA')
001900041012     A            D23CPO         3S 0       TEXT('P.O. UTENTE')
002000041012     A            D23KCI         4S 0       TEXT('CAPOCONTO CLIENTE')
002100041012     A            D23RSU        20A         TEXT('RAGIONE SOCILAE')
002200041012     A            D23FEL         3S 0       TEXT('SIMFEL')
002300041029     A            D23DPC         1A         TEXT('STAMPA DIFF. DA P.D.C.')
