000100040917      *--------------------------------------------------------------*
000200040917      *  DS PER PGM DI STAMPA TARIFFE GIACENZE
000300040917      *--------------------------------------------------------------*
000400040917     A                                      REF(CNDIZION)
000500040917     A          R D23REC                    TEXT('DS X STP.TARIFFE GIACENZE')
000600040917      *********************************
000700040917      * C A M P  I   D I    I N P U T
000800040917      *********************************
000900040917      *
001000040917     A            D23POG         3S 0       TEXT('P.O. GESTIONE')
001100040920     A            D23DPG        20A         TEXT('DECODIFICA P.O. GESTIONE')
001200040917     A            D23TCM         1A         TEXT('TIPO COM. MITTENTE')
001300040920     A            D23DCM        20A         TEXT('DECODIFICA TIPO COM.MITTENTE')
001400040917     A            D23TFG         1A         TEXT('TIPO COM. FINE GIAC.')
001500040920     A            D23DFG        20A         TEXT('DECOD. TIPO COM FINE GIACENZ')
