000001060324     A*%%***********************************************************************
000002060324     A*%%TS  RD  20060324  102921  EDPMB       REL-V5R3M0  5722-WDS
000003060324     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004060324     A*%%FI       0000000000000000000000000000000000000000000000000
000005060324     A*%%***********************************************************************
000006060324     A*  STATO AVANZAMENTO PROGETTO AC BASE
000007060324     A*
000008060324     A*
000009060324      * ?  S E L E Z I O N I  D I  S T A M P A  ?
000010060324     A          R TA58S1
000011060324     A*%%***********************************************************************
000012060324     A*%%RI 00000
000013060324     A*%%FS 001
000014060324     A*%%***********************************************************************
000015060324     A                                      SKIPB(002)
000016060324     A                                      SPACEA(002)
000017060324     A            RSUT          20A        1
000018060324     A            KNSIF     R             22
000019060324     A                                      REFFLD(KNSIF KPJBA)
000020060324     A            KNMUS     R             33
000021060324     A                                      REFFLD(KNMUS KPJBA)
000022060324     A                                    72
000023060324     A                                      'STATO AVANZAMENTO PROGETTO AC BASE'
000024060324     A                                   141
000025060324     A                                      'TNTA58R'
000026060324     A            WDATA          8S 0    156
000027060324     A                                      EDTWRD('  /  /    ')
000028060324     A            WORA           6S 0    169
000029060324     A                                      EDTWRD('  :  :  ')
000030060324     A                                   181
000031060324     A                                      'PAG.'
000032060324     A                                   186
000033060324     A                                      PAGNBR
000034060324     A                                      EDTCDE(Z)
000035060324     A                                     1
000036060324     A                                      'S E L E Z I O N I'
000037060324     A                                      SPACEB(003)
000038060324     A                                     1
000039060324     A                                      'Punto Operativo ..................-
000040060324     A                                      ........:'
000041060324     A                                      SPACEB(002)
000042060324     A            PARFIL         3S 0O    +1
000043060324     A            DESFIL        20A  O    +1
000044060324     A  46                                 1
000045060324     A                                      'Aree .............................-
000046060324     A                                      ........:'
000047060324     A                                      SPACEB(001)
000048060324     A  46        PARCAR01       3A  O    +1
000049060324     A  46        PARCAR02       3A  O    +1
000050060324     A  46        PARCAR03       3A  O    +1
000051060324     A  46        PARCAR04       3A  O    +1
000052060324     A  46        PARCAR05       3A  O    +1
000053060324     A  46        PARCAR06       3A  O    +1
000054060324     A  46        PARCAR07       3A  O    +1
000055060324     A  46        PARCAR08       3A  O    +1
000056060324     A  46        PARCAR09       3A  O    +1
000057060324     A  46        PARCAR10       3A  O    +1
000058060324     A                                     1
000059060324     A                                      'Sottoscrizione AC BASE ...........-
000060060324     A                                      ........:'
000061060324     A                                      SPACEB(001)
000062060324     A            PARSC01        1A  O    +1
000063060324     A                                     1
000064060324     A                                      'Rinuncia AC BASE .................-
000065060324     A                                      ........:'
000066060324     A                                      SPACEB(001)
000067060324     A            PARSC02        1A  O    +1
000068060324     A                                     1
000069060324     A                                      'Nessuna risposta .................-
000070060324     A                                      ........:'
000071060324     A                                      SPACEB(001)
000072060324     A            PARSC03        1A  O    +1
000073060324     A                                     1
000074060324     A                                      'Discordanza tra cat.cliente e imp.-
000075060324     A                                       AC BASE:'
000076060324     A                                      SPACEB(001)
000077060324     A            PARSC05        1A  O    +1
000078060324     A  12                                 1
000079060324     A                                      'Tipo elaborazione ................-
000080060324     A                                      ........:'
000081060324     A                                      SPACEB(001)
000082060324     A  12        PARFILE        1A  O    +1
000083060324     A  12                                +1
000084060324     A                                      '(S=Stampa F=File E=Entrambi)'
000085060324     A                                     1
000086060324     A                                      'Sono escluse dall''elaborazione:'
000087060324     A                                      SPACEB(006)
000088060324     A                                    32
000089060324     A                                      '- Tariffe DPD, FEDEX ed EuroExpres-
000090060324     A                                      s'
000091060324     A                                      SPACEB(001)
000092060324     A                                    32
000093060324     A                                      '- Tariffe bloccate'
000094060324     A                                      SPACEB(001)
000095060324     A                                    32
000096060324     A                                      '- Tariffe di clienti bloccati'
000097060324     A                                      SPACEB(001)
000098060324     A                                    32
000099060324     A                                      '- Tariffe di clienti p.o. Posta'
000100060324     A                                      SPACEB(001)
000101060324     A                                    32
000102060324     A                                      '- Tariffe di clienti p.o. DPD ed E-
000103060324     A                                      uroExpress'
000104060324     A                                      SPACEB(001)
000105060324     A                                    32
000106060324     A                                      '- Clienti che non hanno spedizioni-
000107060324     A                                       fatturate dopo il 31/12/2004'
000108060324     A                                      SPACEB(001)
000109060324     A                                    34
000110060324     A                                      '(i clienti senza spedizioni fattur-
000111060324     A                                      are sono inclusi)'
000112060324     A                                      SPACEB(001)
000113060324     A*%%***********************************************************************
000114060324     A*%%SS
000115060324     A*%%CL 003
000116060324     A*%%CL 002
000117060324     A*%%CL 001
000118060324     A*%%CL 001
000119060324     A*%%CL 001
000120060324     A*%%CL 001
000121060324     A*%%CL 001
000122060324     A*%%CL 001
000123060324     A*%%CL 006
000124060324     A*%%CL 001
000125060324     A*%%CL 001
000126060324     A*%%CL 001
000127060324     A*%%CL 001
000128060324     A*%%CL 001
000129060324     A*%%CL 001
000130060324     A*%%CL 001
000131060324     A*%%CL 002
000132060324     A*%%***********************************************************************
000133060324     A*
000134060324      * ?  T E S T A T A    D I    S T A M P A  ?
000135060324     A          R TA58T1
000136060324     A*%%***********************************************************************
000137060324     A*%%RI 00000
000138060324     A*%%FS 001
000139060324     A*%%***********************************************************************
000140060324     A                                      SKIPB(002)
000141060324     A                                      SPACEA(001)
000142060324     A            RSUT          20A        1
000143060324     A            KNSIF     R             22
000144060324     A                                      REFFLD(KNSIF KPJBA)
000145060324     A            KNMUS     R             33
000146060324     A                                      REFFLD(KNMUS KPJBA)
000147060324     A                                    72
000148060324     A                                      'STATO AVANZAMENTO PROGETTO AC BASE'
000149060324     A                                   141
000150060324     A                                      'TNTA58R'
000151060324     A            WDATA          8S 0    155
000152060324     A                                      EDTWRD('  /  /    ')
000153060324     A            WORA           6S 0    169
000154060324     A                                      EDTWRD('  :  :  ')
000155060324     A                                   181
000156060324     A                                      'PAG.'
000157060324     A                                   186
000158060324     A                                      PAGNBR
000159060324     A                                      EDTCDE(Z)
000160060324     A*%%***********************************************************************
000161060324     A*%%SS
000162060324     A*%%CL 001
000163060324     A*%%***********************************************************************
000164060324     A          R TA58T2
000165060324     A*%%***********************************************************************
000166060324     A*%%RI 00000
000167060324     A*%%***********************************************************************
000168060324     A                                      SPACEB(001)
000169060324     A                                     1
000170060324     A                                      'Distretto'
000171060324     A            PDIS           1A  O    11
000172060324     A            PDESDIS       20A  O    13
000173060324     A                                    36
000174060324     A                                      'Area'
000175060324     A            PCAR           3S 0O    41
000176060324     A            PDESCAR       20A  O    45
000177060324     A                                    +3
000178060324     A                                      'P.O.'
000179060324     A            PFIL           3  0     73
000180060324     A            PDESFIL       20        77
000181060324     A*%%***********************************************************************
000182060324     A*%%SS
000183060324     A*%%***********************************************************************
000184060324     A          R TA58T3
000185060324     A*%%***********************************************************************
000186060324     A*%%RI 00000
000187060324     A*%%FS 001
000188060324     A*%%***********************************************************************
000189060324     A                                      SPACEB(002)
000190060324     A                                    87
000191060324     A                                      '* --Tariffa-- *'
000192060324     A                                   111
000193060324     A                                      '* ----------------- A C  B A S E --
000194060324     A                                      ---------------- *'
000195060324     A                                   171
000196060324     A                                      '* A C  P L U S *'
000197060324     A                                   172
000198060324     A                                      'Completa'
000199060324     A                                      SPACEB(001)
000200060324     A                                   183
000201060324     A                                      'Val'
000202060324     A                                     2
000203060324     A                                      'Cliente'
000204060324     A                                   +51
000205060324     A                                      'Telefono'
000206060324     A                                    78
000207060324     A                                      'Cat'
000208060324     A                                    87
000209060324     A                                      'Cod'
000210060324     A                                    93
000211060324     A                                      'Prg'
000212060324     A                                    99
000213060324     A                                      'Val'
000214060324     A                                   111
000215060324     A                                      'Risposta'
000216060324     A                                   121
000217060324     A                                      'Rifiuta'
000218060324     A                                   130
000219060324     A                                      'Presente'
000220060324     A                                   143
000221060324     A                                      'Importo'
000222060324     A                                   152
000223060324     A                                      'Discordanza'
000224060324     A                                     2
000225060324     A                                      '-----------------------------------
000226060324     A                                      ------------------------------------
000227060324     A                                      ------------------------------------
000228060324     A                                      ------------------------------------
000229060324     A                                      ------------------------------------
000230060324     A                                      ----------------'
000231060324     A                                      SPACEB(001)
000232060324     A*%%***********************************************************************
000233060324     A*%%SS
000234060324     A*%%CL 001
000235060324     A*%%CL 001
000236060324     A*%%***********************************************************************
000237060324     A          R TA58T4
000238060324     A*%%***********************************************************************
000239060324     A*%%RI 00000
000240060324     A*%%FS 001
000241060324     A*%%***********************************************************************
000242060324     A                                      SPACEB(002)
000243060324     A                                     1
000244060324     A                                      'Commerciale'
000245060324     A            PCMM           7S  O    +1
000246060324     A            PDESCMM       20A  O    +1
000247060324     A*%%***********************************************************************
000248060324     A*%%SS
000249060324     A*%%***********************************************************************
000250060324     A          R TA58D1
000251060324     A*%%***********************************************************************
000252060324     A*%%RI 00000
000253060324     A*%%***********************************************************************
000254060324     A                                      SPACEB(001)
000255060324     A            TACKSC         7S 0      2
000256060324     A            PRAG          48A  O    +1
000257060324     A            TACTEL        16A  O    59
000258060324     A            TACCLV         1A  O    79
000259060324     A            TACCTR         3S  O    87
000260060324     A            TACPRG         3S  O    93
000261060324     A                                      EDTWRD(' 0 ')
000262060324     A            PBAP           3A  O    99
000263060324     A            PRISP          2A  O   114
000264060324     A            PFMP           2A  O   123
000265060324     A            PACB           2A  O   132
000266060324     A            PITR          11S 3O   138
000267060324     A                                      EDTCDE(4)
000268060324     A            PDISC          2A  O   155
000269060324     A            PACP           2A  O   174
000270060324     A            PAPL           3A  O   183
000271060324     A*%%***********************************************************************
000272060324     A*%%SS
000273060324     A*%%***********************************************************************
000274060324     A          R TA58TF1
000275060324     A*%%***********************************************************************
000276060324     A*%%RI 00000
000277060324     A*%%FS 001
000278060324     A*%%***********************************************************************
000279060324     A                                      SPACEB(002)
000280060324     A                                     2
000281060324     A                                      '-----------------------------------
000282060324     A                                      ------------------------------------
000283060324     A                                      ------------------------------------
000284060324     A                                      -----========--=======--========----
000285060324     A                                      -----------===========---------====-
000286060324     A                                      ====------------'
000287060324     A                                     2
000288060324     A                                      'Totale P.O......:'
000289060324     A                                      SPACEB(001)
000290060324     A            PFIL           3S  O    +1
000291060324     A            PDESFIL       20A  O    +1
000292060324     A                                    +3
000293060324     A                                      'Clienti:'
000294060324     A            PTFKSC         5S  O    +1
000295060324     A                                      EDTCDE(4)
000296060324     A                                    +3
000297060324     A                                      'Tariffe:'
000298060324     A            PTFCTR         5S  O    +1
000299060324     A                                      EDTCDE(4)
000300060324     A            PTFRISP        5S  O   +35
000301060324     A                                      EDTCDE(4)
000302060324     A            PTFFMP         5S  O    +4
000303060324     A                                      EDTCDE(4)
000304060324     A            PTFACB         5S  O    +4
000305060324     A                                      EDTCDE(4)
000306060324     A            PTFDISC        5S  O   +18
000307060324     A                                      EDTCDE(4)
000308060324     A            PTFACP         5S  O   +14
000309060324     A                                      EDTCDE(4)
000310060324     A*%%***********************************************************************
000311060324     A*%%SS
000312060324     A*%%CL 001
000313060324     A*%%***********************************************************************
000314060324     A          R TA58TC1
000315060324     A*%%***********************************************************************
000316060324     A*%%RI 00000
000317060324     A*%%FS 001
000318060324     A*%%***********************************************************************
000319060324     A                                      SPACEB(002)
000320060324     A                                     2
000321060324     A                                      '-----------------------------------
000322060324     A                                      ------------------------------------
000323060324     A                                      ------------------------------------
000324060324     A                                      -----========--=======--========----
000325060324     A                                      -----------===========---------====-
000326060324     A                                      ====------------'
000327060324     A                                     2
000328060324     A                                      'Totale Area.....:'
000329060324     A                                      SPACEB(001)
000330060324     A            PCAR           3S  O    +1
000331060324     A            PDESCAR       20A  O    +1
000332060324     A                                    +3
000333060324     A                                      'Clienti:'
000334060324     A            PTCKSC         5S  O    +1
000335060324     A                                      EDTCDE(4)
000336060324     A                                    +3
000337060324     A                                      'Tariffe:'
000338060324     A            PTCCTR         5S  O    +1
000339060324     A                                      EDTCDE(4)
000340060324     A            PTCRISP        5S  O   +35
000341060324     A                                      EDTCDE(4)
000342060324     A            PTCFMP         5S  O    +4
000343060324     A                                      EDTCDE(4)
000344060324     A            PTCACB         5S  O    +4
000345060324     A                                      EDTCDE(4)
000346060324     A            PTCDISC        5S  O   +18
000347060324     A                                      EDTCDE(4)
000348060324     A            PTCACP         5S  O   +14
000349060324     A                                      EDTCDE(4)
000350060324     A*%%***********************************************************************
000351060324     A*%%SS
000352060324     A*%%CL 001
000353060324     A*%%***********************************************************************
000354060324     A          R TA58TD1
000355060324     A*%%***********************************************************************
000356060324     A*%%RI 00000
000357060324     A*%%FS 001
000358060324     A*%%***********************************************************************
000359060324     A                                      SPACEB(002)
000360060324     A                                     2
000361060324     A                                      '-----------------------------------
000362060324     A                                      ------------------------------------
000363060324     A                                      ------------------------------------
000364060324     A                                      -----========--=======--========----
000365060324     A                                      -----------===========---------====-
000366060324     A                                      ====------------'
000367060324     A                                     2
000368060324     A                                      'Totale Distretto:'
000369060324     A                                      SPACEB(001)
000370060324     A            PDIS           1A  O    +2
000371060324     A            PDESDIS       20A  O    +2
000372060324     A                                    +3
000373060324     A                                      'Clienti:'
000374060324     A            PTDKSC         5S  O    +1
000375060324     A                                      EDTCDE(4)
000376060324     A                                    +3
000377060324     A                                      'Tariffe:'
000378060324     A            PTDCTR         5S  O    +1
000379060324     A                                      EDTCDE(4)
000380060324     A            PTDRISP        5S  O   +35
000381060324     A                                      EDTCDE(4)
000382060324     A            PTDFMP         5S  O    +4
000383060324     A                                      EDTCDE(4)
000384060324     A            PTDACB         5S  O    +4
000385060324     A                                      EDTCDE(4)
000386060324     A            PTDDISC        5S  O   +18
000387060324     A                                      EDTCDE(4)
000388060324     A            PTDACP         5S  O   +14
000389060324     A                                      EDTCDE(4)
000390060324     A*%%***********************************************************************
000391060324     A*%%SS
000392060324     A*%%CL 001
000393060324     A*%%***********************************************************************
000394060324     A          R TA58TT
000395060324     A*%%***********************************************************************
000396060324     A*%%RI 00000
000397060324     A*%%FS 001
000398060324     A*%%***********************************************************************
000399060324     A                                      SPACEB(002)
000400060324     A                                     2
000401060324     A                                      '-----------------------------------
000402060324     A                                      ------------------------------------
000403060324     A                                      ------------------------------------
000404060324     A                                      -----========--=======--========----
000405060324     A                                      -----------===========---------====-
000406060324     A                                      ====------------'
000407060324     A                                     2
000408060324     A                                      'Totale Generale:'
000409060324     A                                      SPACEB(001)
000410060324     A                                   +29
000411060324     A                                      'Clienti:'
000412060324     A            TKSC           5S  O    +1
000413060324     A                                      EDTCDE(4)
000414060324     A                                    +3
000415060324     A                                      'Tariffe:'
000416060324     A            TCTR           5S  O    +1
000417060324     A                                      EDTCDE(4)
000418060324     A            TRISP          5S  O   +35
000419060324     A                                      EDTCDE(4)
000420060324     A            TFMP           5S  O    +4
000421060324     A                                      EDTCDE(4)
000422060324     A            TACB           5S  O    +4
000423060324     A                                      EDTCDE(4)
000424060324     A            TDISC          5S  O   +18
000425060324     A                                      EDTCDE(4)
000426060324     A            TACP           5S  O   +14
000427060324     A                                      EDTCDE(4)
000428060324     A*%%***********************************************************************
000429060324     A*%%SS
000430060324     A*%%CL 001
000431060324     A*%%***********************************************************************
000432060324      * ?  F I N E    S T A M P A  ?
000433060324     A          R TA58E1
000434060324     A*%%***********************************************************************
000435060324     A*%%RI 00000
000436060324     A*%%FS 003
000437060324     A*%%***********************************************************************
000438060324     A                                      SPACEB(004)
000439060324     A                                    52
000440060324     A                                      '***   FINE  STAMPA   ***'
000441060324     A*%%***********************************************************************
000442060324     A*%%SS
000443060324     A*%%CP+999CRTPRTF
000444060324     A*%%CP+    FILE(GAITRAFIL/TNTA58P)
000445060324     A*%%CP+    DEVTYPE(*SCS)
000446060324     A*%%CP+    PAGESIZE(*N 192)
000447060324     A*%%CP+    CPI(15)
000448060324     A*%%CP     OVRFLW(60)
000449060324     A*%%CS+999CRTPRTF
000450060324     A*%%CS+    FILE(QTEMP/QPRDRPT)
000451060324     A*%%CS+    DEVTYPE(*SCS)
000452060324     A*%%CS     PAGESIZE(*N 198)
000453060324     A*%%***********************************************************************
