000100941013     A          R FNLG45                    TEXT('PARAMETRI RICERCA PERIODI.')
000200931125     A*
000300941013     A            D45PAA         2S 0       TEXT('ANNO PERIODO STAT.GIACENZE')
000400941013     A            D45PRD         2S 0       TEXT('PERIODO STATICHE GIACENZE')
000500941013     A            D45CMD         1          TEXT('3=RITORNO PGM.CHIAMANTE SENZ-
000600931125     A                                           A NESSUNA SELEZIONE')
