000100940913     A*--------------------------------------------------------------*
000200050513     A*  DS per definizione parametri da passare X FNLG10R/FNLG20R   *
000300940913     A*--------------------------------------------------------------*
000400940919     A          R FNLG82
000500940913     A*
000600940919     A            D82GES         1A         TEXT('GESTIONE: P=PARTENZE, A=ARRIV+
000700940919     A                                      I')
000800940928     A            D82GIA         1A         TEXT('GIACENZA: S=SI, N=NO')
000900940928     A            D82MOB        10A         TEXT('MODULO BOLLE')
001000940928     A            D82PRB        10A         TEXT('PRINTER BOLLE')
001100940928     A            D82MOE        10A         TEXT('MODULO ETICH.')
001200940928     A            D82PRE        10A         TEXT('PRINTER ETICH.')
001300940928     A            D82AGC         4A         TEXT('Anno di apertura giacenza')
001400940928     A            D82FGC         3A         TEXT('Filiale di apertura giacenza')
001500940928     A            D82NGC         7A         TEXT('Numero di apertura giacenza')
001600990628     A            D82FRG         2A         TEXT('Proggr. apertura giacenza')
001700940928     A            D82AAS         4A         TEXT('Anno Spedizione ')
001800940928     A            D82LNP         3A         TEXT('Linea Partenza  ')
001900940928     A            D82NRS         2A         TEXT('Nr. Serie  ')
002000940928     A            D82NSP         7A         TEXT('Nr. Spedizione  ')
002100940928     A            D82DIS         1A         TEXT('DISPOSIZIONI')
002200941005     A            D82TRI         1A         TEXT('Tipo richiamo: D=Immiss.dispo-
002300941005     A                                      sizioni/C=Esecuz.')
002400941005     A            D82F12         1A         TEXT('1=Premuto F12')
002500941215     A            D82FGS         3A         TEXT('Filiale in Gestione')
002600941221     A            D82PSS        10A         TEXT('PGM ST.SEGNACOLLI.')
002700030715      * BOLLE SU STAMPANTE LASER
002800030715     A            D82MDB4       10A         TEXT('MODULO STAMPA LDV SU A4')
002900030715     A            D82MDB5       10A         TEXT('MODULO STAMPA LDV SU A5')
003000030715     A            D82BSL         1A         TEXT('"S"=STAMPA LDV SU LASER')
003100030715     A            D82PSL        10A         TEXT('PGM PER STAMPA LDV')
003200030715     A            D82PRB4       10A         TEXT('STAMPANTE PER LDV SU A4')
003300030715     A            D82PRB5       10A         TEXT('STAMPANTE PER LDV SU A5')
003400050316     A            D82COMM        1A         TEXT('ESECUZIONE COMMIT')
003500050513     A            D82NODSP       1A         TEXT('ESECUZIONE PGM SENZA EMISSION-
003600050513     A                                      E DELLE VIDEATE NEI PGM CHIAMATI ')
003700050527     A            D82NTAUT       1A         TEXT('INSERIMENTO NOTA FORZATO ')
003800060329     A            D82MOTR        1A         TEXT('GESTIONE MOTIVI A RISCHIO')
003900060403     A            D82FSPE        1A         TEXT('FORZA SPESE IN CONFERMA APE-
004000060403     A                                      RTURA IN PARTENZA ')
