000010170511     A*%%TS  SD  20170511  092922  EDPAB       REL-V7R2M0  5770-WDS
000020970526     A*-------------------------------------------------------------------------
000030170511     A*%%EC
000040170511     A                                      DSPSIZ(24 80 *DS3)
000050170511     A                                      CHGINPDFT(HI CS)
000060170511     A                                      PRINT
000070170511     A                                      CF01
000080170511     A                                      CF02
000090170511     A                                      CF03
000100170511     A                                      CF04
000110170511     A                                      CF05
000120170511     A                                      CF06
000130170511     A                                      CF07
000140170511     A                                      CF08
000150170511     A                                      CF09
000160170511     A                                      CF10
000170170511     A                                      CF11
000180170511     A                                      CF12
000190170511     A                                      CF13
000200170511     A                                      CF14
000210170511     A                                      CF15
000220170511     A                                      CF16
000230170511     A                                      CF17
000240170511     A                                      CF18
000250170511     A                                      CF19
000260170511     A                                      CF20
000270170511     A                                      CF21
000280170511     A                                      CF22
000290170511     A                                      CF23
000300170511     A                                      CF24
000310170511     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330170510     A          R LGI2D01
000340170510     A*%%TS  SD  20170510  123420  EDPAB       REL-V7R2M0  5770-WDS
000350170510     A                                      TEXT('Testata')
000360170510     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370170510     A                                  1 24'* STATISTICA GIACENZE:colli in IMA-
000380170510     A                                      *'
000390170510     A                                      DSPATR(RI)
000400170510     A                                      DSPATR(UL)
000410170510     A                                  1 61'FNLGI2R'
000420170510     A                                  1 71DATE
000430170510     A                                      EDTCDE(Y)
000440170510     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000450170510     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000460170510     A                                  2 71TIME
000470970526     A*-------------------------------------------------------------------------
000480170510     A          R LGI2D02
000490970526     A                                      OVERLAY
000500970526     A            FUN001        19A  O 22  2
000510970526     A            FUN002        19A  O 22 22
000520970526     A            FUN003        19A  O 22 42
000530970526     A            FUN004        19A  O 22 62
000540970526     A            FUN005        19A  O 23  2
000550970526     A            FUN006        19A  O 23 22
000560970526     A            FUN007        19A  O 23 42
000570970526     A            FUN008        19A  O 23 62
000580970526     A*-------------------------------------------------------------------------
000590170511     A          R LGI2D03
000600170511     A*%%TS  SD  20170511  092922  EDPAB       REL-V7R2M0  5770-WDS
000610170511     A                                      CHGINPDFT
000620170511     A                                      OVERLAY
000630170511     A                                  7  2'SELEZIONI'
000640170511     A                                      DSPATR(HI)
000650170511     A                                  8  2'Periodo   dal - al ......:'
000660170511     A            VIDDAL         8Y 0B  8 29EDTWRD('  /  /    ')
000670170511     A N83                                  DSPATR(CS)
000680170511     A N83                                  DSPATR(HI)
000690170511     A  83                                  DSPATR(PC)
000700170511     A  83                                  DSPATR(RI)
000710170511     A                                  8 41'a'
000720170511     A            VIDAL          8Y 0B  8 44EDTWRD('  /  /    ')
000730170511     A N84                                  DSPATR(CS)
000740170511     A N84                                  DSPATR(HI)
000750170511     A  84                                  DSPATR(PC)
000760170511     A  84                                  DSPATR(RI)
000770170511     A                                  8 59'(gg/mm/anno)'
000780170511     A                                 15  5'>> Vengono ri-generati i dati del -
000790170511     A                                      periodo sul file TNIMAG0F <<'
000800170502     A*-------------------------------------------------------------------------
000810970526     A*-------------------------------------------------------------------------
000820170510     A          R LGI2DMS                   SFL
000830970526     A                                      SFLMSGRCD(24)
000840970526     A            MSGKEY                    SFLMSGKEY
000850970526     A            MSGQUE                    SFLPGMQ
000860970526     A*-------------------------------------------------------------------------
000870170510     A          R LGI2DMC                   SFLCTL(LGI2DMS)
000880970526     A                                      OVERLAY
000890970526     A                                      SFLDSP
000900970526     A  40                                  SFLCLR
000910970526     A                                      SFLSIZ(0002)
000920970526     A                                      SFLPAG(0001)
