000100051005     A                                      REF(ANDIZ00F)
000200051005     A          R FNLG9640S
000300051005     A                                      TEXT('Log ricezione disposizioni-
000400051005     A                                       giac.: dettaglio.')
000500051005     A            TASTO          1
000600051005     A                                      TEXT('Tasto funzionale di uscita.')
000700051005     A            ESITO          1
000800051005     A                                      TEXT('Esito.')
000900051005     A            AGC       R     S
001000051005     A                                      REFFLD($AAA CNDIZION)
001100051005     A                                      TEXT('Id giacenza: anno.')
001200051005     A                                      COLHDG('Id' 'giacenza' 'anno')
001300051005     A                                      EDTCDE(Z)
001400051005     A            FGC       R     S
001500051005     A                                      REFFLD($FIL CNDIZION)
001600051005     A                                      TEXT('Id giacenza: PO.')
001700051005     A                                      COLHDG('Id' 'giacenza' 'PO')
001800051005     A                                      EDTCDE(Z)
001900051005     A            NGC       R     S
002000051005     A                                      REFFLD($NGC CNDIZION)
002100051005     A                                      TEXT('Id giacenza: numero.')
002200051005     A                                      COLHDG('Id' 'giacenza' 'numero')
002300051005     A                                      EDTCDE(Z)
002400051005     A            AAS       R     S
002500051005     A                                      REFFLD($AAS CNDIZION)
002600051005     A                                      TEXT('Id spedizione: anno.')
002700051005     A                                      COLHDG('Id' 'spedizione' 'anno')
002800051005     A                                      EDTCDE(Z)
002900051005     A            LNP       R     S
003000051005     A                                      REFFLD($LNP CNDIZION)
003100051005     A                                      TEXT('Id spedizione: PO.')
003200051005     A                                      COLHDG('Id' 'spedizione' 'PO')
003300051005     A                                      EDTCDE(Z)
003400051005     A            NRS       R     S
003500051005     A                                      REFFLD($NRS CNDIZION)
003600051005     A                                      TEXT('Id spedizione: serie.')
003700051005     A                                      COLHDG('Id' 'spedizione' 'serie')
003800051005     A                                      EDTCDE(Z)
003900051005     A            NSP       R     S
004000051005     A                                      REFFLD($NSP CNDIZION)
004100051005     A                                      TEXT('Id spedizione: numero.')
004200051005     A                                      COLHDG('Id' 'spedizione' 'numero')
004300051005     A                                      EDTCDE(Z)
