000100941013     A          R FNLG44                    TEXT('PARAMETRI RICERCA PERIODI.')
000200931125     A*
000300941013     A            D44DT1         8S 0       TEXT('DATA INIZIO PERIODO')
000400941013     A            D44DT2         8S 0       TEXT('DATA FINE PERIODO')
000500941013     A            D44AA          4S 0       TEXT('ANNO')
000600941013     A            D44PER         2S 0       TEXT('PERIODO')
000700941013     A            D44FIL         3S 0       TEXT('FILIALE')
