000100160826     A          R LG28DS
000200160826      *
000300160826      *  BOLLA GENERATA DA UNA DPD X CREARE SCAN 06 DI DIROTTAMENTO
000400160826     A            I28AAS         4S 0       TEXT('ANNO SPEDIZIONE')
000500160826     A            I28LNP         3S 0       TEXT('LINEA PARTENZA')
000600160826     A            I28NRS         2S 0       TEXT('SERIE')
000700160826     A            I28NSP         7S 0       TEXT('NR.SPEDIZIONE')
000800160826     A            I28LNA         3S 0       TEXT('LINEA ARRIVO')
000900160826      *
