000100120928     A          R FNLG56                    TEXT('PARAMETRI ESTRAZIONE')
000200121218     A            D57KSC         7S 0       TEXT('CODICE CLIENTE')
000300121219     A            D57NRS         2S 0       TEXT('NUMERO SERIE')
000400121218     A            D57DATAD       8S 0       TEXT('DATA CHIUSURA DA')
000500121218     A            D57DATAA       8S 0       TEXT('DATA CHIUSURA A')
000600121218     A            D57FIL         3S 0       TEXT('FILIALE APERTURA GIACENZA')
