000100900418     H DECEDIT('0,') DATEDIT(*DMY.)
000200010507      * FNLGZ5R *----------------------------------------------------*
000300010507      *                                                              *
000400010507      *        - PULIZIE ARCHIVI GIACENZE partenza                   *
000500010507      *                                                              *
000600010507      *--------------------------------------------------------------*
000700010411     FFIGCp01L  UF   E           K DISK
000800010411     FFIGNp01L  UF   E           K DISK
000900010411     FFIGAp01L  UF   E           K DISK
001000941021     D*--------------------------------------------------------------*
001100900626     D UTEDSE        E DS                  EXTNAME(UT§DSE0F)
001200900710     D CNCR80        E DS
001300010507     D fnlgz5ds      E DS
001400010411     d primo           s              1    inz
001500941019     I*--------------------------------------------------------------*
001600010411     C     kgcp          setll     FIGCp01L
001700010411     c                   do        *hival
001800010411     C     kgcp          reade     FIGCp01L                               99
001900010411     c   99              leave
002000010411     c                   if        primo = *blank
002100010411     c                   exsr      note
002200010411     c                   exsr      anagra
002300010411     c                   move      'X'           primo
002400010411     c                   endif
002500010411     c                   delete    figcp000
002600010411     c                   enddo
002700010411     c     fine          tag
002800911114     C                   SETON                                        LR
002900010411      *------------------------------------------------------
003000010411     c     note          begsr
003100010411      *------------------------------------------------------
003200010411
003300010411     C     kgnp          setll     FIGNp01L
003400010411     c                   do        *hival
003500010411     C     kgnp          reade     FIGNp01L                               98
003600010411     c   98              leave
003700010411     c                   delete    fignp000
003800010411     c                   enddo
003900010411     c                   endsr
004000010411      *------------------------------------------------------
004100010411     c     anagra        begsr
004200010411      *------------------------------------------------------
004300010411
004400010411     C     kgcp          setll     FIGAp01L
004500010411     c                   do        *hival
004600010411     C     kgcp          reade     FIGAp01L                               97
004700010411     c   97              leave
004800010411     c                   delete    figap000
004900010411     c                   enddo
005000010411     c                   endsr
005100900418     C*---------------------------------------------------------------*
005200941021     C*   OPERAZIONI INIZIALI                                         *
005300900418     C*---------------------------------------------------------------*
005400941019     C     *INZSR        BEGSR
005500941021     C*
005600900418     C     *ENTRY        PLIST
005700010507     c                   parm                    fnlgz5ds
005800010507      *
005900900418     C                   Z-ADD     1             CODUT
006000900418     C                   CALL      'X§PARUT'
006100900418     C                   PARM                    UTEDSE
006200941019     C     CODUT         CABEQ     -1            FINE
006300900418     C                   MOVEL     REC80         CNCR80
006400010507      *--------------------------------------------------------------*
006500010507      *  KLIST
006600010411     C     KGcp          KLIST
006700010507     C                   KFLD                    iz5AAS
006800010507     C                   KFLD                    iz5LNP
006900010507     C                   KFLD                    iz5NRS
007000010507     C                   KFLD                    iz5NSP
007100010507      *
007200010411     C     KGnp          KLIST
007300010411     C                   KFLD                    gcpAGC
007400010411     C                   KFLD                    gcpFGC
007500010411     C                   KFLD                    gcpNGC
007600010411
007700900418     C                   ENDSR
