000100060823     A*%%TS  SD  20060823  105902  EDPMM       REL-V5R3M0  5722-WDS
000200911126     A*  91/11/26  13:13:20    EDPDB       REL-R03M00  5728-PW1
000300060823     A*%%EC
000400060823     A                                      DSPSIZ(24 80 *DS3)
000500060823     A                                      REF(*LIBL/CNDIZION)
000600060823     A                                      CHGINPDFT
000700060823     A                                      PRINT
000800911126     A*  91/11/26  13:13:20    EDPDB       REL-R03M00  5728-PW1
000900060823     A          R LG85D01
001000060823     A*%%TS  SD  20060823  105902  EDPMM       REL-V5R3M0  5722-WDS
001100060823     A                                      CA03
001200060823     A                                      CF08
001300060823     A                                      CF07
001400060823     A                                      PUTOVR
001500060823     A                                      OVRDTA
001600060823     A            RSUT          20A  O  1  2
001700060823     A                                  1 27'* CONFERMA CHIUSURA GIACENZE *'
001800060823     A                                      DSPATR(RI)
001900060823     A                                      DSPATR(UL)
002000060823     A                                  1 65'FNLG85R'
002100060823     A                                  1 73DATE
002200060823     A                                      EDTCDE(Y)
002300130104     A                                  9 29'Filiale........:'
002400060823     A                                      DSPATR(HI)
002500060823     A            VFGC           3Y 0B  9 46DSPATR(CS)
002600060823     A                                      EDTCDE(4)
002700060823     A  50                                  ERRMSG('Giacenza inesistente o non -
002800060823     A                                      chiudibile !!' 50)
002900060823     A                                      CHECK(RZ)
003000060823     A                                 11 29'Anno..........:'
003100060823     A                                      DSPATR(HI)
003200060823     A            VAGC           4Y 0B 11 45EDTCDE(4)
003300060823     A                                      DSPATR(CS)
003400060823     A                                      CHECK(RZ)
003500060823     A                                 13 29'Numero.....:'
003600060823     A                                      DSPATR(HI)
003700060823     A            VNGC           7Y 0B 13 42EDTCDE(4)
003800060823     A                                      DSPATR(CS)
003900060823     A                                      CHECK(RZ)
004000060823     A                                 24 61'F8=Chiuse in arrivo'
004100060823     A                                 24  2'F3=Fine Lavoro'
004200060823     A                                 24 31'F7=Interr. giacenze'
004300060823     A            KNSIF         10A  O  2  2
004400060823     A            KNMUS         10A  O  2 13
004500060823     A                                  2 73TIME
004600060823     A                                 23  2'                                  -
004700060823     A                                                                         -
004800060823     A                                               '
004900060823     A                                      DSPATR(UL)
005000060823     A            VMOTIV         1A  B 19 50VALUES(' ' 'S')
005100060823     A                                      DSPATR(UL)
005200060823     A                                      DSPATR(HI)
005300060823     A                                 18 13'Analisi motivi apertura '
005400060823     A                                 18 38'a rischio'
005500060823     A                                 19 52'(S/ )'
005600060823     A                                 19 13'anche per precedenti aperture'
005700911108     A*  91/11/08  17:00:45    EDPDB       REL-R03M00  5728-PW1
005800060329     A          R LG85S02                   SFL
005900060329     A*%%TS  SD  20060329  093019  EDPMM       REL-V5R3M0  5722-WDS
006000060329     A  67                                  SFLNXTCHG
006100060329     A            VSEL           1A  B  6  2DSPATR(UL)
006200060329     A                                      VALUES(' ' '1')
006300060329     A            VFGC           3S 0O  6  7DSPATR(CS)
006400060329     A            VAGC           4S 0O  6 11DSPATR(CS)
006500060329     A            VNGC           7Y 0O  6 16DSPATR(CS)
006600060329     A                                      EDTCDE(Z)
006700060329     A            VMGC           4Y 0O  6 24EDTWRD('  /  ')
006800060329     A                                      DSPATR(CS)
006900060329     A            VAAS           4S 0O  6 30DSPATR(CS)
007000060329     A            VNRS           2S 0O  6 35DSPATR(CS)
007100060329     A            VNSP           7Y 0O  6 38DSPATR(CS)
007200060329     A                                      EDTCDE(Z)
007300060329     A            VCFG           3A  O  6 46DSPATR(UL)
007400060329     A            DESCFG        30A  O  6 50DSPATR(UL)
007500060329     A            VAUT           1   O  6  5COLOR(RED)
007600911108     A*  91/11/08  16:12:38    EDPDB       REL-R03M00  5728-PW1
007700060811     A          R LG85C02                   SFLCTL(LG85S02)
007800060811     A*%%TS  SD  20060811  171620  EDPMM       REL-V5R3M0  5722-WDS
007900060811     A                                      SFLSIZ(0018)
008000060811     A                                      SFLPAG(0017)
008100060811     A                                      CA03
008200060811     A N01                                  CA18
008300060811     A                                      CA12
008400060811     A                                      CF01
008500060811     A                                      CF07
008600060811     A                                      CF09
008700060811     A                                      OVERLAY
008800060811     A                                      SFLDSP
008900060811     A N70                                  SFLDSPCTL
009000060811     A  70                                  SFLCLR
009100060811     A            RSUT          20A  O  1  2
009200060811     A                                  1 27'* CONFERMA CHIUSURA GIACENZE *'
009300060811     A                                      DSPATR(RI)
009400060811     A                                      DSPATR(UL)
009500060811     A                                  1 65'FNLG85R'
009600130104     A                                  3  2'Filiale........:'
009700060811     A            §FLE           3S 0O  3 19
009800060811     A  60                                  ERRMSG('Non ci sono giacenze chiuse-
009900060811     A                                       da confermare' 60)
010000060811     A                                  1 73DATE
010100060811     A                                      EDTCDE(Y)
010200130104     A                                  5  2'1  A Fil Anno Giac.   Gi/Me Anno N-
010300060811     A                                      r.Sped.   Codice fine Giacenza     -
010400060811     A                                               '
010500060811     A                                      DSPATR(UL)
010600060811     A                                      DSPATR(HI)
010700060811     A            KNSIF         10A  O  2  2
010800060811     A            KNMUS         10A  O  2 13
010900060811     A                                  2 73TIME
011000060811     A                                  3 27'Analisi motivi apertura"a rischio"'
011100060811     A            VMOTIV         1   O  3 64
011200060811     A                                  3 67'(S/ )'
011300911108     A*  91/11/08  16:12:38    EDPDB       REL-R03M00  5728-PW1
011400060329     A          R LG85Z02
011500060329     A*%%TS  SD  20060329  140652  EDPMM       REL-V5R3M0  5722-WDS
011600060329     A                                 23  2'                                  -
011700060329     A                                                                         -
011800060329     A                                              '
011900060329     A                                      DSPATR(UL)
012000060329     A                                 24 51'F12=Vid.Prec.'
012100060329     A                                 24  2'F3=Fine'
012200130104     A                                 24 65'F18=Cambio Fil.'
012300060329     A                                 24 11'F01=Sel.Tutte'
012400060329     A                                 24 26'F07=Sel.Aut'
012500060329     A                                 24 38'F09=Sel.Man'
012600911126     A*  91/11/26  12:44:39    EDPDB       REL-R03M00  5728-PW1
012700961112     A          R LG85D03
012800961112     A*%%TS  SD  19961112  084452  EDPRE       REL-V3R6M0  5716-PW1
012900961112     A                                      CA12
013000961112     A            RSUT          20A  O  1  2
013100961112     A                                  1 27'* CONFERMA CHIUSURA GIACENZE *'
013200961112     A                                      DSPATR(RI)
013300961112     A                                      DSPATR(UL)
013400961112     A                                  1 61'FNLG85R'
013500961112     A                                  1 71DATE
013600961112     A                                      EDTCDE(Y)
013700961112     A            §FLE           3Y 0B 11 40
013800961112     A N40                                  DSPATR(CS)
013900961112     A                                      EDTCDE(4)
014000961112     A  40                                  DSPATR(RI)
014100961112     A  40                                  DSPATR(PC)
014200961112     A                                 24  2'F12=Precedente'
014300961112     A                                 23  2'                                  -
014400961112     A                                                                         -
014500961112     A                                               '
014600961112     A                                      DSPATR(UL)
014700961112     A  28        $MSG          70   M
014800961112     A                                  2 71TIME
014900961112     A            KNSIF         10   O  2  2
015000961112     A            KNMUS         10   O  2 13
015100130104     A                                 11 23'Filiale........:'
