000100980129     A*------------------------------------------------------------------------*
000200020529     A* DS DATAARA DATI VARI PER CONTO ECONOMICO                               *
000300980129     A*------------------------------------------------------------------------*
000400980129     A                                      REF(CNDIZION)
000500020529     A          R D00REC                    TEXT('DS DATAARA DATI VARI PER C/E')
000600980129     A            D00RCB    R               REFFLD($FLA)
000700020529     A                                      TEXT('RILASCIO KECONOM (S/N)')
000800020529     A            D00XXX        99          TEXT('FILLER FINO A 100')
