000010031222     A*%%TS  SD  20031222  122935  EDPBA       REL-V4R4M0  5769-PW1
000020000000     A*------------------------------------------------------------------------*
000030000000     A* Gestione competenze dettaglio di C/E
000040000000     A*------------------------------------------------------------------------*
000050031222     A*%%EC
000060031222     A                                      DSPSIZ(24 80 *DS3)
000070031222     A                                      CHGINPDFT(HI CS)
000080031222     A                                      PRINT
000090031222     A                                      CF01
000100031222     A                                      CF02
000110031222     A                                      CF03
000120031222     A                                      CF04
000130031222     A                                      CF05
000140031222     A                                      CF06
000150031222     A                                      CF07
000160031222     A                                      CF08
000170031222     A                                      CF09
000180031222     A                                      CF10
000190031222     A                                      CF11
000200031222     A                                      CF12
000210031222     A                                      CF13
000220031222     A                                      CF14
000230031222     A                                      CF15
000240031222     A                                      CF16
000250031222     A                                      CF17
000260031222     A                                      CF18
000270031222     A                                      CF19
000280031222     A                                      CF20
000290031222     A                                      CF21
000300031222     A                                      CF22
000310031222     A                                      CF23
000320031222     A                                      CF24
000330031222     A                                      ROLLUP(97)
000340031222     A                                      ROLLDOWN(97)
000350031222     A                                      HELP
000360000000     A*------------------------------------------------------------------------*
000370000000     A* Record Testata
000380000000     A*------------------------------------------------------------------------*
000390000000     A          R EC76DVT
000400000000     A            VTDRSU        20A  O  1  2
000410000000     A                                  1 25'* COMPETENZE DI CONTO ECONOMICO *'
000420000000     A                                      DSPATR(RI)
000430000000     A                                      DSPATR(UL)
000440000000     A                                  1 61'TREC76R'
000450000000     A                                  1 71DATE
000460000000     A                                      EDTCDE(Y)
000470000000     A            VTDFUN        16A  O  2 34DSPATR(HI)
000480000000     A                                      DSPATR(RI)
000490000000     A*------------------------------------------------------------------------*
000500000000     A* Record descrizione tasti funzionali attivi
000510000000     A*------------------------------------------------------------------------*
000520000000     A          R EC76DVF
000530000000     A                                      OVERLAY
000540000000     A            VFD001        19A  O 22  2
000550000000     A            VFD002        19A  O 22 22
000560000000     A            VFD003        19A  O 22 42
000570000000     A            VFD004        19A  O 22 62
000580000000     A            VFD005        19A  O 23  2
000590000000     A            VFD006        19A  O 23 22
000600000000     A            VFD007        19A  O 23 42
000610000000     A            VFD008        19A  O 23 62
000620000000     A*------------------------------------------------------------------------*
000630000000     A* Record subfile messaggi
000640000000     A*------------------------------------------------------------------------*
000650000000     A          R EC76DVM                   SFL
000660000000     A                                      SFLMSGRCD(24)
000670000000     A            VMCKEY                    SFLMSGKEY
000680000000     A            VMCQUE                    SFLPGMQ
000690000000     A*------------------------------------------------------------------------*
000700000000     A* Record controllo subfile messaggi
000710000000     A*------------------------------------------------------------------------*
000720000000     A          R EC76DVK                   SFLCTL(EC76DVM)
000730000000     A                                      SFLSIZ(0002)
000740000000     A                                      SFLPAG(0001)
000750000000     A                                      OVERLAY
000760000000     A                                      SFLDSP
000770000000     A  40                                  SFLCLR
000780000000     A  44                                  SFLEND
000790000000     A*------------------------------------------------------------------------*
000800000000     A* Record dettaglio
000810000000     A*------------------------------------------------------------------------*
000820031222     A          R EC76DV1
000830031222     A*%%TS  SD  20031222  122935  EDPBA       REL-V4R4M0  5769-PW1
000840031222     A                                      CHGINPDFT(HI)
000850031222     A                                      OVERLAY
000860031222     A            V1CNBC    R        H      REFFLD(ECDNBC ECECD00F)
000870031222     A            V1CATB        10A  O  3 37DSPATR(BL)
000880031222     A                                      DSPATR(HI)
000890031222     A                                  6  2'Codice competenza ............:'
000900031222     A            V1CCMP    R        B  6 35REFFLD(ECDCMP ECECD00F)
000910031222     A  60                                  DSPATR(RI)
000920031222     A  60                                  DSPATR(PC)
000930031222     A  90                                  DSPATR(PR)
000940031222     A N90                                  DSPATR(CS)
000950031222     A                                      CHECK(RB)
000960031222     A                                      EDTCDE(Z)
000970031222     A            V1CCMD    R        O  6 46REFFLD(ECTCMD ECECT00F)
000980031222     A                                      DSPATR(HI)
000990031222     A                                  7 20'di tipo ....:'
001000031222     A            V1CFCR    R        O  7 35REFFLD(ECTFCR ECECT00F)
001010031222     A                                      DSPATR(HI)
001020031222     A                                  7 46'C=Competenza   R=Ricavo'
001030031222     A                                  8  2'Competenza franco o assegnato :'
001040031222     A            V1CFRA    R        B  8 35REFFLD(ECDFRA ECECD00F)
001050031222     A  68                                  DSPATR(RI)
001060031222     A N90                                  DSPATR(CS)
001070031222     A  68                                  DSPATR(PC)
001080031222     A  90                                  DSPATR(PR)
001090031222     A                                  8 46'F=Franco  A=Assegnato '' ''=Tutte'
001100031222     A                                  9  2'Competenza Italia o Estero ...:'
001110031222     A            V1CIOE    R        B  9 35REFFLD(ECDIOE ECECD00F)
001120031222     A  70                                  DSPATR(RI)
001130031222     A N90                                  DSPATR(CS)
001140031222     A  70                                  DSPATR(PC)
001150031222     A  90                                  DSPATR(PR)
001160031222     A                                  9 46'I=Italia  E=Estero  '' ''=Tutte'
001170031222     A                                 11  2'Voce di contabilità ..........:'
001180031222     A            V1CKCC    R        B 11 35REFFLD(ECDKCC ECECD00F)
001190031222     A  61                                  DSPATR(RI)
001200031222     A  61                                  DSPATR(PC)
001210031222     A  90                                  DSPATR(PR)
001220031222     A N90                                  DSPATR(CS)
001230031222     A                                      CHECK(RZ)
001240031222     A                                      EDTCDE(Z)
001250031222     A            V1CKCD    R   34   O 11 46REFFLD(ACORAG CNACO00F)
001260031222     A                                      DSPATR(HI)
001270031222     A                                 12  2'Sottoconto di contabilità ....:'
001280031222     A            V1CKSC    R     Y  B 12 35REFFLD(ECDKSC ECECD00F)
001290031222     A  62                                  DSPATR(RI)
001300031222     A  62                                  DSPATR(PC)
001310031222     A  90                                  DSPATR(PR)
001320031222     A N90                                  DSPATR(CS)
001330031222     A                                      CHECK(RZ)
001340031222     A            V1CKSD    R   34   O 12 46REFFLD(ACORAG CNACO00F)
001350031222     A                                      DSPATR(HI)
001360031222     A                                 13  2'Riferimento centro di costo .?:'
001370031222     A            V1CRIC    R        B 13 35REFFLD(ECDRIC ECECD00F)
001380031222     A  63                                  DSPATR(RI)
001390031222     A  63                                  DSPATR(PC)
001400031222     A  90                                  DSPATR(PR)
001410031222     A N90                                  DSPATR(CS)
001420031222     A            V1CRID        20A  O 13 46DSPATR(HI)
001430031222     A                                 14  2'Centro di costo forzato ......:'
001440031222     A            V1CCCF    R     Y  B 14 35REFFLD(ECDCCF ECECD00F)
001450031222     A  69                                  DSPATR(RI)
001460031222     A N90                                  DSPATR(CS)
001470031222     A  69                                  DSPATR(PC)
001480031222     A  90                                  DSPATR(PR)
001490031222     A                                      CHECK(RB)
001500031222     A                                      EDTCDE(Z)
001510031222     A            V1DCCF    R   34   O 14 46REFFLD(ACORAG CNACO00F)
001520031222     A                                      DSPATR(HI)
001530031222     A                                 15  2'Data decorrenza / scadenza ...:'
001540031222     A            V1CDDO    R    6 00B 15 35REFFLD(ECDDDO ECECD00F)
001550031222     A  64                                  DSPATR(RI)
001560031222     A  64                                  DSPATR(PC)
001570031222     A  90                                  DSPATR(PR)
001580031222     A N90                                  DSPATR(CS)
001590031222     A                                      CHECK(RB)
001600031222     A                                      EDTWRD('  /    ')
001610031222     A            V1CDSO    R    6 00B 15 46REFFLD(ECDDSO ECECD00F)
001620031222     A  65                                  DSPATR(RI)
001630031222     A  65                                  DSPATR(PC)
001640031222     A  91                                  DSPATR(PR)
001650031222     A N91                                  DSPATR(CS)
001660031222     A                                      EDTWRD('  /    ')
001670031222     A                                      CHECK(RB)
001680031222     A                                 15 59'(MM/ANNO)'
001690031222     A                                 17  2'Dare o Avere .................:'
001700031222     A            V1CSEG    R        B 17 35REFFLD(ECDSEG ECECD00F)
001710031222     A  66                                  DSPATR(RI)
001720031222     A  66                                  DSPATR(PC)
001730031222     A  91                                  DSPATR(PR)
001740031222     A N91                                  DSPATR(CS)
001750031222     A                                 17 46'D=Dare   A=Avere'
001760031222     A                                 18  2'Percentuale da applicare .....:'
001770031222     A            V1CPER    R        B 18 35REFFLD(ECDPER ECECD00F)
001780031222     A  67                                  DSPATR(RI)
001790031222     A  67                                  DSPATR(PC)
001800031222     A  91                                  DSPATR(PR)
001810031222     A N91                                  DSPATR(CS)
001820031222     A                                      EDTCDE(2)
001830031222     A                                 10 46'D=DPD  X=Euroexpress  F=Fedex'
