000010110228     A*%%TS  SD  20110228  114013  EDPBA       REL-V6R1M0  5761-WDS
000020110228     A*%%EC
000030110228     A                                      DSPSIZ(24 80 *DS3)
000040110228     A          R TRECS1
000050110228     A*%%TS  SD  20110228  114013  EDPBA       REL-V6R1M0  5761-WDS
000060110228     A                                      CF12
000070110228     A                                      OVERLAY
000080110228     A                                      WINDOW(10 35 10 30)
000090110228     A                                      RMVWDW
000100110228     A                                      USRRSTDSP
000110110228     A                                  1  4'Parametri di SIMULAZIONE'
000120110228     A                                      DSPATR(RI)
000130110228     A                                      DSPATR(UL)
000140110228     A                                  3  2'Nome libreria'
000150110228     A            VLIB          10A  B  3 16DSPATR(HI)
000160110228     A                                  5  2'Duplica ambiente.....:'
000170110228     A            VDUP           1A  B  5 25DSPATR(HI)
000180110228     A                                      VALUES('S' 'N')
000190110228     A                                  5 27'S/N'
000200110228     A                                  7  2'Pulisce file OUTPUT..:'
000210110228     A            VCLR           1A  B  7 25DSPATR(HI)
000220110228     A                                      VALUES('S' 'N')
000230110228     A                                  7 27'S/N'
000240110228     A                                  9  2'F12=Guida'
000250110228     A                                      COLOR(BLU)
000260050426     A          R ASSUME
000270050426     A*%%TS  SD  19940608  111038  CAMPORESI   REL-V2R2M0  5738-PW1
000280050426     A                                      TEXT('Serve x preservare il video p-
000290050426     A                                      recedente')
000300050426     A                                      ASSUME
000310050426     A                                  1  2' '
