000010990602     A*%%TS  SD  19990602  095721  EDPRN       REL-V4R2M0  5769-PW1
000020000000     A*------------------------------------------------------------------------*
000030990602     A*%%EC
000040990602     A                                      DSPSIZ(24 80 *DS3)
000050990602     A                                      CHGINPDFT(HI CS)
000060990602     A                                      PRINT
000070990602     A                                      CF01
000080990602     A                                      CF02
000090990602     A                                      CF03
000100990602     A                                      CF04
000110990602     A                                      CF05
000120990602     A                                      CF06
000130990602     A                                      CF07
000140990602     A                                      CF08
000150990602     A                                      CF09
000160990602     A                                      CF10
000170990602     A                                      CF11
000180990602     A                                      CF12
000190990602     A                                      CF13
000200990602     A                                      CF14
000210990602     A                                      CF15
000220990602     A                                      CF16
000230990602     A                                      CF17
000240990602     A                                      CF18
000250990602     A                                      CF19
000260990602     A                                      CF20
000270990602     A                                      CF21
000280990602     A                                      CF22
000290990602     A                                      CF23
000300990602     A                                      CF24
000310990602     A                                      ROLLUP(97)
000320990602     A                                      ROLLDOWN(97)
000330990602     A                                      HELP
000340000000     A*------------------------------------------------------------------------*
000350000000     A* Record testata
000360000000     A*------------------------------------------------------------------------*
000370000000     A          R O901DVT
000380000000     A            DSFIRS        20A  O  1  2
000390000000     A                                  1 27'** AGGIORNAMENTO SALDI CLIENTE **'
000400000000     A                                      DSPATR(RI)
000410000000     A                                      DSPATR(UL)
000420000000     A                                  1 63'YCO901R'
000430000000     A                                  1 72DATE
000440000000     A                                      EDTCDE(Y)
000450000000     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000460000000     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000470000000     A                                  2 72TIME
000480000000     A*------------------------------------------------------------------------*
000490000000     A* Record descrizione tasti funzionali attivi
000500000000     A*------------------------------------------------------------------------*
000510000000     A          R O901DVF
000520000000     A                                      OVERLAY
000530000000     A            VFD001        19A  O 22  2
000540000000     A            VFD002        19A  O 22 22
000550000000     A            VFD003        19A  O 22 42
000560000000     A            VFD004        19A  O 22 62
000570000000     A            VFD005        19A  O 23  2
000580000000     A            VFD006        19A  O 23 22
000590000000     A            VFD007        19A  O 23 42
000600000000     A            VFD008        19A  O 23 62
000610000000     A*------------------------------------------------------------------------*
000620000000     A* Record Richiesta Parametri
000630000000     A*------------------------------------------------------------------------*
000640990602     A          R O901DV1
000650990602     A*%%TS  SD  19990602  095721  EDPRN       REL-V4R2M0  5769-PW1
000660990602     A                                      OVERLAY
000670990602     A                                  4 27'Anno/mese iniziale ....:'
000680990602     A            V1CDAI         6Y 0B  4 53
000690990602     A N60                                  DSPATR(HI)
000700990602     A  60                                  DSPATR(RI)
000710990602     A  60                                  DSPATR(PC)
000720990602     A                                      CHECK(RB)
000730990602     A                                      EDTWRD('    /  ')
000740990602     A                                  4 63'(aaaa/mm)'
000750990602     A                                  5 27'Anno/mese finale ......:'
000760990602     A            V1CDAF         6Y 0B  5 53
000770990602     A N61                                  DSPATR(HI)
000780990602     A  61                                  DSPATR(RI)
000790990602     A  61                                  DSPATR(PC)
000800990602     A                                      CHECK(RB)
000810990602     A                                      EDTWRD('    /  ')
000820990602     A                                  5 63'(aaaa/mm)'
000830990602     A                                  9  3'NB: Questo programma recupera le N-
000840990602     A                                      ote di credito e le Rettifiche dall-
000850990602     A                                      a'
000860990602     A                                 10  7'contabilità e aggiorna i saldi cli-
000870990602     A                                      enti.'
000880990602     A                                 11  7'Da lanciarsi PRIMA delle statistic-
000890990602     A                                      he Cliente e Delta'
000900000000     A*------------------------------------------------------------------------*
000910000000     A* Record subfile messaggi
000920000000     A*------------------------------------------------------------------------*
000930000000     A          R O901DVM                   SFL
000940000000     A                                      SFLMSGRCD(24)
000950000000     A            VMCKEY                    SFLMSGKEY
000960000000     A            VMCQUE                    SFLPGMQ
000970000000     A*------------------------------------------------------------------------*
000980000000     A* Record controllo subfile messaggi
000990000000     A*------------------------------------------------------------------------*
001000000000     A          R O901DVK                   SFLCTL(O901DVM)
001010000000     A                                      OVERLAY
001020000000     A                                      SFLDSP
001030000000     A  40                                  SFLCLR
001040000000     A  44                                  SFLEND
001050000000     A                                      SFLSIZ(0002)
001060000000     A                                      SFLPAG(0001)
