000010040316     A*%%TS  SD  20040316  144409  EDPBA       REL-V4R4M0  5769-PW1
000020000000     A*------------------------------------------------------------------------*
000030040316     A*%%EC
000040040316     A                                      DSPSIZ(24 80 *DS3)
000050040316     A                                      CHGINPDFT(HI CS)
000060040316     A                                      PRINT
000070040316     A                                      CF01
000080040316     A                                      CF02
000090040316     A                                      CF03
000100040316     A                                      CF04
000110040316     A                                      CF05
000120040316     A                                      CF06
000130040316     A                                      CF07
000140040316     A                                      CF08
000150040316     A                                      CF09
000160040316     A                                      CF10
000170040316     A                                      CF11
000180040316     A                                      CF12
000190040316     A                                      CF13
000200040316     A                                      CF14
000210040316     A                                      CF15
000220040316     A                                      CF16
000230040316     A                                      CF17
000240040316     A                                      CF18
000250040316     A                                      CF19
000260040316     A                                      CF20
000270040316     A                                      CF21
000280040316     A                                      CF22
000290040316     A                                      CF23
000300040316     A                                      CF24
000310040316     A                                      ROLLUP(97)
000320040316     A                                      ROLLDOWN(97)
000330040316     A                                      HELP
000340000000     A*------------------------------------------------------------------------*
000350000000     A          R ECE6DVT
000360000000     A            DSFIRS        20A  O  1  2
000370000000     A                                  1 25'AZZERAMENTO FILES C/E PER RICALCOL-
000380000000     A                                      O'
000390000000     A                                      DSPATR(RI)
000400000000     A                                      DSPATR(UL)
000410000000     A                                  1 62'TRECE6R'
000420000000     A                                  1 72DATE
000430000000     A                                      EDTCDE(Y)
000440000000     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000450000000     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000460000000     A                                  2 72TIME
000470000000     A*------------------------------------------------------------------------*
000480000000     A          R ECE6DVF
000490000000     A                                      OVERLAY
000500000000     A            VFD001        19A  O 22  2
000510000000     A            VFD002        19A  O 22 22
000520000000     A            VFD003        19A  O 22 42
000530000000     A            VFD004        19A  O 22 62
000540000000     A            VFD005        19A  O 23  2
000550000000     A            VFD006        19A  O 23 22
000560000000     A            VFD007        19A  O 23 42
000570000000     A            VFD008        19A  O 23 62
000580000000     A*------------------------------------------------------------------------*
000590040316     A          R ECE6DV1
000600040316     A*%%TS  SD  20040316  144409  EDPBA       REL-V4R4M0  5769-PW1
000610040316     A                                      OVERLAY
000620040316     A                                  4  2'LANCIO'
000630040316     A                                      DSPATR(HI)
000640040316     A                                  5  2'Anno .....................:'
000650040316     A            V1CANN         4Y 0B  5 31
000660040316     A N60                                  DSPATR(HI)
000670040316     A  60                                  DSPATR(RI)
000680040316     A N60                                  DSPATR(CS)
000690040316     A  60                                  DSPATR(PC)
000700040316     A                                      CHECK(RB)
000710040316     A                                      EDTCDE(Z)
000720040316     A                                      TEXT('ANNO')
000730040316     A                                  6  2'Mese iniziale / finale ...:'
000740040316     A            V1CMMI    R     Y  B  6 31REFFLD(SDOMES SISDO00F)
000750040316     A N61                                  DSPATR(HI)
000760040316     A  61                                  DSPATR(RI)
000770040316     A N61                                  DSPATR(CS)
000780040316     A  61                                  DSPATR(PC)
000790040316     A                                      CHECK(RB)
000800040316     A                                      EDTCDE(Z)
000810040316     A                                  6 34'/'
000820040316     A            V1CMMF    R     Y  B  6 36REFFLD(SDOMES SISDO00F)
000830040316     A N62                                  DSPATR(HI)
000840040316     A  62                                  DSPATR(RI)
000850040316     A N62                                  DSPATR(CS)
000860040316     A  62                                  DSPATR(PC)
000870040316     A                                      CHECK(RB)
000880040316     A                                      EDTCDE(Z)
000890040316     A                                  7  2'SELEZIONI'
000900040316     A                                      DSPATR(HI)
000910040316     A                                  8  2'Azzera   SISDO ...........:'
000920040316     A            V1CSDO         1A  B  8 31
000930040316     A N63                                  DSPATR(HI)
000940040316     A  63                                  DSPATR(RI)
000950040316     A N63                                  DSPATR(CS)
000960040316     A  63                                  DSPATR(PC)
000970040316     A                                  8 36'(S/ )'
000980040316     A                                  9  2'Azzera   SISDC ...........:'
000990040316     A            V1CSDC         1A  B  9 31
001000040316     A N64                                  DSPATR(HI)
001010040316     A  64                                  DSPATR(RI)
001020040316     A N64                                  DSPATR(CS)
001030040316     A  64                                  DSPATR(PC)
001040040316     A                                  9 36'(S/ )'
001050040316     A                                 10  2'Azzera   SISDA ...........:'
001060040316     A            V1CSDA         1A  B 10 31
001070040316     A N65                                  DSPATR(HI)
001080040316     A  65                                  DSPATR(RI)
001090040316     A N65                                  DSPATR(CS)
001100040316     A  65                                  DSPATR(PC)
001110040316     A                                 10 36'(S/ )'
001120040316     A                                 11  2'Azzera   SISDP ...........:'
001130040316     A            V1CSDP         1A  B 11 31
001140040316     A N66                                  DSPATR(HI)
001150040316     A  66                                  DSPATR(RI)
001160040316     A N66                                  DSPATR(CS)
001170040316     A  66                                  DSPATR(PC)
001180040316     A                                 11 36'(S/ )'
001190040316     A                                 12  2'Azzera   SISDF ...........:'
001200040316     A            V1CSDF         1A  B 12 31
001210040316     A N67                                  DSPATR(HI)
001220040316     A  67                                  DSPATR(RI)
001230040316     A N67                                  DSPATR(CS)
001240040316     A  67                                  DSPATR(PC)
001250040316     A                                 12 36'(S/ )'
001260040316     A                                 13  2'Azzera   SISDR ...........:'
001270040316     A            V1CSDR         1A  B 13 31
001280040316     A N68                                  DSPATR(HI)
001290040316     A  68                                  DSPATR(RI)
001300040316     A N68                                  DSPATR(CS)
001310040316     A  68                                  DSPATR(PC)
001320040316     A                                 13 36'(S/ )'
001330040316     A                                 14  2'Azzera   SISDT ...........:'
001340040316     A            V1CSDT         1A  B 14 31
001350040316     A N76                                  DSPATR(HI)
001360040316     A  76                                  DSPATR(RI)
001370040316     A N76                                  DSPATR(CS)
001380040316     A  76                                  DSPATR(PC)
001390040316     A                                 14 36'(S/ )'
001400040316     A                                 15  2'Azzera   SISDE ...........:'
001410040316     A            V1CSDE         1A  B 15 31
001420040316     A N69                                  DSPATR(HI)
001430040316     A  69                                  DSPATR(RI)
001440040316     A N69                                  DSPATR(CS)
001450040316     A  69                                  DSPATR(PC)
001460040316     A                                 15 36'(S/ )'
001470040316     A                                 16  2'Cancella ECMOV ...........:'
001480040316     A            V1CWFM         1A  B 16 31
001490040316     A N70                                  DSPATR(HI)
001500040316     A  70                                  DSPATR(RI)
001510040316     A N70                                  DSPATR(CS)
001520040316     A  70                                  DSPATR(PC)
001530040316     A                                 16 36'(S/ )'
001540040316     A                                 17  2'Cancella ECCET ...........:'
001550040316     A            V1CCET         1A  B 17 31
001560040316     A N71                                  DSPATR(HI)
001570040316     A  71                                  DSPATR(RI)
001580040316     A N71                                  DSPATR(CS)
001590040316     A  71                                  DSPATR(PC)
001600040316     A                                 17 36'(S/ )'
001610040316     A                                 18  2'Cancella ECCED ...........:'
001620040316     A            V1CCED         1A  B 18 31
001630040316     A N72                                  DSPATR(HI)
001640040316     A  72                                  DSPATR(RI)
001650040316     A N72                                  DSPATR(CS)
001660040316     A  72                                  DSPATR(PC)
001670040316     A                                 18 36'(S/ )'
001680040316     A                                 19  2'Cancella ECFIM ...........:'
001690040316     A            V1CFIM         1A  B 19 31
001700040316     A N74                                  DSPATR(HI)
001710040316     A  74                                  DSPATR(RI)
001720040316     A N74                                  DSPATR(CS)
001730040316     A  74                                  DSPATR(PC)
001740040316     A                                 19 36'(S/ )'
001750040316     A                                 20  2'Cancella SICOP,ECCEV,ECC2V:'
001760040316     A            V1CCOP         1A  B 20 31
001770040316     A N75                                  DSPATR(HI)
001780040316     A  75                                  DSPATR(RI)
001790040316     A N75                                  DSPATR(CS)
001800040316     A  75                                  DSPATR(PC)
001810040316     A                                 20 36'(S/ )'
001820000000     A*------------------------------------------------------------------------*
001830000000     A          R ECE6DVM                   SFL
001840000000     A                                      SFLMSGRCD(24)
001850000000     A            VMCKEY                    SFLMSGKEY
001860000000     A            VMCQUE                    SFLPGMQ
001870000000     A*------------------------------------------------------------------------*
001880000000     A          R ECE6DVK                   SFLCTL(ECE6DVM)
001890000000     A                                      SFLSIZ(0002)
001900000000     A                                      SFLPAG(0001)
001910000000     A                                      OVERLAY
001920000000     A                                      SFLDSP
001930000000     A  40                                  SFLCLR
001940000000     A  44                                  SFLEND
