000100000000     A*------------------------------------------------------------------------*
000200170223     A* DS RICAVI E COMPETENZE UNIFICANTE X FASCE DI PESOO                     *
000300000000     A*------------------------------------------------------------------------*
000500170223     A          R D17REC                    TEXT('DS RICAVI E COMPETENZE UNI')
000900170224     A            I17KSC         7S 0       TEXT('UNIFICANTE')
001000170301     A            I17ANNOI       4S 0       TEXT('ANNO INIZIO')
001001170301     A            I17MESEI       2S 0       TEXT('MESE INIZIO')
001100170301     A            I17ANNOF       4S 0       TEXT('ANNO FINE')
001200170301     A            I17MESEF       2S 0       TEXT('MESE FINE')
001300170307     A            I17UNI         1          TEXT('N=NO CLIENTE UNIFICANTE')
