000100940527     C*------------------------------------------------------------------------*
000200940617     C*        - IMPOSTA IMMAGINE PRIMA E DOPO DI UNA BOLLA DI SEDE -          *
000300941128     C*                + IMMAGINE BOLLA ORIGINALE (MAMMA)                      *
000400940527     C*------------------------------------------------------------------------*
000500940527     C*------------------------------------------------------------------------*
000600940527     C*?APDTAQ - AZZERA TUTTI I CAMPI DELLA DS -PRIMA-
000700940527     C*------------------------------------------------------------------------*
000800940527     C     APDTAQ        BEGSR
000900940527     C*
001000941122     C                   Z-ADD     *ZEROS        D$PAAS
001100941122     C                   Z-ADD     *ZEROS        D$PLNP
001200941122     C                   Z-ADD     *ZEROS        D$PNRS
001300941122     C                   Z-ADD     *ZEROS        D$PNSP
001400941122     C                   MOVEL     *BLANKS       D$PTBL
001500990730     C                   MOVEL     *BLANKS       D$PCBO
001600941122     C                   Z-ADD     *ZEROS        D$PMGS
001700941122     C                   Z-ADD     *ZEROS        D$PKSC
001800941122     C                   Z-ADD     *ZEROS        D$PLNA
001900941122     C                   Z-ADD     *ZEROS        D$PNCL
002000941122     C                   Z-ADD     *ZEROS        D$PPKB
002100990730     C                   MOVEL     *BLANKS       D$PFPB
002200990730     C                   Z-ADD     *ZEROS        D$PPKC
002300990730     C                   Z-ADD     *ZEROS        D$PNCP
002400990730     C                   Z-ADD     *ZEROS        D$PPKF
002500990730     C                   MOVEL     *BLANKS       D$PFPF
002600941122     C                   Z-ADD     *ZEROS        D$PPVL
002700990730     C                   MOVEL     *BLANKS       D$PFVB
002800990730     C                   Z-ADD     *ZEROS        D$PVLB
002900941122     C                   Z-ADD     *ZEROS        D$PVLC
003000941122     C                   Z-ADD     *ZEROS        D$PNCR
003100941122     C                   Z-ADD     *ZEROS        D$PVLF
003200941122     C                   MOVEL     *BLANKS       D$PFVF
003300941122     C                   Z-ADD     *ZEROS        D$PQFT
003400990730     C                   Z-ADD     *ZEROS        D$PIAS
003500990730     C                   MOVEL     *BLANKS       D$PVAS
003600990730     C                   MOVEL     *BLANKS       D$PFCM
003700990730     C                   Z-ADD     *ZEROS        D$PCTR
003800990730     C                   MOVEL     *BLANKS       D$PTSP
003900990730     C                   MOVEL     *BLANKS       D$PRSD
004000990730     C                   MOVEL     *BLANKS       D$PIND
004100990730     C                   MOVEL     *BLANKS       D$PCAD
004200990730     C                   MOVEL     *BLANKS       D$PLOD
004300990730     C                   MOVEL     *BLANKS       D$PPRD
004400990730     C                   MOVEL     *BLANKS       D$PNZD
004500990730     C                   MOVEL     *BLANKS       D$PCPD
004600990730     C                   MOVEL     *BLANKS       D$PCTS
004700990730     C                   MOVEL     *BLANKS       D$PFIN
004800990730     C                   Z-ADD     *ZEROS        D$PCCM
004900990730     C                   Z-ADD     *ZEROS        D$PRMN
005000990730     C                   MOVEL     *BLANKS       D$PMCT
005100990730     C                   MOVEL     *BLANKS       D$PFAP
005200990730     C                   MOVEL     *BLANKS       D$PFTM
005300990730     C                   MOVEL     *BLANKS       D$PNAS
005400990730     C                   Z-ADD     *ZEROS        D$PFLB
005500990730     C                   Z-ADD     *ZEROS        D$PFLP
005600990730     C                   Z-ADD     *ZEROS        D$PFL2
005700990730     C                   Z-ADD     *ZEROS        D$PTFA
005800990730     C                   Z-ADD     *ZEROS        D$PTFP
005900990730     C                   Z-ADD     *ZEROS        D$PDIM
006000990730     C                   MOVEL     *BLANKS       D$PSOP
006100990730     C                   Z-ADD     *ZEROS        D$PPDR
006200990730     C                   Z-ADD     *ZEROS        D$PDRT
006300990730     C                   Z-ADD     *ZEROS        D$PHRT
006400990730     C                   Z-ADD     *ZEROS        D$PNRT
006500990730     C                   MOVEL     *BLANKS       D$PFPP
006600990730     C                   Z-ADD     *ZEROS        D$PSTR
006700990730     C                   MOVEL     *BLANKS       D$PCTM
006800990730     C                   MOVEL     *BLANKS       D$PFNS
006900990730     C                   Z-ADD     *ZEROS        D$PFLS
007000990730     C                   Z-ADD     *ZEROS        D$PNCD
007100990730     C                   Z-ADD     *ZEROS        D$PNCA
007200990730     C                   MOVEL     *BLANKS       D$PXCO
007300990730     C                   Z-ADD     *ZEROS        D$PDBR
007400990730     C                   Z-ADD     *ZEROS        D$PDUC
007500990730     C                   Z-ADD     *ZEROS        D$PDTI
007600990730     C                   Z-ADD     *ZEROS        D$PHTI
007700990730     C                   Z-ADD     *ZEROS        D$PZNC
007800990730     C                   Z-ADD     *ZEROS        D$PPDC
007900990730     C                   Z-ADD     *ZEROS        D$PNDC
008000990730     C                   Z-ADD     *ZEROS        D$PDDC
008100990730     C                   Z-ADD     *ZEROS        D$PSTP
008200990730     C                   Z-ADD     *ZEROS        D$PDCE
008300990730     C                   Z-ADD     *ZEROS        D$PHCE
008400990730     C                   Z-ADD     *ZEROS        D$PDCP
008500990730     C                   Z-ADD     *ZEROS        D$PDCM
008600990730     C                   Z-ADD     *ZEROS        D$PHMC
008700990730     C                   MOVEL     *BLANKS       D$PCCA
008800990730     C                   Z-ADD     *ZEROS        D$PNPI
008900990730     C                   Z-ADD     *ZEROS        D$PNCI
009000990730     C                   Z-ADD     *ZEROS        D$PNRC
009100990730     C                   MOVEL     *BLANKS       D$PFDN
009200990730     C                   MOVEL     *BLANKS       D$PFFD
009300990730     C                   MOVEL     *BLANKS       D$PFTC
009400990730     C                   MOVEL     *BLANKS       D$PTC2
009500990730     C                   MOVEL     *BLANKS       D$PGC1
009600990730     C                   MOVEL     *BLANKS       D$PGC2
009700990730     C                   MOVEL     *BLANKS       D$PTCR
009800990730     C                   Z-ADD     *ZEROS        D$PDCR
009900990730     C                   Z-ADD     *ZEROS        D$PHCR
010000990730     C                   MOVEL     *BLANKS       D$PFBR
010100990730     C                   MOVEL     *BLANKS       D$PLL1
010200990730     C                   MOVEL     *BLANKS       D$PLL2
010300990730     C                   MOVEL     *BLANKS       D$PFA2
010400990730     C                   MOVEL     *BLANKS       D$PFCA
010500990730     C                   MOVEL     *BLANKS       D$PFA1
010600990730     C                   MOVEL     *BLANKS       D$PFGC
010700990730     C                   MOVEL     *BLANKS       D$PFDA
010800990730     C                   Z-ADD     *ZEROS        D$PGUF
010900990730     C                   MOVEL     *BLANKS       D$PFLO
011000990730     C                   Z-ADD     *ZEROS        D$PGGS
011100990730     C                   MOVEL     *BLANKS       D$PGGA
011200990730     C                   MOVEL     *BLANKS       D$PGMA
011300990730     C                   MOVEL     *BLANKS       D$PGVA
011400990730     C                   MOVEL     *BLANKS       D$PNZM
011500990730     C                   MOVEL     *BLANKS       D$PCAM
011600990730     C                   MOVEL     *BLANKS       D$PDIV
011700990730     C                   Z-ADD     *ZEROS        D$PPOR
011800990730     C                   MOVEL     *BLANKS       D$PSV1
011900990730     C                   Z-ADD     *ZEROS        D$PVA1
012000990730     C                   MOVEL     *BLANKS       D$PSV2
012100990730     C                   Z-ADD     *ZEROS        D$PVA2
012200990730     C                   MOVEL     *BLANKS       D$PSV3
012300990730     C                   Z-ADD     *ZEROS        D$PVA3
012400990730     C                   Z-ADD     *ZEROS        D$PIMV
012500990730     C                   Z-ADD     *ZEROS        D$PDFT
012600990730     C                   Z-ADD     *ZEROS        D$PNFT
012700990730     C                   Z-ADD     *ZEROS        D$PFIV
012800990730     C                   MOVEL     *BLANKS       D$PFEI
012900990730     C                   MOVEL     *BLANKS       D$PFTS
013000990730     C                   MOVEL     *BLANKS       D$PFIC
013100990805     C                   MOVEL     *BLANKS       D$PSCL
013200940527     C*
013300940527     C                   ENDSR
013400941123     C*------------------------------------------------------------------------*
013500940527     C*?ADDTAQ - AZZERA TUTTI I CAMPI DELLA DS -DOPO-
013600940527     C*------------------------------------------------------------------------*
013700940527     C     ADDTAQ        BEGSR
013800941123     C*
013900941123     C                   Z-ADD     *ZEROS        D$DAAS
014000990804     C                   Z-ADD     *ZEROS        D$DLNP
014100990804     C                   Z-ADD     *ZEROS        D$DNRS
014200990804     C                   Z-ADD     *ZEROS        D$DNSP
014300990804     C                   MOVEL     *BLANKS       D$DTBL
014400990804     C                   MOVEL     *BLANKS       D$DCBO
014500990804     C                   Z-ADD     *ZEROS        D$DMGS
014600990804     C                   Z-ADD     *ZEROS        D$DKSC
014700990804     C                   Z-ADD     *ZEROS        D$DLNA
014800990804     C                   Z-ADD     *ZEROS        D$DNCL
014900990804     C                   Z-ADD     *ZEROS        D$DPKB
015000990804     C                   MOVEL     *BLANKS       D$DFPB
015100990804     C                   Z-ADD     *ZEROS        D$DPKC
015200990804     C                   Z-ADD     *ZEROS        D$DNCP
015300990804     C                   Z-ADD     *ZEROS        D$DPKF
015400990804     C                   MOVEL     *BLANKS       D$DFPF
015500990804     C                   Z-ADD     *ZEROS        D$DPVL
015600990804     C                   MOVEL     *BLANKS       D$DFVB
015700990804     C                   Z-ADD     *ZEROS        D$DVLB
015800990804     C                   Z-ADD     *ZEROS        D$DVLC
015900990804     C                   Z-ADD     *ZEROS        D$DNCR
016000990804     C                   Z-ADD     *ZEROS        D$DVLF
016100990804     C                   MOVEL     *BLANKS       D$DFVF
016200990804     C                   Z-ADD     *ZEROS        D$DQFT
016300990804     C                   Z-ADD     *ZEROS        D$DIAS
016400990804     C                   MOVEL     *BLANKS       D$DVAS
016500990804     C                   MOVEL     *BLANKS       D$DFCM
016600990804     C                   Z-ADD     *ZEROS        D$DCTR
016700990804     C                   MOVEL     *BLANKS       D$DTSP
016800990804     C                   MOVEL     *BLANKS       D$DRSD
016900990804     C                   MOVEL     *BLANKS       D$DIND
017000990804     C                   MOVEL     *BLANKS       D$DCAD
017100990804     C                   MOVEL     *BLANKS       D$DLOD
017200990804     C                   MOVEL     *BLANKS       D$DPRD
017300990804     C                   MOVEL     *BLANKS       D$DNZD
017400990804     C                   MOVEL     *BLANKS       D$DCPD
017500990804     C                   MOVEL     *BLANKS       D$DCTS
017600990804     C                   MOVEL     *BLANKS       D$DFIN
017700990804     C                   Z-ADD     *ZEROS        D$DCCM
017800990804     C                   Z-ADD     *ZEROS        D$DRMN
017900990804     C                   MOVEL     *BLANKS       D$DMCT
018000990804     C                   MOVEL     *BLANKS       D$DFAP
018100990804     C                   MOVEL     *BLANKS       D$DFTM
018200990804     C                   MOVEL     *BLANKS       D$DNAS
018300990804     C                   Z-ADD     *ZEROS        D$DFLB
018400990804     C                   Z-ADD     *ZEROS        D$DFLP
018500990804     C                   Z-ADD     *ZEROS        D$DFL2
018600990804     C                   Z-ADD     *ZEROS        D$DTFA
018700990804     C                   Z-ADD     *ZEROS        D$DTFP
018800990804     C                   Z-ADD     *ZEROS        D$DDIM
018900990804     C                   MOVEL     *BLANKS       D$DSOP
019000990804     C                   Z-ADD     *ZEROS        D$DPDR
019100990804     C                   Z-ADD     *ZEROS        D$DDRT
019200990804     C                   Z-ADD     *ZEROS        D$DHRT
019300990804     C                   Z-ADD     *ZEROS        D$DNRT
019400990804     C                   MOVEL     *BLANKS       D$DFPP
019500990804     C                   Z-ADD     *ZEROS        D$DSTR
019600990804     C                   MOVEL     *BLANKS       D$DCTM
019700990804     C                   MOVEL     *BLANKS       D$DFNS
019800990804     C                   Z-ADD     *ZEROS        D$DFLS
019900990804     C                   Z-ADD     *ZEROS        D$DNCD
020000990804     C                   Z-ADD     *ZEROS        D$DNCA
020100990804     C                   MOVEL     *BLANKS       D$DXCO
020200990804     C                   Z-ADD     *ZEROS        D$DDBR
020300990804     C                   Z-ADD     *ZEROS        D$DDUC
020400990804     C                   Z-ADD     *ZEROS        D$DDTI
020500990804     C                   Z-ADD     *ZEROS        D$DHTI
020600990804     C                   Z-ADD     *ZEROS        D$DZNC
020700990804     C                   Z-ADD     *ZEROS        D$DPDC
020800990804     C                   Z-ADD     *ZEROS        D$DNDC
020900990804     C                   Z-ADD     *ZEROS        D$DDDC
021000990804     C                   Z-ADD     *ZEROS        D$DSTP
021100990804     C                   Z-ADD     *ZEROS        D$DDCE
021200990804     C                   Z-ADD     *ZEROS        D$DHCE
021300990804     C                   Z-ADD     *ZEROS        D$DDCP
021400990804     C                   Z-ADD     *ZEROS        D$DDCM
021500990804     C                   Z-ADD     *ZEROS        D$DHMC
021600990804     C                   MOVEL     *BLANKS       D$DCCA
021700990804     C                   Z-ADD     *ZEROS        D$DNPI
021800990804     C                   Z-ADD     *ZEROS        D$DNCI
021900990804     C                   Z-ADD     *ZEROS        D$DNRC
022000990804     C                   MOVEL     *BLANKS       D$DFDN
022100990804     C                   MOVEL     *BLANKS       D$DFFD
022200990804     C                   MOVEL     *BLANKS       D$DFTC
022300990804     C                   MOVEL     *BLANKS       D$DTC2
022400990804     C                   MOVEL     *BLANKS       D$DGC1
022500990804     C                   MOVEL     *BLANKS       D$DGC2
022600990804     C                   MOVEL     *BLANKS       D$DTCR
022700990804     C                   Z-ADD     *ZEROS        D$DDCR
022800990804     C                   Z-ADD     *ZEROS        D$DHCR
022900990804     C                   MOVEL     *BLANKS       D$DFBR
023000990804     C                   MOVEL     *BLANKS       D$DLL1
023100990804     C                   MOVEL     *BLANKS       D$DLL2
023200990804     C                   MOVEL     *BLANKS       D$DFA2
023300990804     C                   MOVEL     *BLANKS       D$DFCA
023400990804     C                   MOVEL     *BLANKS       D$DFA1
023500990804     C                   MOVEL     *BLANKS       D$DFGC
023600990804     C                   MOVEL     *BLANKS       D$DFDA
023700990804     C                   Z-ADD     *ZEROS        D$DGUF
023800990804     C                   MOVEL     *BLANKS       D$DFLO
023900990804     C                   Z-ADD     *ZEROS        D$DGGS
024000990804     C                   MOVEL     *BLANKS       D$DGGA
024100990804     C                   MOVEL     *BLANKS       D$DGMA
024200990804     C                   MOVEL     *BLANKS       D$DGVA
024300990804     C                   MOVEL     *BLANKS       D$DNZM
024400990804     C                   MOVEL     *BLANKS       D$DCAM
024500990804     C                   MOVEL     *BLANKS       D$DDIV
024600990804     C                   Z-ADD     *ZEROS        D$DPOR
024700990804     C                   MOVEL     *BLANKS       D$DSV1
024800990804     C                   Z-ADD     *ZEROS        D$DVA1
024900990804     C                   MOVEL     *BLANKS       D$DSV2
025000990804     C                   Z-ADD     *ZEROS        D$DVA2
025100990804     C                   MOVEL     *BLANKS       D$DSV3
025200990804     C                   Z-ADD     *ZEROS        D$DVA3
025300990804     C                   Z-ADD     *ZEROS        D$DIMV
025400990804     C                   Z-ADD     *ZEROS        D$DDFT
025500990804     C                   Z-ADD     *ZEROS        D$DNFT
025600990804     C                   Z-ADD     *ZEROS        D$DFIV
025700990804     C                   MOVEL     *BLANKS       D$DFEI
025800990804     C                   MOVEL     *BLANKS       D$DFTS
025900990804     C                   MOVEL     *BLANKS       D$DFIC
026000990805     C                   MOVEL     *BLANKS       D$DSCL
026100940527     C*
026200940527     C                   ENDSR
026300941128     C*------------------------------------------------------------------------*
026400941128     C*?AODTAQ - AZZERA TUTTI I CAMPI DELLA DS -ORIGINALE-
026500941128     C*------------------------------------------------------------------------*
026600941128     C     AODTAQ        BEGSR
026700941128     C*
026800941128     C                   Z-ADD     *ZEROS        D$OAAS
026900990804     C                   Z-ADD     *ZEROS        D$OLNP
027000990804     C                   Z-ADD     *ZEROS        D$ONRS
027100990804     C                   Z-ADD     *ZEROS        D$ONSP
027200990804     C                   MOVEL     *BLANKS       D$OTBL
027300990804     C                   MOVEL     *BLANKS       D$OCBO
027400990804     C                   Z-ADD     *ZEROS        D$OMGS
027500990804     C                   Z-ADD     *ZEROS        D$OKSC
027600990804     C                   Z-ADD     *ZEROS        D$OLNA
027700990804     C                   Z-ADD     *ZEROS        D$ONCL
027800990804     C                   Z-ADD     *ZEROS        D$OPKB
027900990804     C                   MOVEL     *BLANKS       D$OFPB
028000990804     C                   Z-ADD     *ZEROS        D$OPKC
028100990804     C                   Z-ADD     *ZEROS        D$ONCP
028200990804     C                   Z-ADD     *ZEROS        D$OPKF
028300990804     C                   MOVEL     *BLANKS       D$OFPF
028400990804     C                   Z-ADD     *ZEROS        D$OPVL
028500990804     C                   MOVEL     *BLANKS       D$OFVB
028600990804     C                   Z-ADD     *ZEROS        D$OVLB
028700990804     C                   Z-ADD     *ZEROS        D$OVLC
028800990804     C                   Z-ADD     *ZEROS        D$ONCR
028900990804     C                   Z-ADD     *ZEROS        D$OVLF
029000990804     C                   MOVEL     *BLANKS       D$OFVF
029100990804     C                   Z-ADD     *ZEROS        D$OQFT
029200990804     C                   Z-ADD     *ZEROS        D$OIAS
029300990804     C                   MOVEL     *BLANKS       D$OVAS
029400990804     C                   MOVEL     *BLANKS       D$OFCM
029500990804     C                   Z-ADD     *ZEROS        D$OCTR
029600990804     C                   MOVEL     *BLANKS       D$OTSP
029700990804     C                   MOVEL     *BLANKS       D$ORSD
029800990804     C                   MOVEL     *BLANKS       D$OIND
029900990804     C                   MOVEL     *BLANKS       D$OCAD
030000990804     C                   MOVEL     *BLANKS       D$OLOD
030100990804     C                   MOVEL     *BLANKS       D$OPRD
030200990804     C                   MOVEL     *BLANKS       D$ONZD
030300990804     C                   MOVEL     *BLANKS       D$OCPD
030400990804     C                   MOVEL     *BLANKS       D$OCTS
030500990804     C                   MOVEL     *BLANKS       D$OFIN
030600990804     C                   Z-ADD     *ZEROS        D$OCCM
030700990804     C                   Z-ADD     *ZEROS        D$ORMN
030800990804     C                   MOVEL     *BLANKS       D$OMCT
030900990804     C                   MOVEL     *BLANKS       D$OFAP
031000990804     C                   MOVEL     *BLANKS       D$OFTM
031100990804     C                   MOVEL     *BLANKS       D$ONAS
031200990804     C                   Z-ADD     *ZEROS        D$OFLB
031300990804     C                   Z-ADD     *ZEROS        D$OFLP
031400990804     C                   Z-ADD     *ZEROS        D$OFL2
031500990804     C                   Z-ADD     *ZEROS        D$OTFA
031600990804     C                   Z-ADD     *ZEROS        D$OTFP
031700990804     C                   Z-ADD     *ZEROS        D$ODIM
031800990804     C                   MOVEL     *BLANKS       D$OSOP
031900990804     C                   Z-ADD     *ZEROS        D$OPDR
032000990804     C                   Z-ADD     *ZEROS        D$ODRT
032100990804     C                   Z-ADD     *ZEROS        D$OHRT
032200990804     C                   Z-ADD     *ZEROS        D$ONRT
032300990804     C                   MOVEL     *BLANKS       D$OFPP
032400990804     C                   Z-ADD     *ZEROS        D$OSTR
032500990804     C                   MOVEL     *BLANKS       D$OCTM
032600990804     C                   MOVEL     *BLANKS       D$OFNS
032700990804     C                   Z-ADD     *ZEROS        D$OFLS
032800990804     C                   Z-ADD     *ZEROS        D$ONCD
032900990804     C                   Z-ADD     *ZEROS        D$ONCA
033000990804     C                   MOVEL     *BLANKS       D$OXCO
033100990804     C                   Z-ADD     *ZEROS        D$ODBR
033200990804     C                   Z-ADD     *ZEROS        D$ODUC
033300990804     C                   Z-ADD     *ZEROS        D$ODTI
033400990804     C                   Z-ADD     *ZEROS        D$OHTI
033500990804     C                   Z-ADD     *ZEROS        D$OZNC
033600990804     C                   Z-ADD     *ZEROS        D$OPDC
033700990804     C                   Z-ADD     *ZEROS        D$ONDC
033800990804     C                   Z-ADD     *ZEROS        D$ODDC
033900990804     C                   Z-ADD     *ZEROS        D$OSTP
034000990804     C                   Z-ADD     *ZEROS        D$ODCE
034100990804     C                   Z-ADD     *ZEROS        D$OHCE
034200990804     C                   Z-ADD     *ZEROS        D$ODCP
034300990804     C                   Z-ADD     *ZEROS        D$ODCM
034400990804     C                   Z-ADD     *ZEROS        D$OHMC
034500990804     C                   MOVEL     *BLANKS       D$OCCA
034600990804     C                   Z-ADD     *ZEROS        D$ONPI
034700990804     C                   Z-ADD     *ZEROS        D$ONCI
034800990804     C                   Z-ADD     *ZEROS        D$ONRC
034900990804     C                   MOVEL     *BLANKS       D$OFDN
035000990804     C                   MOVEL     *BLANKS       D$OFFD
035100990804     C                   MOVEL     *BLANKS       D$OFTC
035200990804     C                   MOVEL     *BLANKS       D$OTC2
035300990804     C                   MOVEL     *BLANKS       D$OGC1
035400990804     C                   MOVEL     *BLANKS       D$OGC2
035500990804     C                   MOVEL     *BLANKS       D$OTCR
035600990804     C                   Z-ADD     *ZEROS        D$ODCR
035700990804     C                   Z-ADD     *ZEROS        D$OHCR
035800990804     C                   MOVEL     *BLANKS       D$OFBR
035900990804     C                   MOVEL     *BLANKS       D$OLL1
036000990804     C                   MOVEL     *BLANKS       D$OLL2
036100990804     C                   MOVEL     *BLANKS       D$OFA2
036200990804     C                   MOVEL     *BLANKS       D$OFCA
036300990804     C                   MOVEL     *BLANKS       D$OFA1
036400990804     C                   MOVEL     *BLANKS       D$OFGC
036500990804     C                   MOVEL     *BLANKS       D$OFDA
036600990804     C                   Z-ADD     *ZEROS        D$OGUF
036700990804     C                   MOVEL     *BLANKS       D$OFLO
036800990804     C                   Z-ADD     *ZEROS        D$OGGS
036900990804     C                   MOVEL     *BLANKS       D$OGGA
037000990804     C                   MOVEL     *BLANKS       D$OGMA
037100990804     C                   MOVEL     *BLANKS       D$OGVA
037200990804     C                   MOVEL     *BLANKS       D$ONZM
037300990804     C                   MOVEL     *BLANKS       D$OCAM
037400990804     C                   MOVEL     *BLANKS       D$ODIV
037500990804     C                   Z-ADD     *ZEROS        D$OPOR
037600990804     C                   MOVEL     *BLANKS       D$OSV1
037700990804     C                   Z-ADD     *ZEROS        D$OVA1
037800990804     C                   MOVEL     *BLANKS       D$OSV2
037900990804     C                   Z-ADD     *ZEROS        D$OVA2
038000990804     C                   MOVEL     *BLANKS       D$OSV3
038100990804     C                   Z-ADD     *ZEROS        D$OVA3
038200990804     C                   Z-ADD     *ZEROS        D$OIMV
038300990804     C                   Z-ADD     *ZEROS        D$ODFT
038400990804     C                   Z-ADD     *ZEROS        D$ONFT
038500990804     C                   Z-ADD     *ZEROS        D$OFIV
038600990804     C                   MOVEL     *BLANKS       D$OFEI
038700990804     C                   MOVEL     *BLANKS       D$OFTS
038800990804     C                   MOVEL     *BLANKS       D$OFIC
038900990805     C                   MOVEL     *BLANKS       D$OSCL
039000941128     C*
039100941128     C                   ENDSR
039200940527     C*------------------------------------------------------------------------*
039300940527     C*?CPDTAQ - IMPOSTA TUTTI I CAMPI DELLA DS -PRIMA-
039400940527     C*------------------------------------------------------------------------*
039500940527     C     CPDTAQ        BEGSR
039600941123     C*
039700941123     C                   Z-ADD     TASAAS        D$PAAS
039800990804     C                   Z-ADD     TASLNP        D$PLNP
039900990804     C                   Z-ADD     TASNRS        D$PNRS
040000990804     C                   Z-ADD     TASNSP        D$PNSP
040100990804     C                   MOVEL     TASTBL        D$PTBL
040200990804     C                   MOVEL     TASCBO        D$PCBO
040300990804     C                   Z-ADD     TASMGS        D$PMGS
040400990804     C                   Z-ADD     TASKSC        D$PKSC
040500990804     C                   Z-ADD     TASLNA        D$PLNA
040600990804     C                   Z-ADD     TASNCL        D$PNCL
040700990804     C                   Z-ADD     TASPKB        D$PPKB
040800990804     C                   MOVEL     TASFPB        D$PFPB
040900990804     C                   Z-ADD     TASPKC        D$PPKC
041000990804     C                   Z-ADD     TASNCP        D$PNCP
041100990804     C                   Z-ADD     TASPKF        D$PPKF
041200990804     C                   MOVEL     TASFPF        D$PFPF
041300990804     C                   Z-ADD     TASPVL        D$PPVL
041400990804     C                   MOVEL     TASFVB        D$PFVB
041500990804     C                   Z-ADD     TASVLB        D$PVLB
041600990804     C                   Z-ADD     TASVLC        D$PVLC
041700990804     C                   Z-ADD     TASNCR        D$PNCR
041800990804     C                   Z-ADD     TASVLF        D$PVLF
041900990804     C                   MOVEL     TASFVF        D$PFVF
042000990804     C                   Z-ADD     TASQFT        D$PQFT
042100990804     C                   Z-ADD     TASIAS        D$PIAS
042200990804     C                   MOVEL     TASVAS        D$PVAS
042300990804     C                   MOVEL     TASFCM        D$PFCM
042400990804     C                   Z-ADD     TASCTR        D$PCTR
042500990804     C                   MOVEL     TASTSP        D$PTSP
042600990804     C                   MOVEL     TASRSD        D$PRSD
042700990804     C                   MOVEL     TASIND        D$PIND
042800990804     C                   MOVEL     TASCAD        D$PCAD
042900990804     C                   MOVEL     TASLOD        D$PLOD
043000990804     C                   MOVEL     TASPRD        D$PPRD
043100990804     C                   MOVEL     TASNZD        D$PNZD
043200990804     C                   MOVEL     TASCPD        D$PCPD
043300990804     C                   MOVEL     TASCTS        D$PCTS
043400990804     C                   MOVEL     TASFIN        D$PFIN
043500990804     C                   Z-ADD     TASCCM        D$PCCM
043600990804     C                   Z-ADD     TASRMN        D$PRMN
043700990804     C                   MOVEL     TASMCT        D$PMCT
043800990804     C                   MOVEL     TASFAP        D$PFAP
043900990804     C                   MOVEL     TASFTM        D$PFTM
044000990804     C                   MOVEL     TASNAS        D$PNAS
044100990804     C                   Z-ADD     TASFLB        D$PFLB
044200990804     C                   Z-ADD     TASFLP        D$PFLP
044300990804     C                   Z-ADD     TASFL2        D$PFL2
044400990804     C                   Z-ADD     TASTFA        D$PTFA
044500990804     C                   Z-ADD     TASTFP        D$PTFP
044600990804     C                   Z-ADD     TASDIM        D$PDIM
044700990804     C                   MOVEL     TASSOP        D$PSOP
044800990804     C                   Z-ADD     TASPDR        D$PPDR
044900990804     C                   Z-ADD     TASDRT        D$PDRT
045000990804     C                   Z-ADD     TASHRT        D$PHRT
045100990804     C                   Z-ADD     TASNRT        D$PNRT
045200990804     C                   MOVEL     TASFPP        D$PFPP
045300990804     C                   Z-ADD     TASSTR        D$PSTR
045400990804     C                   MOVEL     TASCTM        D$PCTM
045500990804     C                   MOVEL     TASFNS        D$PFNS
045600990804     C                   Z-ADD     TASFLS        D$PFLS
045700990804     C                   Z-ADD     TASNCD        D$PNCD
045800990804     C                   Z-ADD     TASNCA        D$PNCA
045900990804     C                   MOVEL     TASXCO        D$PXCO
046000990804     C                   Z-ADD     TASDBR        D$PDBR
046100990804     C                   Z-ADD     TASDUC        D$PDUC
046200990804     C                   Z-ADD     TASDTI        D$PDTI
046300990804     C                   Z-ADD     TASHTI        D$PHTI
046400990804     C                   Z-ADD     TASZNC        D$PZNC
046500990804     C                   Z-ADD     TASPDC        D$PPDC
046600990804     C                   Z-ADD     TASNDC        D$PNDC
046700990804     C                   Z-ADD     TASDDC        D$PDDC
046800990804     C                   Z-ADD     TASSTP        D$PSTP
046900990804     C                   Z-ADD     TASDCE        D$PDCE
047000990804     C                   Z-ADD     TASHCE        D$PHCE
047100990804     C                   Z-ADD     TASDCP        D$PDCP
047200990804     C                   Z-ADD     TASDCM        D$PDCM
047300990804     C                   Z-ADD     TASHMC        D$PHMC
047400990804     C                   MOVEL     TASCCA        D$PCCA
047500990804     C                   Z-ADD     TASNPI        D$PNPI
047600990804     C                   Z-ADD     TASNCI        D$PNCI
047700990804     C                   Z-ADD     TASNRC        D$PNRC
047800990804     C                   MOVEL     TASFDN        D$PFDN
047900990804     C                   MOVEL     TASFFD        D$PFFD
048000990804     C                   MOVEL     TASFTC        D$PFTC
048100990804     C                   MOVEL     TASTC2        D$PTC2
048200990804     C                   MOVEL     TASGC1        D$PGC1
048300990804     C                   MOVEL     TASGC2        D$PGC2
048400990804     C                   MOVEL     TASTCR        D$PTCR
048500990804     C                   Z-ADD     TASDCR        D$PDCR
048600990804     C                   Z-ADD     TASHCR        D$PHCR
048700990804     C                   MOVEL     TASFBR        D$PFBR
048800990804     C                   MOVEL     TASLL1        D$PLL1
048900990804     C                   MOVEL     TASLL2        D$PLL2
049000990804     C                   MOVEL     TASFA2        D$PFA2
049100990804     C                   MOVEL     TASFCA        D$PFCA
049200990804     C                   MOVEL     TASFA1        D$PFA1
049300990804     C                   MOVEL     TASFGC        D$PFGC
049400990804     C                   MOVEL     TASFDA        D$PFDA
049500990804     C                   Z-ADD     TASGUF        D$PGUF
049600990804     C                   MOVEL     TASFLO        D$PFLO
049700990804     C                   Z-ADD     TASGGS        D$PGGS
049800990804     C                   MOVEL     TASGGA        D$PGGA
049900990804     C                   MOVEL     TASGMA        D$PGMA
050000990804     C                   MOVEL     TASGVA        D$PGVA
050100990804     C                   MOVEL     TASNZM        D$PNZM
050200990804     C                   MOVEL     TASCAM        D$PCAM
050300990804     C                   MOVEL     TASDIV        D$PDIV
050400990804     C                   Z-ADD     TASPOR        D$PPOR
050500990804     C                   MOVEL     TASSV1        D$PSV1
050600990804     C                   Z-ADD     TASVA1        D$PVA1
050700990804     C                   MOVEL     TASSV2        D$PSV2
050800990804     C                   Z-ADD     TASVA2        D$PVA2
050900990804     C                   MOVEL     TASSV3        D$PSV3
051000990804     C                   Z-ADD     TASVA3        D$PVA3
051100990804     C                   Z-ADD     TASIMV        D$PIMV
051200990804     C                   Z-ADD     TASDFT        D$PDFT
051300990804     C                   Z-ADD     TASNFT        D$PNFT
051400990804     C                   Z-ADD     TASFIV        D$PFIV
051500990804     C                   MOVEL     TASFEI        D$PFEI
051600990804     C                   MOVEL     TASFTS        D$PFTS
051700990804     C                   MOVEL     TASFIC        D$PFIC
051800990805     C                   MOVEL     TASSCL        D$PSCL
051900941123     C*
052000940527     C                   ENDSR
052100940527     C*------------------------------------------------------------------------*
052200940527     C*?CDDTAQ - IMPOSTA TUTTI I CAMPI DELLA DS -DOPO-
052300940527     C*------------------------------------------------------------------------*
052400940527     C     CDDTAQ        BEGSR
052500941123     C*
052600941123     C                   Z-ADD     TASAAS        D$DAAS
052700990804     C                   Z-ADD     TASLNP        D$DLNP
052800990804     C                   Z-ADD     TASNRS        D$DNRS
052900990804     C                   Z-ADD     TASNSP        D$DNSP
053000990804     C                   MOVEL     TASTBL        D$DTBL
053100990804     C                   MOVEL     TASCBO        D$DCBO
053200990804     C                   Z-ADD     TASMGS        D$DMGS
053300990804     C                   Z-ADD     TASKSC        D$DKSC
053400990804     C                   Z-ADD     TASLNA        D$DLNA
053500990804     C                   Z-ADD     TASNCL        D$DNCL
053600990804     C                   Z-ADD     TASPKB        D$DPKB
053700990804     C                   MOVEL     TASFPB        D$DFPB
053800990804     C                   Z-ADD     TASPKC        D$DPKC
053900990804     C                   Z-ADD     TASNCP        D$DNCP
054000990804     C                   Z-ADD     TASPKF        D$DPKF
054100990804     C                   MOVEL     TASFPF        D$DFPF
054200990804     C                   Z-ADD     TASPVL        D$DPVL
054300990804     C                   MOVEL     TASFVB        D$DFVB
054400990804     C                   Z-ADD     TASVLB        D$DVLB
054500990804     C                   Z-ADD     TASVLC        D$DVLC
054600990804     C                   Z-ADD     TASNCR        D$DNCR
054700990804     C                   Z-ADD     TASVLF        D$DVLF
054800990804     C                   MOVEL     TASFVF        D$DFVF
054900990804     C                   Z-ADD     TASQFT        D$DQFT
055000990804     C                   Z-ADD     TASIAS        D$DIAS
055100990804     C                   MOVEL     TASVAS        D$DVAS
055200990804     C                   MOVEL     TASFCM        D$DFCM
055300990804     C                   Z-ADD     TASCTR        D$DCTR
055400990804     C                   MOVEL     TASTSP        D$DTSP
055500990804     C                   MOVEL     TASRSD        D$DRSD
055600990804     C                   MOVEL     TASIND        D$DIND
055700990804     C                   MOVEL     TASCAD        D$DCAD
055800990804     C                   MOVEL     TASLOD        D$DLOD
055900990804     C                   MOVEL     TASPRD        D$DPRD
056000990804     C                   MOVEL     TASNZD        D$DNZD
056100990804     C                   MOVEL     TASCPD        D$DCPD
056200990804     C                   MOVEL     TASCTS        D$DCTS
056300990804     C                   MOVEL     TASFIN        D$DFIN
056400990804     C                   Z-ADD     TASCCM        D$DCCM
056500990804     C                   Z-ADD     TASRMN        D$DRMN
056600990804     C                   MOVEL     TASMCT        D$DMCT
056700990804     C                   MOVEL     TASFAP        D$DFAP
056800990804     C                   MOVEL     TASFTM        D$DFTM
056900990804     C                   MOVEL     TASNAS        D$DNAS
057000990804     C                   Z-ADD     TASFLB        D$DFLB
057100990804     C                   Z-ADD     TASFLP        D$DFLP
057200990804     C                   Z-ADD     TASFL2        D$DFL2
057300990804     C                   Z-ADD     TASTFA        D$DTFA
057400990804     C                   Z-ADD     TASTFP        D$DTFP
057500990804     C                   Z-ADD     TASDIM        D$DDIM
057600990804     C                   MOVEL     TASSOP        D$DSOP
057700990804     C                   Z-ADD     TASPDR        D$DPDR
057800990804     C                   Z-ADD     TASDRT        D$DDRT
057900990804     C                   Z-ADD     TASHRT        D$DHRT
058000990804     C                   Z-ADD     TASNRT        D$DNRT
058100990804     C                   MOVEL     TASFPP        D$DFPP
058200990804     C                   Z-ADD     TASSTR        D$DSTR
058300990804     C                   MOVEL     TASCTM        D$DCTM
058400990804     C                   MOVEL     TASFNS        D$DFNS
058500990804     C                   Z-ADD     TASFLS        D$DFLS
058600990804     C                   Z-ADD     TASNCD        D$DNCD
058700990804     C                   Z-ADD     TASNCA        D$DNCA
058800990804     C                   MOVEL     TASXCO        D$DXCO
058900990804     C                   Z-ADD     TASDBR        D$DDBR
059000990804     C                   Z-ADD     TASDUC        D$DDUC
059100990804     C                   Z-ADD     TASDTI        D$DDTI
059200990804     C                   Z-ADD     TASHTI        D$DHTI
059300990804     C                   Z-ADD     TASZNC        D$DZNC
059400990804     C                   Z-ADD     TASPDC        D$DPDC
059500990804     C                   Z-ADD     TASNDC        D$DNDC
059600990804     C                   Z-ADD     TASDDC        D$DDDC
059700990804     C                   Z-ADD     TASSTP        D$DSTP
059800990804     C                   Z-ADD     TASDCE        D$DDCE
059900990804     C                   Z-ADD     TASHCE        D$DHCE
060000990804     C                   Z-ADD     TASDCP        D$DDCP
060100990804     C                   Z-ADD     TASDCM        D$DDCM
060200990804     C                   Z-ADD     TASHMC        D$DHMC
060300990804     C                   MOVEL     TASCCA        D$DCCA
060400990804     C                   Z-ADD     TASNPI        D$DNPI
060500990804     C                   Z-ADD     TASNCI        D$DNCI
060600990804     C                   Z-ADD     TASNRC        D$DNRC
060700990804     C                   MOVEL     TASFDN        D$DFDN
060800990804     C                   MOVEL     TASFFD        D$DFFD
060900990804     C                   MOVEL     TASFTC        D$DFTC
061000990804     C                   MOVEL     TASTC2        D$DTC2
061100990804     C                   MOVEL     TASGC1        D$DGC1
061200990804     C                   MOVEL     TASGC2        D$DGC2
061300990804     C                   MOVEL     TASTCR        D$DTCR
061400990804     C                   Z-ADD     TASDCR        D$DDCR
061500990804     C                   Z-ADD     TASHCR        D$DHCR
061600990804     C                   MOVEL     TASFBR        D$DFBR
061700990804     C                   MOVEL     TASLL1        D$DLL1
061800990804     C                   MOVEL     TASLL2        D$DLL2
061900990804     C                   MOVEL     TASFA2        D$DFA2
062000990804     C                   MOVEL     TASFCA        D$DFCA
062100990804     C                   MOVEL     TASFA1        D$DFA1
062200990804     C                   MOVEL     TASFGC        D$DFGC
062300990804     C                   MOVEL     TASFDA        D$DFDA
062400990804     C                   Z-ADD     TASGUF        D$DGUF
062500990804     C                   MOVEL     TASFLO        D$DFLO
062600990804     C                   Z-ADD     TASGGS        D$DGGS
062700990804     C                   MOVEL     TASGGA        D$DGGA
062800990804     C                   MOVEL     TASGMA        D$DGMA
062900990804     C                   MOVEL     TASGVA        D$DGVA
063000990804     C                   MOVEL     TASNZM        D$DNZM
063100990804     C                   MOVEL     TASCAM        D$DCAM
063200990804     C                   MOVEL     TASDIV        D$DDIV
063300990804     C                   Z-ADD     TASPOR        D$DPOR
063400990804     C                   MOVEL     TASSV1        D$DSV1
063500990804     C                   Z-ADD     TASVA1        D$DVA1
063600990804     C                   MOVEL     TASSV2        D$DSV2
063700990804     C                   Z-ADD     TASVA2        D$DVA2
063800990804     C                   MOVEL     TASSV3        D$DSV3
063900990804     C                   Z-ADD     TASVA3        D$DVA3
064000990804     C                   Z-ADD     TASIMV        D$DIMV
064100990804     C                   Z-ADD     TASDFT        D$DDFT
064200990804     C                   Z-ADD     TASNFT        D$DNFT
064300990804     C                   Z-ADD     TASFIV        D$DFIV
064400990804     C                   MOVEL     TASFEI        D$DFEI
064500990804     C                   MOVEL     TASFTS        D$DFTS
064600990804     C                   MOVEL     TASFIC        D$DFIC
064700990805     C                   MOVEL     TASSCL        D$DSCL
064800941123     C*
064900940527     C                   ENDSR
065000941128     C*------------------------------------------------------------------------*
065100941128     C*?CODTAQ - IMPOSTA TUTTI I CAMPI DELLA DS -ORIGINALE-
065200941128     C*------------------------------------------------------------------------*
065300941128     C     CODTAQ        BEGSR
065400941128     C*
065500941128     C                   Z-ADD     TASAAS        D$OAAS
065600990804     C                   Z-ADD     TASLNP        D$OLNP
065700990804     C                   Z-ADD     TASNRS        D$ONRS
065800990804     C                   Z-ADD     TASNSP        D$ONSP
065900990804     C                   MOVEL     TASTBL        D$OTBL
066000990804     C                   MOVEL     TASCBO        D$OCBO
066100990804     C                   Z-ADD     TASMGS        D$OMGS
066200990804     C                   Z-ADD     TASKSC        D$OKSC
066300990804     C                   Z-ADD     TASLNA        D$OLNA
066400990804     C                   Z-ADD     TASNCL        D$ONCL
066500990804     C                   Z-ADD     TASPKB        D$OPKB
066600990804     C                   MOVEL     TASFPB        D$OFPB
066700990804     C                   Z-ADD     TASPKC        D$OPKC
066800990804     C                   Z-ADD     TASNCP        D$ONCP
066900990804     C                   Z-ADD     TASPKF        D$OPKF
067000990804     C                   MOVEL     TASFPF        D$OFPF
067100990804     C                   Z-ADD     TASPVL        D$OPVL
067200990804     C                   MOVEL     TASFVB        D$OFVB
067300990804     C                   Z-ADD     TASVLB        D$OVLB
067400990804     C                   Z-ADD     TASVLC        D$OVLC
067500990804     C                   Z-ADD     TASNCR        D$ONCR
067600990804     C                   Z-ADD     TASVLF        D$OVLF
067700990804     C                   MOVEL     TASFVF        D$OFVF
067800990804     C                   Z-ADD     TASQFT        D$OQFT
067900990804     C                   Z-ADD     TASIAS        D$OIAS
068000990804     C                   MOVEL     TASVAS        D$OVAS
068100990804     C                   MOVEL     TASFCM        D$OFCM
068200990804     C                   Z-ADD     TASCTR        D$OCTR
068300990804     C                   MOVEL     TASTSP        D$OTSP
068400990804     C                   MOVEL     TASRSD        D$ORSD
068500990804     C                   MOVEL     TASIND        D$OIND
068600990804     C                   MOVEL     TASCAD        D$OCAD
068700990804     C                   MOVEL     TASLOD        D$OLOD
068800990804     C                   MOVEL     TASPRD        D$OPRD
068900990804     C                   MOVEL     TASNZD        D$ONZD
069000990804     C                   MOVEL     TASCPD        D$OCPD
069100990804     C                   MOVEL     TASCTS        D$OCTS
069200990804     C                   MOVEL     TASFIN        D$OFIN
069300990804     C                   Z-ADD     TASCCM        D$OCCM
069400990804     C                   Z-ADD     TASRMN        D$ORMN
069500990804     C                   MOVEL     TASMCT        D$OMCT
069600990804     C                   MOVEL     TASFAP        D$OFAP
069700990804     C                   MOVEL     TASFTM        D$OFTM
069800990804     C                   MOVEL     TASNAS        D$ONAS
069900990804     C                   Z-ADD     TASFLB        D$OFLB
070000990804     C                   Z-ADD     TASFLP        D$OFLP
070100990804     C                   Z-ADD     TASFL2        D$OFL2
070200990804     C                   Z-ADD     TASTFA        D$OTFA
070300990804     C                   Z-ADD     TASTFP        D$OTFP
070400990804     C                   Z-ADD     TASDIM        D$ODIM
070500990804     C                   MOVEL     TASSOP        D$OSOP
070600990804     C                   Z-ADD     TASPDR        D$OPDR
070700990804     C                   Z-ADD     TASDRT        D$ODRT
070800990804     C                   Z-ADD     TASHRT        D$OHRT
070900990804     C                   Z-ADD     TASNRT        D$ONRT
071000990804     C                   MOVEL     TASFPP        D$OFPP
071100990804     C                   Z-ADD     TASSTR        D$OSTR
071200990804     C                   MOVEL     TASCTM        D$OCTM
071300990804     C                   MOVEL     TASFNS        D$OFNS
071400990804     C                   Z-ADD     TASFLS        D$OFLS
071500990804     C                   Z-ADD     TASNCD        D$ONCD
071600990804     C                   Z-ADD     TASNCA        D$ONCA
071700990804     C                   MOVEL     TASXCO        D$OXCO
071800990804     C                   Z-ADD     TASDBR        D$ODBR
071900990804     C                   Z-ADD     TASDUC        D$ODUC
072000990804     C                   Z-ADD     TASDTI        D$ODTI
072100990804     C                   Z-ADD     TASHTI        D$OHTI
072200990804     C                   Z-ADD     TASZNC        D$OZNC
072300990804     C                   Z-ADD     TASPDC        D$OPDC
072400990804     C                   Z-ADD     TASNDC        D$ONDC
072500990804     C                   Z-ADD     TASDDC        D$ODDC
072600990804     C                   Z-ADD     TASSTP        D$OSTP
072700990804     C                   Z-ADD     TASDCE        D$ODCE
072800990804     C                   Z-ADD     TASHCE        D$OHCE
072900990804     C                   Z-ADD     TASDCP        D$ODCP
073000990804     C                   Z-ADD     TASDCM        D$ODCM
073100990804     C                   Z-ADD     TASHMC        D$OHMC
073200990804     C                   MOVEL     TASCCA        D$OCCA
073300990804     C                   Z-ADD     TASNPI        D$ONPI
073400990804     C                   Z-ADD     TASNCI        D$ONCI
073500990804     C                   Z-ADD     TASNRC        D$ONRC
073600990804     C                   MOVEL     TASFDN        D$OFDN
073700990804     C                   MOVEL     TASFFD        D$OFFD
073800990804     C                   MOVEL     TASFTC        D$OFTC
073900990804     C                   MOVEL     TASTC2        D$OTC2
074000990804     C                   MOVEL     TASGC1        D$OGC1
074100990804     C                   MOVEL     TASGC2        D$OGC2
074200990804     C                   MOVEL     TASTCR        D$OTCR
074300990804     C                   Z-ADD     TASDCR        D$ODCR
074400990804     C                   Z-ADD     TASHCR        D$OHCR
074500990804     C                   MOVEL     TASFBR        D$OFBR
074600990804     C                   MOVEL     TASLL1        D$OLL1
074700990804     C                   MOVEL     TASLL2        D$OLL2
074800990804     C                   MOVEL     TASFA2        D$OFA2
074900990804     C                   MOVEL     TASFCA        D$OFCA
075000990804     C                   MOVEL     TASFA1        D$OFA1
075100990804     C                   MOVEL     TASFGC        D$OFGC
075200990804     C                   MOVEL     TASFDA        D$OFDA
075300990804     C                   Z-ADD     TASGUF        D$OGUF
075400990804     C                   MOVEL     TASFLO        D$OFLO
075500990804     C                   Z-ADD     TASGGS        D$OGGS
075600990804     C                   MOVEL     TASGGA        D$OGGA
075700990804     C                   MOVEL     TASGMA        D$OGMA
075800990804     C                   MOVEL     TASGVA        D$OGVA
075900990804     C                   MOVEL     TASNZM        D$ONZM
076000990804     C                   MOVEL     TASCAM        D$OCAM
076100990804     C                   MOVEL     TASDIV        D$ODIV
076200990804     C                   Z-ADD     TASPOR        D$OPOR
076300990804     C                   MOVEL     TASSV1        D$OSV1
076400990804     C                   Z-ADD     TASVA1        D$OVA1
076500990804     C                   MOVEL     TASSV2        D$OSV2
076600990804     C                   Z-ADD     TASVA2        D$OVA2
076700990804     C                   MOVEL     TASSV3        D$OSV3
076800990804     C                   Z-ADD     TASVA3        D$OVA3
076900990804     C                   Z-ADD     TASIMV        D$OIMV
077000990804     C                   Z-ADD     TASDFT        D$ODFT
077100990804     C                   Z-ADD     TASNFT        D$ONFT
077200990804     C                   Z-ADD     TASFIV        D$OFIV
077300990804     C                   MOVEL     TASFEI        D$OFEI
077400990804     C                   MOVEL     TASFTS        D$OFTS
077500990804     C                   MOVEL     TASFIC        D$OFIC
077600990805     C                   MOVEL     TASSCL        D$OSCL
077700941128     C*
077800941128     C                   ENDSR
