000010110510     A*%%TS  SD  20110510  152205  EDPBA       REL-V6R1M0  5761-WDS
000020110510     A*%%EC
000030110510     A                                      DSPSIZ(24 80 *DS3)
000040110510     A          R TREC01
000050110510     A*%%TS  SD  20110510  152205  EDPBA       REL-V6R1M0  5761-WDS
000060110510     A                                      WINDOW(5 35 15 30)
000070110510     A                                      CF03
000080110510     A                                      CA06
000090110510     A                                      OVERLAY
000100110510     A                                      RMVWDW
000110110510     A                                      USRRSTDSP
000120110510     A                                  1  2'Tariffe C/E 201 + C/E budget'
000130110510     A                                      COLOR(BLU)
000140110510     A                                  3  2'Libreria ARRIVO'
000150110510     A            LIBOUTV       10A  B  3 20
000160110510     A N01                                  DSPATR(HI)
000170110510     A  01                                  DSPATR(RI)
000180110510     A  01                                  DSPATR(PC)
000190110510     A                                  8  2'Libreria budget'
000200110510     A            LIBINPV       10A  B  8 20
000210110510     A N02                                  DSPATR(HI)
000220110510     A  02                                  DSPATR(RI)
000230110510     A  02                                  DSPATR(PC)
000240110510     A                                  6  2'Libreria 201   '
000250110510     A            LIB201V       10A  O  6 20
000260110510     A                                 10  2'Data decorrenza'
000270110510     A            DTADECV        8Y 0B 10 20EDTWRD('  /  /    ')
000280110510     A                                      EDTMSK('  &  &    ')
000290110510     A N04                                  DSPATR(HI)
000300110510     A  04                                  DSPATR(RI)
000310110510     A  04                                  DSPATR(PC)
000320110510     A                                 12  2'Controllo tariffe'
000330110510     A            CTRV           1A  B 12 22DSPATR(HI)
000340110510     A                                      VALUES('S' 'N')
000350110510     A                                 12 25'(S/N)'
000360110510     A                                 14  2'F3=Fine'
000370110510     A                                      COLOR(BLU)
000380110510     A                                 14 14'F6=Conferma'
000390110510     A                                      COLOR(BLU)
000400050426     A          R ASSUME
000410050426     A*%%TS  SD  19940608  111038  CAMPORESI   REL-V2R2M0  5738-PW1
000420050426     A                                      TEXT('Serve x preservare il video p-
000430050426     A                                      recedente')
000440050426     A                                      ASSUME
000450050426     A                                  1  2' '
