000100130517      */*PRM devtype(*AFPDS) pagesize(70 136 *rowcol) lpi(6) cpi(16,7)
000200130405      */*PRM ovrflw(69) prtqlty(*STD) drawer(*FORMDF)
000300130531      */*PRM uom(*INCH) formtype(LET1) save(*NO) usrdta('Contatti')
000400130405      */*END
000500130405
000600130405      *---------------------------------------------------------------*
000700130409      *?Stampa RIFERIMENTI e CONTATTI x cliente (su carta intestata) ?*
000800130531      *?- ex organigramma di filiale - Lingua Inglese                ?*
000900130405      *---------------------------------------------------------------*
001000130405
001100130405     A                                      REF(CNDIZION)
001200130405
001300130405      *---------------------------------------------------------------*
001400130405      *?Testo letera per cliente di filiale (di 1° e 2° livello)     ?*
001500130405      *---------------------------------------------------------------*
001600130405
001700130405     A          R SD30TXT
001800130405     A                                      TEXT('Testo fil. di 1° e 2° liv.')
001900130405      *
002000130405      * » FONT(font-identifier point-size)
002100130405      *
002200130409      * » FNTCHRSET([library-name/ | &library-name-field/]
002300130409      *             font-character-set | &font-character-set-field
002400130409      *             [library-name/ | &library-name-field/]
002500130409      *             code-page | &code-page-field
002600130409      *             [(*POINTSIZE height-value | &height-value-field
002700130409      *             width-value | &width-value-field)])
002800130409      *
002900130409      * » CDEFNT([library-name/ | &library-name-field/]
003000130409      *          coded-font-name | &coded-font-name-field
003100130409      *          [(*POINTSIZE height-value | &height-value-field
003200130409      *          width-value | &width-value-field)])
003300130409      *
003400130405      *
003500130531     A                                      FNTCHRSET(GAITRAOBJ/CZH200 +
003600130531     A                                                QFNTCPL/T1001144 +
003700130531     A                                               (*POINTSIZE 10.0))
003800130531     A*//                                   FONT(02304 (*POINTSIZE 10))
003900130405      *
004000130521     A                                    10
004100130531     A                                      'Branch:'
004200130521     A                                      SKIPB(0011)
004300130521      *
004400130521     A            O30FILD   R             10
004500130521     A                                      REFFLD(ORGDES     AZORG00F)
004600130521     A                                      SPACEB(0001)
004700130521      *
004800130521     A            O30FILI   R             10
004900130521     A                                      REFFLD(ORGIND     AZORG00F)
005000130521     A                                      SPACEB(0001)
005100130521      *
005200130521     A            O30FILA   R             10
005300130521     A                                      REFFLD(ORGCPF     AZORG00F)
005400130521     A                                      SPACEB(0001)
005500130521     A            O30FILLP  R   +5       + 5
005600130521     A                                      REFFLD(ORGLOC     AZORG00F)
005700130521     A                                    71
005800130531     A                                      'To:'
005900130521      *
006000130521     A            O30RSC    R             71
006100130521     A                                      REFFLD(ACORAG     CNACO00F)
006200130521     A                                      SPACEB(0001)
006300130521      *
006400130517     A            O30IND    R             71
006500130516     A                                      REFFLD(INDVIA     CNIND00F)
006600130521     A                                      SPACEB(0001)
006700130516      *
006800130517     A*//         O30CAP    R             71
006900130517     A*//                                   REFFLD(INDCAE     CNIND00F)
007000130521     A*//                                   SPACEB(0001)
007100130517     A*//         O30LOC    R   25       + 1
007200130517     A*//                                   REFFLD(INDCIT     CNIND00F)
007300130517     A*//         O30PRO    R            + 2
007400130517     A*//                                   REFFLD(INDPRV     CNIND00F)
007500130517     A            O30CALOPR     43        71
007600130517     A                                      TEXT('CAP + LOCALITÀ + PROV.')
007700130521     A                                      SPACEB(0001)
007800130516      *
007900130517     A            O30NAZ    R             71
008000130516     A                                      REFFLD(§15DES     DS15)
008100130516     A                                      TEXT('DESCRIZIONE NAZIONE')
008200130521     A                                      SPACEB(0001)
008300130409      *
008400130517     A            O30ACA    R             71
008500130409     A                                      REFFLD(NTCRNT     TFNTC00F)
008600130515     A                                      SPACEB(0001)
008700130517      *
008800130517     A            O30DAT        35        10
008900130517     A                                      TEXT('LOCALITÀ, DATA')
009000130517     A                                      SPACEB(0003)
009100130517      *
009200130521     A                                    53
009300130531     A                                      'USEFUL CONTACTS'
009400130531     A                                      SPACEB(0004)
009500130531     A                                      FNTCHRSET(GAITRAOBJ/CZH400 +
009600130531     A                                                QFNTCPL/T1001144 +
009700130531     A                                               (*POINTSIZE 13.0))
009800130531     A*//                                   FONT(02305 (*POINTSIZE 13))
009900130405      *
010000130517     A                                    10
010100130531     A                                      'Commercial representative'
010200130531     A                                      SPACEB(0004)
010300130531     A                                      FNTCHRSET(GAITRAOBJ/CZH400 +
010400130531     A                                                QFNTCPL/T1001144 +
010500130531     A                                               (*POINTSIZE 12.0))
010600130531     A*//                                   FONT(02305 (*POINTSIZE 12))
010700130521     A                                      UNDERLINE
010800130405      *
010900130517     A            O30COMD   R             10
011000131108     A                                      REFFLD(NTCRNT     AZNTC00F)
011100130531     A                                      SPACEB(0002)
011200130531     A                                      FNTCHRSET(GAITRAOBJ/CZH400 +
011300130531     A                                                QFNTCPL/T1001144 +
011400130531     A                                               (*POINTSIZE 10.0))
011500130531     A*//                                   FONT(02305 (*POINTSIZE 10))
011600130409      *
011700130517     A                                    10
011800130531     A                                      'Telephone:'
011900130521     A                                      SPACEB(0002)
012000130531     A            O30COMT   R             22
012100130515     A                                      REFFLD(ORGTEL     AZORG00F)
012200130521     A                                    10
012300130531     A                                      'e-mail:   '
012400130521     A                                      SPACEB(0001)
012500130531     A            O30COME   R             22
012600131108     A                                      REFFLD(NTCRNT     AZNTC00F)
012700130405      *
012800130517     A                                    10
012900130405     A                                      'www.brt.it'
013000130531     A                                      SPACEB(0004)
013100130531     A                                      FNTCHRSET(GAITRAOBJ/CZH400 +
013200130531     A                                                QFNTCPL/T1001144 +
013300130531     A                                               (*POINTSIZE 13.0))
013400130531     A*//                                   FONT(02305 (*POINTSIZE 13))
013500130405     A                                      UNDERLINE
013600130405      *
013700130521     A                                    10
013800130531     A                                      'Entering your username and -
013900130531     A                                      password in the Customer Area, -
014000130531     A                                      you can use our 24-hour online -
014100130531     A                                      services to:'
014200130521     A                                      SPACEB(0002)
014300130405      *
014400130517     A                                    14
014500130531     A                                      '·  Request collection of a -
014600130531     A                                      shipment'
014700130515     A                                      SPACEB(0002)
014800130521     A                                    14
014900130531     A                                      '·  Check the status of your -
015000130531     A                                      shipments'
015100130521     A                                      SPACEB(0001)
015200130521     A                                    14
015300130531     A                                      '·  View the carriage note signed -
015400130531     A                                      by the consignee'
015500130521     A                                      SPACEB(0001)
015600130521     A                                    14
015700130531     A                                      '·  Manage undelivered goods'
015800130521     A                                      SPACEB(0001)
015900130517     A                                    14
016000130531     A                                      '·  Calculate the cost of a -
016100130531     A                                      shipment'
016200130405     A                                      SPACEB(0001)
016300130517     A                                    14
016400130531     A                                      '·  Check the status of COD -
016500130531     A                                      consignments'
016600130405     A                                      SPACEB(0001)
016700130405      *
016800130517     A                                    10
016900130531     A                                      'Customer Service:'
017000130531     A                                      FNTCHRSET(GAITRAOBJ/CZH400 +
017100130531     A                                                QFNTCPL/T1001144 +
017200130531     A                                               (*POINTSIZE 12.0))
017300130531     A*//                                   FONT(02305 (*POINTSIZE 12))
017400130405     A                                      UNDERLINE
017500130517     A                                      SPACEB(0004)
017600130517     A            O30ACLT   R             40
017700130517     A                                      REFFLD($TELE)
017800130531     A                                      FNTCHRSET(GAITRAOBJ/CZH400 +
017900130531     A                                                QFNTCPL/T1001144 +
018000130531     A                                               (*POINTSIZE 12.0))
018100130531     A*//                                   FONT(02305 (*POINTSIZE 12))
018200130405      *
018300130528     A            O30ACL        80A       10
018400130405     A                                      TEXT('ORARI DAL LUNEDÌ AL VENERDÌ')
018500130528     A                                      SPACEB(0002)
018600130409      *
018700130517     A                                    10
018800130531     A                                      'Fax:     '
018900130517     A                                      SPACEB(0002)
019000130531     A            O30ACLF   R             22
019100130515     A                                      REFFLD($TELE)
019200130517     A                                    10
019300130405     A                                      'e-mail:  '
019400130405     A                                      SPACEB(0001)
019500130531     A            O30ACLE   R             22
019600131108     A                                      REFFLD(NTCRNT     AZNTC00F)
019700130517      *
019800130517     A            O30RSUO   R             95
019900130517     A                                      REFFLD(RSUTOLD    DDATIUTE)
020000130517     A                                      SPACEB(005)
