000010170105     A*%%TS  SD  20170105  103712  EDPES       REL-V7R1M0  5770-WDS
000020000000     A*
000030170105     A*%%EC
000040170105     A                                      DSPSIZ(24 80 *DS3)
000050170105     A                                      CHGINPDFT(HI CS)
000060170105     A                                      PRINT
000070170105     A                                      CF01
000080170105     A                                      CF02
000090170105     A                                      CF03
000100170105     A                                      CF04
000110170105     A                                      CF05
000120170105     A                                      CF06
000130170105     A                                      CF07
000140170105     A                                      CF08
000150170105     A                                      CF09
000160170105     A                                      CF10
000170170105     A                                      CF11
000180170105     A                                      CF12
000190170105     A                                      CF13
000200170105     A                                      CF14
000210170105     A                                      CF15
000220170105     A                                      CF16
000230170105     A                                      CF17
000240170105     A                                      CF18
000250170105     A                                      CF19
000260170105     A                                      CF20
000270170105     A                                      CF21
000280170105     A                                      CF22
000290170105     A                                      CF23
000300170105     A                                      CF24
000310170105     A                                      HELP
000320930204     A* Record TESTATA
000330970730     A          R SD97D01
000340931202     A*%%TS  SD  19931202  170140  EDPSL       REL-V2R1M0  5738-PW1
000350010822     A            KNSIF         10A  O  1  2
000360931202     A                                  1 23'* T E M P I   D I   D E L I V E R -
000370931202     A                                      Y  *'
000380931202     A                                      DSPATR(RI)
000390931202     A                                      DSPATR(UL)
000400010822     A                                  1 62'TNSD97R'
000410931202     A                                  1 71DATE
000420931202     A                                      EDTCDE(Y)
000430930204     A*
000440930204     A* Record FUNZIONI
000450150415     A          R SD97D02
000460150415     A*%%TS  SD  20150415  094005  EDPES       REL-V7R1M0  5770-WDS
000470150415     A                                      OVERLAY
000480150415     A            FUN005        19A  H
000490150415     A            FUN006        19A  H
000500150415     A            FUN007        19A  H
000510150415     A            FUN008        19A  H
000520150415     A            FUN002        19A  O 24 22
000530150415     A            FUN003        19A  O 24 42
000540150415     A            FUN004        19A  O 24 62
000550930204     A*
000560930204     A* Record DETTAGLIO
000570170105     A          R SD97D03
000580170105     A*%%TS  SD  20170105  103712  EDPES       REL-V7R1M0  5770-WDS
000590170105     A                                      OVERLAY
000600170105     A                                  3  2'Tipo bolla P/A:'
000610170105     A            D98TBO         1A  B  3 18DSPATR(UL)
000620170105     A                                  3 26'BOLLA:'
000630170105     A                                      DSPATR(UL)
000640170105     A                                      DSPATR(HI)
000650170105     A                                  3 33'Anno'
000660170105     A            D98AAS         4Y 0B  3 38EDTCDE(Z)
000670170105     A                                      DSPATR(UL)
000680170105     A                                  3 44'LNP'
000690170105     A            D98LNP         3Y 0B  3 48EDTCDE(Z)
000700170105     A                                      DSPATR(UL)
000710170105     A                                  3 53'Serie'
000720170105     A            D98NRS         2Y 0B  3 59EDTCDE(Z)
000730170105     A                                      DSPATR(UL)
000740170105     A                                  3 63'Spediz'
000750170105     A            D98NSP         7Y 0B  3 70EDTCDE(Z)
000760170105     A                                      DSPATR(UL)
000770170105     A                                  4  2'CONSEGNABILITA'':'
000780170105     A                                      DSPATR(UL)
000790170105     A                                  4 19'Inizio'
000800170105     A            D98DIC         8Y 0B  4 26DSPATR(UL)
000810170105     A                                  4 35'/'
000820170105     A            D98OIC         4Y 0B  4 37DSPATR(UL)
000830170105     A                                      EDTWRD(' 0:  ')
000840170105     A                                  4 43'Fine:'
000850170105     A            D98DFC         8Y 0B  4 49DSPATR(UL)
000860170105     A                                  4 59'/'
000870170105     A            D98OFC         4Y 0B  4 61DSPATR(UL)
000880170105     A                                      EDTWRD(' 0:  ')
000890170105     A                                  4 67'TSP forz'
000900170105     A            I98TSP_FOR     1A  B  4 76VALUES(' ' 'C' 'D' 'E' 'H')
000910170105     A                                  5  2'Dt.Riferimento calcolo Affidabilit-
000920170105     A                                      à PARTENZA :'
000930170105     A            D98DRF         8Y 0B  5 49DSPATR(UL)
000940170105     A                                  5 59'/'
000950170105     A            D98ORF         4Y 0B  5 61DSPATR(UL)
000960170105     A                                      EDTWRD(' 0:  ')
000970170105     A                                  5 72'TLA'
000980170105     A            D98TLA         1A  B  5 76VALUES(' ' 'T' 'C')
000990170105     A                                  5 78'(T)'
001000170105     A                                  6  2'Errore:'
001010170105     A            D98ERR         1A  B  6 10
001020170105     A                                  6 18'Messaggio:'
001030170105     A            D98MSG        80A  B  6 29
001040170105     A                                  7 32'I Part C'
001050170105     A                                      DSPATR(UL)
001060170105     A                                  7 45'I Traz C'
001070170105     A                                      DSPATR(UL)
001080170105     A                                  7 58'I Cons C'
001090170105     A                                      DSPATR(UL)
001100170105     A                                  7 71'I Resa C'
001110170105     A                                      DSPATR(UL)
001120170105     A                                  8  2'Ore Teoriche.............:'
001130170105     A            D98TPI         3S 0B  8 31
001140170105     A            D98TPC         3S 0B  8 37
001150170105     A            D98TTI         3S 0B  8 44
001160170105     A            D98TTC         3S 0B  8 50
001170170105     A            D98TCI         3S 0B  8 57
001180170105     A            D98TCC         3S 0B  8 63
001190170105     A            D98TRI         3S 0B  8 70
001200170105     A            D98TRC         3S 0B  8 76
001210170105     A                                  9  2'Ore Reali................:'
001220170105     A            D98RPI         3S 0B  9 31
001230170105     A            D98RPC         3S 0B  9 37
001240170105     A            D98RTI         3S 0B  9 44
001250170105     A            D98RTC         3S 0B  9 50
001260170105     A            D98RCI         3S 0B  9 57
001270170105     A            D98RCC         3S 0B  9 63
001280170105     A            D98RRI         3S 0B  9 70
001290170105     A            D98RRC         3S 0B  9 76
001300170105     A                                 10  2'Ore Differenza...........:'
001310170105     A            D98FPI         3S 0B 10 31
001320170105     A            D98FPC         3S 0B 10 37
001330170105     A            D98FTI         3S 0B 10 44
001340170105     A            D98FTC         3S 0B 10 50
001350170105     A            D98FCI         3S 0B 10 57
001360170105     A            D98FCC         3S 0B 10 63
001370170105     A            D98FRI         3S 0B 10 70
001380170105     A            D98FRC         3S 0B 10 76
001390170105     A                                 11  2'Conformità...............:'
001400170105     A            D98CPI         1A  B 11 33
001410170105     A            D98CPC         1A  B 11 39
001420170105     A            D98CTI         1A  B 11 46
001430170105     A            D98CTC         1A  B 11 52
001440170105     A            D98CCI         1A  B 11 59
001450170105     A            D98CCC         1A  B 11 65
001460170105     A            D98CRI         1A  B 11 72
001470170105     A            D98CRC         1A  B 11 78
001480170105     A                                 12  2'Ore non conformità.......:'
001490170105     A            D98NPI         3S 0B 12 31
001500170105     A            D98NPC         3S 0B 12 37
001510170105     A            D98NTI         3S 0B 12 44
001520170105     A            D98NTC         3S 0B 12 50
001530170105     A            D98NCI         3S 0B 12 57
001540170105     A            D98NCC         3S 0B 12 63
001550170105     A            D98NRI         3S 0B 12 70
001560170105     A            D98NRC         3S 0B 12 76
001570170105     A                                 13  2'FeTr'
001580170105     A            D98HFC         3S 0B 13  7
001590170105     A                                 13 12'FeCl'
001600170105     A            D98HEC         3S 0B 13 17
001610170105     A                                 13 22'ChTu'
001620170105     A            D98HHC         3S 0B 13 27
001630170105     A                                 13 32'Giac'
001640170105     A            D98HGC         3S 0B 13 37
001650170105     A                                 13 42'LAvv'
001660170105     A            D98HLC         3S 0B 13 47
001670170105     A                                 13 53'C/A'
001680170105     A            D98HOC         3S 0B 13 57
001690170105     A                                 13 62'CRic'
001700170105     A            D98HRC         3S 0B 13 67
001710170105     A                                 13 72'FD:'
001720170105     A            D98HDC         3S 0B 13 76
001730170105     A                                 14  2'EventiPart:'
001740170105     A                                 14 14'GIUST.'
001750170105     A            D98HEGC        3S 0B 14 22
001760170105     A                                 14 29'ALLUNGA'
001770170105     A            D98HEAC        3S 0B 14 37
001780170105     A                                 14 70'TipServ'
001790170105     A            D98TSP         1A  B 14 78
001800170105     A                                 15  2'Naz:'
001810170105     A            D98NZD         3A  B 15  7
001820170105     A                                 15 12'CAP:'
001830170105     A            D98CAD         9A  B 15 17
001840170105     A                                 15 28'Loc'
001850170105     A            D98LOD        35A  B 15 32
001860170105     A                                 15 70'Inoltro'
001870170105     A            D98FIN         1A  B 15 78
001880170105     A                                 16  2'DtSPE:'
001890170105     A                                      DSPATR(UL)
001900170105     A            D98DSP         8Y 0B 16  9
001910170105     A                                 16 19'Borderizz.'
001920170105     A            D98DFV         8Y 0B 16 30
001930170105     A                                 16 40'ParUC:'
001940170105     A            D98DUC         8Y 0B 16 47
001950170105     A            DECDBR         7A  O 16 57
001960170105     A  01                                  DSPATR(RI)
001970170105     A            D98DBR         8Y 0B 16 65
001980170105     A                                 17  2'ARR.Trazione'
001990170105     A            D98DTI         8Y 0B 17 15
002000170105     A            D98HTI         4Y 0B 17 24EDTWRD('  :  ')
002010170105     A                                 17 30'Cons.RICHIESTA'
002020170105     A                                      DSPATR(UL)
002030170105     A            D98TCR         1A  B 17 45
002040170105     A            D98DCR         8Y 0B 17 48
002050170105     A            D98HCR         4Y 0B 17 58EDTWRD(' 0:  ')
002060170105     A                                 17 65'ConPartic'
002070170105     A            D98TC1         1A  B 17 75
002080170105     A            D98TC2         1A  B 17 78
002090170105     A                                 18  2'ConsREALE:'
002100170105     A                                      DSPATR(UL)
002110170105     A            D98DCM         8Y 0B 18 13
002120170105     A            D98HMC         4Y 0B 18 23EDTWRD(' 0:  ')
002130170105     A                                 18 29'C.Anomala'
002140170105     A            D98CCA         1A  B 18 39
002150170105     A                                 18 42'TFP:'
002160170105     A            D98TFP         3Y 0B 18 47EDTCDE(Z)
002170170105     A                                 18 52'TFA:'
002180170105     A            D98TFA         3Y 0B 18 57EDTCDE(Z)
002190170105     A                                 18 62'LNA:'
002200170105     A            D98LNA         3Y 0B 18 67EDTCDE(Z)
002210170105     A                                 18 72'FDep:'
002220170105     A            D98FFD         1A  B 18 78
002230170105     A                                 19  2'DataDistin'
002240170105     A            D98DDC         8Y 0B 19 13
002250170105     A                                 19 23'InConsegna'
002260170105     A            D98CONS        1A  B 19 34VALUES(' ' 'S')
002270170105     A                                 19 37'GGchius'
002280170105     A            D98GC1         2A  B 19 45
002290170105     A            D98GC2         2A  B 19 49
002300170105     A                                 19 53'CliMitt'
002310170105     A            D98KSC         7S 0B 19 61CHECK(RZ)
002320170105     A                                 19 74'TBo'
002330170105     A            D98TBL         2A  B 19 78
002340170105     A                                 20  2'CAs'
002350170105     A                                      DSPATR(UL)
002360170105     A            D98TIC         2A  B 20  6
002370170105     A            D98CAS        13Y 3B 20 10EDTCDE(4)
002380170105     A            D98VCA         3A  B 20 25
002390170105     A                                 20 29'Aper/chius:GIAC'
002400170105     A            D98DAG         8Y 0B 20 45
002410170105     A            D98DCG         8Y 0B 20 54
002420170105     A                                 20 64'C.A.'
002430170105     A            D98DAC         8Y 0B 20 69
002440170105     A                                 21  2'Dt/HH cons.prev.I:'
002450170105     A                                      DSPATR(HI)
002460170105     A            D98DCI         8Y 0B 21 21DSPATR(HI)
002470170105     A            D98HCI         4Y 0B 21 31EDTWRD('0 :  ')
002480170105     A                                 21 39'Est:'
002490170105     A                                      DSPATR(HI)
002500170105     A            D98DCE         8Y 0B 21 44
002510170105     A            D98HCE         4Y 0B 21 54EDTWRD('0 :  ')
002520170105     A                                 21 61'Ore consegn.I:'
002530170105     A                                      DSPATR(HI)
002540170105     A            D98OCI         3S 0B 21 76
002550170105     A                                 22  2'Dt/hh cons.teor.I:'
002560170105     A                                      DSPATR(HI)
002570170105     A            D98DEI         8Y 0B 22 21DSPATR(HI)
002580170105     A            D98OEI         4Y 0B 22 31EDTWRD('0 :  ')
002590170105     A                                 22 61'Ore consegn.E:'
002600170105     A                                      DSPATR(HI)
002610170105     A            D98OCC         3S 0B 22 76
002620170105     A                                 23  2'CONSEGNA PREVISTA Cliente'
002630170105     A                                      DSPATR(HI)
002640170105     A            D98DEE         8Y 0O 23 28EDTWRD('    /  /  ')
002650170105     A                                      DSPATR(HI)
002660170105     A                                      DSPATR(CS)
002670170105     A                                 23 39'('
002680170105     A            D98OEE         4Y 0O 23 41DSPATR(CS)
002690170105     A                                 23 46'non usata)'
002700170105     A                                 23 57'stato'
002710170105     A            D98SPCDEE      3A  O 23 63COLOR(YLW)
002720170105     A                                 23 68'LimPick'
002730170105     A            D98PICKLIM     4A  O 23 76COLOR(YLW)
002740170105     A            FUN001        19A  O 24  2
002750170105     A                                 24 40'Data contattoCLI'
002760170105     A            D98DTCTD       8A  O 24 58COLOR(YLW)
002770930204     A*
002780000000     A* Record subfile messaggi
002790970730     A          R SD97DMS                   SFL
002800931202     A*%%TS  SD  19931202  170140  EDPSL       REL-V2R1M0  5738-PW1
002810931202     A                                      SFLMSGRCD(24)
002820931202     A            MSGKEY                    SFLMSGKEY
002830931202     A            MSGQUE                    SFLPGMQ
002840930204     A*
002850000000     A* Record controllo subfile messaggi
002860970730     A          R SD97DMC                   SFLCTL(SD97DMS)
002870000000     A*%%TS  SD  19920527  120939  PGM_MASTER  REL-V2R1M0  5738-PW1
002880000000     A                                      OVERLAY
002890000000     A                                      SFLDSP
002900000000     A  40                                  SFLCLR
002910000000     A                                      SFLSIZ(0002)
002920000000     A                                      SFLPAG(0001)
002930150415     A          R SD97WNOT
002940150415     A*%%TS  SD  20150415  094005  EDPES       REL-V7R1M0  5770-WDS
002950150415     A                                      OVERLAY
002960150415     A                                      WINDOW(8 2 6 60)
002970150415     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
002980150415     A                                          '))
002990150415     A                                  5 20'F12 = Ritorno'
003000150415     A                                  1  4'Codici per tracciabilità flussi fi-
003010150415     A                                      nanziari'
003020150415     A                                      DSPATR(HI)
