000100041001     H DECEDIT('0,') DATEDIT(*ymd.)
000200160601     h option(*nodebugio)
000300941115     H* TNSD18R *----------------------------------------------------*
000400900405     H*         - STAMPA ORGANIGRAMMA -                              *
000500000000     H*--------------------------------------------------------------*
000600900409     FTABEL00F  IF   E           K DISK
000700900405     FAZORG02L  IF   E           K DISK
000800900405     FAZORG01L  IF   E           K DISK
000900900405     F                                     RENAME(AZORG:AZORG1)
001000041005     FAZOse01L  IF   E           K DISK
001100041005     F                                     RENAME(AZORG:AZOse1)
001200000920     FLET017    O    F  124        PRINTER
001300160601     f                                     infds(Let017_InfDS)
001400160601      *
001500020701     D SDT             S              1    DIM(15) CTDATA PERRCD(15)            SCHIERA DATA
001600020702     D STP1            S             12    DIM(3)  CTDATA PERRCD(1)             SCHIERA DATA
001700020702     D STP2            S             38    DIM(3) CTDATA PERRCD(1)              SCHIERA DATA
001800160601      *
001900160601      * -?InfDS?
002000160601     d Let017_InfDS    ds
002100160601     d   CurLine             367    368i 0
002200160601      *
002300960910     D                 DS
002400960910     D  WGG                    1      2
002500960910     D  WMM                    3      4
002600960910     D  WAA                    5      8
002700960910     D  WDATA                  1      8
002800941219     D*
002900900405     D DSOG          E DS
003000030523     D DSOR          E DS
003100021107     D OG140         E DS
003200050708     D OG141         E DS
003300030519     D OG142         E DS
003400021107     D OG143         E DS
003500030519     D OG144         E DS
003600020701     D OG146         E DS
003700020701     D OG147         E DS
003800020701     D OG148         E DS
003900030519     D OG149         E DS
004000020701     D OG150         E DS
004100981113     D* PASSAGGIO DATI
004200030331     D TNSD17DS      E DS                  INZ
004300900131     D KPJBA         E DS
004400910226     D  §SEDE                247    250
004500020626     D UT§DSE        E DS                  EXTNAME(UT§DSE0F)
004600900405     D DEDS            DS
004700030331      *
004800900405     D  ORGD01                 1     25
004900900405     D  ORGD02                26     50
005000900405     D  ORGD03                51     75
005100900405     D  ORGD04                76    100
005200900405     D  ORGD05               101    125
005300900405     D  ORGD06               126    150
005400900405     D  ORGD07               151    175
005500900405     D  ORGD08               176    200
005600900405     D  ORGD09               201    225
005700900405     D  ORGD10               226    250
005800900405     D  ORGD11               251    275
005900900405     D  ORGD12               276    300
006000900405     D  ORGD13               301    325
006100900405     D  ORGD14               326    350
006200900405     D  ORGD15               351    375
006300900405     D  ORGD16               376    400
006400900405     D  ORGD17               401    425
006500900405     D  ORGD18               426    450
006600900405     D  ORGD19               451    475
006700900405     D  ORGD20               476    500
006800900405     D  ORGD21               501    525
006900900405     D  ORGD22               526    550
007000900405     D  ORGD23               551    575
007100900405     D  ORGD24               576    600
007200900405     D  ORGD25               601    625
007300900405     D  ORGD26               626    650
007400900405     D  ORGD27               651    675
007500900405     D  ORGD28               676    700
007600900405     D  ORGD29               701    725
007700900405     D  ORGD30               726    750
007800900405     D  ORGD31               751    775
007900900405     D  ORGD32               776    800
008000900405     D  ORGD33               801    825
008100900405     D  ORGD34               826    850
008200900405     D  ORGD35               851    875
008300900405     D  ORGD36               876    900
008400900405     D  ORGD37               901    925
008500900405     D  ORGD38               926    950
008600900405     D  ORGD39               951    975
008700900405     D  ORGD40               976   1000
008800900405     D  ORGD41              1001   1025
008900900405     D  ORGD42              1026   1050
009000900405     D  ORGD43              1051   1075
009100900405     D  ORGD44              1076   1100
009200900405     D  ORGD45              1101   1125
009300900405     D  ORGD46              1126   1150
009400900405     D  ORGD47              1151   1175
009500900405     D  ORGD48              1176   1200
009600900405     D  ORGD49              1201   1225
009700900405     D  ORGD50              1226   1250
009800900405     D  ORGD51              1251   1275
009900900405     D  ORGD52              1276   1300
010000900405     D  ORGD53              1301   1325
010100900405     D  ORGD54              1326   1350
010200900405     D  ORGD55              1351   1375
010300900405     D  ORGD56              1376   1400
010400900405     D  ORGD57              1401   1425
010500900405     D  ORGD58              1426   1450
010600900405     D  ORGD59              1451   1475
010700900405     D  ORGD60              1476   1500
010800900405     D  ORGD61              1501   1525
010900900405     D  ORGD62              1526   1550
011000900405     D  ORGD63              1551   1575
011100900405     D  ORGD64              1576   1600
011200900405     D  ORGD65              1601   1625
011300900405     D  ORGD66              1626   1650
011400900405     D  ORGD67              1651   1675
011500900405     D  ORGD68              1676   1700
011600900405     D  ORGD69              1701   1725
011700900405     D  ORGD70              1726   1750
011800900405     D  ORGD71              1751   1775
011900900405     D  ORGD72              1776   1800
012000900405     D  ORGD73              1801   1825
012100900405     D  ORGD74              1826   1850
012200900405     D  ORGD75              1851   1875
012300900405     D  ORGD76              1876   1900
012400900405     D  ORGD77              1901   1925
012500900405     D  ORGD78              1926   1950
012600900405     D  ORGD79              1951   1975
012700900405     D  ORGD80              1976   2000
012800900405     D  ORGD81              2001   2025
012900900405     D  ORGD82              2026   2050
013000900405     D  ORGD83              2051   2075
013100900405     D  ORGD84              2076   2100
013200900405     D  ORGD85              2101   2125
013300900405     D  ORGD86              2126   2150
013400900405     D  ORGD87              2151   2175
013500900405     D  ORGD88              2176   2200
013600900405     D  ORGD89              2201   2225
013700900405     D  ORGD90              2226   2250
013800900405     D  ORGD91              2251   2275
013900900405     D  ORGD92              2276   2300
014000900405     D  ORGD93              2301   2325
014100900405     D  ORGD94              2326   2350
014200900405     D  ORGD95              2351   2375
014300900405     D  ORGD96              2376   2400
014400900405     D  ORGD97              2401   2425
014500900405     D  ORGD98              2426   2450
014600900405     D  ORGD99              2451   2475
014700900405     D  ORGDA0              2476   2500
014800900405     D  ORGDA1              2501   2525
014900900405     D  ORGDA2              2526   2550
015000900405     D  ORGDA3              2551   2575
015100900405     D  ORGDA4              2576   2600
015200900405     D  ORGDA5              2601   2625
015300900405     D  ORGDA6              2626   2650
015400900405     D  ORGDA7              2651   2675
015500900405     D  ORGDA8              2676   2700
015600900405     D  ORGDA9              2701   2725
015700900405     D  ORGDB0              2726   2750
015800900405     D  ORGDB1              2751   2775
015900900405     D  ORGDB2              2776   2800
016000900405     D  ORGDB3              2801   2825
016100900405     D  ORGDB4              2826   2850
016200900405     D  ORGDB5              2851   2875
016300900405     D  ORGDB6              2876   2900
016400900405     D  ORGDB7              2901   2925
016500900405     D  ORGDB8              2926   2950
016600900405     D  ORGDB9              2951   2975
016700900405     D  ORGDC0              2976   3000
016800900405     D  ORGDC1              3001   3025
016900900405     D  ORGDC2              3026   3050
017000900405     D  ORGDC3              3051   3075
017100900405     D  ORGDC4              3076   3100
017200900405     D  ORGDC5              3101   3125
017300900405     D  ORGDC6              3126   3150
017400900405     D  ORGDC7              3151   3175
017500900405     D  ORGDC8              3176   3200
017600900405     D  ORGDC9              3201   3225
017700900405     D  ORGDD0              3226   3250
017800900405     D  ORGDD1              3251   3275
017900900405     D  ORGDD2              3276   3300
018000900405     D  ORGDD3              3301   3325
018100900405     D  ORGDD4              3326   3350
018200900405     D  ORGDD5              3351   3375
018300900405     D  ORGDD6              3376   3400
018400900405     D  ORGDD7              3401   3425
018500900405     D  ORGDD8              3426   3450
018600900405     D  ORGDD9              3451   3475
018700900405     D  ORGDE0              3476   3500
018800900405     D  ORGDE1              3501   3525
018900900405     D  ORGDE2              3526   3550
019000900405     D  ORGDE3              3551   3575
019100900405     D  ORGDE4              3576   3600
019200900405     D  ORGDE5              3601   3625
019300900405     D  ORGDE6              3626   3650
019400900405     D  ORGDE7              3651   3675
019500900405     D  ORGDE8              3676   3700
019600900405     D  ORGDE9              3701   3725
019700900405     D  ORGDF0              3726   3750
019800900405     D  DE                     1   3750
019900900405     D                                     DIM(150)
020000900405     D CFDS            DS
020100900405     D  ORGF01                 1      3  0
020200900405     D  ORGF02                 4      6  0
020300900405     D  ORGF03                 7      9  0
020400900405     D  ORGF04                10     12  0
020500900405     D  ORGF05                13     15  0
020600900405     D  ORGF06                16     18  0
020700900405     D  ORGF07                19     21  0
020800900405     D  ORGF08                22     24  0
020900900405     D  ORGF09                25     27  0
021000900405     D  ORGF10                28     30  0
021100900405     D  ORGF11                31     33  0
021200900405     D  ORGF12                34     36  0
021300900405     D  ORGF13                37     39  0
021400900405     D  ORGF14                40     42  0
021500900405     D  ORGF15                43     45  0
021600900405     D  ORGF16                46     48  0
021700900405     D  ORGF17                49     51  0
021800900405     D  ORGF18                52     54  0
021900900405     D  ORGF19                55     57  0
022000900405     D  ORGF20                58     60  0
022100900405     D  ORGF21                61     63  0
022200900405     D  ORGF22                64     66  0
022300900405     D  ORGF23                67     69  0
022400900405     D  ORGF24                70     72  0
022500900405     D  ORGF25                73     75  0
022600900405     D  ORGF26                76     78  0
022700900405     D  ORGF27                79     81  0
022800900405     D  ORGF28                82     84  0
022900900405     D  ORGF29                85     87  0
023000900405     D  ORGF30                88     90  0
023100900405     D  ORGF31                91     93  0
023200900405     D  ORGF32                94     96  0
023300900405     D  ORGF33                97     99  0
023400900405     D  ORGF34               100    102  0
023500900405     D  ORGF35               103    105  0
023600900405     D  ORGF36               106    108  0
023700900405     D  ORGF37               109    111  0
023800900405     D  ORGF38               112    114  0
023900900405     D  ORGF39               115    117  0
024000900405     D  ORGF40               118    120  0
024100900405     D  ORGF41               121    123  0
024200900405     D  ORGF42               124    126  0
024300900405     D  ORGF43               127    129  0
024400900405     D  ORGF44               130    132  0
024500900405     D  ORGF45               133    135  0
024600900405     D  ORGF46               136    138  0
024700900405     D  ORGF47               139    141  0
024800900405     D  ORGF48               142    144  0
024900900405     D  ORGF49               145    147  0
025000900405     D  ORGF50               148    150  0
025100900405     D  ORGF51               151    153  0
025200900405     D  ORGF52               154    156  0
025300900405     D  ORGF53               157    159  0
025400900405     D  ORGF54               160    162  0
025500900405     D  ORGF55               163    165  0
025600900405     D  ORGF56               166    168  0
025700900405     D  ORGF57               169    171  0
025800900405     D  ORGF58               172    174  0
025900900405     D  ORGF59               175    177  0
026000900405     D  ORGF60               178    180  0
026100900405     D  ORGF61               181    183  0
026200900405     D  ORGF62               184    186  0
026300900405     D  ORGF63               187    189  0
026400900405     D  ORGF64               190    192  0
026500900405     D  ORGF65               193    195  0
026600900405     D  ORGF66               196    198  0
026700900405     D  ORGF67               199    201  0
026800900405     D  ORGF68               202    204  0
026900900405     D  ORGF69               205    207  0
027000900405     D  ORGF70               208    210  0
027100900405     D  ORGF71               211    213  0
027200900405     D  ORGF72               214    216  0
027300900405     D  ORGF73               217    219  0
027400900405     D  ORGF74               220    222  0
027500900405     D  ORGF75               223    225  0
027600900405     D  ORGF76               226    228  0
027700900405     D  ORGF77               229    231  0
027800900405     D  ORGF78               232    234  0
027900900405     D  ORGF79               235    237  0
028000900405     D  ORGF80               238    240  0
028100900405     D  ORGF81               241    243  0
028200900405     D  ORGF82               244    246  0
028300900405     D  ORGF83               247    249  0
028400900405     D  ORGF84               250    252  0
028500900405     D  ORGF85               253    255  0
028600900405     D  ORGF86               256    258  0
028700900405     D  ORGF87               259    261  0
028800900405     D  ORGF88               262    264  0
028900900405     D  ORGF89               265    267  0
029000900405     D  ORGF90               268    270  0
029100900405     D  ORGF91               271    273  0
029200900405     D  ORGF92               274    276  0
029300900405     D  ORGF93               277    279  0
029400900405     D  ORGF94               280    282  0
029500900405     D  ORGF95               283    285  0
029600900405     D  ORGF96               286    288  0
029700900405     D  ORGF97               289    291  0
029800900405     D  ORGF98               292    294  0
029900900405     D  ORGF99               295    297  0
030000900405     D  ORGFA0               298    300  0
030100900405     D  ORGFA1               301    303  0
030200900405     D  ORGFA2               304    306  0
030300900405     D  ORGFA3               307    309  0
030400900405     D  ORGFA4               310    312  0
030500900405     D  ORGFA5               313    315  0
030600900405     D  ORGFA6               316    318  0
030700900405     D  ORGFA7               319    321  0
030800900405     D  ORGFA8               322    324  0
030900900405     D  ORGFA9               325    327  0
031000900405     D  ORGFB0               328    330  0
031100900405     D  ORGFB1               331    333  0
031200900405     D  ORGFB2               334    336  0
031300900405     D  ORGFB3               337    339  0
031400900405     D  ORGFB4               340    342  0
031500900405     D  ORGFB5               343    345  0
031600900405     D  ORGFB6               346    348  0
031700900405     D  ORGFB7               349    351  0
031800900405     D  ORGFB8               352    354  0
031900900405     D  ORGFB9               355    357  0
032000900405     D  ORGFC0               358    360  0
032100900405     D  ORGFC1               361    363  0
032200900405     D  ORGFC2               364    366  0
032300900405     D  ORGFC3               367    369  0
032400900405     D  ORGFC4               370    372  0
032500900405     D  ORGFC5               373    375  0
032600900405     D  ORGFC6               376    378  0
032700900405     D  ORGFC7               379    381  0
032800900405     D  ORGFC8               382    384  0
032900900405     D  ORGFC9               385    387  0
033000900405     D  ORGFD0               388    390  0
033100900405     D  ORGFD1               391    393  0
033200900405     D  ORGFD2               394    396  0
033300900405     D  ORGFD3               397    399  0
033400900405     D  ORGFD4               400    402  0
033500900405     D  ORGFD5               403    405  0
033600900405     D  ORGFD6               406    408  0
033700900405     D  ORGFD7               409    411  0
033800900405     D  ORGFD8               412    414  0
033900900405     D  ORGFD9               415    417  0
034000900405     D  ORGFE0               418    420  0
034100900405     D  ORGFE1               421    423  0
034200900405     D  ORGFE2               424    426  0
034300900405     D  ORGFE3               427    429  0
034400900405     D  ORGFE4               430    432  0
034500900405     D  ORGFE5               433    435  0
034600900405     D  ORGFE6               436    438  0
034700900405     D  ORGFE7               439    441  0
034800900405     D  ORGFE8               442    444  0
034900900405     D  ORGFE9               445    447  0
035000900405     D  ORGFF0               448    450  0
035100900405     D  CF                     1    450  0
035200900405     D                                     DIM(150)
035300900405     D VDEDS           DS
035400900405     D  VD01                   1     25
035500900405     D  VD02                  26     50
035600900405     D  VD03                  51     75
035700900405     D  VD04                  76    100
035800900405     D  VD05                 101    125
035900900405     D  VD06                 126    150
036000900405     D  VD07                 151    175
036100900405     D  VD08                 176    200
036200900405     D  VD09                 201    225
036300900405     D  VD10                 226    250
036400900405     D  VD11                 251    275
036500900405     D  VD12                 276    300
036600900405     D  VD13                 301    325
036700900405     D  VD14                 326    350
036800900405     D  VD15                 351    375
036900900405     D  VD16                 376    400
037000900405     D  VD17                 401    425
037100900405     D  VD18                 426    450
037200900405     D  VD19                 451    475
037300900405     D  VD20                 476    500
037400900405     D  VD21                 501    525
037500900405     D  VD22                 526    550
037600900405     D  VD23                 551    575
037700900405     D  VD24                 576    600
037800900405     D  VD25                 601    625
037900900405     D  VD26                 626    650
038000900405     D  VD27                 651    675
038100900405     D  VD28                 676    700
038200900405     D  VD29                 701    725
038300900405     D  VD30                 726    750
038400900405     D  VD31                 751    775
038500900405     D  VD32                 776    800
038600900405     D  VD33                 801    825
038700900405     D  VD34                 826    850
038800900405     D  VD35                 851    875
038900900405     D  VD36                 876    900
039000900405     D  VD37                 901    925
039100900405     D  VD38                 926    950
039200900405     D  VD39                 951    975
039300900405     D  VD40                 976   1000
039400900405     D  VD41                1001   1025
039500900405     D  VD42                1026   1050
039600900405     D  VD43                1051   1075
039700900405     D  VD44                1076   1100
039800900405     D  VD45                1101   1125
039900900405     D  VD46                1126   1150
040000900405     D  VD47                1151   1175
040100900405     D  VD48                1176   1200
040200900405     D  VD49                1201   1225
040300900405     D  VD50                1226   1250
040400900405     D  VD51                1251   1275
040500900405     D  VD52                1276   1300
040600900405     D  VD53                1301   1325
040700900405     D  VD54                1326   1350
040800900405     D  VD55                1351   1375
040900900405     D  VD56                1376   1400
041000900405     D  VD57                1401   1425
041100900405     D  VD58                1426   1450
041200900405     D  VD59                1451   1475
041300900405     D  VD60                1476   1500
041400900405     D  VD61                1501   1525
041500900405     D  VD62                1526   1550
041600900405     D  VD63                1551   1575
041700900405     D  VD64                1576   1600
041800900405     D  VD65                1601   1625
041900900405     D  VD66                1626   1650
042000900405     D  VD67                1651   1675
042100900405     D  VD68                1676   1700
042200900405     D  VD69                1701   1725
042300900405     D  VD70                1726   1750
042400900405     D  VD71                1751   1775
042500900405     D  VD72                1776   1800
042600900405     D  VD73                1801   1825
042700900405     D  VD74                1826   1850
042800900405     D  VD75                1851   1875
042900900405     D  VD76                1876   1900
043000900405     D  VD77                1901   1925
043100900405     D  VD78                1926   1950
043200900405     D  VD79                1951   1975
043300900405     D  VD80                1976   2000
043400900405     D  VD81                2001   2025
043500900405     D  VD82                2026   2050
043600900405     D  VD83                2051   2075
043700900405     D  VD84                2076   2100
043800900405     D  VD85                2101   2125
043900900405     D  VD86                2126   2150
044000900405     D  VD87                2151   2175
044100900405     D  VD88                2176   2200
044200900405     D  VD89                2201   2225
044300900405     D  VD90                2226   2250
044400900405     D  VD91                2251   2275
044500900405     D  VD92                2276   2300
044600900405     D  VD93                2301   2325
044700900405     D  VD94                2326   2350
044800900405     D  VD95                2351   2375
044900900405     D  VD96                2376   2400
045000900405     D  VD97                2401   2425
045100900405     D  VD98                2426   2450
045200900405     D  VD99                2451   2475
045300900405     D  VDA0                2476   2500
045400900405     D  VDA1                2501   2525
045500900405     D  VDA2                2526   2550
045600900405     D  VDA3                2551   2575
045700900405     D  VDA4                2576   2600
045800900405     D  VDA5                2601   2625
045900900405     D  VDA6                2626   2650
046000900405     D  VDA7                2651   2675
046100900405     D  VDA8                2676   2700
046200900405     D  VDA9                2701   2725
046300900405     D  VDB0                2726   2750
046400900405     D  VDB1                2751   2775
046500900405     D  VDB2                2776   2800
046600900405     D  VDB3                2801   2825
046700900405     D  VDB4                2826   2850
046800900405     D  VDB5                2851   2875
046900900405     D  VDB6                2876   2900
047000900405     D  VDB7                2901   2925
047100900405     D  VDB8                2926   2950
047200900405     D  VDB9                2951   2975
047300900405     D  VDC0                2976   3000
047400900405     D  VDC1                3001   3025
047500900405     D  VDC2                3026   3050
047600900405     D  VDC3                3051   3075
047700900405     D  VDC4                3076   3100
047800900405     D  VDC5                3101   3125
047900900405     D  VDC6                3126   3150
048000900405     D  VDC7                3151   3175
048100900405     D  VDC8                3176   3200
048200900405     D  VDC9                3201   3225
048300900405     D  VDD0                3226   3250
048400900405     D  VDD1                3251   3275
048500900405     D  VDD2                3276   3300
048600900405     D  VDD3                3301   3325
048700900405     D  VDD4                3326   3350
048800900405     D  VDD5                3351   3375
048900900405     D  VDD6                3376   3400
049000900405     D  VDD7                3401   3425
049100900405     D  VDD8                3426   3450
049200900405     D  VDD9                3451   3475
049300900405     D  VDE0                3476   3500
049400900405     D  VDE1                3501   3525
049500900405     D  VDE2                3526   3550
049600900405     D  VDE3                3551   3575
049700900405     D  VDE4                3576   3600
049800900405     D  VDE5                3601   3625
049900900405     D  VDE6                3626   3650
050000900405     D  VDE7                3651   3675
050100900405     D  VDE8                3676   3700
050200900405     D  VDE9                3701   3725
050300900405     D  VDF0                3726   3750
050400900405     D  VDE                    1   3750
050500900409     D                                     DIM(150)                             DESCRIZIONI
050600900405     D VCFDS           DS
050700900405     D  VF01                   1      3  0
050800900405     D  VF02                   4      6  0
050900900405     D  VF03                   7      9  0
051000900405     D  VF04                  10     12  0
051100900405     D  VF05                  13     15  0
051200900405     D  VF06                  16     18  0
051300900405     D  VF07                  19     21  0
051400900405     D  VF08                  22     24  0
051500900405     D  VF09                  25     27  0
051600900405     D  VF10                  28     30  0
051700900405     D  VF11                  31     33  0
051800900405     D  VF12                  34     36  0
051900900405     D  VF13                  37     39  0
052000900405     D  VF14                  40     42  0
052100900405     D  VF15                  43     45  0
052200900405     D  VF16                  46     48  0
052300900405     D  VF17                  49     51  0
052400900405     D  VF18                  52     54  0
052500900405     D  VF19                  55     57  0
052600900405     D  VF20                  58     60  0
052700900405     D  VF21                  61     63  0
052800900405     D  VF22                  64     66  0
052900900405     D  VF23                  67     69  0
053000900405     D  VF24                  70     72  0
053100900405     D  VF25                  73     75  0
053200900405     D  VF26                  76     78  0
053300900405     D  VF27                  79     81  0
053400900405     D  VF28                  82     84  0
053500900405     D  VF29                  85     87  0
053600900405     D  VF30                  88     90  0
053700900405     D  VF31                  91     93  0
053800900405     D  VF32                  94     96  0
053900900405     D  VF33                  97     99  0
054000900405     D  VF34                 100    102  0
054100900405     D  VF35                 103    105  0
054200900405     D  VF36                 106    108  0
054300900405     D  VF37                 109    111  0
054400900405     D  VF38                 112    114  0
054500900405     D  VF39                 115    117  0
054600900405     D  VF40                 118    120  0
054700900405     D  VF41                 121    123  0
054800900405     D  VF42                 124    126  0
054900900405     D  VF43                 127    129  0
055000900405     D  VF44                 130    132  0
055100900405     D  VF45                 133    135  0
055200900405     D  VF46                 136    138  0
055300900405     D  VF47                 139    141  0
055400900405     D  VF48                 142    144  0
055500900405     D  VF49                 145    147  0
055600900405     D  VF50                 148    150  0
055700900405     D  VF51                 151    153  0
055800900405     D  VF52                 154    156  0
055900900405     D  VF53                 157    159  0
056000900405     D  VF54                 160    162  0
056100900405     D  VF55                 163    165  0
056200900405     D  VF56                 166    168  0
056300900405     D  VF57                 169    171  0
056400900405     D  VF58                 172    174  0
056500900405     D  VF59                 175    177  0
056600900405     D  VF60                 178    180  0
056700900405     D  VF61                 181    183  0
056800900405     D  VF62                 184    186  0
056900900405     D  VF63                 187    189  0
057000900405     D  VF64                 190    192  0
057100900405     D  VF65                 193    195  0
057200900405     D  VF66                 196    198  0
057300900405     D  VF67                 199    201  0
057400900405     D  VF68                 202    204  0
057500900405     D  VF69                 205    207  0
057600900405     D  VF70                 208    210  0
057700900405     D  VF71                 211    213  0
057800900405     D  VF72                 214    216  0
057900900405     D  VF73                 217    219  0
058000900405     D  VF74                 220    222  0
058100900405     D  VF75                 223    225  0
058200900405     D  VF76                 226    228  0
058300900405     D  VF77                 229    231  0
058400900405     D  VF78                 232    234  0
058500900405     D  VF79                 235    237  0
058600900405     D  VF80                 238    240  0
058700900405     D  VF81                 241    243  0
058800900405     D  VF82                 244    246  0
058900900405     D  VF83                 247    249  0
059000900405     D  VF84                 250    252  0
059100900405     D  VF85                 253    255  0
059200900405     D  VF86                 256    258  0
059300900405     D  VF87                 259    261  0
059400900405     D  VF88                 262    264  0
059500900405     D  VF89                 265    267  0
059600900405     D  VF90                 268    270  0
059700900405     D  VF91                 271    273  0
059800900405     D  VF92                 274    276  0
059900900405     D  VF93                 277    279  0
060000900405     D  VF94                 280    282  0
060100900405     D  VF95                 283    285  0
060200900405     D  VF96                 286    288  0
060300900405     D  VF97                 289    291  0
060400900405     D  VF98                 292    294  0
060500900405     D  VF99                 295    297  0
060600900405     D  VFA0                 298    300  0
060700900405     D  VFA1                 301    303  0
060800900405     D  VFA2                 304    306  0
060900900405     D  VFA3                 307    309  0
061000900405     D  VFA4                 310    312  0
061100900405     D  VFA5                 313    315  0
061200900405     D  VFA6                 316    318  0
061300900405     D  VFA7                 319    321  0
061400900405     D  VFA8                 322    324  0
061500900405     D  VFA9                 325    327  0
061600900405     D  VFB0                 328    330  0
061700900405     D  VFB1                 331    333  0
061800900405     D  VFB2                 334    336  0
061900900405     D  VFB3                 337    339  0
062000900405     D  VFB4                 340    342  0
062100900405     D  VFB5                 343    345  0
062200900405     D  VFB6                 346    348  0
062300900405     D  VFB7                 349    351  0
062400900405     D  VFB8                 352    354  0
062500900405     D  VFB9                 355    357  0
062600900405     D  VFC0                 358    360  0
062700900405     D  VFC1                 361    363  0
062800900405     D  VFC2                 364    366  0
062900900405     D  VFC3                 367    369  0
063000900405     D  VFC4                 370    372  0
063100900405     D  VFC5                 373    375  0
063200900405     D  VFC6                 376    378  0
063300900405     D  VFC7                 379    381  0
063400900405     D  VFC8                 382    384  0
063500900405     D  VFC9                 385    387  0
063600900405     D  VFD0                 388    390  0
063700900405     D  VFD1                 391    393  0
063800900405     D  VFD2                 394    396  0
063900900405     D  VFD3                 397    399  0
064000900405     D  VFD4                 400    402  0
064100900405     D  VFD5                 403    405  0
064200900405     D  VFD6                 406    408  0
064300900405     D  VFD7                 409    411  0
064400900405     D  VFD8                 412    414  0
064500900405     D  VFD9                 415    417  0
064600900405     D  VFE0                 418    420  0
064700900405     D  VFE1                 421    423  0
064800900405     D  VFE2                 424    426  0
064900900405     D  VFE3                 427    429  0
065000900405     D  VFE4                 430    432  0
065100900405     D  VFE5                 433    435  0
065200900405     D  VFE6                 436    438  0
065300900405     D  VFE7                 439    441  0
065400900405     D  VFE8                 442    444  0
065500900405     D  VFE9                 445    447  0
065600900405     D  VFF0                 448    450  0
065700900405     D  VCF                    1    450  0
065800900409     D                                     DIM(150)                             cod.fil.app.
065900041001     D savfag          s                   like(orgfag)
066000060613
066100030331     D* Reperimento nome PGM
066200030331     D STATUS         SDS           333
066300030331     D  PARMS            *PARMS
066400040520     d
066500040520     D CONST1          C                   CONST('NON OPERAT.')
066600040520     D CONST2          C                   CONST('1° LIVELLO ')
066700040520     D CONST3          C                   CONST('2° LIVELLO ')
066800900522     IAZORG
066900900410     I              ORGFIL                      ORGFI§
067000900405     C******************************************************
067100900131     C     *ENTRY        PLIST
067200900131     C                   PARM                    KPJBA
067300030331     C                   PARM                    SD17DS           15
067400030331      *
067500030331      * testo se sono stati passati 2 parametri (caso di richiesta stampa
067600030331      * organigramma da tariffe) oppure 3 parametri (caso di richiesta
067700030331      * stampa organigramma da menù)
067800030331     C*
067900030331     C                   eval      TNSD17DS=SD17Ds
068000030331      *
068100020626     C                   CALL      'X§PARUT'
068200020626     C                   PARM                    UT§DSE
068300900131     C                   MOVEL     RAGUT         RSUT             20
068400910226     C     §SEDE         COMP      'SEDE'                                 88
068500041001     c
068600041001     c                   eval      wcontpo=5
068700000000     C******************************************************
068800900405     C     KTAB          KLIST
068900900405     C                   KFLD                    CODUT
069000910325     C                   KFLD                    COD
069100910325     C     KTAB1         KLIST
069200910325     C                   KFLD                    CODUT
069300910325     C                   KFLD                    COD
069400910325     C                   KFLD                    KEY
069500910325     C*
069600910325     C     *LIKE         DEFINE    TBLCOD        COD
069700910325     C     *LIKE         DEFINE    TBLKEY        KEY
069800910225     C     *LIKE         DEFINE    ORGFIL        COMFI§
069900910225     C     *LIKE         DEFINE    ORGFIL        CODFIL
070000020701     C     *LIKE         DEFINE    §ogdkc        §ogdkc_p
070100040519     C     *LIKE         DEFINE    §ogpck        §ogpck_p
070200050509     C     *LIKE         DEFINE    §ogpkm        §ogpkm_p
070300160506     C     *LIKE         DEFINE    §ogturno      §ogturno_p
070400160531     C     *LIKE         DEFINE    §ogAgSpUs     §ogAgSpUs_p
070500020701     C     *LIKE         DEFINE    §ognoc        §ognoc_p
070600020701     C     *LIKE         DEFINE    §ognid        §ognid_p
070700020701     C     *LIKE         DEFINE    §ogeid        §ogeid_p
070800020702     C     *LIKE         DEFINE    §oglbl        §oglbl_p
070900020702     C     *LIKE         DEFINE    §oglfv        §oglfv_p
071000030523     C     *LIKE         DEFINE    §ogara        §ogara_p
071100030523     C     *LIKE         DEFINE    §ogaex        §ogaex_p
071200030523     C     *LIKE         DEFINE    §ogapo        §ogapo_p
071300060426     C     *LIKE         DEFINE    §oghb1        §oghub_p
071400060426     C     *LIKE         DEFINE    §ogdp1        §ogdpt_p
071500131016     C     *LIKE         DEFINE    §ogLNAres     §ogres_p
071600900405     C*---------------------------------------------------------------*
071700941219     C* PRENDO LA DATA DEL GIORNO DA TIME
071800941219     C                   TIME                    W0140            14 0
071900941219     C                   MOVE      W0140         UDATE8            8 0
072000941219     C*
072100130621     C                   SETOFF                                       1516
072200940316     I* SEDE
072300020626     C     D17TPS        COMP      'S'                                    15
072400940316     I* FILIALE
072500020628     C     D17TPS        COMP      'F'                                    16
072600900405     C**
072700900522     C     INIZIO        TAG
072800160601     c*--
072900900405     C                   MOVEL     *BLANKS       DE
073000900405     C                   MOVEL     *BLANKS       VDE
073100900405     C                   Z-ADD     0             CF
073200900405     C                   Z-ADD     0             VCF
073300900409     C                   SETOFF                                           80
073400160601     c*
073500040930     c                   if        d17pos<>0  and d17pos<>999
073600041005     c  n88d17pos        chain     azorg1                             10
073700041005     c   88d17pos        chain     azose1                             10
073800040519     c                   movel     orgfil        orgfi§
073900040519     c                   else
074000900405     C                   READ      AZORG                                  10
074100040519     c                   endif
074200040519     c* 10 on - Fine lettura
074300040519     C   10              GOTO      FINE
074400160601     c*
074500900405     C                   MOVEL     DE            VDE
074600900405     C                   Z-ADD     CF            VCF
074700160601     c*
074800040930     c* Se non parzializzato il tipo, per Filiale non stampo i tipi  V/T
074900050504     c   16              if        d17pos= 0  or  d17pos=999
075000050504     c                   if        d17tpo=*blanks and  orgfag='V'
075100040930     C                   GOTO      INIZIO
075200040930     C                   END
075300050504     C                   END
075400160601     c*
075500030528      * Parzializzazioni su Network
075600030528     C                   move      *on           $NtwOk            1
075700030528      *
075800030528      * Se ho scelto 1 NTW valorizzo og143 e scatta il controllo network
075900030528     C                   IF        D17NTW1<>*blanks or
076000030528     C                             D17NTW2<>*blanks or D17NTW3<>*blanks
076100030528     C                   eval      OG143 = orgde3
076200030528     C                   move      *off          $NtwOk
076300030528     C                   if        D17NTW1<>*blanks and §OgNtw=D17NTW1
076400030528     C                   move      *on           $NtwOk
076500030528     C                   endif
076600030528     C                   if        D17NTW2<>*blanks and §OgNtw=D17NTW2
076700030528     C                   move      *on           $NtwOk
076800030528     C                   endif
076900030528     C                   if        D17NTW3<>*blanks and §OgNtw=D17NTW3
077000030528     C                   move      *on           $NtwOk
077100030528     C                   endif
077200030528     C                   ENDIF
077300030528      *
077400030528     C                   IF        $NtwOk = *off
077500020628     C                   GOTO      INIZIO
077600020628     C                   ENDIF
077700160601     c*
077800030528      * Parzializzazioni su tipo p.o
077900030528     C                   IF        D17TPO<>*blanks
078000030528     C                   SELECT
078100030528      * Filiale
078200030528     C                   when      d17tpo = 'F' and orgfag <> 'F'
078300030528     C                   GOTO      INIZIO
078400030528      * Agenzia
078500030528     C                   when      d17tpo = 'A' and orgfag <> 'A'
078600030528     C                   GOTO      INIZIO
078700030528      * Filiale+Agenzia
078800030528     C                   when      d17tpo = 'E' and orgfag <>'F'
078900030528     C                             and orgfag <>'A'
079000030528     C                   GOTO      INIZIO
079100030528      * Varie
079200030528     C                   when      d17tpo = 'V' and orgfag <>'V' or
079300030528     C                             d17tpo ='V' and orgfag='V'and orgfl2='S'
079400030528     C                   GOTO      INIZIO
079500030528      * Tariffe
079600030528     C                   when      d17tpo = 'T' and orgfag <>'V' or
079700030528     C                             d17tpo ='T' and orgfag='V'and orgfl2=' '
079800030528     C                   GOTO      INIZIO
079900030528     C                   ENDSL
080000030528     C                   ENDIF
080100040930     c
080200040930     c*
080300040519     C* Se stampa non per la sede escludo gli annullati
080400910325     C  N15ORGFVA        IFNE      *BLANKS
080500910129     C                   GOTO      INIZIO
080600910129     C                   END
080700041001      *
080800041001      * Imposto Ds per descrizioni organigramma
080900041001     C                   MOVEL     ORGDE0        OG140
081000050708     C                   MOVEL     ORGDE1        OG141
081100041001     C                   MOVEL     ORGDE2        OG142
081200041001     C                   MOVEL     ORGDE3        OG143
081300041001     C                   MOVEL     ORGDE4        OG144
081400041001     C                   MOVEL     ORGDE6        OG146
081500041001     C                   MOVEL     ORGDE7        OG147
081600041001     C                   MOVEL     ORGDE8        OG148
081700041001     C                   MOVEL     ORGDE9        OG149
081800041001     C                   MOVEL     ORGDF0        OG150
081900160601     c*
082000041001     c* mio salvo il tipo p.o. del p.o. letto
082100041001     c                   eval      savfag=orgfag
082200040519     c
082300040519     C     ORGFVA        COMP      *BLANK                             6666
082400970514     C*
082500041001     C* 39 on - 1 livello
082600980110     C                   SETOFF                                       39
082700041001     c  n88              if        §oglpo='1'
082800041001     C                   SETON                                        39
082900980110     C                   ENDIF
083000041001     c*
083100041001     C* A cambio p.o. vado a pagina nuova: non lo faccio se richiesta solo
083200041001     c*  la stampa dei tipi V/T
083300040519     C     ORGFI§        IFNE      comfi§
083400160601     c*
083500040519     c* 80 off - stampo indirizzo della agenzia
083600900405     C     ORGFAG        IFEQ      'F'
083700901120     C     ORGFAG        OREQ      'V'
083800900405     C                   SETON                                        80
083900900405     C                   END
084000910226     C   88              SETON                                          80
084100160601     c*
084200910225     C                   Z-ADD     ORGFI§        COMFI§
084300060613
084400040519     c* Decodifiche
084500040519     C                   EXSR      DECO
084600160601     c*
084700960611     C* 19 ON  - STAMPO I NUMERI TELEFONICI INTERNI DELL'ASSISTENZA
084800960611     C     ORGD47        IFNE      *BLANKS
084900960618     C  N15
085000960618     CANN16
085100960618     CANN88              SETON                                        19
085200960611     C                   ENDIF
085300960611     C*
085400041001     c* Per tipi V/T non stampo la videata dettagliata dei dati
085500041001     c                   if         not *in15 or orgfag='V'
085600041001     c                   setoff                                       25
085700041001     c                   else
085800041001     c                   seton                                        25
085900041001     c                   endif
086000160601     c*
086100041001     c* Stampa testata
086200041001     c                   if        d17tpo='V' or d17tpo='T'
086300160601     c*
086400041001     c* Stampo a pagina nuova solo dopo 5 p.o.
086500041001     c                   if        wcontpo=5
086600160601     c*
086700041001     C   99              EXCEPT    FONDO
086800041001     C                   SETON                                        99
086900160601      * - Questo è un posizionamento sull'8ª riga
087000160601     C  N88              EXCEPT    TESTA4
087100041001     c                   eval      wcontpo=0
087200041001     c                   else
087300160601     c*
087400041001     c* lascio 2 righe tra un p.o. e l'altro
087500041001     C                   EXCEPT    TESTA5
087600041001     c                   endif
087700160601     c*
087800041001     c                   else
087900041001     C   99              EXCEPT    FONDO
088000041001     C                   SETON                                        99
088100160601      * - Questo è un posizionamento sull'8ª riga
088200160601     C  N88              EXCEPT    TESTA4
088300041001     c                   endif
088400160601     c*
088500160601      * - Questo - per *in88 - è un posizionamento sulla 5ª riga
088600160601      *   Altrimenti stampa sulla riga in cui è già posizionato
088700041001     C                   EXCEPT    TESTA
088800040519     c  N88
088900040519     Can 15              EXCEPT    TESTA2
089000900405     C                   END
089100160601     c*
089200900405     C                   EXSR      STAMPA
089300041001     c                   add       1             wcontpo           3 0
089400041001     c*
089500041001     c                   if        d17pos>0  and d17pos<>999
089600041001     c                   goto      fine
089700041001     c                   endif
089800160601     c*
089900900405     C                   GOTO      INIZIO
090000160601     c*
090100900405     C     FINE          TAG
090200040519     C                   EXCEPT    FONDO
090300980204     C*
090400900405     C                   SETON                                        LR
090500040519     C**-----------------------------------------------------------
090600910325     C** DECODIFICHE
090700040519     C**-----------------------------------------------------------
090800910325     C     DECO          BEGSR
090900040519      * distretto
091000910325     C                   MOVEL     '17'          COD                            AREA
091100910325     C                   MOVE      *BLANK        KEY
091200910325     C                   MOVE      *BLANK        DEFL3
091300910325     C                   MOVEL     ORGFL3        KEY
091400910325     C     KTAB1         CHAIN     TABEL                              07
091500910325     C  N07              MOVEL     TBLUNI        DEFL3            20
091600040519     c* codice tassazione
091700910325     C                   MOVEL     'CT'          COD                            TASSAZIONE
091800910325     C                   MOVE      *BLANK        KEY
091900910325     C                   MOVE      *BLANK        DECTS
092000910325     C                   MOVEL     ORGCTS        KEY
092100910325     C     KTAB1         CHAIN     TABEL                              07
092200910325     C  N07              MOVEL     TBLUNI        DECTS            20
092300040519     c* Area
092400910325     C                   MOVEL     '05'          COD                            AREA
092500910325     C                   MOVE      *BLANK        KEY
092600910325     C                   MOVE      *BLANK        DECAR
092700910325     C                   MOVEL     ORGCAR        KEY
092800910325     C     KTAB1         CHAIN     TABEL                              07
092900910325     C  N07              MOVEL     TBLUNI        DECAR            20
093000040519     c* regione
093100910325     C                   MOVEL     '14'          COD                            REGIONE
093200910325     C                   MOVE      *BLANK        KEY
093300910325     C                   MOVE      *BLANK        DECRE
093400910325     C                   MOVEL     ORGCRE        KEY
093500910325     C     KTAB1         CHAIN     TABEL                              07
093600910325     C  N07              MOVEL     TBLUNI        DECRE            20
093700041001     c
093800041001     c* Località e data le stampo solo per tipi F/A
093900041001     C                   CLEAR                   LOCDAT
094000041001     c                   if         orgfag='V'
094100041001     c                   setoff                                       26
094200041001     c                   else
094300041001     c                   seton                                        26
094400960910     C*
094500960910     C* COSTRUISCO LOCALITA' + DATA
094600960910     C                   MOVEL     UDATE8        WDATA
094700960910     C                   MOVEA     WGG           SDT(6)
094800960910     C                   MOVEA     WMM           SDT(9)
094900960910     C                   MOVEA     WAA           SDT(12)
095000960910     C                   MOVEA     SDT           W015             15
095100130621     C     ORGDES        CAT       W015:0        LOCDAT           35            LOCALITA'+DATA
095200060613     C   88ORGDES        CAT       W015:0        LOCDAT           35            LOCALITA'+DATA
095300041001     c                   endif
095400041001     c
095500041005     c                   if        not *in88
095600041001      * Codice hub
095700060426     c                   move      §oghb1        §oghub_p
095800041001      *
095900041001      * Codice deposito
096000060426     c                   move      §ogdp1        §ogdpt_p
096100041001      *
096200131016      * Linea Forzatura x i Resi
096300131016     c                   move      §ogLNAres     §ogres_p
096400131016      *
096500131016     C                   MOVEL     *blanks       DESresi          20
096600131016     C                   if        §ogLNAres <> *blanks
096700131016     C                   move      §ogLNAres     $Fit              3 0
096800131016     C     $Fit          CHAIN     AZORG1                             36
096900131016     C  N36              MOVEL     ORGDES        DESResi
097000131016     C                   endif
097100131016      *
097200041001      * Autogenerazione spunte
097300041001     C                   move      *blanks       $DesAgs          40
097400041001     C                   SELECT
097500041001     C     §ogagp        WHENEQ    ' '
097600041001     C     §ogags        ANDEQ     ' '
097700041001     C                   eval      $DesAgs = STP2(1)
097800041001     C     §ogagp        WHENEQ    ' '
097900041001     C     §ogags        ANDEQ     'E'
098000041001     C                   eval      $DesAgs = STP2(2)
098100041001      *
098200041001     C     §ogagp        WHENEQ    'P'
098300041001     C     §ogags        ANDEQ     'E'
098400041001     C                   eval      $DesAgs = STP2(3)
098500041001     C                   ENDSL
098600041001     c* Tipo p.o.
098700041001     C                   SELECT
098800041001     C     §oglpo        WHENEQ    *blanks
098900041001     C                   movel     const1        deslpo           11
099000041001     C     §oglpo        WHENEQ    '1'
099100041001     C                   movel     const2        deslpo
099200041001     C     §oglpo        WHENEQ    '2'
099300041001     C                   movel     const3        deslpo
099400041001     C                   ENDSL
099500041001      *
099600041001     C                   if        §ogdkc ='S'
099700041001     C                   move      'S'           §ogdkc_p
099800041001     C                   else
099900041001     C                   move      'N'           §ogdkc_p
100000041001     C                   endif
100100041001     C                   if        §ogpck ='S'
100200041001     C                   move      'S'           §ogpck_p
100300041001     C                   else
100400041001     C                   move      'N'           §ogpck_p
100500041001     C                   endif
100600041213
100700050509     C                   if        §ogpkm ='S'
100800050509     C                   move      'S'           §ogpkm_p
100900050509     C                   else
101000050509     C                   move      'N'           §ogpkm_p
101100050509     C                   endif
101200050509
101300160506     C                   if        §ogturno ='S'
101400160506     C                   move      'S'           §ogturno_p
101500160506     C                   else
101600160506     C                   move      'N'           §ogturno_p
101700160506     C                   endif
101800160506
101900160531     C                   if        §ogAgSpUs ='S'
102000160531     C                   move      'S'           §ogAgSpUs_p
102100160531     C                   else
102200160531     C                   move      'N'           §ogAgSpUs_p
102300160531     C                   endif
102400160531      *
102500041001     C                   if        §ognoc ='N'
102600041001     C                   move      'N'           §ognoc_p
102700041001     C                   else
102800041001     C                   move      'S'           §ognoc_p
102900041001     C                   endif
103000041001     C
103100041001     C                   if        §ognid ='N'
103200041001     C                   move      'N'           §ognid_p
103300041001     C                   else
103400041001     C                   move      'S'           §ognid_p
103500041001     C                   endif
103600041001     C
103700041001     C                   if        §ogeid ='S'
103800041001     C                   move      'S'           §ogeid_p
103900041001     C                   else
104000041001     C                   move      'N'           §ogeid_p
104100041001     C                   endif
104200041001     C
104300041215     c                   clear                   §ogdtis_p        15
104400041215     c                   select
104500041215     C                   when      §ogtis ='V'
104600041215     C                   eval      §ogdtis_p = 'VDL'
104700041215     C                   when      §ogtis ='C'
104800041215     C                   eval      §ogdtis_p = 'CML'
104900041215     C                   when      §ogtis ='R'
105000041215     c                   eval      §ogdtis_p = 'Rulliera'
105100041215     C                   when      §ogtis =' '
105200041215     c                   eval      §ogdtis_p = 'Nessun impianto'
105300041215     C                   endsl
105400041001     C
105500041001      *
105600041001     C                   if        §oglbl =' '
105700041001     C                   move      'S'           §oglbl_p
105800041001     C                   else
105900041001     C                   move      'N'           §oglbl_p
106000041001     C                   endif
106100041001     C
106200041001     C                   if        §oglfv =' '
106300041001     C                   move      'S'           §oglfv_p
106400041001     C                   else
106500041001     C                   move      'N'           §oglfv_p
106600041001     C                   endif
106700041001     C
106800041001      *
106900041001      * Raggruppamenti, imposto campi stampa e decodifiche
107000041001      *
107100041001     C                   if        §ogara = *zeros
107200041001     C                   move      *blanks       §ogara_p
107300041001     C                   move      *blanks       desara
107400041001     C                   else
107500041001     C                   move      §ogara        §ogara_p
107600041001     C                   MOVEL     '05'          COD                            AREA
107700041001     C                   MOVEL(P)  §ogara        KEY
107800041001     C     KTAB1         CHAIN     TABEL                              07
107900041001     C  N07              MOVEL     TBLUNI        desara           20
108000041001     C                   endif
108100041001      *
108200041001     C                   if        §ogaex = *zeros
108300041001     C                   move      *blanks       §ogaex_p
108400041001     C                   else
108500041001     C                   move      §ogaex        §ogaex_p
108600041001     C                   endif
108700041001      *
108800041001     C                   MOVEL     *blanks       DESAEX           20
108900041001     C                   if        §ogAEX <> *blanks and §ogaex <> *blanks
109000041001     C                   move      §Ogaex        $Fit              3 0
109100041001     C     $Fit          CHAIN     AZORG1                             36
109200041001     C  N36              MOVEL     ORGDES        DESAex
109300041001     C                   endif
109400041001      *
109500041001     C                   if        §ogapo = *zeros
109600041001     C                   move      *blanks       §ogapo_p
109700041001     C                   else
109800041001     C                   move      §ogapo        §ogapo_p
109900041001     C                   endif
110000041001      *
110100041001     C                   MOVEL     *blanks       DESAPO           20
110200041001     C                   if        §ogApo <> *blanks and §ogApo <> *blanks
110300041001     C                   move      §OgApo        $Fit              3 0
110400041001     C     $Fit          CHAIN     AZORG1                             36
110500041001     C  N36              MOVEL     ORGDES        DESApo
110600041001     C                   endif
110700041001     c
110800041001      * decodifica regione ai fini tariffari
110900041001     C                   MOVEL     *blanks       DESRet           20
111000041001     C                   move      §OgRet        $Ret              3 0
111100041001     C     $Ret          CHAIN     AZORG1                             36
111200041001     C  N36              MOVEL     ORGDES        DESRet
111300041001      *
111400041001      * data macchinone peso/volume
111500041001      *
111600041001     C                   move      §ogpes        §ogpes_p          6 0
111700041001     C                   move      §ogvol        §ogvol_p          6 0
111800041001     c
111900041001     c
112000041001     C                   if        §ogsea =' '
112100041001     C                   move      'N'           §ogsea_p          1
112200041001     C                   else
112300041001     C                   move      'S'           §ogsea_p
112400041001     C                   endif
112500060912
112600061012     c                   clear                   §ogtlls_p         2
112700060912     c                   if        §ogtlls = *blanks
112800061012     c                   eval      §ogtlls_p = 'NO'
112900060912     c                   else
113000061012     c                   eval      §ogtlls_p = 'SI'
113100060912     c                   endif
113200910325     C*
113300041001      * mi riposiziono
113400041001     C     COMFI§        CHAIN     AZORG1                             36
113500041005     c                   endif
113600020701     C                   ENDSR
113700040519     C**-----------------------------------------------------------
113800900405     C** STAMPA
113900040519     C**-----------------------------------------------------------
114000900405     C     STAMPA        BEGSR
114100041001     c                   setoff                                       98
114200900405     C*
114300020628     C     D17PGI        IFGT      0
114400020628     C                   Z-ADD     D17PGI        PAGE
114500900405     C                   END
114600900405     C**
114700910226     C  N88              MOVEL     'OG'          COD
114800910226     C   88              MOVEL     'OR'          COD
114900900405     C                   Z-ADD     0             A                 3 0
115000130621     c                   eval      codut = 1
115100900405     C     KTAB          SETLL     TABEL                                  07
115200900405     C  N07              SETON                                          H7
115300900405     C   H7              GOTO      FINE
115400030523      *
115500030523   1aC                   DO        *HIVAL
115600900405     C     KTAB          READE     TABEL                                  07
115700900409     C   07              GOTO      ENDSTA
115800030523      *
115900030523   2aC                   IF        tblkey <> *blanks and tblflg <>'*'
116000030523      *
116100030523     C  N88              MOVEL     TBLUNI        DSOG
116200030523     C   88              MOVEL     TBLUNI        DSOR
116300900405     C                   MOVEL     TBLKEY        A
116400030523      *
116500030523      * Controlli flag di stampa CASO DSOG
116600020628      *
116700030523   3aC  n88              DO
116800020628      * TIPO STAMPA FILIALE
116900030523   4aC                   IF        *in16 = *on
117000020628      * F/A
117100041001   5aC                   if        savfag= 'A' or savFag ='F'
117200030523   6aC                   if        §OgFsf ='N'
117300020628     C                   goto      End1
117400030523   6-C                   endif
117500050603     c* escludi 1° livello
117600050603   6aC                   if        §OgFsf ='1' and *in39
117700050603     C                   goto      End1
117800050603   6-C                   endif
117900050603     c* escludi 2° livello
118000050603   6aC                   if        §OgFsf ='2' and not *in39
118100050603     C                   goto      End1
118200050603   6-C                   endif
118300050603     c
118400030523   5eC                   else
118500020628      * V/T
118600030523   7aC                   if        §OgFf2 ='N'
118700020628     C                   goto      End1
118800030523   6-C                   endif
118900050504     c* solo per network LOG
119000050504   7aC                   if        §OgFf2 ='L'  and
119100050504     c                             §ogntw<>'LOG'
119200050504     C                   goto      End1
119300050504   6-C                   endif
119400030523   5-C                   endif
119500030523   4-C                   ENDIF
119600020628      *
119700020628      * TIPO STAMPA SEDE
119800030523   4aC                   IF        *in15 = *on
119900020628      * F/A
120000041001   5aC                   if        savfag= 'A' or savFag ='F'
120100030523   6aC                   if        §OgFs1 ='N'
120200020628     C                   goto      End1
120300030523   6-C                   endif
120400050603     c* escludi 1° livello
120500050603   6aC                   if        §OgFs1 ='1' and *in39
120600050603     C                   goto      End1
120700050603   6-C                   endif
120800050603     c* escludi 2° livello
120900050603   6aC                   if        §OgFs1 ='2' and not *in39
121000050603     C                   goto      End1
121100050603   6-C                   endif
121200030523   5eC                   else
121300020628      * V/T
121400030523   6aC                   if        §Ogfs2 ='N'
121500020628     C                   goto      End1
121600030523   6-C                   endif
121700050504     c* solo per network LOG
121800050504   7aC                   if        §OgFf2 ='L'  and
121900050504     c                             §ogntw<>'LOG'
122000050504     C                   goto      End1
122100050504   6-C                   endif
122200030523   5-C                   endif
122300030523   4-C                   ENDIF
122400020628      *
122500030523   3-C                   ENDDO
122600030523      *
122700030523      *
122800030523      * Controlli flag di stampa CASO DSOR
122900030523      *
123000030523   3aC   88              DO
123100030523      * TIPO STAMPA FILIALE
123200030523   4aC                   IF        *in16 = *on
123300030523      * F/A
123400041001   5aC                   if        savfag= 'A' or savFag ='F'
123500030523   6aC                   if        §OrFsf ='N'
123600030523     C                   goto      End1
123700030523   6-C                   endif
123800030523   5-C                   endif
123900030523   4-C                   ENDIF
124000030523      *
124100030523   3-C                   ENDDO
124200030523      *
124300900410     C                   MOVEL     *BLANKS       DESFIA           20
124400900410     C     VCF(A)        IFNE      ORGFI§
124500900405     C                   Z-ADD     VCF(A)        CODFIL
124600910225     C     CODFIL        CHAIN     AZORG1                             36
124700900405     C  N36              MOVEL     ORGDES        DESFIA
124800900405     C                   END
124900030523      *
125000160601     c     CurLine       ifGE      60
125100900409     C                   EXCEPT    FONDO
125200020701      *
125300910227     C     COMFI§        CHAIN     AZORG1                             36
125400020701      *
125500041001     C                   EXCEPT    TESTA4
125600041001     C                   EXCEPT    TESTA
125700160601      *
125800041001     c                   setoff                                       98
125900020701     C                   END
126000980127     C*
126100041001     c                   if        not *in98
126200041001     c                   except    testa3
126300160601     c                   If        CurLine >= 60
126400160601     c                   except    FONDO
126500160601     c     COMFI§        chain     AZORG1                             36
126600160601     c                   except    TESTA4
126700160601     c                   except    TESTA
126800160601     c                   EndIf
126900160601     c                   except    Testa3B
127000041001     c                   seton                                        98
127100041001     c                   endif
127200160601     c*
127300900405     C                   EXCEPT    DET
127400030523   2-C                   END
127500160601      *
127600900405     C     END1          TAG
127700030523   1-C                   END
127800160601      *
127900900405     C     ENDSTA        ENDSR
128000890904     C***------------------------------------------------***
128100041008     OLET017    E            TESTA4            8
128200041001     O                                         +  9 ' '
128300041001     O          E            TESTA5      2
128400041001     O                                         +  9 ' '
128500041001     O          E    25n88   TESTA       0  0
128600040519     O                                         +  9 'Distretto:'
128700040519     O                       ORGFL3            +  1
128800040519     O                       DEFL3             +  1
128900040519     O                                         +  1 'Area :'
129000040519     O                       ORGCAR            +  1
129100040519     O                       DECAR             +  1
129200040519     O                                         +  1 'Raggruppamento area:'
129300040519     O                       §ogara_p          +  1
129400040519     O                       desara            +  1
129500041001     O          E    25n88   TESTA       1
129600040519     O                                         +  9 'Regione:'
129700040519     O                       ORGCRE            +  1
129800040519     O                       DECRE             +  1
129900040519     O          E       88   TESTA             5
130000040519     O                                         +  9 ' '
130100041008     O          E   n25n88   TESTA       2
130200040519     O                                         +  9 ' '
130300030520     O          E            TESTA       1
130400160601     O                  88                       15 'Ditta:'
130500160601     O                 N88                       20 'Filiale di:'
130600060613     O                       ORGFI§              35
130700960618     O          E            TESTA       1
130800160601     O                 N88   ORGDES              29
130900960429     O               66                          65 '*>   <*'
131000960429     O               66      ORGFVA              62
131100900409     O          E            TESTA       1
131200960618     O               80N88   RSUT                29
131300960618     O              N80N88   ORGDEA              29
131400160601     O                  88   ORGDES              29
131500960611     O                                           61 'Fax '
131600960611     O               80      ORGFAX            +  1
131700960611     O              N80      ORGFAA            +  1
131800900406     O          E            TESTA       1
131900960618     O               80      ORGIND              29
132000960618     O              N80      ORGINA              29
132100900409     O              N80      ORGTLA            +  1
132200030519     O                                           61 'Tel.'
132300030519     O               80      ORGTEL            +  1
132400030519     O              N80      ORGTEA            +  1
132500900409     O          E            TESTA       1
132600960618     O               80      ORGCPF              14
132700900409     O               80      ORGLOC            +  1
132800900409     O               80      ORGPRO            +  1
132900960618     O              N80      ORGCPA              14
133000900409     O              N80      ORGLOA            +  1
133100900409     O              N80      ORGPRA            +  1
133200041027     o* Non  stampo telefono diretto per i clienti
133300160601     O              n25n88                       61 'Dir.'
133400160601     O              n25n88   §ogtld            +  1
133500041008     O          E       19   TESTA       2
133600130621     O                                           27 'Assistenza Clienti'
133700960618     O                                           61 'Tel.'
133800960618     O                       ORGD47            +  1
133900160601     O*//       E            TESTA       1
134000160601     O*//                                           ' '
134100160601     O          E    26      TESTA       2
134200960910     O                       LOCDAT              44
134300160601     O*//       E            TESTA          1
134400160601     O*
134500160601     O*//       E    25n88   TESTA2      1
134600160601     O          E    25n88   TESTA2      2
134700040519     O                                         +  9 'Cod.Tassazione ..........:'
134800040519     O                       ORGCTS            +  1
134900040519     O                       DECTS             +  1
135000040519     O                                           94 'Aspettativa aziendale ...:'
135100040519     O                       ORGCAA            +  1
135200041001     O          E    25N88   TESTA2      1
135300040519     O                                         +  9 'Area ex AS/400 ..........:'
135400040519     O                       §ogaex_p          +  1
135500040519     O                       DESAEX            +  1
135600040519     O                                           94 'Area POC ................:'
135700040519     O                       §ogapo_p          +  1
135800040519     O                       DESAPO            +  1
135900041001     O          E    25n88   TESTA2      1
136000040519     O                                         +  9 'NetWork .................:'
136100040519     O                       §OGNTW            +  1
136200040520     O                                         +  8 'Ramo aziendale:'
136300040520     O                       orgdit            +  1
136400070312     O                                           94 'Tipo filiale ............:'
136500040520     O                       deslpo            +  1
136600041001     O          E    25n88   TESTA2      1
136700040520     O                                         +  9 'Codice HUB  DPD .........:'
136800040519     O                       §oghub_p          +  1
136900040520     O                                           94 'Codice deposito  DPD ....:'
137000040520     O                       §ogdpt_p          +  1
137100041001     O          E    25N88   TESTA2      1
137200170321     O                                         +  9 'LnArrivo Forzatura Resi .:'
137300131016     O                       §ogres_p          +  1
137400131016     O                       DESRESI           +  1
137500040519     O                                           94 'Regione ai fini tariffari:'
137600040519     O                       §OGRET            +  1
137700040519     O                       DesRet            +  1
137800041001     O          E    25N88   TESTA2      1
137900060102     O                                         +  9 'LnArrivo in bollettazione:'
138000040519     O                       §OGLBL_p          +  1
138100040519     O                                           94 'L.gestita fogli viaggio .:'
138200040519     O                       §OGLFV_p          +  1
138300041001     O          E    25N88   TESTA2      1
138400040519     O                                         +  9 'Autog.spunte partenza '
138500040519     O                       $DesAgs           +  0
138600041001     O          E    25N88   TESTA2      1
138700040519     O                                         +  9 'Abilitato Disk C ........:'
138800040519     O                       §OGDKC_p          +  1
138900040519     O                                           94 'Abilitato Picking .......:'
139000040519     O                       §OGpck_p          +  1
139100041215     O          E    25N88   TESTA2      1
139200050509     O                                           94 'Picking Messaggerie .....:'
139300050509     O                       §OGpkm_p          +  1
139400160506     O          E    25N88   TESTA2      1
139500160531     O                                           94 'Turno Picking ...........:'
139600160506     O                       §OGturno_p        +  1
139700160531     O          E    25N88   TESTA2      1
139800160531     O                                           94 'Autog. spunte uscita ....:'
139900160531     O                       §OGagSpUs_p       +  1
140000041001     O          E    25N88   TESTA2      1
140100160506     O                                         +  9 'Fil.esegue IDD ..........:'
140200040519     O                       §OGNID_p          +  1
140300040519     O                                           94 'Esegue IDD giorno dopo ..:'
140400040519     O                       §OGEID_p          +  1
140500041001     O          E    25N88   TESTA2      1
140600041215     O                                         +  9 'Tipo Impianto Smistacolli:'
140700041215     O                       §OGdtis_p         +  1
140800040519     O                                           94 'Crea bolle sede per po-
140900040519     O                                              sta:'
141000040519     O                       §OGNOC_p          +  1
141100041001     O          E    25N88   TESTA2      1
141200040519     O                                         +  9 'Data macchinone per volu-
141300020701     O                                              me:'
141400040519     O                       §OGVOL_P          +  1 '  /  /  '
141500040520     O                                         +  3 'per peso:'
141600040519     O                       §OGPES_P          +  1 '  /  /  '
141700041001     O          E    25N88   TESTA2      1
141800040519     O                                           94 'L.arrivo stampa segnacollo'
141900040519     O                       ORGDE5            +  1
142000041001     O          E    25N88   TESTA2      1
142100040520     O                                         +  9 'Coda stampe FAXIN .......:'
142200040520     O                       §ogfxi            +  1
142300040520     O                                           94 'Coda stampe FAXOUT ......:'
142400040520     O                       §ogfxo            +  1
142500041001     O          E    25N88   TESTA2      1
142600070312     O                                         +  9 'Coda stampe SEDE->Filiale:'
142700040520     O                       §ogssp            +  1
142800060912     O                                           94 'Stampa segnac.estero arr.:'
142900040520     O                       §ogsea_p          +  1
143000050707     O          E    25N88   TESTA2      1
143100050707     O                                         +  9 'Coda stampe SEDE -> Comm.:'
143200050707     O                       §ogssc            +  1
143300070301     O          E    25N88   TESTA2      1
143400070301     O                                         +  9 'G E O - Scambio Dati:'
143500070301     O                       §ogtlls_p         +  1
143600041001     O          E    25N88   TESTA2      1
143700040519     O                                         +  9 'L.parallela BAR->SDI/SDI->-
143800030520     O                                              BAR da proporre in tass. P.-
143900030520     O                                              A. .:'
144000040519     O                       §oglpr            +  1
144100170321     O          E    25N88   TESTA2      1
144200170321     O                                         +  9 'Esente blocco dirottam. .:'
144300170321     O                       §ogEsBlDi         +  1
144400041001     O          E            TESTA3      3
144500130621     O                                           58 'O R G A N I G R A M M A'
144600160601     O          E            TESTA3b     2
144700900409     O          E            DET         1
144800030523     O              n88      §OGDES              49
144900030523     O               88      §ORDES              49
145000900409     O                       VDE(A)            +  1
145100041001     O          E    15      FONDO            65
145200960429     O                                           55 '***'
145300910327     O                       PAGE          Z   +  1
145400910327     O                                         +  1 '***'
145500960910** SDT
145600960910, li XX/XX/XXXX
145700020701** STP1
1458000207011°livello .:                                                                   1
145900160506solo la Fil:                                                                   1
1460001605061°liv.e Fil:                                                                   1
146100020701** STP2
146200020701solo con pistola 88                                                            2
146300020701da spunta entrata con presenza Cml/Vdl                                         2
146400040520da qualsiasi spunta entrata                                                    2
