000100120619     A*%%TS  SD  20120619  155647  EDPLC       REL-V6R1M0  5761-WDS
000200120619     A*%%EC
000601121130     A                                      DSPSIZ(27 132 *DS4)
000602121130     A                                      REF(*LIBL/CNDIZION)
000603121130     A                                      INDARA
000604121130     A                                      PRINT
002300120620      *---------------------------------------------------------------*
002400120620     A          R PROTECT
002500120620     A                                      TEXT('Serve x inibire tutt-
002600120620     A                                      o il video')
002700120620     A                                      OVERLAY
002800120620     A                                      PROTECT
002900120620     A                                      CLRL(*NO)
003000120620     A          R ASSUME
003100120620     A                                      ASSUME
003200120620     A                                  1  2' '
003300121130     A          R SDUOW05
003400121130     A*%%TS  SD  20121130  104252  EDPES       REL-V6R1M0  5761-WDS
003500121130     A                                      CF06
003600121130     A                                      CA12
003700121130     A                                      OVERLAY
003800121130     A                                      WINDOW(17 45 6 38)
003900121130     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
004000121130     A                                          '))
004100121130     A  28        W05MSG        38   M
004200121130     A                                  2  7'M O D I F I C A'
004300121130     A                                      DSPATR(HI)
004400121130     A                                  3  2'Data conferma movimento:'
004500121130     A            W05DTM         6Y 0B  3 29DSPATR(HI)
004600121130     A                                      EDTWRD('  /  /  ')
004700121130     A  61                                  DSPATR(PC)
004800121130     A                                  5  2'F6=conferma'
004900121130     A                                  5 26'F12=Ritorno'
