000100000630      **************************************************************************
000200000630      *                                                                        *
000300000630      *   *----------------------------------------------------------------*   *
000400050404      *    PULIZIA FILES PER SEDE -   T I L A O 0 0 F                          *
000500000630      *   *----------------------------------------------------------------*   *
000600000630      *                                                                        *
000700000630      **************************************************************************
000800000000     H DECEDIT('0,') DATEDIT(*DMY.)
000900050404     Ftilao01l  UF   E           K DISK
001000000630      *
001100000630      * DS PASSAGGIO PARAMETRI
001200000630      *
001300000630     D PARAM           DS
001400050404     D  datlao                33     40  0                                      ANNO PULIZIA
001500000630     D KPJBA         E DS
001600000630      **************************************************************************
001700000630      *                                                                        *
001800000630      *         O P E R A Z I O N I   I N I Z I A L I                          *
001900000630      *                                                                        *
002000000630      **************************************************************************
002100000630     C     *ENTRY        PLIST
002200000630     C                   PARM                    KPJBA
002300000630     C                   MOVEL     KPJBU         PARAM
002400000630      **************************************************************************
002500000630      *                                                                        *
002600000630      *         R O U T I N E   P R I N C I P A L E                            *
002700000630      *                                                                        *
002800000630      **************************************************************************
002900050404     C     *loval        SETLL     tilao01l
003000000630     C                   DO        *HIVAL
003100050404     C                   READ      tilao01l                               90
003200000630     C   90              LEAVE
003300000630      *
003400050404     c                   movel     laotim        w_datlao          8 0
003500050404     c                   if        W_datlao < datlao  and lagela <> '00'
003600050404     C                   DELETE    tilao000
003700050404     c                   endif
003800000630      *
003900000630     C                   ENDDO
004000000630     C                   SETON                                        LR
