000010171115     A*%%TS  SD  20171115  142750  EDPRM       REL-V7R2M0  5770-WDS
000020000000     A*------------------------------------------------------------------------*
000030171115     A*%%EC
000040171115     A                                      DSPSIZ(24 80 *DS3)
000050171115     A                                      CHGINPDFT(HI UL)
000060171115     A                                      PRINT
000070171115     A                                      CF01
000080171115     A                                      CF02
000090171115     A                                      CF03
000100171115     A                                      CF04
000110171115     A                                      CF05
000120171115     A                                      CF06
000130171115     A                                      CF07
000140171115     A                                      CF08
000150171115     A                                      CF09
000160171115     A                                      CF10
000170171115     A                                      CF11
000180171115     A                                      CF12
000190171115     A                                      CF13
000200171115     A                                      CF14
000210171115     A                                      CF15
000220171115     A                                      CF16
000230171115     A                                      CF17
000240171115     A                                      CF18
000250171115     A                                      CF19
000260171115     A                                      CF20
000270171115     A                                      CF21
000280171115     A                                      CF22
000290171115     A                                      CF23
000300171115     A                                      CF24
000310171115     A                                      HELP
000320000000     A*------------------------------------------------------------------------*
000330171116     A          R SDUTD01
000340171115     A*%%TS  SD  20171115  121526  EDPRM       REL-V7R2M0  5770-WDS
000350171115     A            RSUT          20A  O  1  2
000360171115     A                                  1 24'Crea Bolle per invio materiale IT -
000370171115     A                                        '
000380171115     A                                      DSPATR(RI)
000390171116     A                                  1 62'TNSDUTR1'
000400171115     A                                  1 71DATE
000410171115     A                                      EDTCDE(Y)
000420171115     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000430171115     A                                  2 71TIME
000440171115     A                                 10  3'Filiale di Arrivo'
000450171115     A                                 14  3'Rif.Mitt.Alfabetico'
000460171115     A            VIDLNA         3Y 0B 10 24EDTCDE(Z)
000470171115     A                                      CHECK(RZ)
000480171115     A  40                                  DSPATR(PC)
000490171115     A            VIDRMA        15A  B 14 24
000500171115     A  41                                  DSPATR(PC)
000510171115     A                                 24  3'F3=Fine'
000520171115     A  28        VIDMSG        78   M
000530171115     A                                 24 14'F6=Conferma'
000540171115     A                                      DSPATR(HI)
000550171116     A          R SDUTW01
000560171115     A*%%TS  SD  20171115  142750  EDPRM       REL-V7R2M0  5770-WDS
000570171115     A                                      OVERLAY
000580171115     A                                      WINDOW(15 5 4 70)
000590171115     A                                  1  1'Bolla già presente.'
000600171115     A                                  1 21'Immettere "S" per la ristampa del -
000610171115     A                                      segnacollo'
000620171115     A            WIDRIS         1A  B  1 67VALUES('S' ' ')
000630171115     A                                  3 43'F6=Conferma'
000640171115     A                                      DSPATR(HI)
