000100110914     A*%%***********************************************************************
000200110914     A*%%TS  RD  20110914  103627  EDPES       REL-V6R1M0  5761-WDS
000300110914     A*%%FI+10660100000000000000000000000000000000000000000000000000
000400110914     A*%%FI       0000000000000000000000000000000000000000000000000
000500110914     A*%%EC
000600110914     A*%%***********************************************************************
000700110914     A          R SDUMPT1
000800110914     A*%%***********************************************************************
000900110914     A*%%RI 00000
001000110914     A*%%***********************************************************************
001100110914     A            RSUT          20   O     1
001200110914     A                                      SKIPB(001)
001300110914     A N99                                30
001400110914     A                                      '** ELENCO INVII / RIENTRI GIORNALI-
001500110914     A                                      ERI UNITÀ EDP **'
001600110914     A                                      HIGHLIGHT
001700110914     A                                    87
001800110914     A                                      'TNSDUMR'
001900110914     A                                   100
002000110914     A                                      DATE(*YY)
002100110914     A                                      EDTCDE(8)
002200110914     A                                   116
002300110914     A                                      'PAG.'
002400110914     A                                   120
002500110914     A                                      PAGNBR
002600110914     A                                      EDTCDE(Z)
002700110914     A*
002800110914     A            KNMUS         10   O     1
002900110914     A                                      SKIPB(002)
003000110914     A            KNSIF         10   O    12
003100110914     A            T1DCONF       30A  O   +13
003200110914     A            T1CDTM         8S 0O    67
003300110914     A                                      EDTWRD('  /  /    ')
003400110914     A                                      HIGHLIGHT
003500110914     A                                   101
003600110914     A                                      TIME
003700110914     A                                     1
003800110914     A                                      'SELEZIONI:'
003900110914     A                                      SPACEB(002)
004000110914     A                                      HIGHLIGHT
004100110914     A                                      UNDERLINE
004200110914     A                                    12
004300110914     A                                      'Ufficio:'
004400110914     A            T1DCUF        17A  O    21
004500110914     A                                      HIGHLIGHT
004600110914     A            T1DINVR       22A  O    39
004700110914     A                                    63
004800110914     A                                      'Magazzino: Dest.'
004900110914     A            T1CMAG         3S 0O    80
005000110914     A                                      EDTCDE(Z)
005100110914     A            T1DMAG        15A  O    84
005200110914     A                                   100
005300110914     A                                      'Corr.'
005400110914     A            T1CMGC         3S 0O   106
005500110914     A                                      EDTCDE(Z)
005600110914     A            T1DMGC        15A  O   110
005700110914     A                                    12
005800110914     A                                      'Utente:'
005900110914     A                                      SPACEB(001)
006000110914     A            T1CUTE        10A  O    20
006100110914     A                                    31
006200110914     A                                      'dalla data'
006300110914     A            T1CDIM         8S 0O    42
006400110914     A                                      EDTWRD('  /  /    ')
006500110914     A                                      HIGHLIGHT
006600110914     A                                    53
006700110914     A                                      'ora'
006800110914     A            T1CHIM         6S  O    57
006900110914     A                                      EDTWRD('  :  :  ')
007000110914     A                                    72
007100110914     A                                      'ORDINAMENTO'
007200110914     A                                      HIGHLIGHT
007300110914     A                                      UNDERLINE
007400110914     A            T1DORD        40A  O    85
007500110914     A                                     1
007600110914     A                                      '__________________________________-
007700110914     A                                      ___________________________________-
007800110914     A                                      ___________________________________-
007900110914     A                                      ____________________'
008000110914     A                                      HIGHLIGHT
008100110914     A                                      SPACEB(001)
008200110914     A                                     1
008300110914     A                                      '|'
008400110914     A                                      SPACEB(001)
008500110914     A                                      HIGHLIGHT
008600110914     A                                     2
008700110914     A                                      'IMMISS.'
008800110914     A                                      HIGHLIGHT
008900110914     A                                    10
009000110914     A                                      '|'
009100110914     A                                      HIGHLIGHT
009200110914     A                                    13
009300110914     A                                      'Magazzino'
009400110914     A                                      HIGHLIGHT
009500110914     A                                    30
009600110914     A                                      '|'
009700110914     A                                      HIGHLIGHT
009800110914     A                                    32
009900110914     A                                      'Tipo Unità'
010000110914     A                                      HIGHLIGHT
010100110914     A                                    46
010200110914     A                                      '|'
010300110914     A                                      HIGHLIGHT
010400110914     A                                    48
010500110914     A                                      'Descrizione'
010600110914     A                                      HIGHLIGHT
010700110914     A                                    63
010800110914     A                                      'Note'
010900110914     A                                      HIGHLIGHT
011000110914     A                                    83
011100110914     A                                      '|'
011200110914     A                                      HIGHLIGHT
011300110914     A                                    84
011400110914     A                                      'Matricola'
011500110914     A                                      HIGHLIGHT
011600110914     A                                   100
011700110914     A                                      'Modello'
011800110914     A                                      HIGHLIGHT
011900110914     A                                   116
012000110914     A                                      '|'
012100110914     A                                      HIGHLIGHT
012200110914     A                                    +1
012300110914     A                                      'RESO'
012400110914     A                                      HIGHLIGHT
012500110914     A                                   124
012600110914     A                                      '|'
012700110914     A                                      HIGHLIGHT
012800110914     A                                     1
012900110914     A                                      '|'
013000110914     A                                      HIGHLIGHT
013100110914     A                                      SPACEB(001)
013200110914     A                                     2
013300110914     A                                      'Data/Ora'
013400110914     A                                      HIGHLIGHT
013500110914     A                                    10
013600110914     A                                      '|'
013700110914     A                                      HIGHLIGHT
013800110914     A                                    13
013900110914     A                                      'Destinazione'
014000110914     A                                      HIGHLIGHT
014100110914     A                                    30
014200110914     A                                      '|'
014300110914     A                                      HIGHLIGHT
014400110914     A                                    46
014500110914     A                                      '|'
014600110914     A                                      HIGHLIGHT
014700110914     A                                    48
014800110914     A                                      'Mag.Corr'
014900110914     A                                      HIGHLIGHT
015000110914     A                                    63
015100110914     A                                      'Codice  Cliente'
015200110914     A                                      HIGHLIGHT
015300110914     A                                    83
015400110914     A                                      '|'
015500110914     A                                      HIGHLIGHT
015600110914     A                                   116
015700110914     A                                      '|'
015800110914     A                                      HIGHLIGHT
015900110914     A                                    +0
016000110914     A                                      'Un/Mat'
016100110914     A                                      HIGHLIGHT
016200110914     A                                   124
016300110914     A                                      '|'
016400110914     A                                      HIGHLIGHT
016500110914     A                                     1
016600110914     A                                      '|________|___________________|____-
016700110914     A                                      ___________|_______________________-
016800110914     A                                      _____________|_____________________-
016900110914     A                                      ___________|_______|'
017000110914     A                                      HIGHLIGHT
017100110914     A*%%***********************************************************************
017200110914     A*%%SS
017300110914     A*%%CL 001
017400110914     A*%%CL 002
017500110914     A*%%CL 001
017600110914     A*%%CL 001
017700110914     A*%%CL 001
017800110914     A*%%CL 001
017900110914     A*%%***********************************************************************
018000110914     A*
018100110914     A          R SDUMPD1
018200110914     A*%%***********************************************************************
018300110914     A*%%RI 00000
018400110914     A*%%***********************************************************************
018500110914     A                                      SPACEB(001)
018600110914     A                                     1
018700110914     A                                      '|'
018800110914     A                                      HIGHLIGHT
018900110914     A            S1CDIM         6S 0O     2
019000110914     A                                      EDTWRD('  /  /  ')
019100110914     A  10                                  HIGHLIGHT
019200110914     A                                    10
019300110914     A                                      '|'
019400110914     A            S1CMAG         3  0O    11
019500110914     A  11                                  HIGHLIGHT
019600110914     A                                    14
019700110914     A                                      '-'
019800110914     A            S1DMAG        15   O    15
019900110914     A  11                                  HIGHLIGHT
020000110914     A                                    30
020100110914     A                                      '|'
020200110914     A            S1DTIP        15   O    31
020300110914     A  11                                  HIGHLIGHT
020400110914     A                                    46
020500110914     A                                      '|'
020600110914     A            S1CDES        15A  O    47
020700110914     A            S1CNOT        20A  O    63
020800110914     A                                    83
020900110914     A                                      '|'
021000110914     A            S1CMAT        15A  O    84
021100110914     A            S1CMOD        15A  O   100
021200110914     A                                   116
021300110914     A                                      '|'
021400110914     A            S1CTIR         2   O   117
021500110914     A            S1DTRU         4A  O   120
021600110914     A                                   124
021700110914     A                                      '|'
021800110914     A                                      HIGHLIGHT
021900110914     A                                     1
022000110914     A                                      '|'
022100110914     A                                      HIGHLIGHT
022200110914     A                                      SPACEB(001)
022300110914     A            S1CHIM         6S 0O     2
022400110914     A                                      EDTWRD('0 :  :  ')
022500110914     A  10                                  HIGHLIGHT
022600110914     A                                    10
022700110914     A                                      '|'
022800110914     A            S1DFPR        11A  O    15
022900110914     A                                      HIGHLIGHT
023000110914     A                                    30
023100110914     A                                      '|'
023200110914     A            S1CTIP         2   O    31
023300110914     A  11                                  HIGHLIGHT
023400110914     A                                    46
023500110914     A                                      '|'
023600110914     A            S1CMGC         3S 0O    47
023700110914     A                                      EDTCDE(Z)
023800110914     A            S1DMGC        12A  O    50
023900110914     A            S1CKSC         7S 0O    63
024000110914     A                                      EDTCDE(Z)
024100110914     A            S1DKSC        13A  O    70
024200110914     A                                    83
024300110914     A                                      '|'
024400110914     A            S1CMATR       15A  O   109
024500110914     A                                   124
024600110914     A                                      '|'
024700110914     A                                     1
024800110914     A                                      '|________|___________________|____-
024900110914     A                                      ___________|_______________________-
025000110914     A                                      _____________|_____________________-
025100110914     A                                      ___________________'
025200110914     A*%%***********************************************************************
025300110914     A*%%SS
025400110914     A*%%CL 001
025500110914     A*%%***********************************************************************
025600110914     A          R SDUMPFI
025700110914     A*%%***********************************************************************
025800110914     A*%%RI 00000
025900110914     A*%%FS 001
026000110914     A*%%***********************************************************************
026100110914     A                                      SPACEB(002)
026200110914     A                                    54
026300110914     A                                      '***  FINE  STAMPA  ***'
026400110914     A*%%***********************************************************************
026500110914     A*%%SS
026600110914     A*%%FL 001
026700110914     A*%%CP+999CRTPRTF
026800110914     A*%%CP+    OVRFLW(63)
026900110914     A*%%CP+    FILE(GAITRAFIL/TNSDUMP)
027000110914     A*%%CP+    DEVTYPE(*SCS)
027100110914     A*%%CP+    PAGESIZE(*N       198      *N     )
027200110914     A*%%CP+    LPI(6)
027300110914     A*%%CP     CPI(16.7)
027400110914     A*%%***********************************************************************
027500110914      *----
