000100090327     A                                      REF(CNDIZION)
000200090402     A          R TNSD4030O
000300090327     A                                      TEXT('Anagrafico società: +
000400090402     A                                      selettore parametri output.')
000500090402     A            IDRIGA        10S 0
000600090402     A                                      TEXT('ID riga.')
