000100070411      *PARMS MBR(*NONE)
000200070411      *---------------------------------------------------------------*
000300100901      *? DS DI STAMPA  INVII/RIENTRI GIORNALIERI UNITÀ EDP                ?*
000400070411      *---------------------------------------------------------------*
000500070411     A                                      REF(CNDIZION)
000600070411      *
000700100903     A          R SDUOREC                   TEXT('DATA AREA INVII/RIENTRI -
000800100827     A                                      GIORNALIERI UNITÀ EDP')
000900070411      *
001000100903     A            §SDUODAT       8S 0       TEXT('DATA GESTIONE IMM.MATRICOLE')
001100100903     A            §SDUOUTE      10A         TEXT('UTENTE GESTIONE ')
001200100907     A            §SDUOPGM      20A         TEXT('PGM  IN ESECUZIONE')
