000010971013     A*%%TS  SD  19971013  160110  EDPRN       REL-V3R6M0  5716-PW1
000020941215     A*------------------------------------------------------------------------*
000030971013     A*%%EC
000040971013     A                                      DSPSIZ(24 80 *DS3)
000050971013     A                                      CHGINPDFT(HI CS)
000060971013     A                                      PRINT
000070971013     A                                      CF01
000080971013     A                                      CF02
000090971013     A                                      CF03
000100971013     A                                      CF04
000110971013     A                                      CF05
000120971013     A                                      CF06
000130971013     A                                      CF07
000140971013     A                                      CF08
000150971013     A                                      CF09
000160971013     A                                      CF10
000170971013     A                                      CF11
000180971013     A                                      CF12
000190971013     A                                      CF13
000200971013     A                                      CF14
000210971013     A                                      CF15
000220971013     A                                      CF16
000230971013     A                                      CF17
000240971013     A                                      CF18
000250971013     A                                      CF19
000260971013     A                                      CF20
000270971013     A                                      CF21
000280971013     A                                      CF22
000290971013     A                                      CF23
000300971013     A                                      CF24
000310971013     A                                      HELP
000320941215     A*------------------------------------------------------------------------*
000330971013     A          R SDUDD01
000340971013     A*%%TS  SD  19971013  160110  EDPRN       REL-V3R6M0  5716-PW1
000350971013     A            RSUT          20A  O  1  2
000360971013     A                                  1 24'DOTAZIONI UNITA'' EDP PUNTI OPERAT-
000370971013     A                                      IVI'
000380971013     A                                      DSPATR(RI)
000390971013     A                                  1 62'TNSDUDR'
000400971013     A                                  1 71DATE
000410971013     A                                      EDTCDE(Y)
000420941215     A*------------------------------------------------------------------------*
000430941215     A          R SDUDD02
000440930709     A                                      OVERLAY
000450930709     A            FUN001        19A  O 22  2
000460930709     A            FUN002        19A  O 22 22
000470930709     A            FUN003        19A  O 22 42
000480930709     A            FUN004        19A  O 22 62
000490930709     A            FUN005        19A  O 23  2
000500930709     A            FUN006        19A  O 23 22
000510930709     A            FUN007        19A  O 23 42
000520930709     A            FUN008        19A  O 23 62
000530941215     A*------------------------------------------------------------------------*
000540941220     A          R SDUDD03
000550941220     A*%%TS  SD  19941220  105048  EDPRN       REL-V2R3M0  5738-PW1
000560941220     A                                      OVERLAY
000570941220     A            VIDFUN        15A  O  2 34DSPATR(HI)
000580941220     A                                      DSPATR(RI)
000590941220     A            VIDATB         9A  O  3 37DSPATR(HI)
000600941220     A                                      DSPATR(BL)
000610941220     A                                  5  2'Tipo unità ............?:'
000620941220     A            VIDTIP    R     A  B  5 29REFFLD(DOTTIP UNDOT00F)
000630941220     A                                      CHECK(RZ)
000640941220     A  60                                  DSPATR(RI)
000650941220     A  60                                  DSPATR(PC)
000660941220     A  91                                  DSPATR(PR)
000670941220     A            VIDTID        25A  O  5 34
000680941220     A                                  7  2'Magazzino .............?:'
000690941220     A            VIDFIL    R     A  B  7 29REFFLD(DOTFIL UNDOT00F)
000700941220     A  61                                  DSPATR(RI)
000710941220     A  61                                  DSPATR(PC)
000720941220     A  91                                  DSPATR(PR)
000730941220     A                                      CHECK(RZ)
000740941220     A            VIDFID        20A  O  7 34
000750941220     A                                  9  2'Quantità in dotazione ..:'
000760941220     A            VIDQTA    R     Y  B  9 29REFFLD(DOTQTA UNDOT00F)
000770941220     A  62                                  DSPATR(RI)
000780941220     A  62                                  DSPATR(PC)
000790941220     A  90                                  DSPATR(PR)
000800941220     A                                      CHECK(RZ)
000810941220     A                                      EDTCDE(Z)
000820941215     A*------------------------------------------------------------------------*
000830941215     A          R SDUDDMS                   SFL
000840000000     A                                      SFLMSGRCD(24)
000850000000     A            MSGKEY                    SFLMSGKEY
000860000000     A            MSGQUE                    SFLPGMQ
000870941215     A*------------------------------------------------------------------------*
000880941215     A          R SDUDDMC                   SFLCTL(SDUDDMS)
000890000000     A                                      OVERLAY
000900000000     A                                      SFLDSP
000910000000     A  40                                  SFLCLR
000920000000     A                                      SFLSIZ(0002)
000930000000     A                                      SFLPAG(0001)
