000100080530      *PARMS DFTACTGRP(*NO) ACTGRP(QILE) OPTION(*NOXREF) DATEDIT(*yMd.)
000200080206      //--------------------------------------------------------------
000300100831      //?TNSDV1R - Interrogazione  invii/rientri giornalieri  UNITÀ EDP
000400080206      //--------------------------------------------------------------
000500080206
000600080206     h decedit('0,') datedit(*ymd/) option(*nodebugio)
000700080206
000800080206      //---------------------------------------------------------------
000900080206      //?Dichiarazione file.
001000080206      //---------------------------------------------------------------
001100050704
001200100312
001300080206      //---------------------------------------------------------------
001400080206      //?Definizione aree dati.
001500080206      //---------------------------------------------------------------
001600080206      // - Dati utente
001700080206     d §AzUte        e ds                  extname(AZUTE00F)
001800080206     d                                     dtaara
001900080206     d §DatiUte      e ds                  extname(dDatiUte)
002000080206     d                                     dtaara
002100080206
002200080206      // - Parametri ricevuti
002300080206     d KPJBA         e ds
002400080206
002500080206      // - Reperimento dati utente
002600080206     d TIBS34ds      e ds
002700080206     d dUte01        e ds
002800080702     d DLAT          e ds
002900100827     d tnsdv0ds      e ds
003000080702
003100080206      //---------------------------------------------------------------
003200080206      //?Definizione procedure usate.
003300080206      //---------------------------------------------------------------
003400080414      /copy gaitrasrc/srcprotopr,tibs34r
003500100827      /copy gaitrasrc/srcprotopr,tnsduor
003600080206      //---------------------------------------------------------------
003700080206      //?M A I N - L I N E
003800080206      //---------------------------------------------------------------
003900080206
004000080627     c     *Entry        plist
004100080206     c                   parm                    KPJBA
004200080627
004300080702
004400080206      /free
004500080206
004600080206       // Operazioni iniziali
004700080206       exsr RoutInz;
004800100827
004900100830       // RICHIAMO MODALITÀ Interrogazione
005000100827       clear tnsdv0ds  ;
005100100830       EVAL §SDV0IMM=' '  ;
005200100830       EVAL §SDV0INT='S'  ;
005300100827       EVAL §SDV0MMAT=' '  ;
005400100827       eval kpjbu=tnsdv0ds  ;
005500100827       callp TNSDUOR (kpjba)  ;
005600081215
005700080206
005800080206       // Operazioni finali
005900080206       exsr RoutEnd;
006000080206
006100080206       //--------------------------------------------------------------
006200080206       //?Operazioni iniziali.
006300080206       //--------------------------------------------------------------
006400080206       BEGSR RoutInz;
006500080206         // Reperimento dati job
006600080206         exsr DatiJob;
006700080627         ENDSR;
006800080206
006900080206       //--------------------------------------------------------------
007000080206       //?Reperimento Dati del job (Utente/Operativi).
007100080206       //--------------------------------------------------------------
007200080206       BEGSR DatiJob;
007300080206
007400080206         in(E) §AzUte;
007500080206         if NOT %error;
007600080206           in(E) §DatiUte;
007700080206         endif;
007800080206         if %error or RSut = *blanks;
007900080206           clear TIBS34ds;
008000080206           tibs34r(tibs34ds);
008100080206           in §AzUte;
008200080206           in §DatiUte;
008300080206         endif;
008400080206
008500080206       ENDSR;
008600080702
008700080206       //--------------------------------------------------------------
008800080206       //?Operazioni finali.
008900080206       //--------------------------------------------------------------
009000080206       BEGSR RoutEnd;
009100080627
009200080206         *inLR = *on;
009300080704
009400080206         return;
009500080206
009600080206       ENDSR;
009700080206
009800080206      /end-free
