000100090327     A                                      REF(CNDIZION)
000200120319     A          R TNSD4130O                 TEXT('Società delle filiali: +
000300120319     A                                      output selettore.')
000400120319     A            FORMATO       10A         TEXT('Nome formato "TNSD4130O".')
000500120319     A                                      DFT('TNSD4130O')
000600120319     A            VERSIONE       1A         TEXT('Versione formato "A".')
000700120319     A                                      DFT('A')
