000100131129
000200131129 /* Piteco: pgm da schedulare per esportaizone anagrafiche da Proj    */
000300131129
000400131129             PGM
000500131129   /* Piano dei conti  */
000600131129             CALL       PGM(YPTCXCTOR)
000700131129             MONMSG     MSGID(CPF0000)
000800131129
000900131129   /* Area (Unità)     */
001000131129             CALL       PGM(YPTCXARER)
001100131129             MONMSG     MSGID(CPF0000)
001200131129
001300131129   /* Centri di costo) */
001400131129             CALL       PGM(YPTCXCDCR)
001500131129             MONMSG     MSGID(CPF0000)
001600131129
001700131129   /* Abi/Cab          */
001800131129             CALL       PGM(YPTCXABIR)
001900131129             MONMSG     MSGID(CPF0000)
002000131129
002100000000             ENDPGM
