000100120924     A          R YPTCXCTO                  TEXT('Piteco: +
000200120924     A                                      carico piano dei conti.')
000300120925     A* Campi chiave.
000400120924     A            SOCIETA        4A         TEXT('Società presente in Piteco.')
000500120924     A                                      CMP(NE ' ')
000600120924     A            SEGM           4A         TEXT('Tipo anagrafica "XCTO".')
000700120924     A                                      ALIAS(SEGMENTO)
000800120924     A                                      DFT('XCTO')
000900120924     A                                      CMP(EQ 'XCTO')
001000120925     A            CODICE1       20A         TEXT('Codice anagrafica.')
001100120924     A                                      ALIAS(CODICE_ANAGRAFICA_1)
001200120924     A                                      CMP(NE ' ')
001300120925     A            CODICE2       20A         TEXT('Codice anagrafica +
001400120925     A                                      opzionale.')
001500120924     A                                      ALIAS(CODICE_ANAGRAFICA_2)
001600120925     A            CODICE3       20A         TEXT('Codice anagrafica +
001700120925     A                                      opzionale.')
001800120924     A                                      ALIAS(CODICE_ANAGRAFICA_3)
001900120925     A* Campi dati.
002000120925     A            FLPROVE        1A         TEXT('Flag provenienza.')
002100120925     A                                      ALIAS(FLAG_PROVENINEZA)
002200120925     A                                      VALUES(' ' 'M' 'A' 'C')
002300120925     A*                                     'M' = inserito manualmente
002400120925     A*                                     'A' = inserito in automatico
002500120925     A*                                     'C' = cancellazione
002600120925     A            DESCR1        40A         TEXT('Descrizione codice.')
002700120925     A                                      ALIAS(DESCRIZIONE_1)
002800120925     A                                      CMP(NE ' ')
002900120925     A            DESCR2        40A         TEXT('Descrizione codice +
003000120925     A                                      opzionale.')
003100120925     A                                      ALIAS(DESCRIZIONE_2)
003200120925     A            DATAINI        8A         TEXT('Data inizio validità +
003300120925     A                                      YYYYMMDD.')
003400120925     A            DATAFIN        8A         TEXT('Data fine   validità +
003500120925     A                                      YYYYMMDD.')
003600120925     A            CODRAGGR      20A         TEXT('Codice raggruppamento.')
003700120925     A            CODFISCALE    16A         TEXT('Non significativo.')
003800120925     A            FLAG1          1A         TEXT('Flag a disposizione.')
003900120925     A            FLAG2          1A         TEXT('Flag a disposizione.')
004000120925     A            FLAG3          1A         TEXT('Flag a disposizione.')
004100120925     A* Indirizzo anagrafica.
004200120925     A            PAESE          3A         TEXT('Non significativo.')
004300120925     A            INDIRIZZO     40A         TEXT('Non significativo.')
004400120925     A            LOCALITA      30A         TEXT('Non significativo.')
004500120925     A            CAP            5S 0       TEXT('Non significativo.')
004600120925     A            PROV           2A         TEXT('Non significativo.')
004700120925     A            ABI            5A         TEXT('Non significativo.')
004800120925     A            CAB            5A         TEXT('Non significativo.')
004900120925     A            INTERNAZSF    12A         TEXT('Non significativo.')
005000120925     A            NCC           20A         TEXT('Non significativo.')
005100120925     A* Dati appoggio.
005200120925     A            DESCRAPP      50A         TEXT('Non significativo.')
005300120925     A            SPOAPP        30A         TEXT('Non significativo.')
005400120925     A            INDAPP        40A         TEXT('Non significativo.')
005500120925     A            LOCAPP        30A         TEXT('Non significativo.')
005600120925     A            CAPAPP         5S 0       TEXT('Non significativo.')
005700120925     A            PROVAPP        2A         TEXT('Non significativo.')
005800120925     A            ABIAPP         5A         TEXT('Non significativo.')
005900120925     A            CABAPP         5A         TEXT('Non significativo.')
006000120925     A            INTERAPP      12A         TEXT('Non significativo.')
006100120925     A            NCCAPP        50A         TEXT('Non significativo.')
006200120925     A            LIBERO        20A         TEXT('Non significativo.')
