000100950929     A*------------------------------------------------------------------------*
000200051122     A*  DS ESTERNA PER TNTU04R
000300950929     A*------------------------------------------------------------------------*
000400051122     A          R TNTU04                    TEXT('PASSAGGIO PARAMETRI')
000600051122     A            T04NRR        15S 0       TEXT('NRR TNTUT00F')
000700051122     A            T04MOD         2          TEXT('MODALITÀ CHIAMATA')
000701051124     A            T04ATT         3          TEXT('ATTIVITÀ')
000702051124     A            T04PRG         3S 0       TEXT('PROG.ATTIVITÀ')
000800051122     A            T04CMD         1A         TEXT('CMD RITORNO')
