000010060110     A*%%TS  SD  20060110  144548  EDPBA       REL-V5R3M0  5722-WDS
000020011218     A*  91/05/15  10:18:36    EDPDB       REL-R02M00  5728-PW1
000030060110     A*%%EC
000040060110     A                                      DSPSIZ(24 80 *DS3)
000050060110     A                                      PRINT
000060060110     A                                      INDARA
000070060110     A                                      ERRSFL
000080011218     A*  91/05/15  10:18:36    EDPDB       REL-R02M00  5728-PW1
000090011218     A*-------------------------------------------------------*
000100051213     A          R V01
000110051213     A*%%TS  SD  20051213  114145  EDPBA       REL-V5R3M0  5722-WDS
000120051213     A                                      TEXT('RECORD INSERIMENTO O VARIAZ')
000130051213     A                                      CA03
000140051213     A                                      CF04
000150051213     A                                      RTNCSRLOC(&RTNCSRREC &RTNCSRFLD &RT-
000160051213     A                                      NCSRPOS)
000170051213     A            RTNCSRREC     10A  H      TEXT('Nome Record')
000180051213     A            RTNCSRFLD     10A  H      TEXT('Nome Campo')
000190051213     A            RTNCSRPOS      4S 0H      TEXT('Posizione Cursore nel Campo')
000200051213     A                                  1 29'Anagrafico attività '
000210051213     A                                      DSPATR(HI)
000220051213     A                                  1 59USER
000230051213     A                                  1 72DATE
000240051213     A                                      EDTCDE(Y)
000250051213     A                                  2  2SYSNAME
000260051213     A            KNSIF     R        O  2 11REFFLD(FMKPJBA/KNSIF *LIBL/KPJBA)
000270051213     A                                  2 31'PARZIALIZZAZIONI'
000280051213     A                                      DSPATR(HI)
000290051213     A                                  2 59'TNTU01R '
000300051213     A                                  5  2'Attività........:'
000310051213     A                                      COLOR(WHT)
000320051213     A            V01ATT         3A  B  5 20
000330051213     A  01 99                               ERRMSG('Cod.attività errato' 01)
000340051213     A            V01PRG         3Y 0B  5 24CHECK(RZ)
000350051213     A            V01DES        30A  O  5 28
000360051213     A                                  7  2'Chi esegue att..:'
000370051213     A                                      DSPATR(HI)
000380051213     A            V01CHI         2A  B  7 20
000390051213     A  02 99                               ERRMSG('Immettere P.O. che esegue a-
000400051213     A                                      ttività valido' 02)
000410051213     A            V01DCHI       20A  O  7 28
000420051213     A                                  9  2'Reparto.........:'
000430051213     A                                      DSPATR(HI)
000440051213     A            V01REP         5A  B  9 20
000450051213     A  03 99                               ERRMSG('Cod.Reparto errato' 03)
000460051213     A            V01DREP       20A  O  9 28
000470051213     A                                 11  2'Moltiplicatore..:'
000480051213     A                                      DSPATR(HI)
000490051213     A            V01MULT        3A  B 11 20
000500051213     A  07 99                               ERRMSG('Immettere moltiplicatrevali-
000510051213     A                                      do' 07)
000520051213     A            V01DMULT      30A  O 11 28
000530051213     A                                 13  2'Decorrenza......:'
000540051213     A                                      COLOR(WHT)
000550051213     A                                 13 20'dal'
000560051213     A                                      DSPATR(HI)
000570051213     A            V01DTI         6Y 0B 13 24EDTWRD('  /  /  ')
000580051213     A  04 99                               ERRMSG('Data inizio decorrenza erra-
000590051213     A                                      ta' 04)
000600051213     A                                 13 34'al'
000610051213     A                                      DSPATR(HI)
000620051213     A            V01DTF         6Y 0B 13 37EDTWRD('  /  /  ')
000630051213     A  05 99                               ERRMSG('Data fine decorrenza errata-
000640051213     A                                      ' 05)
000650051213     A                                 15  2'Valide al.......:'
000660051213     A                                      COLOR(WHT)
000670051213     A            V01DTV         6Y 0B 15 20EDTWRD('  /  /  ')
000680051213     A  06 99                               ERRMSG('Data validità errata' 06)
000690051213     A                                 17  2'Annullati.......:'
000700051213     A                                      COLOR(WHT)
000710051213     A            V01ATB         1A  B 17 20VALUES('S' 'N')
000720051213     A                                 17 24'(S/N)'
000730051213     A                                 23  2'F3=Fine'
000740051213     A                                      COLOR(BLU)
000750051213     A                                 23 11'F4=Richiesta'
000760051213     A                                      COLOR(BLU)
000770060110     A          R S01                       SFL
000780060110     A*%%TS  SD  20060110  144548  EDPBA       REL-V5R3M0  5722-WDS
000790060110     A            HNRR          15S 0H
000800060110     A            S01OPZ         2A  B  7  2DSPATR(UL)
000810060110     A                                      VALUES('  ' '2 ' '3 ' '4 ' '5 ' 'T -
000820060110     A                                      ')
000830060110     A            S01ATB         1A  O  7  5
000840060110     A            S01ATT         3A  O  7  8
000850060110     A            S01PRG         3Y 0O  7 12
000860060110     A            S01DES        30A  O  7 18
000870060110     A            S01CHI         2A  O  7 49
000880060110     A            S01REP         5A  O  7 52
000890060110     A            S01MULT        3A  O  7 58
000900060110     A            S01DTI         6Y 0O  7 63EDTWRD('  /  /  ')
000910060110     A            S01DTF         6Y 0O  7 72EDTWRD('  /  /  ')
000920060110     A          R C01                       SFLCTL(S01)
000930060110     A*%%TS  SD  20060110  144548  EDPBA       REL-V5R3M0  5722-WDS
000940060110     A                                      SFLSIZ(0017)
000950060110     A                                      SFLPAG(0015)
000960060110     A                                      CA03
000970060110     A N40                                  CF10
000980060110     A                                      CA12
000990060110     A                                      OVERLAY
001000060110     A                                      SFLCSRRRN(&C01CSRRRN)
001010060110     A  91                                  SFLDSP
001020060110     A N90                                  SFLDSPCTL
001030060110     A  90                                  SFLCLR
001040060110     A N90                                  SFLEND
001050060110     A            RCDNBR         4S 0H      SFLRCDNBR(*TOP)
001060060110     A            C01CSRRRN      5S 0H
001070060110     A                                  1 31'Anagrafico Attività '
001080060110     A                                      COLOR(WHT)
001090060110     A                                  1 59USER
001100060110     A                                  1 72DATE
001110060110     A                                      EDTCDE(Y)
001120060110     A                                  2  2SYSNAME
001130060110     A            KNSIF     R        O  2 11REFFLD(FMKPJBA/KNSIF *LIBL/KPJBA)
001140060110     A                                  2 59'TNTU01R '
001150060110     A                                  4 29'Inizio elenco'
001160060110     A                                      DSPATR(HI)
001170060110     A                                      DSPATR(ND)
001180060110     A            DESTPS        11A  O  4 43DSPATR(HI)
001190060110     A                                      DSPATR(ND)
001200060110     A            VDES          25A  B  4 55DSPATR(ND)
001210060110     A                                      DSPATR(PR)
001220060110     A                                  5  2'2=Modifica  3=Copia  4=Annullo/Rip-
001230060110     A                                      ristino'
001240060110     A                                      COLOR(BLU)
001250060110     A  40                                  DSPATR(ND)
001260060110     A                                  6  2'Op A  Attività  Descrizione       -
001270060110     A                                                  Chi Rep.  Mol. Dt.iniz.-
001280060110     A                                       Dt. fine'
001290060110     A                                      COLOR(WHT)
001300060110     A                                      DSPATR(UL)
001310060110     A                                  5 46'5=Visualizza   T=Tempi'
001320060110     A                                      COLOR(BLU)
001330060110     A          R R03
001340060110     A*%%TS  SD  20060110  144548  EDPBA       REL-V5R3M0  5722-WDS
001350060110     A                                      OVERLAY
001360060110     A                                 23  1'F3=Fine'
001370060110     A                                      COLOR(BLU)
001380060110     A                                 23 58'F12=Ritorno'
001390060110     A                                      COLOR(BLU)
001400060110     A                                 23 25'F10=Immissione'
001410060110     A                                      COLOR(BLU)
001420060110     A  40                                  DSPATR(ND)
