000100950929     A*------------------------------------------------------------------------*
000200051214     A*  DS ESTERNA PER CALCOLO MOLTIPLICATORE
000300950929     A*------------------------------------------------------------------------*
000400051128     A          R TNTU05                    TEXT('PASSAGGIO PARAMETRI')
000600051214     A            T05DTI          L         TEXT('DATA INIZIO ATTIVITÀ')
000601051214     A            T05DTF          L         TEXT('DATA FINE ATTIVITÀ')
000700051214     A            T05MULT        3          TEXT('MOLTIPLICATORE OPZIONALE')
