000100050809      *PARMS MBR(*NONE)
000200070704      *---------------------------------------------------------------*
000300070704      *?DS per ricerca nominativi in bolle sede per G.d.F.           ?*
000400070704      *---------------------------------------------------------------*
000500050809     A                                      REF(CNDIZION)
000600070704     A          R TNSB19S                   TEXT('PARAMETRI PER RICERC-
000700070704     A                                      A NOMINATIVI IN BOLLE SEDE-
000800070704     A                                      PER G.D.F.')
000900070704      *
001000070704     A            SB19CWF   R               REFFLD($FLA)
001100070704     A                                      TEXT('Pulizia anticipata d-
001200070704     A                                      el Work-File (S/N)')
001300070704      *
001400070704     A            SB19DAL   R     S         REFFLD($DA8)
001500070704     A                                      TEXT('Data limite iniziale-
001600070704     A                                      ')
001700070704     A            SB19AL    R     S         REFFLD($DA8)
001800070704     A                                      TEXT('Data limite finale')
001900070704     A            SB19RIC   R               REFFLD($FLA)
002000070704     A                                      TEXT('Tipo ricerca: M-Mitt-
002100070704     A                                       D-Dest E-Entrambi K-Ksc')
002200050809      *
002300070629     A            SB19RS1   R   30          REFFLD($RSC)
002400070704     A                                      TEXT('RAGIONE SOCIALE O CO-
002500070704     A                                      DICE CLIENTE')
002600070629     A            SB19RS2   R   30          REFFLD($RSC)
002700070704     A                                      TEXT('RAGIONE SOCIALE O CO-
002800070704     A                                      DICE CLIENTE')
002900070629     A            SB19RS3   R   30          REFFLD($RSC)
003000070704     A                                      TEXT('RAGIONE SOCIALE O CO-
003100070704     A                                      DICE CLIENTE')
003200070629     A            SB19RS4   R   30          REFFLD($RSC)
003300070704     A                                      TEXT('RAGIONE SOCIALE O CO-
003400070704     A                                      DICE CLIENTE')
003500070629     A            SB19RS5   R   30          REFFLD($RSC)
003600070704     A                                      TEXT('RAGIONE SOCIALE O CO-
003700070704     A                                      DICE CLIENTE')
003800070629     A            SB19IN1   R   30          REFFLD($IND)
003900070629     A            SB19IN2   R   30          REFFLD($IND)
004000070629     A            SB19IN3   R   30          REFFLD($IND)
004100070629     A            SB19IN4   R   30          REFFLD($IND)
004200070629     A            SB19IN5   R   30          REFFLD($IND)
004300070629     A            SB19LO1   R   30          REFFLD($LOC)
004400070629     A            SB19LO2   R   30          REFFLD($LOC)
004500070629     A            SB19LO3   R   30          REFFLD($LOC)
004600070629     A            SB19LO4   R   30          REFFLD($LOC)
004700070629     A            SB19LO5   R   30          REFFLD($LOC)
004800050809     A            SB19PR1   R               REFFLD($PRO)
004900050809     A            SB19PR2   R               REFFLD($PRO)
005000050809     A            SB19PR3   R               REFFLD($PRO)
005100050809     A            SB19PR4   R               REFFLD($PRO)
005200070629     A            SB19PR5   R               REFFLD($PRO)
