000010160621     A*%%TS  SD  20160621  105233  EDPMB       REL-V7R1M0  5770-WDS
000020151016     A*/*PRM waitrcd(50)
000030151016     A*/*PRM rstdsp(*yes) dfrwrt(*yes) decfmt(*job)
000040151016     A*/*END
000050040119     A*------------------------------------*
000060160621     A*%%EC
000070160621     A                                      DSPSIZ(24 80 *DS3)
000080160621     A                                      PRINT
000090160621     A  02                                  CF02(27)
000100160621     A                                      CA03(27)
000110160621     A  04                                  CF04(27)
000120160621     A  05                                  CF05(27)
000130160621     A  06 19                               CF06(27)
000140160621     A                                      CF07(27)
000150160621     A  08                                  CF08(27)
000160160621     A  09                                  CF09(27)
000170160621     A  10                                  CF10(27)
000180160621     A  11                                  CF11(27)
000190160621     A                                      CA12(27)
000200160621     A  13                                  CF13(27)
000210160621     A  14                                  CF14(27)
000220160621     A  15                                  CF15(27)
000230160621     A  16                                  CF16(27)
000240160621     A  17                                  CF17(27)
000250160621     A  18                                  CF18(27)
000260160621     A  19                                  CF19(27)
000270160621     A                                      CF20(27)
000280160621     A  21                                  CF21(27)
000290160621     A  22                                  CA22(27)
000300160621     A  23                                  CF23(27)
000310160621     A  24                                  CF24(27)
000320160621     A  01                                  CF01(27)
000330040119     A*------------------------------------*
000340120711     A          R SB51Z00
000350120711     A*%%TS  SD  20120711  091222  EDPRM       REL-V6R1M0  5761-WDS
000360120711     A                                      OVERLAY
000370120711     A            VTF01         11A  O 23  2
000380120711     A            VTF02         11A  O 23 14
000390120711     A            VTF03         11A  O 23 26
000400120711     A            VTF04         11A  O 23 38
000410120711     A            VTF05         11A  O 23 50
000420120711     A                                 24  2'F3=Fine'
000430120711     A                                 24 10'F7=AltriDati'
000440120711     A  16                             24 23'F16=C/E'
000450120711     A  17                             24 31'F17=RigBolla'
000460120711     A  13                             24 44'F13=Tassaz.'
000470120711     A                                 24 56'F20=Affidab.'
000480120711     A                                 24 69'F12=Ritorno'
000490120711     A            VTF06         16A  O 23 64
000500040119      *------------------------------------*
000510030408     A          R SB51T01
000520030408     A            RSUT          20A  O  1  2
000530030408     A                                  1 26'* VISUALIZZAZIONE BOLLA SEDE *'
000540030408     A                                      DSPATR(RI)
000550030408     A                                      DSPATR(UL)
000560030408     A            VTCPGM        10A  O  1 60
000570030408     A                                  1 72DATE
000580030408     A                                      EDTCDE(Y)
000590030408     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000600030408     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000610030408     A  57                              2 35'BOLLA LEGATA'
000620030408     A                                      DSPATR(UL)
000630030408     A                                  2 72TIME
000640040119     A*------------------------------------*
000650160412     A          R SB51D01
000660160412     A*%%TS  SD  20160412  112056  EDPRM       REL-V7R1M0  5770-WDS
000670160412     A                                      INVITE
000680160412     A                                      OVERLAY
000690160412     A  28        V1CMSG        78   M
000700160412     A                                  3  2'SPEDIZIONE:'
000710160412     A                                      DSPATR(UL)
000720160412     A            V0CLNP         3S 0O  3 15DSPATR(HI)
000730160412     A                                      DSPATR(UL)
000740160412     A                                      TEXT('FILIALE PARTENZA')
000750160412     A            V0CNRS         2Y 0O  3 20DSPATR(UL)
000760160412     A                                      DSPATR(HI)
000770160412     A                                      EDTCDE(Z)
000780160412     A                                      TEXT('NUMERO SERIE')
000790160412     A                                  3 23'-'
000800160412     A            V0CNSP         7Y 0O  3 25DSPATR(HI)
000810160412     A                                      EDTCDE(2)
000820160412     A                                      DSPATR(UL)
000830160412     A                                      TEXT('NUMERO SPEDIZIONE')
000840160412     A                                  3 37'del'
000850160412     A            V0CDSP         8Y 0O  3 43TEXT('DATA SPEDIZIONE')
000860160412     A                                      DSPATR(HI)
000870160412     A                                      EDTWRD('  /  /    ')
000880160412     A                                      DSPATR(UL)
000890160412     A            V0DTSP        10A  O  3 56TEXT('TIPO SERVIZIO BOLLA')
000900160412     A                                      DSPATR(HI)
000910160412     A            V0DSTS        12A  O  3 69TEXT('Da Fatturare/Fatturata/Contab-
000920160412     A                                      ilizzata')
000930160412     A                                      DSPATR(RI)
000940160412     A                                  4  2'Linea Arrivo'
000950160412     A            V0CLNA         3S 0O  4 15DSPATR(HI)
000960160412     A                                      TEXT('FILIALE ARRIVO')
000970160412     A            V0DLNA        15A  O  4 19DSPATR(HI)
000980160412     A                                      TEXT('DESCRIZIONE FILIALE')
000990160412     A                                  4 37'Tipo Bolla'
001000160412     A            V0CTBL         2A  O  4 51DSPATR(HI)
001010160412     A                                      TEXT('CODICE BOLLA')
001020160412     A            V0DTBL        20A  O  4 54DSPATR(HI)
001030160412     A                                      TEXT('DESCRIZIONE')
001040160412     A                                  5  2'-----------------------------------
001050160412     A                                      ------------------------------------
001060160412     A                                      ----------'
001070160412     A                                  6  2'Prima Cons.Parziale'
001080160412     A            V0CDCP        10A  O  6 23DSPATR(HI)
001090160412     A                                  6 36'Consegna Anomala'
001100160412     A            V0CCCA         1A  O  6 55DSPATR(HI)
001110160412     A                                      TEXT('CODICE CONSEGNA ANOMALA')
001120160412     A            V0DCCA        20A  O  6 58DSPATR(HI)
001130160412     A  19                              7  2'F19=Immagine'
001140160412     A                                  7 15'CONSEGNA REALE'
001150160412     A                                      DSPATR(HI)
001160160412     A                                      DSPATR(UL)
001170160412     A            V0CDCM        10A  O  7 30DSPATR(HI)
001180160412     A  40        V0CHMC         4Y 0O  7 41EDTWRD('  :  ')
001190160412     A                                      DSPATR(HI)
001200160412     A                                      TEXT('ORA CONSEGNA MERCE (REALE)')
001210160412     A                                  7 47'Distinta n°'
001220160412     A            V0CNDC         7Y 0O  7 59DSPATR(HI)
001230160412     A                                      EDTCDE(Z)
001240160412     A                                  7 67'del'
001250160412     A            V0CDDC        10A  O  7 71DSPATR(HI)
001260160412     A                                  8  2'-----------------------------------
001270160412     A                                      ------------------------------------
001280160412     A                                      ----------'
001290160412     A                                  9  2'FATTURA:'
001300160412     A                                      DSPATR(HI)
001310160412     A                                      DSPATR(UL)
001320160412     A N41N35                           9 11'Importo'
001330160412     A  41N35                           9 11'Imponibile'
001340160412     A N35        V1CIMP        13A  O  9 22DSPATR(HI)
001350160412     A N35        V1CDIV         3A  O  9 36DSPATR(HI)
001360160412     A                                  9 41'Lib.IVA'
001370160412     A            V0CFIV         3Y 0O  9 49DSPATR(HI)
001380160412     A                                      EDTCDE(2)
001390160412     A                                  9 54'Nr.'
001400160412     A            V0CNFT         6Y 0O  9 58DSPATR(HI)
001410160412     A                                      EDTCDE(Z)
001420160412     A                                  9 66'Data'
001430160412     A            V0CDFT        10A  O  9 71DSPATR(HI)
001440160412     A                                 10  2'-----------------------------------
001450160412     A                                      ------------------------------------
001460160412     A                                      ----------'
001470160412     A                                 11  2'Mittente'
001480160412     A            V1CRSM        28A  O 11 12DSPATR(HI)
001490160412     A                                      DSPATR(UL)
001500160412     A                                      TEXT('RAG.SOCIALE MITTENTE 1')
001510160412     A                                 11 43'Destinat.'
001520160412     A            V1CRSD        28A  O 11 53DSPATR(HI)
001530160412     A                                      DSPATR(UL)
001540160412     A                                      TEXT('RAGIONE SOCIALE DESTINATARIO')
001550160412     A            V0CCCM         7Y 0O 12  3DSPATR(HI)
001560160412     A                                      EDTCDE(Z)
001570160412     A                                      TEXT('COD.CLIENTE SPEDIZIONE')
001580160412     A            V1CINM        28A  O 12 12DSPATR(HI)
001590160412     A                                      DSPATR(UL)
001600160412     A                                      TEXT('INDIRIZZO MITTENTE')
001610160412     A            V0CCCD         7Y 0O 12 44DSPATR(HI)
001620160412     A                                      EDTCDE(Z)
001630160412     A                                      TEXT('COD.CLIENTE SPEDIZIONE')
001640160412     A            V1CIND        28A  O 12 53DSPATR(HI)
001650160412     A                                      DSPATR(UL)
001660160412     A                                      TEXT('INDIRIZZO DESTINATARIO')
001670160412     A            V0CCAM         9A  O 13  2DSPATR(HI)
001680160412     A                                      DSPATR(UL)
001690160412     A                                      TEXT('CAP MITTENTE')
001700160412     A            V1CLOM        24A  O 13 12DSPATR(HI)
001710160412     A                                      DSPATR(UL)
001720160412     A                                      TEXT('LOCALITA'' MITTENTE')
001730160412     A            V1CPNM         3A  O 13 37DSPATR(HI)
001740160412     A                                      DSPATR(UL)
001750160412     A                                      TEXT('PROVINCIA MITTENTE')
001760160412     A            V0CCAD         9A  O 13 43DSPATR(HI)
001770160412     A                                      DSPATR(UL)
001780160412     A                                      TEXT('CAP DESTINATARIO')
001790160412     A            V1CLOD        24A  O 13 53DSPATR(HI)
001800160412     A                                      DSPATR(UL)
001810160412     A                                      TEXT('LOCALITA'' DESTINATARIO')
001820160412     A            V1CPND         3A  O 13 78DSPATR(HI)
001830160412     A                                      DSPATR(UL)
001840160412     A                                      TEXT('PROVINCIA DESTINATARIO')
001850160412     A  52                             14 51'DPD: Depot Arrivo'
001860160412     A  52        V1CRTN         4A  O 14 69DSPATR(HI)
001870160412     A                                      DSPATR(UL)
001880160412     A  52                             14 74'Zona'
001890160412     A  52        V1CZON         2A  O 14 79DSPATR(HI)
001900160412     A                                      DSPATR(UL)
001910160412     A                                 15  2'Riferimenti'
001920160412     A            V0CRMN        15Y 0O 15 14EDTCDE(Z)
001930160412     A                                      DSPATR(UL)
001940160412     A                                      DSPATR(HI)
001950160412     A                                      TEXT('RIFERIMENTO MITTENTE NUM.')
001960160412     A            V1CRMA        15A  O 15 31DSPATR(HI)
001970160412     A                                      DSPATR(UL)
001980160412     A                                      TEXT('RIFERIM.MITTENTE ALFANUMER')
001990160412     A                                 15 51'Rifer. Partner'
002000160412     A            V1CRPT        15A  O 15 66DSPATR(HI)
002010160412     A                                      DSPATR(UL)
002020160412     A                                      TEXT('RIFERIM.MITTENTE ALFANUMER')
002030160412     A                                 16  2'Natura Merce'
002040160412     A                                 16 20'-LNP Serie Numero SEGNACOLLI-'
002050160412     A                                 16 51'R'
002060160412     A                                 16 55'Zona'
002070160412     A                                 16 62'-- Contrassegno --'
002080160412     A            V1CNAS        15A  O 17  2DSPATR(HI)
002090160412     A                                      DSPATR(UL)
002100160412     A            V1CFLS         3Y 0O 17 21TEXT('P.O. SEGNACOLLO')
002110160412     A                                      DSPATR(HI)
002120160412     A                                      DSPATR(UL)
002130160412     A                                      EDTCDE(Z)
002140160412     A            V1CNRSS        2Y 0O 17 27DSPATR(HI)
002150160412     A                                      DSPATR(UL)
002160160412     A                                      EDTCDE(Z)
002170160412     A                                      TEXT('NUMERO SERIE')
002180160412     A            V1CNCD         7Y 0O 17 31EDTCDE(Z)
002190160412     A                                      DSPATR(UL)
002200160412     A                                      DSPATR(HI)
002210160412     A                                      TEXT('NUM.SEGNACOLLO -DAL-')
002220160412     A                                 17 39'/'
002230160412     A            V1CNCA         7Y 0O 17 41EDTCDE(Z)
002240160412     A                                      DSPATR(UL)
002250160412     A                                      DSPATR(HI)
002260160412     A                                      TEXT('NUM.SEGNACOLLO -AL-')
002270160412     A            V1CXCO         1A  O 17 51DSPATR(UL)
002280160412     A                                      DSPATR(HI)
002290160412     A            V1CZNC         2Y 0O 17 55EDTCDE(Z)
002300160412     A                                      DSPATR(HI)
002310160412     A                                      TEXT('ZONA CONSEGNA')
002320160412     A                                      DSPATR(UL)
002330160412     A            V1CBVA         1A  O 17 58TEXT('FLAG "COLLI DI VALORE"')
002340160419     A            V1CCAS        13Y 3O 17 62EDTCDE(4)
002350160419     A N39                                  DSPATR(HI)
002360160412     A                                      TEXT('CONTRASSEGNO')
002370160419     A N39                                  DSPATR(UL)
002380160419     A            V1CVCA         3A  O 17 77
002390160419     A N39                                  DSPATR(HI)
002400160412     A                                      TEXT('DIVISA IMPORTO C/ASSEGNO')
002410160419     A N39                                  DSPATR(UL)
002420160419     A  39                             18 67'ANNULLATO'
002430160419     A                                      DSPATR(HI)
002440160412     A            V1DFNS        15A  O 18 31DSPATR(BL)
002450160412     A                                 19  2'COLLI'
002460160412     A            V0CNCL         5Y 0O 19  8DSPATR(HI)
002470160412     A                                      EDTCDE(Z)
002480160412     A                                      DSPATR(UL)
002490160412     A                                      TEXT('NUMERO COLLI')
002500160412     A                                 19 15'BANCALI'
002510160412     A            V0CNBA         2Y 0O 19 23DSPATR(HI)
002520160412     A                                      DSPATR(UL)
002530160412     A                                      EDTCDE(Z)
002540160412     A            V0DTBA        10A  O 19 26DSPATR(HI)
002550160412     A                                      DSPATR(UL)
002560160412     A                                 19 37'/'
002570160412     A            V0CNB2         2Y 0O 19 39DSPATR(HI)
002580160412     A                                      DSPATR(UL)
002590160412     A                                      EDTCDE(Z)
002600160412     A            V0DTB2        10A  O 19 42DSPATR(HI)
002610160412     A                                      DSPATR(UL)
002620160412     A                                 20  2'-------------- P   E   S   O ------
002630160412     A                                      ----------'
002640160412     A  70                             20 47'?'
002650160412     A                                 20 50'---- V   O   L   U   M   E ----'
002660160412     A                                 21  2'Bollettato  Da VDL  Colli Boll/Var-
002670160412     A                                       Fatturato'
002680160412     A  70        V1PESTAS       1A  B 21 47DSPATR(HI)
002690160412     A                                      VALUES(' ' '?')
002700160412     A                                 21 50'Bollett.'
002710160412     A                                 21 59'Da VDL'
002720160412     A                                 21 66'Colli'
002730160412     A                                 21 72'Fatturare'
002740160412     A            V1CFPB         1A  O 22  2DSPATR(HI)
002750160412     A                                      DSPATR(UL)
002760160412     A            V1CPKB         7Y 1O 22  4DSPATR(HI)
002770160412     A                                      EDTCDE(4)
002780160412     A                                      DSPATR(UL)
002790160412     A                                      TEXT('PESO KG DA FATTURARE')
002800160412     A            V1CPKC         7Y 1O 22 13DSPATR(HI)
002810160412     A                                      EDTCDE(4)
002820160412     A                                      DSPATR(UL)
002830160412     A                                      TEXT('PESO KG DA FATTURARE')
002840160412     A            V1CNCP         5Y 0O 22 22DSPATR(HI)
002850160412     A                                      DSPATR(UL)
002860160412     A                                      EDTCDE(Z)
002870160412     A                                      TEXT('COLLI RILEVATI PER VOLUME CML-
002880160412     A                                      ')
002890160412     A            V0CPKF         7Y 1O 22 28DSPATR(HI)
002900160412     A                                      EDTCDE(4)
002910160412     A                                      DSPATR(UL)
002920160412     A                                      TEXT('PESO KG DA FATTURARE')
002930160412     A            V0CFPF         1A  O 22 37DSPATR(HI)
002940160412     A                                      DSPATR(UL)
002950160412     A            V0CPESO        7Y 1O 22 39DSPATR(HI)
002960160412     A                                      EDTCDE(4)
002970160412     A                                      DSPATR(UL)
002980160412     A                                      TEXT('PESO KG DA FATTURARE')
002990160412     A            V1CFVB         1A  O 22 50DSPATR(HI)
003000160412     A                                      DSPATR(UL)
003010160412     A                                      TEXT('FLAG VOLUME BOLLETTATO')
003020160412     A            V1CVLB         5Y 3O 22 52DSPATR(HI)
003030160412     A                                      DSPATR(UL)
003040160412     A                                      EDTCDE(2)
003050160412     A                                      TEXT('VOLUME BOLLETTATO')
003060160412     A            V1CVLC         5Y 3O 22 59DSPATR(HI)
003070160412     A                                      DSPATR(UL)
003080160412     A                                      EDTCDE(4)
003090160412     A                                      TEXT('VOLUME CML')
003100160412     A            V1CNCR         5Y 0O 22 66DSPATR(HI)
003110160412     A                                      DSPATR(UL)
003120160412     A                                      EDTCDE(Z)
003130160412     A                                      TEXT('COLLI RILEVATI PER VOLUME CML-
003140160412     A                                      ')
003150160412     A            V0CFVF         1A  O 22 73DSPATR(HI)
003160160412     A                                      DSPATR(UL)
003170160412     A                                      TEXT('FLAG VOLUME DA FATTURARE')
003180160412     A            V0CVLF         5Y 3O 22 75DSPATR(HI)
003190160412     A                                      DSPATR(UL)
003200160412     A                                      EDTCDE(4)
003210160412     A                                      TEXT('VOLUME DA FATTURARE')
003220160412     A  71        V1DLEG        23A  O 19 55DSPATR(RI)
003230160412     A  71        V1CLEG         1A  B 19 79DSPATR(HI)
003240040119     A*------------------------------------*
003250130927     A          R SB51D07
003260130927     A*%%TS  SD  20130927  104215  EDPRM       REL-V7R1M0  5770-WDS
003270130927     A                                      INVITE
003280130927     A                                      OVERLAY
003290130927     A                                  3  2'SPEDIZIONE:'
003300130927     A                                      DSPATR(UL)
003310130927     A            V0CLNP         3S 0O  3 15DSPATR(HI)
003320130927     A                                      DSPATR(UL)
003330130927     A                                      TEXT('FILIALE PARTENZA')
003340130927     A            V0CNRS         2Y 0O  3 20DSPATR(UL)
003350130927     A                                      DSPATR(HI)
003360130927     A                                      EDTCDE(Z)
003370130927     A                                      TEXT('NUMERO SERIE')
003380130927     A                                  3 23'-'
003390130927     A            V0CNSP         7Y 0O  3 25DSPATR(HI)
003400130927     A                                      EDTCDE(2)
003410130927     A                                      DSPATR(UL)
003420130927     A                                      TEXT('NUMERO SPEDIZIONE')
003430130927     A                                  3 37'Del'
003440130927     A            V0CDSP         8Y 0O  3 43TEXT('DATA SPEDIZIONE')
003450130927     A                                      DSPATR(HI)
003460130927     A                                      EDTWRD('  /  /    ')
003470130927     A                                      DSPATR(UL)
003480130927     A            V0DTSP        10A  O  3 56TEXT('TIPO SERVIZIO BOLLA')
003490130927     A                                      DSPATR(HI)
003500130927     A            V0DSTS        12A  O  3 69DSPATR(RI)
003510130927     A                                  4  2'Linea Arrivo'
003520130927     A            V0CLNA         3S 0O  4 15TEXT('FILIALE ARRIVO')
003530130927     A                                      DSPATR(HI)
003540130927     A            V0DLNA        15A  O  4 19DSPATR(HI)
003550130927     A                                      TEXT('DESCRIZIONE FILIALE')
003560130927     A                                  4 37'Tipo Bolla'
003570130927     A            V0CTBL         2A  O  4 51DSPATR(HI)
003580130927     A                                      TEXT('CODICE BOLLA')
003590130927     A            V0DTBL        20A  O  4 54DSPATR(HI)
003600130927     A                                      TEXT('DESCRIZIONE')
003610130927     A                                  5  2'Linea Part.'
003620130927     A            V7CLNP         3S 0O  5 15TEXT('FILIALE ARRIVO')
003630130927     A                                      DSPATR(HI)
003640130927     A            V7DLNP        15A  O  5 19DSPATR(HI)
003650130927     A                                      TEXT('DESCRIZIONE FILIALE')
003660130927     A                                  5 37'Codice Bolla'
003670130927     A            V7CCBO         2A  O  5 51DSPATR(HI)
003680130927     A                                      TEXT('CODICE BOLLA')
003690130927     A            V7DCBO        25A  O  5 54DSPATR(HI)
003700130927     A                                      TEXT('DESCRIZIONE')
003710130927     A                                  6  2'Terminal Par'
003720130927     A            V7CTFP         3Y 0O  6 15DSPATR(HI)
003730130927     A                                      TEXT('FILIALE ARRIVO')
003740130927     A            V7DTFP        15A  O  6 19DSPATR(HI)
003750130927     A                                      TEXT('DESCRIZIONE FILIALE')
003760130927     A                                  6 37'Terminal Arr'
003770130927     A            V7CTFA         3Y 0O  6 50DSPATR(HI)
003780130927     A                                      TEXT('FILIALE ARRIVO')
003790130927     A            V7DTFA        15A  O  6 54DSPATR(HI)
003800130927     A                                      TEXT('DESCRIZIONE FILIALE')
003810130927     A  09                              7  2'F9=Transiti'
003820130927     A                                      DSPATR(RI)
003830130927     A                                  8  2'Mittente'
003840130927     A            V7CRSM        48A  O  8 12DSPATR(HI)
003850130927     A                                      DSPATR(UL)
003860130927     A                                      TEXT('RAG.SOCIALE MITTENTE 1')
003870130927     A                                  8 65'P.IVA/Cd.Fiscale'
003880130927     A            V0CCCM         7Y 0O  9  2DSPATR(HI)
003890130927     A                                      EDTCDE(Z)
003900130927     A                                      TEXT('COD.CLIENTE SPEDIZIONE')
003910130927     A            V7CINM        35A  O  9 12DSPATR(HI)
003920130927     A                                      DSPATR(UL)
003930130927     A                                      TEXT('INDIRIZZO MITTENTE')
003940130927     A                                  9 51'Anteporto'
003950130927     A            V0CFAP         1A  O  9 61DSPATR(HI)
003960130927     A                                      TEXT('FL.ANTEPORTO: P-PROV BLANK-CI-
003970130927     A                                      TTA'' I=ISOLA')
003980130927     A            V7CPIM        16A  O  9 65DSPATR(HI)
003990130927     A                                      DSPATR(UL)
004000130927     A                                      TEXT('PART.IVA: MITTENTE SE FRANCO -
004010130927     A                                      DESTINAT. SE ASS.TO')
004020130927     A            V0CCAM         9A  O 10 12DSPATR(HI)
004030130927     A                                      DSPATR(UL)
004040130927     A                                      TEXT('CAP MITTENTE')
004050130927     A            V7CLOM        35A  O 10 22DSPATR(HI)
004060130927     A                                      DSPATR(UL)
004070130927     A                                      TEXT('LOCALITA'' MITTENTE')
004080130927     A            V7CPRM         2A  O 10 58DSPATR(HI)
004090130927     A                                      DSPATR(UL)
004100130927     A                                      TEXT('PROVINCIA MITTENTE')
004110130927     A            V7CNZM         3A  O 10 61DSPATR(HI)
004120130927     A                                      DSPATR(UL)
004130130927     A                                      TEXT('NAZIONE MITTENTE')
004140130927     A            V7CDFM        16A  O 10 65DSPATR(UL)
004150130927     A                                      DSPATR(HI)
004160130927     A  51                             11  2'Mittente originale'
004170130927     A  51        V7CRMO        35A  O 11 22DSPATR(HI)
004180130927     A                                      TEXT('INDIRIZZO DESTINATARIO')
004190130927     A                                 12  2'Destinat.'
004200130927     A            V7CRSD        48A  O 12 12DSPATR(HI)
004210130927     A                                      DSPATR(UL)
004220130927     A                                 12 65'P.IVA/Cd.Fiscale'
004230130927     A            V0CCCD         7Y 0O 13  2DSPATR(HI)
004240130927     A                                      EDTCDE(Z)
004250130927     A            V7CIND        35A  O 13 12DSPATR(HI)
004260130927     A                                      DSPATR(UL)
004270130927     A                                      TEXT('INDIRIZZO DESTINATARIO')
004280130927     A                                 13 53'Inoltro'
004290130927     A            V0CFIN         1A  O 13 61DSPATR(HI)
004300130927     A                                      TEXT('FL.INOLTRO  : P-PROV BLANK-CI-
004310130927     A                                      TTA'' I=ISOLA')
004320130927     A            V7CPID        16A  O 13 65DSPATR(HI)
004330130927     A                                      DSPATR(UL)
004340130927     A                                      TEXT('PART.IVA: MITTENTE SE FRANCO -
004350130927     A                                      DESTINAT. SE ASS.TO')
004360130927     A            V0CCAD         9A  O 14 12DSPATR(HI)
004370130927     A                                      DSPATR(UL)
004380130927     A                                      TEXT('CAP DESTINATARIO')
004390130927     A            V7CLOD        35A  O 14 22DSPATR(HI)
004400130927     A                                      DSPATR(UL)
004410130927     A                                      TEXT('LOCALITA'' DESTINATARIO')
004420130927     A            V7CPRD         2A  O 14 58DSPATR(HI)
004430130927     A                                      DSPATR(UL)
004440130927     A                                      TEXT('PROVINCIA DESTINATARIO')
004450130927     A            V0CNZD         3A  O 14 61DSPATR(HI)
004460130927     A                                      DSPATR(UL)
004470130927     A                                      TEXT('NAZIONE DESTINATARIO')
004480130927     A            V7CDFD        16A  O 14 65DSPATR(HI)
004490130927     A                                      DSPATR(UL)
004500130927     A                                 15  2'Referente consegna'
004510130927     A            V7CREF        35A  O 15 22DSPATR(UL)
004520130927     A                                      DSPATR(HI)
004530130927     A                                 15 60'Tel.'
004540130927     A            V7CTELD       16A  O 15 65DSPATR(HI)
004550130927     A                                      DSPATR(UL)
004560130927     A                                 16  2'Sigla Operatore'
004570130927     A            V7CSOP         1A  O 16 20DSPATR(HI)
004580130927     A                                      TEXT('SIGLA OPERATORE VIDEO')
004590130927     A  66                             16 25'Immessa da'
004600130927     A  66        V7CPRU        10A  O 16 36DSPATR(HI)
004610130927     A  66        V7CNMTD       10A  O 16 47DSPATR(HI)
004620130927     A                                 16 58'Stampa Lett.Vettura'
004630130927     A            V7DLL1         3A  O 16 78DSPATR(HI)
004640130927     A                                 17  2'Trattamento Merce'
004650130927     A            V7CCTM         2A  O 17 20DSPATR(HI)
004660130927     A                                      TEXT('COD.TRATTAMENTO MERCE')
004670130927     A                                 17 25'Franco Frontiera'
004680130927     A            V7DFFR         2A  O 17 47DSPATR(HI)
004690130927     A                                 17 58'DDT Cliente'
004700130927     A            V7DDDT         2A  O 17 78DSPATR(HI)
004710130927     A                                 18  2'Emessa Nota Accr.'
004720130927     A            V7DFA2         2A  O 18 20DSPATR(HI)
004730130927     A  65                             18 25'Avviso a Destinatario'
004740130927     A  65        V7CEMD         8A  O 18 47DSPATR(HI)
004750130927     A                                 18 58'Bolla Rientro'
004760130927     A            V7DFBR         2A  O 18 78DSPATR(HI)
004770130927     A                                      TEXT('S=BOLLA RIENTRO')
004780130927     A                                 19  2'Note'
004790130927     A N58                                  DSPATR(ND)
004800130927     A            V7DNT1        35A  O 19 10DSPATR(HI)
004810130927     A            V7DNT2        35A  O 19 46DSPATR(HI)
004820130927     A  67                             20  2'Restituz. Documenti al Mitt:(?)'
004830130927     A                                 20 57'---- Particolarita'' ----'
004840130927     A                                 21  2'Importo da Assicurare'
004850130927     A                                 21 57'Giacenza'
004860130927     A                                 21 66'Consegna'
004870130927     A                                 21 75'Varie'
004880130927     A            V7CIAS        13Y 3O 22  2DSPATR(HI)
004890130927     A                                      EDTCDE(2)
004900130927     A                                      TEXT('IMPORTO DA ASSICURARE')
004910130927     A            V7CVAS         3A  O 22 20DSPATR(HI)
004920130927     A                                      TEXT('DIVISA IMPORTO DA ASSICURARE')
004930130927     A  50                             22 24'Inserito in'
004940130927     A  50                             22 36'Fatturazione'
004950130927     A  45                             22 58'?'
004960130927     A  45        V7IGGA         1A  B 22 60VALUES(' ' '?')
004970130927     A            V7CGGA         2A  O 22 62DSPATR(HI)
004980130927     A                                      TEXT('GESTIONE PARTICOLARITA'' GIAC-
004990130927     A                                      ENZA')
005000130927     A  46                             22 67'?'
005010130927     A  46        V7IGMA         1A  B 22 69VALUES(' ' '?')
005020130927     A            V7CGMA         2A  O 22 71DSPATR(HI)
005030130927     A                                      TEXT('GESTIONE PARTICOLARITA'' CONS-
005040130927     A                                      EGNA')
005050130927     A  47                             22 75'?'
005060130927     A  47        V7IGVA         1A  B 22 77VALUES(' ' '?')
005070130927     A            V7CGVA         2A  O 22 79DSPATR(HI)
005080130927     A                                      TEXT('GESTIONE PARTICOLARITA'' VARI-
005090130927     A                                      E')
005100130927     A  67        V7IDOC         1A  B 20 34DSPATR(HI)
005110040603     A*         R SB51S11                   SFL
005120040608     A          R SB51S09                   SFL
005130040608     A*%%TS  SD  20040608  144909  EDPMB       REL-V4R4M0  5769-PW1
005140040608     A            V09FIL         3S 0O  8  2DSPATR(HI)
005150040608     A            V09DFL        20A  O  8  7
005160040608     A            V09DET         8  0O  8 30EDTCDE(Y)
005170040608     A  48                                  DSPATR(ND)
005180040608     A            V09DUT         8  0O  8 45EDTCDE(Y)
005190040608     A  49                                  DSPATR(ND)
005200040603     A*         R SB51C11                   SFLCTL(SB51S11)
005210040603     A          R SB51C09                   SFLCTL(SB51S09)
005220040603     A*%%TS  SD  20040603  125055  EDPMB       REL-V4R4M0  5769-PW1
005230120302     A  26                                  INVITE
005240040603     A                                      OVERLAY
005250040603     A  25                                  SFLDSP
005260040603     A  26                                  SFLDSPCTL
005270040603     A N26                                  SFLCLR
005280040603     A                                      SFLSIZ(0016)
005290040603     A                                      SFLPAG(0015)
005300040603     A                                  7  2'P.O. Transito               Data E-
005310040603     A                                      ntrata   Data Uscita               -
005320040603     A                                                '
005330040603     A                                      DSPATR(UL)
005340040603     A                                      DSPATR(HI)
005350040119      *------------------------------------*
005360030402     A          R SB51T10
005370030402     A            RSUT          20A  O  1  2
005380030402     A                                  1 26'* VISUALIZZAZIONE BOLLA SEDE *'
005390030402     A                                      DSPATR(RI)
005400030402     A                                      DSPATR(UL)
005410030402     A            VTCPGM        10A  O  1 60
005420030402     A                                  1 72DATE
005430030402     A                                      EDTCDE(Y)
005440030402     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
005450030402     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
005460030402     A                                  2 72TIME
005470030402     A            V0DSTS        12A  O  3 68DSPATR(RI)
005480030402     A                                  4  2'SPEDIZIONE:'
005490030402     A                                      DSPATR(UL)
005500030402     A            V0CLNP         3S 0O  4 15DSPATR(HI)
005510030402     A                                      DSPATR(UL)
005520030402     A                                      TEXT('FILIALE PARTENZA')
005530030402     A            V0CNRS         2Y 0O  4 20EDTCDE(Z)
005540030402     A                                      DSPATR(HI)
005550030402     A                                      DSPATR(UL)
005560030402     A                                      TEXT('NUMERO SERIE')
005570030402     A                                  4 23'-'
005580030402     A            V0CNSP         7Y 0O  4 25DSPATR(HI)
005590030402     A                                      EDTCDE(2)
005600030402     A                                      DSPATR(UL)
005610030402     A                                      TEXT('NUMERO SPEDIZIONE')
005620030402     A                                  4 36'del'
005630030402     A            V0CDSP         8Y 0O  4 41EDTWRD('  /  /    ')
005640030402     A                                      DSPATR(HI)
005650030402     A                                      TEXT('DATA SPEDIZIONE (GG/MM/AAAA)')
005660030402     A                                  4 55'Tipo Bolla'
005670030402     A                                  5  2'Linea Arrivo'
005680030402     A            V0CLNA         3Y 0O  5 15DSPATR(HI)
005690030402     A                                      EDTCDE(Z)
005700030402     A                                      TEXT('FILIALE ARRIVO')
005710030402     A            V0DLNA        15A  O  5 19DSPATR(HI)
005720030402     A                                      TEXT('DESCRIZIONE LINEA DI ARRIVO')
005730030402     A                                  5 36'Cli.Fatt.'
005740030402     A            VTCKSC         8Y 0O  5 46DSPATR(HI)
005750030402     A                                      EDTCDE(Z)
005760030402     A            VTDKSC        24A  O  5 55DSPATR(HI)
005770030402     A                                      TEXT('RAGIONE SOCIALE DESTINATARIO')
005780030402     A            V0CTBL         2A  O  4 66DSPATR(HI)
005790030402     A            V0DTB1        11A  O  4 69DSPATR(HI)
005800040119      *------------------------------------*
005810030402     A          R SB51S11                   SFL
005820030402     A            V11AAC         4S 0H
005830030402     A            V11SCE         1A  B  8  2DSPATR(HI)
005840030402     A                                      VALUES('5' ' ')
005850030402     A            V11FIL         3S 0O  8  4DSPATR(HI)
005860030402     A            V11NCA         7Y 0O  8  8DSPATR(HI)
005870030402     A                                      EDTCDE(Z)
005880030402     A            V11DCA        10A  O  8 17
005890030402     A            V11FCA         3S 0O  8 29
005900030402     A            V11DFA        48A  O  8 33
005910040119      *------------------------------------*
005920010221     A          R SB51C11                   SFLCTL(SB51S11)
005930120302     A  26                                  INVITE
005940010221     A                                      OVERLAY
005950010221     A  25                                  SFLDSP
005960010221     A  26                                  SFLDSPCTL
005970010221     A N26                                  SFLCLR
005980010221     A                                      SFLSIZ(0016)
005990010221     A                                      SFLPAG(0015)
006000010221     A                                  7  2'5|Comunicazione Anomalia |  F a s -
006010010221     A                                      e                                  -
006020010221     A                                               |'
006030010221     A                                      DSPATR(UL)
006040010221     A                                      DSPATR(HI)
006050040119     A*------------------------------------*
006060091210     A          R SB51D12
006070091210     A*%%TS  SD  20091210  103018  EDPES       REL-V5R4M0  5722-WDS
006080120302     A                                      INVITE
006090091210     A                                      OVERLAY
006100091210     A                                  7  2'Ritiro merce'
006110091210     A            V12DRT        10A  O  7 26DSPATR(HI)
006120091210     A                                  7 38'Numero'
006130091210     A            V12NRT         1Y 0O  7 45DSPATR(HI)
006140091210     A            V12FPP        10A  O  7 47DSPATR(HI)
006150091210     A                                  7 59'Portata a magazz.'
006160091210     A            V0DFDN         2A  O  7 77DSPATR(HI)
006170091210     A                                  8  2'Numero ORM'
006180091210     A            V12POE         3A  O  8 19DSPATR(HI)
006190091210     A            V12NSR         2Y 0O  8 23DSPATR(HI)
006200091210     A                                      EDTCDE(Z)
006210091210     A            V12NOR         7Y 0O  8 26DSPATR(HI)
006220091210     A                                      EDTCDE(Z)
006230091210     A            V12NRV         2Y 0O  8 34DSPATR(HI)
006240091210     A                                      EDTCDE(Z)
006250091210     A                                  8 38'Nr.Stop'
006260091210     A            V12STR         5Y 0O  8 46DSPATR(HI)
006270091210     A                                      EDTCDE(Z)
006280091210     A                                  8 52'Autotr'
006290091210     A            V12PDR         7Y 0O  8 59DSPATR(HI)
006300091210     A                                      EDTCDE(Z)
006310091210     A            V12RS1        12A  O  8 67DSPATR(HI)
006320091210     A                                  9  2'Immissione bolla'
006330091210     A            V12DIM        10A  O  9 26DSPATR(HI)
006340091210     A                                  9 38'Data Bordero'''
006350091210     A            V12DBR        10A  O  9 59DSPATR(HI)
006360091210     A                                 10  2'Partenza ultimo collo'
006370091210     A            V12DUC        10A  O 10 26DSPATR(HI)
006380091210     A                                 10 38'Arrivo merce TermArr'
006390091210     A            V12DTI        10A  O 10 59DSPATR(HI)
006400091210     A  42        V12HTI         4Y 0O 10 71DSPATR(HI)
006410091210     A                                      EDTWRD('0 :  ')
006420091210     A                                      TEXT('ORA ARRIVO REALE TRAZIONE')
006430091210     A  59                             11  2'Data invio partner'
006440091210     A  59        V12DMF        10A  O 11 26DSPATR(HI)
006450091210     A                                 11 38'Arrivo merce Fil.Arr'
006460091210     A            V12ARRED      10A  O 11 59DSPATR(HI)
006470091211     A  60        V12ARREH       4Y 0O 11 71DSPATR(HI)
006480091210     A                                      EDTWRD('0 :  ')
006490091210     A                                      TEXT('ORA ARRIVO REALE TRAZIONE')
006500091210     A                                 12  2'Consegna Richiesta'
006510091210     A            V12TCR        11A  O 12 26DSPATR(HI)
006520091210     A            V12DCR        10A  O 12 38DSPATR(HI)
006530091210     A  43        V12HCR         4Y 0O 12 50DSPATR(HI)
006540091210     A                                      EDTWRD('  :  ')
006550091210     A                                      TEXT('ORA CONSEGNA RICHIESTA')
006560091210     A                                 13  2'Prima Conseg. Parziale'
006570091210     A            V0CDCP        10A  O 13 26DSPATR(HI)
006580091210     A                                 13 38'Consegna anomala'
006590091210     A            V0CCCA         1A  O 13 56DSPATR(HI)
006600091210     A                                      TEXT('CODICE CONSEGNA ANOMALA')
006610091210     A            V0DCCA        20A  O 13 59DSPATR(HI)
006620091210     A                                      TEXT('DESCRIZIONE ITALIANO')
006630091210     A                                 15  2'CONSEGNA REALE'
006640091210     A                                      DSPATR(HI)
006650091210     A                                      DSPATR(UL)
006660091210     A            V0CDCM        10A  O 15 26DSPATR(HI)
006670091210     A  40        V0CHMC         4Y 0O 15 38EDTWRD('  :  ')
006680091210     A                                      DSPATR(HI)
006690091210     A                                      TEXT('ORA CONSEGNA MERCE (REALE)')
006700091210     A                                 15 59'Fermo Deposito'
006710091210     A            V0DFFD         3A  O 15 76DSPATR(HI)
006720091210     A                                 16  2'Distinta'
006730091210     A            V0CNDC         7Y 0O 16 12DSPATR(HI)
006740091210     A                                      EDTCDE(Z)
006750091210     A                                 16 21'del'
006760091210     A            V0CDDC        10A  O 16 26DSPATR(HI)
006770091210     A                                 16 38'Nr.Stop'
006780091210     A            V12STP         5Y 0O 16 46DSPATR(HI)
006790091210     A                                      EDTCDE(Z)
006800091210     A                                 16 52'Autotr'
006810091210     A            V12PDC         7Y 0O 16 59DSPATR(HI)
006820091210     A                                      EDTCDE(Z)
006830091210     A            V12RS2        12A  O 16 67DSPATR(HI)
006840091210     A                                 18  2'-Consegna Teorica-'
006850091210     A                                 18 28'---------------- Affidabilita'' ---
006860091210     A                                      --------------'
006870091210     A            V12DCE        10A  O 19  2DSPATR(HI)
006880091210     A  44        V12HCE         4Y 0O 19 15DSPATR(HI)
006890091210     A                                      EDTWRD('  :  ')
006900091210     A                                      TEXT('ORA CONSEGNA RICHIESTA')
006910091210     A                                 19 28'Partenza'
006920091210     A N99        V12NPI         3Y 0O 19 38DSPATR(HI)
006930091210     A                                      EDTCDE(L)
006940091210     A                                      TEXT('ORE NON CONF.PART. INTERNE')
006950091210     A                                 19 45'Cliente'
006960091210     A N99        V12NRC         3Y 0O 19 54DSPATR(HI)
006970091210     A                                      EDTCDE(L)
006980091210     A                                      TEXT('ORE NON CONF.RESA  CLIENTE')
006990091210     A                                 19 61'Consegna'
007000091210     A N99        V12NCI         3Y 0O 19 71DSPATR(HI)
007010091210     A                                      EDTCDE(L)
007020091210     A                                      TEXT('ORE NON CONF.CONS. INTERNE')
007030091210     A                                 21  2'Giorni chiusura'
007040091210     A                                 21 20'-------------------- Consegne Part-
007050091210     A                                      icolari -----------------'
007060091210     A            V12GC1         2A  O 22  5DSPATR(HI)
007070091210     A            V12GC2         2A  O 22 11DSPATR(HI)
007080091210     A            V12FTC         1A  O 22 20DSPATR(HI)
007090091210     A                                      TEXT('1 CONSEGNA PARTICOLARE')
007100091210     A            V12DTC        25A  O 22 23DSPATR(HI)
007110091210     A                                      TEXT('DESCRIZIONE')
007120091210     A            V12TC2         1A  O 22 51DSPATR(HI)
007130091210     A                                      TEXT('1 CONSEGNA PARTICOLARE')
007140091210     A            V12DC2        25A  O 22 54DSPATR(HI)
007150091210     A                                      TEXT('DESCRIZIONE')
007160040119     A*------------------------------------*
007170070524     A          R SB51S13                   SFL
007180070524     A*%%TS  SD  20070524  115820  EDPGA       REL-V5R3M0  5722-WDS
007190070524     A            V13SVN         1   O 19  2DSPATR(HI)
007200070524     A                                      TEXT('SIGLA VARIE 1')
007210070524     A  64                                  DSPATR(RI)
007220070524     A            V13VAN        13   O 19  4DSPATR(HI)
007230070524     A  64                                  DSPATR(RI)
007240070524     A            V13DSV        20A  O 19 18TEXT('DESCRIZIONE')
007250040119     A*------------------------------------*
007260160621     A          R SB51C13                   SFLCTL(SB51S13)
007270160621     A*%%TS  SD  20160621  105233  EDPMB       REL-V7R1M0  5770-WDS
007280160621     A  *DS3                                SFLLIN(0006)
007290160621     A                                      SFLSIZ(0008)
007300160621     A                                      SFLPAG(0007)
007310160621     A  26                                  INVITE
007320160621     A                                      OVERLAY
007330160621     A                                      SFLCSRRRN(&V13NRR)
007340160621     A  25                                  SFLDSP
007350160621     A  26                                  SFLDSPCTL
007360160621     A N26                                  SFLCLR
007370160621     A  25                                  SFLEND
007380160621     A            V13NRR         5S 0H
007390160621     A                                  6  2'----- Valori Fatturati ----'
007400160621     A                                  6 32'Portata a Magazzino'
007410160621     A            V0DFDN         2A  O  6 52DSPATR(HI)
007420160621     A                                  6 57'Fatturata Tar.Mitt.'
007430160621     A            V13FTM         2A  O  6 78DSPATR(HI)
007440160621     A                                  7  7'Peso'
007450160621     A            V0CFPF         1A  O  7 16DSPATR(HI)
007460160621     A                                      DSPATR(UL)
007470160621     A            V13PESO        7Y 1O  7 18DSPATR(HI)
007480160621     A                                      EDTCDE(2)
007490160621     A                                      TEXT('PESO KG DA FATTURARE')
007500160621     A                                      DSPATR(UL)
007510160621     A                                  7 32'Fermo Deposito'
007520160621     A            V0DFFD         3A  O  7 52DSPATR(HI)
007530160621     A                                  7 57'Peso Tassabile'
007540160621     A            V13PVL         5Y 0O  7 75DSPATR(HI)
007550160621     A                                      EDTCDE(Z)
007560160621     A                                  8  6'Colli'
007570160621     A            V0CNCL         5Y 0O  8 21DSPATR(HI)
007580160621     A                                      EDTCDE(2)
007590160621     A                                      TEXT('NUMERO COLLI')
007600160621     A                                      DSPATR(UL)
007610160621     A                                  8 32'-- Nazione/CAP Fat. --'
007620160621     A                                  8 57'-- Codice Tassazione --'
007630160621     A                                  9  5'Volume'
007640160621     A            V0CFVF         1A  O  9 16DSPATR(HI)
007650160621     A                                      TEXT('FLAG VOLUME DA FATTURARE')
007660160621     A                                      DSPATR(UL)
007670160621     A            V0CVLF         5Y 3O  9 21DSPATR(HI)
007680160621     A                                      EDTCDE(4)
007690160621     A                                      TEXT('VOLUME DA FATTURARE')
007700160621     A                                      DSPATR(UL)
007710160621     A                                  9 32'Mitt'
007720160621     A            V13NZM         3A  O  9 37DSPATR(HI)
007730160621     A                                  9 41'/'
007740160621     A            V13CAM         9A  O  9 43DSPATR(HI)
007750160621     A            V0CFAP         1A  O  9 53DSPATR(HI)
007760160621     A                                  9 57'Mitt'
007770160621     A            V13MCT         2A  O  9 62DSPATR(HI)
007780160621     A                                      TEXT('CODICE TASSAZIONE')
007790160621     A            V13DMT        15A  O  9 65TEXT('DESCRIZIONE')
007800160621     A                                 10  2'Quantita'''
007810160621     A            V13QFT        13Y 3O 10 12DSPATR(HI)
007820160621     A                                      EDTCDE(2)
007830160621     A                                      TEXT('QUANTITA DA FATTURARE')
007840160621     A                                      DSPATR(UL)
007850160621     A                                 10 32'Dest'
007860160621     A            V0CNZD         3A  O 10 37DSPATR(HI)
007870160621     A                                 10 41'/'
007880160621     A            V0CCAD         9A  O 10 43DSPATR(HI)
007890160621     A            V0CFIN         1A  O 10 53DSPATR(HI)
007900160621     A                                 10 57'Dest'
007910160621     A            V13CTS         2A  O 10 62DSPATR(HI)
007920160621     A                                      TEXT('CODICE TASSAZIONE')
007930160621     A            V13DCT        15A  O 10 65TEXT('DESCRIZIONE')
007940160621     A                                 12  2'--- Tariffa ---'
007950160621     A  72                             12 20'?=Ottico'
007960160621     A                                 12 30'Divisa'
007970160621     A                                 12 41'Importo / L.IVA / Numero / Data FA-
007980160621     A                                      TTURA'
007990160621     A            V13CTR         3S 0O 13  2DSPATR(HI)
008000160621     A            V13DTR        11A  O 13  6
008010160621     A  72        V13OTTICO      1A  B 13 23DSPATR(HI)
008020160621     A                                      VALUES(' ' '?')
008030160621     A N72                                  DSPATR(PR)
008040160621     A            V13DIV         3A  O 13 32DSPATR(RI)
008050160621     A            V13IFT        13A  O 13 36DSPATR(HI)
008060160621     A            V0CFIV         3Y 0O 13 52DSPATR(HI)
008070160621     A                                      EDTCDE(Z)
008080160621     A                                      TEXT('COD.FILIALE IVA')
008090160621     A            V0CNFT         6Y 0O 13 58DSPATR(HI)
008100160621     A                                      EDTCDE(2)
008110160621     A                                      TEXT('NUMERO FATTURA')
008120160621     A            V0CDFT        10A  O 13 69DSPATR(HI)
008130160621     A                                 15  6'Trasporto'
008140160621     A                                 15 22'Tot.Imponibile'
008150160621     A                                 15 46'I.V.A.'
008160160621     A                                 15 57'Esenzione I.V.A.'
008170160621     A            V13POR        13A  O 16  2DSPATR(HI)
008180160621     A  61                                  DSPATR(RI)
008190160621     A            V13IMV        13A  O 16 23DSPATR(HI)
008200160621     A  62                                  DSPATR(RI)
008210160621     A            V13IVA        13A  O 16 39DSPATR(HI)
008220160621     A  63                                  DSPATR(RI)
008230160621     A            V13FEI         1A  O 16 57DSPATR(HI)
008240160621     A                                      TEXT('CODICE ESENZIONE IVA')
008250160621     A            V13DEI        20A  O 16 60TEXT('DESCRIZIONE')
008260160621     A                                 18  2'-------------- Varie --------------
008270160621     A                                      --'
008280160621     A                                 18 44'-------------- Varie --------------
008290160621     A                                      --'
008300040119      *------------------------------------*
008310000417     A          R SB51S21                   SFL
008320000417     A            V21FLS         3S 0O  9  2DSPATR(HI)
008330000417     A            V21NSC         7Y 0O  9  6DSPATR(HI)
008340000417     A                                      EDTCDE(Z)
008350000417     A            V21DCM        10A  O  9 15
008360040119      *------------------------------------*
008370010221     A          R SB51C21                   SFLCTL(SB51S21)
008380120302     A  26                                  INVITE
008390010221     A                                      OVERLAY
008400010221     A  25                                  SFLDSP
008410010221     A  26                                  SFLDSPCTL
008420010221     A N26                                  SFLCLR
008430010221     A                                      SFLSIZ(0042)
008440010221     A                                      SFLPAG(0041)
008450010221     A  *DS3                                SFLLIN(0004)
008460010221     A                                  7  1'| SEGNACOLLO |   DATA   |'
008470010221     A                                  7 28'| SEGNACOLLO |   DATA   |'
008480010221     A                                  7 55'| SEGNACOLLO |   DATA   |'
008490010221     A                                  8  1'|P.O. Numero | CONSEGNA |'
008500010221     A                                      DSPATR(UL)
008510010221     A                                  8 28'|P.O. Numero | CONSEGNA |'
008520010221     A                                      DSPATR(UL)
008530010221     A                                  8 55'|P.O. Numero | CONSEGNA |'
008540010221     A                                      DSPATR(UL)
008550040119      *------------------------------------*
008560010524     A          R SB51S08                   SFL
008570010524     A            V08NOT        35A  O  8 23DSPATR(HI)
008580010524     A            V08NSC         7Y 0O  8 10DSPATR(HI)
008590010524     A                                      EDTCDE(Z)
008600040119      *------------------------------------*
008610010525     A          R SB51C08                   SFLCTL(SB51S08)
008620010525     A                                      SFLSIZ(0160)
008630010525     A                                      SFLPAG(0015)
008640120302     A  26                                  INVITE
008650010525     A                                      OVERLAY
008660010525     A  25                                  SFLDSP
008670010525     A  26                                  SFLDSPCTL
008680010525     A N26                                  SFLCLR
008690010525     A                                  7  8'SEGNACOLLO     CODICE "CHI SONO"  -
008700010525     A                                                      '
008710010525     A                                      DSPATR(UL)
008720040119      *------------------------------------*
008730020226     A          R SB51S23                   SFL
008740020226     A            V23NOT        35A  O  8 23DSPATR(HI)
008750020226     A            V23NSC         7Y 0O  8 10DSPATR(HI)
008760020226     A                                      EDTCDE(Z)
008770040119      *------------------------------------*
008780020226     A          R SB51C23                   SFLCTL(SB51S23)
008790120302     A  26                                  INVITE
008800020226     A                                      OVERLAY
008810020226     A  25                                  SFLDSP
008820020226     A  26                                  SFLDSPCTL
008830020226     A N26                                  SFLCLR
008840020226     A                                      SFLSIZ(0160)
008850020226     A                                      SFLPAG(0015)
008860020226     A                                  7  8'SEGNACOLLO     AWB FEDEX          -
008870020226     A                                                      '
008880020226     A                                      DSPATR(UL)
008890040119      *------------------------------------*
008900030408     A          R SB51S18                   SFL
008910030408     A            V18FLG         1A  H
008920030408     A            V18AAP    R        O  9  2REFFLD(LBLAAP FNLBL00F)
008930030408     A  53                                  DSPATR(RI)
008940030408     A                                      DSPATR(UL)
008950030408     A                                      EDTCDE(Z)
008960030408     A            V18LPP    R        O  9  7REFFLD(LBLLPP FNLBL00F)
008970030408     A  53                                  DSPATR(RI)
008980030408     A                                      DSPATR(UL)
008990030408     A            V18NRP    R        O  9 11REFFLD(LBLNRP FNLBL00F)
009000030408     A  53                                  DSPATR(RI)
009010030408     A                                      DSPATR(UL)
009020030408     A                                      EDTCDE(Z)
009030030408     A            V18NSP    R        O  9 14REFFLD(LBLNSP FNLBL00F)
009040030408     A  53                                  DSPATR(RI)
009050030408     A                                      DSPATR(UL)
009060030408     A                                      EDTCDE(Z)
009070030408     A            V18LAP    R        O  9 22REFFLD(LBLLAP FNLBL00F)
009080030408     A  53                                  DSPATR(RI)
009090030408     A                                      DSPATR(UL)
009100030408     A            V18AAN    R        O  9 29REFFLD(LBLAAN FNLBL00F)
009110030408     A  54                                  DSPATR(ND)
009120030408     A  55                                  DSPATR(RI)
009130030408     A                                      DSPATR(UL)
009140030408     A                                      EDTCDE(Z)
009150030408     A            V18LPN    R        O  9 34REFFLD(LBLLPN FNLBL00F)
009160030408     A  54                                  DSPATR(ND)
009170030408     A  55                                  DSPATR(RI)
009180030408     A                                      DSPATR(UL)
009190030408     A            V18NRN    R        O  9 38REFFLD(LBLNRN FNLBL00F)
009200030408     A  54                                  DSPATR(ND)
009210030408     A  55                                  DSPATR(RI)
009220030408     A                                      DSPATR(UL)
009230030408     A                                      EDTCDE(Z)
009240030408     A            V18NSN    R        O  9 41REFFLD(LBLNSN FNLBL00F)
009250030408     A  54                                  DSPATR(ND)
009260030408     A  55                                  DSPATR(RI)
009270030408     A                                      DSPATR(UL)
009280030408     A                                      EDTCDE(Z)
009290030408     A            V18LAN    R        O  9 49REFFLD(LBLLAN FNLBL00F)
009300030408     A  54                                  DSPATR(ND)
009310030408     A  55                                  DSPATR(RI)
009320030408     A                                      DSPATR(UL)
009330030408     A            V18PRE         9A  O  9 54
009340030408     A            V18SCE         1A  B  9 65DSPATR(HI)
009350030408     A  56                                  DSPATR(ND)
009360030408     A  56                                  DSPATR(PR)
009370030408     A            V18NPRE       12A  O  9 67
009380040119      *------------------------------------*
009390030402     A          R SB51C18                   SFLCTL(SB51S18)
009400120302     A  26                                  INVITE
009410030402     A                                      OVERLAY
009420030402     A  25                                  SFLDSP
009430030402     A  26                                  SFLDSPCTL
009440030402     A N26                                  SFLCLR
009450030402     A                                      SFLSIZ(0013)
009460030402     A                                      SFLPAG(0012)
009470030402     A                                  7  2'  P R E C E D E N T E  '
009480030402     A                                      DSPATR(UL)
009490030402     A                                  7 29'    S E G U E N T E               '
009500030402     A                                      DSPATR(UL)
009510030402     A                                  8  2'Anno'
009520030402     A                                  8  7'LNP'
009530030402     A                                  8 11'Sr'
009540030402     A                                  8 14'Nr.sped'
009550030402     A                                  8 22'LNA'
009560030402     A                                  8 29'Anno'
009570030402     A                                  8 34'LNP'
009580030402     A                                  8 38'Sr'
009590030402     A                                  8 41'Nr.sped'
009600030402     A                                  8 49'LNA'
009610030402     A                                  7 65'5'
009620030402     A                                      DSPATR(UL)
009630030402     A                                      DSPATR(HI)
009640111007     A          R SB51W01
009650111007     A*%%TS  SD  20111007  122707  EDPRM       REL-V6R1M0  5761-WDS
009660111007     A                                      WINDOW(7 20 8 45)
009670120302     A                                      INVITE
009680111007     A                                      OVERLAY
009690111007     A                                  5 17'premere INVIO per continuare'
009700111007     A                                  3  1'Immagine non visualizzabile. Avvis-
009710111007     A                                      are il CED'
009720111007     A                                      DSPATR(HI)
009730111007     A            W01DES        32A  O  7  1COLOR(BLU)
009740121022     A          R SB51W02
009750121022     A*%%TS  SD  20121022  120855  EDPMB       REL-V6R1M0  5761-WDS
009760121022     A                                      WINDOW(5 10 12 60)
009770121022     A                                      INVITE
009780121022     A                                      OVERLAY
009790121022     A                                  3  1'Data inventario documenti in parte-
009800121022     A                                      nza ....:'
009810121022     A                                  1 12'Documenti da Restituire al Mittent-
009820121022     A                                      e'
009830121022     A                                      DSPATR(HI)
009840121022     A            W02DRDT        8Y 0O  3 45EDTWRD('  /  /    ')
009850121022     A                                      DSPATR(HI)
009860121022     A  69                              5  1'Documenti errati per:'
009870121022     A  69        W02MTVDT       9   O  5 23DSPATR(HI)
009880121022     A  69        W02DDTIL      11   O  5 33
009890121022     A  69        W02DIMTV       8  0O  5 45EDTWRD('  /  /    ')
009900121022     A                                      DSPATR(HI)
009910121022     A  69        W02DMTVDT     40   O  6 15DSPATR(HI)
009920121022     A                                 11 32'Premere INVIO per continuare'
009930121022     A                                  9  1'Data scannerizzazione immagine doc-
009940121022     A                                      umenti..:'
009950121022     A            W02DRID        8Y 0O  9 45EDTWRD('  /  /    ')
009960121022     A                                      DSPATR(HI)
009970121022     A            W02DFSTD      31A  O  4 24DSPATR(HI)
009980121022     A            W02LBL        12A  O 10 43DSPATR(HI)
