000100000000     A*------------------------------------------------------------------------*
000200051219     A* DS CONTROLLO MANCA TARIFFA FILIALE / SEDE                              *
000300000000     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500051219     A          R D44REC                    TEXT('DS CONTROLLO MANCA TARIFFA')
000600000000    ?A*-------------------
000700051219    ?A* Parametri
000800000000    ?A*-------------------
000900060131     A            D44ARE    R               REFFLD($TFP)
001000060131     A                                      TEXT('AREA DA CONTROLLARE')
001100060131     A            D44DAR        20A         TEXT('DESCRIZIONE AREA')
001200051219     A            D44FIL    R               REFFLD($FIL)
001300051219     A                                      TEXT('LINEA DA CONTROLLARE')
001400051222     A            D44DFI        20A         TEXT('DESCRIZIONE FILIALE')
001500051219     A            D44CLI    R               REFFLD($CSC)
001600051219     A                                      TEXT('COD. CLIENTE DA CONTROLLARE')
001700060210     A            D44RAG    R               REFFLD($RSC)
001800060210     A                                      TEXT('RAGIONE SOCIALE CLIENTE')
001900051223     A            D44DSD    R               REFFLD($DA8)
002000051223     A                                      TEXT('DALLA DATA SPEDIZIONE')
002100051223     A            D44DSA    R               REFFLD($DA8)
002200051223     A                                      TEXT('ALLA DATA SPEDIZIONE')
002300051221     A            D44FSI         1A         TEXT('FLAG STAMPA IMPONIBILE S/N')
002400051221     A            D44SPP         1A         TEXT('FLAG STAMPA SEPARATE PER -
002500051221     A                                      P.O. S/N')
002600051221     A            D44SUN         1A         TEXT('FLAG STAMPA UNICA (S/N)')
002700051221     A            D44CRF         1A         TEXT('FLAG CREAZIONE FILE')
002800060208     A            D44MBR        10A         TEXT('NOME MEMBRO DA CREARE')
002900060222     A            D44OUT         1A         TEXT('DETT.CODA DI STAMPA:U=UTENTE-
003000051221     A                                      ,T=TABELLA 5P,O=ORGANIGRAMMA')
003100060203     A            D44TOT         1A         TEXT('TOTALI PER AREA: S=TOTALI')
003200060222     A            D44TOU         1A         TEXT('TOT. CODA DI STAMPA:U=UTENTE-
003300060222     A                                      ,T=TABELLA 05')
003400120308     A            D44GIO         1A         TEXT('S=STP GIORNALIERA; M=STAMPA -
003500120308     A                                      DA MENU;    = STAMPA MENSILE/SETT.')
003600120217     A            D44STPS        1A         TEXT('S=STAMPA SOLO SEGNALAZIONI')
003700120224     A            D44CCM    R               REFFLD($AGE)
003800120224     A            D44SB48        1A         TEXT('S=RICHIAMATO DA SB48 X F5')
