000010040220     A*%%TS  SD  20040220  143225  EDPBA       REL-V4R4M0  5769-PW1
000020940901     A*------------------------------------------------------------------------*
000030040220     A*%%EC
000040040220     A                                      DSPSIZ(24 80 *DS3)
000050040220     A                                      CHGINPDFT(HI CS)
000060040220     A                                      PRINT
000070040220     A                                      CF01
000080040220     A                                      CF02
000090040220     A                                      CF03
000100040220     A                                      CF04
000110040220     A                                      CF05
000120040220     A                                      CF06
000130040220     A                                      CF07
000140040220     A                                      CF08
000150040220     A                                      CF09
000160040220     A                                      CF10
000170040220     A                                      CF11
000180040220     A                                      CF12
000190040220     A                                      CF13
000200040220     A                                      CF14
000210040220     A                                      CF15
000220040220     A                                      CF16
000230040220     A                                      CF17
000240040220     A                                      CF18
000250040220     A                                      CF19
000260040220     A                                      CF20
000270040220     A                                      CF21
000280040220     A                                      CF22
000290040220     A                                      CF23
000300040220     A                                      CF24
000310040220     A                                      ROLLUP(97)
000320040220     A                                      ROLLDOWN(97)
000330040220     A                                      HELP
000340940901     A*------------------------------------------------------------------------*
000350930906     A* Record testata
000360940901     A*------------------------------------------------------------------------*
000370040220     A          R SB39DVT
000380040220     A*%%TS  SD  20040220  142830  EDPBA       REL-V4R4M0  5769-PW1
000390040220     A            VTDRSU        20A  O  1  2
000400040220     A                                  1 28'SALVATAGGIO LIBRERIA SAVTASaamm'
000410040220     A                                      DSPATR(RI)
000420040220     A                                      DSPATR(UL)
000430040220     A                                  1 62'TNSB39R'
000440040220     A                                  1 72DATE
000450040220     A                                      EDTCDE(Y)
000460940901     A*------------------------------------------------------------------------*
000470930806     A* Record descrizione tasti funzionali attivi
000480940901     A*------------------------------------------------------------------------*
000490950717     A          R SB39DVF
000500931115     A                                      OVERLAY
000510931115     A            VFD001        19A  O 22  2
000520931115     A            VFD002        19A  O 22 22
000530931115     A            VFD003        19A  O 22 42
000540931115     A            VFD004        19A  O 22 62
000550931115     A            VFD005        19A  O 23  2
000560931115     A            VFD006        19A  O 23 22
000570931115     A            VFD007        19A  O 23 42
000580931115     A            VFD008        19A  O 23 62
000590940901     A*------------------------------------------------------------------------*
000600930922     A* Record RICHIESTA PARAMETRI
000610940901     A*------------------------------------------------------------------------*
000620040220     A          R SB39DV1
000630040220     A*%%TS  SD  20040220  143225  EDPBA       REL-V4R4M0  5769-PW1
000640040220     A                                      OVERLAY
000650040220     A                                  6 25'Libreria ..: SAVTAS + aa + mm'
000660040220     A            V1CANN         4Y 0B  7 46CHECK(RB)
000670040220     A N61                                  DSPATR(HI)
000680040220     A  61                                  DSPATR(RI)
000690040220     A  61                                  DSPATR(PC)
000700040220     A            V1CMES         2Y 0B  7 52CHECK(RB)
000710040220     A N62                                  DSPATR(HI)
000720040220     A  62                                  DSPATR(RI)
000730040220     A  62                                  DSPATR(PC)
000740940901     A*------------------------------------------------------------------------*
000750930806     A* Record subfile messaggi
000760940901     A*------------------------------------------------------------------------*
000770950717     A          R SB39DVM                   SFL
000780931115     A                                      SFLMSGRCD(24)
000790931115     A            VMCKEY                    SFLMSGKEY
000800931115     A            VMCQUE                    SFLPGMQ
000810940901     A*------------------------------------------------------------------------*
000820930806     A* Record controllo subfile messaggi
000830940901     A*------------------------------------------------------------------------*
000840950717     A          R SB39DVK                   SFLCTL(SB39DVM)
000850931115     A                                      SFLSIZ(0002)
000860931115     A                                      SFLPAG(0001)
000870931115     A                                      OVERLAY
000880931115     A                                      SFLDSP
000890931115     A  40                                  SFLCLR
000900931115     A  44                                  SFLEND
