000010170612     A*%%TS  SD  20170612  142757  EDPRM       REL-V7R2M0  5770-WDS
000020151016     A*/*PRM waitrcd(50)
000030151016     A*/*PRM rstdsp(*yes) dfrwrt(*yes) decfmt(*job)
000040151016     A*/*END
000050040119     A*------------------------------------*
000060170612     A*%%EC
000070170612     A                                      DSPSIZ(24 80 *DS3)
000080170612     A                                      PRINT
000090170612     A  02                                  CF02(27)
000100170612     A                                      CA03(27)
000110170612     A  04                                  CF04(27)
000120170612     A  05                                  CF05(27)
000130170612     A  06                                  CF06(27)
000140170612     A                                      CF07(27)
000150170612     A  08                                  CF08(27)
000160170612     A  09                                  CF09(27)
000170170612     A  10                                  CF10(27)
000180170612     A  11                                  CF11(27)
000190170612     A                                      CA12(27)
000200170612     A  13                                  CF13(27)
000210170612     A  14                                  CF14(27)
000220170612     A  15                                  CF15(27)
000230170612     A  16                                  CF16(27)
000240170612     A  17                                  CF17(27)
000250170612     A  18                                  CF18(27)
000260170612     A  19                                  CF19(27)
000270170612     A                                      CF20(27)
000280170612     A  21                                  CF21(27)
000290170612     A  22                                  CA22(27)
000300170612     A  23                                  CF23(27)
000310170612     A  24                                  CF24(27)
000320170612     A  01                                  CF01(27)
000330040119     A*------------------------------------*
000340170515     A          R SB51Z00
000350170515     A*%%TS  SD  20170515  122015  EDPRM       REL-V7R2M0  5770-WDS
000360170515     A                                      OVERLAY
000370170515     A            VTF01         11A  O 23  2
000380170515     A            VTF02         11A  O 23 14
000390170515     A            VTF03         11A  O 23 26
000400170515     A            VTF04         11A  O 23 38
000410170515     A            VTF05         11A  O 23 50
000420170515     A                                 24  2'F3=Fine'
000430170515     A                                 24 10'F7=AltriDati'
000440170515     A  16                             24 23'F16=C/E'
000450170515     A  17                             24 31'F17=RigBolla'
000460170515     A  13                             24 44'F13=Tassaz.'
000470170515     A                                 24 56'F20=Affidab.'
000480170515     A                                 24 69'F12=Ritorno'
000490170515     A            VTF06         16A  O 23 64
000500040119     A*------------------------------------*
000510170517     A          R SB51T01
000520170517     A*%%TS  SD  20170517  125136  EDPRM       REL-V7R2M0  5770-WDS
000530170517     A            RSUT          20A  O  1  2
000540170517     A            VTCPGM        10A  O  1 60
000550170517     A                                  1 72DATE
000560170517     A                                      EDTCDE(Y)
000570170517     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000580170517     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000590170517     A  57                              2 35'BOLLA LEGATA'
000600170517     A                                      DSPATR(UL)
000610170517     A                                  2 72TIME
000620170517     A            V1CTIT        30   O  1 26DSPATR(RI)
000630170517     A                                      DSPATR(UL)
000640040119     A*------------------------------------*
000650170606     A          R SB51D01
000660170606     A*%%TS  SD  20170606  094112  EDPRM       REL-V7R2M0  5770-WDS
000670170606     A                                      INVITE
000680170606     A                                      OVERLAY
000690170606     A  28        V1CMSG        78   M
000700170606     A                                  3  2'SPEDIZIONE:'
000710170606     A                                      DSPATR(UL)
000720170606     A            V0CLNP         3S 0O  3 15DSPATR(HI)
000730170606     A                                      DSPATR(UL)
000740170606     A                                      TEXT('FILIALE PARTENZA')
000750170606     A            V0CNRS         2Y 0O  3 20DSPATR(UL)
000760170606     A                                      DSPATR(HI)
000770170606     A                                      EDTCDE(Z)
000780170606     A                                      TEXT('NUMERO SERIE')
000790170606     A                                  3 23'-'
000800170606     A            V0CNSP         7Y 0O  3 25DSPATR(HI)
000810170606     A                                      EDTCDE(2)
000820170606     A                                      DSPATR(UL)
000830170606     A                                      TEXT('NUMERO SPEDIZIONE')
000840170606     A                                  3 37'del'
000850170606     A            V0CDSP         8Y 0O  3 43TEXT('DATA SPEDIZIONE')
000860170606     A                                      DSPATR(HI)
000870170606     A                                      EDTWRD('  /  /    ')
000880170606     A                                      DSPATR(UL)
000890170606     A            V0DTSP        10A  O  3 56TEXT('TIPO SERVIZIO BOLLA')
000900170606     A                                      DSPATR(HI)
000910170606     A            V0DSTS        12A  O  3 69TEXT('Da Fatturare/Fatturata/Contab-
000920170606     A                                      ilizzata')
000930170606     A                                      DSPATR(RI)
000940170606     A                                  4  2'Linea Arrivo'
000950170606     A            V0CLNA         3S 0O  4 15DSPATR(HI)
000960170606     A                                      TEXT('FILIALE ARRIVO')
000970170606     A            V0DLNA        15A  O  4 19DSPATR(HI)
000980170606     A                                      TEXT('DESCRIZIONE FILIALE')
000990170606     A                                  4 37'Tipo Bolla'
001000170606     A            V0CTBL         2A  O  4 51DSPATR(HI)
001010170606     A                                      TEXT('CODICE BOLLA')
001020170606     A            V0DTBL        20A  O  4 54DSPATR(HI)
001030170606     A                                      TEXT('DESCRIZIONE')
001040170606     A                                  5  2'-----------------------------------
001050170606     A                                      ------------------------------------
001060170606     A                                      ----------'
001070170606     A                                  6  2'Prima Cons.Parziale'
001080170606     A            V0CDCP        10A  O  6 23DSPATR(HI)
001090170606     A                                  6 36'Consegna Anomala'
001100170606     A            V0CCCA         1A  O  6 55DSPATR(HI)
001110170606     A                                      TEXT('CODICE CONSEGNA ANOMALA')
001120170606     A            V0DCCA        20A  O  6 58DSPATR(HI)
001130170606     A  19                              7  2'F19=Immagine'
001140170606     A                                  7 15'CONSEGNA REALE'
001150170606     A                                      DSPATR(HI)
001160170606     A                                      DSPATR(UL)
001170170606     A            V0CDCM        10A  O  7 30DSPATR(HI)
001180170606     A  40        V0CHMC         4Y 0O  7 41EDTWRD('  :  ')
001190170606     A                                      DSPATR(HI)
001200170606     A                                      TEXT('ORA CONSEGNA MERCE (REALE)')
001210170606     A                                  7 47'Distinta n°'
001220170606     A            V0CNDC         7Y 0O  7 59DSPATR(HI)
001230170606     A                                      EDTCDE(Z)
001240170606     A                                  7 67'del'
001250170606     A            V0CDDC        10A  O  7 71DSPATR(HI)
001260170606     A                                  8  2'-----------------------------------
001270170606     A                                      ------------------------------------
001280170606     A                                      ----------'
001290170606     A                                  9  2'FATTURA:'
001300170606     A                                      DSPATR(HI)
001310170606     A                                      DSPATR(UL)
001320170606     A N41N35                           9 11'Importo'
001330170606     A  41N35                           9 11'Imponibile'
001340170606     A N35        V1CIMP        13A  O  9 22DSPATR(HI)
001350170606     A N35        V1CDIV         3A  O  9 36DSPATR(HI)
001360170606     A                                  9 41'Lib.IVA'
001370170606     A            V0CFIV         3Y 0O  9 49DSPATR(HI)
001380170606     A                                      EDTCDE(2)
001390170606     A                                  9 54'Nr.'
001400170606     A            V0CNFT         6Y 0O  9 58DSPATR(HI)
001410170606     A                                      EDTCDE(Z)
001420170606     A                                  9 66'Data'
001430170606     A            V0CDFT        10A  O  9 71DSPATR(HI)
001440170606     A                                 10  2'-----------------------------------
001450170606     A                                      ------------------------------------
001460170606     A                                      ----------'
001470170606     A                                 11  2'Mittente'
001480170606     A            V1CRSM        28A  O 11 12DSPATR(HI)
001490170606     A                                      DSPATR(UL)
001500170606     A                                      TEXT('RAG.SOCIALE MITTENTE 1')
001510170606     A                                 11 43'Destinat.'
001520170606     A            V1CRSD        28A  O 11 53DSPATR(HI)
001530170606     A                                      DSPATR(UL)
001540170606     A                                      TEXT('RAGIONE SOCIALE DESTINATARIO')
001550170606     A            V0CCCM         7Y 0O 12  3DSPATR(HI)
001560170606     A                                      EDTCDE(Z)
001570170606     A                                      TEXT('COD.CLIENTE SPEDIZIONE')
001580170606     A            V1CINM        28A  O 12 12DSPATR(HI)
001590170606     A                                      DSPATR(UL)
001600170606     A                                      TEXT('INDIRIZZO MITTENTE')
001610170606     A            V0CCCD         7Y 0O 12 44DSPATR(HI)
001620170606     A                                      EDTCDE(Z)
001630170606     A                                      TEXT('COD.CLIENTE SPEDIZIONE')
001640170606     A            V1CIND        28A  O 12 53DSPATR(HI)
001650170606     A                                      DSPATR(UL)
001660170606     A                                      TEXT('INDIRIZZO DESTINATARIO')
001670170606     A            V0CCAM         9A  O 13  2DSPATR(HI)
001680170606     A                                      DSPATR(UL)
001690170606     A                                      TEXT('CAP MITTENTE')
001700170606     A            V1CLOM        24A  O 13 12DSPATR(HI)
001710170606     A                                      DSPATR(UL)
001720170606     A                                      TEXT('LOCALITA'' MITTENTE')
001730170606     A            V1CPNM         3A  O 13 37DSPATR(HI)
001740170606     A                                      DSPATR(UL)
001750170606     A                                      TEXT('PROVINCIA MITTENTE')
001760170606     A            V0CCAD         9A  O 13 43DSPATR(HI)
001770170606     A                                      DSPATR(UL)
001780170606     A                                      TEXT('CAP DESTINATARIO')
001790170606     A            V1CLOD        24A  O 13 53DSPATR(HI)
001800170606     A                                      DSPATR(UL)
001810170606     A                                      TEXT('LOCALITA'' DESTINATARIO')
001820170606     A            V1CPND         3A  O 13 78DSPATR(HI)
001830170606     A                                      DSPATR(UL)
001840170606     A                                      TEXT('PROVINCIA DESTINATARIO')
001850170606     A  52                             14 51'DPD: Depot Arrivo'
001860170606     A  52        V1CRTN         4A  O 14 69DSPATR(HI)
001870170606     A                                      DSPATR(UL)
001880170606     A  52                             14 74'Zona'
001890170606     A  52        V1CZON         2A  O 14 79DSPATR(HI)
001900170606     A                                      DSPATR(UL)
001910170606     A                                 15  2'Riferimenti'
001920170606     A            V0CRMN        15Y 0O 15 14EDTCDE(Z)
001930170606     A                                      DSPATR(UL)
001940170606     A                                      DSPATR(HI)
001950170606     A                                      TEXT('RIFERIMENTO MITTENTE NUM.')
001960170606     A            V1CRMA        15A  O 15 31DSPATR(HI)
001970170606     A                                      DSPATR(UL)
001980170606     A                                      TEXT('RIFERIM.MITTENTE ALFANUMER')
001990170606     A                                 15 51'Rifer. Partner'
002000170606     A            V1CRPT        15A  O 15 66DSPATR(HI)
002010170606     A                                      DSPATR(UL)
002020170606     A                                      TEXT('RIFERIM.MITTENTE ALFANUMER')
002030170606     A                                 16 42'R'
002040170606     A                                 16 46'Zona'
002050170606     A                                 16 63'-- Contrassegno --'
002060170606     A            V1CFLS         3Y 0O 17 14TEXT('P.O. SEGNACOLLO')
002070170606     A                                      DSPATR(HI)
002080170606     A                                      DSPATR(UL)
002090170606     A                                      EDTCDE(Z)
002100170606     A            V1CNRSS        2Y 0O 17 20DSPATR(HI)
002110170606     A                                      DSPATR(UL)
002120170606     A                                      EDTCDE(Z)
002130170606     A                                      TEXT('NUMERO SERIE')
002140170606     A N75        V1CNCD         7Y 0O 17 24EDTCDE(Z)
002150170606     A                                      DSPATR(UL)
002160170606     A                                      DSPATR(HI)
002170170606     A                                      TEXT('NUM.SEGNACOLLO -DAL-')
002180170606     A N75                             17 32'/'
002190170606     A N75        V1CNCA         7Y 0O 17 34EDTCDE(Z)
002200170606     A                                      DSPATR(UL)
002210170606     A                                      DSPATR(HI)
002220170606     A                                      TEXT('NUM.SEGNACOLLO -AL-')
002230170606     A            V1CXCO         1A  O 17 42DSPATR(UL)
002240170606     A                                      DSPATR(HI)
002250170606     A            V1CZNC         2Y 0O 17 46EDTCDE(Z)
002260170606     A                                      DSPATR(HI)
002270170606     A                                      TEXT('ZONA CONSEGNA')
002280170606     A                                      DSPATR(UL)
002290170606     A            V1CBVA         1A  O 17 49TEXT('FLAG "COLLI DI VALORE"')
002300170606     A            V1CCAS        13Y 3O 17 63EDTCDE(4)
002310170606     A N39                                  DSPATR(HI)
002320170606     A                                      TEXT('CONTRASSEGNO')
002330170606     A N39                                  DSPATR(UL)
002340170606     A            V1CVCA         3A  O 17 78
002350170606     A N39                                  DSPATR(HI)
002360170606     A                                      TEXT('DIVISA IMPORTO C/ASSEGNO')
002370170606     A N39                                  DSPATR(UL)
002380170606     A  39                             18 68'ANNULLATO'
002390170606     A                                      DSPATR(HI)
002400170606     A  75        V1DFNS        15A  O 17 24DSPATR(BL)
002410170606     A            V0CNCL         5Y 0O 17  2DSPATR(HI)
002420170606     A                                      EDTCDE(Z)
002430170606     A                                      DSPATR(UL)
002440170606     A                                      TEXT('NUMERO COLLI')
002450170606     A                                 20  2'Bollettato   da VDL   Boll/Var Fat-
002460170606     A                                      turato | Bollett.  da VDL  Boll/Var-
002470170606     A                                        Fattur. '
002480170606     A                                      DSPATR(UL)
002490170606     A  70        V1PESTAS       1A  B 22 40DSPATR(HI)
002500170606     A                                      VALUES(' ' '?')
002510170606     A            V1CFPB         1A  O 21  2DSPATR(HI)
002520170606     A                                      DSPATR(UL)
002530170606     A            V1CPKB         7Y 1O 21  4DSPATR(HI)
002540170606     A                                      EDTCDE(4)
002550170606     A                                      DSPATR(UL)
002560170606     A                                      TEXT('PESO KG DA FATTURARE')
002570170606     A            V1CPKC         7Y 1O 21 14DSPATR(HI)
002580170606     A                                      EDTCDE(4)
002590170606     A                                      DSPATR(UL)
002600170606     A                                      TEXT('PESO KG DA FATTURARE')
002610170606     A            V1CNCP         5Y 0O 22 17DSPATR(HI)
002620170606     A                                      DSPATR(UL)
002630170606     A                                      EDTCDE(Z)
002640170606     A                                      TEXT('COLLI RILEVATI PER VOLUME CML-
002650170606     A                                      ')
002660170606     A            V0CPKF         7Y 1O 21 24DSPATR(HI)
002670170606     A                                      EDTCDE(4)
002680170606     A                                      DSPATR(UL)
002690170606     A                                      TEXT('PESO KG DA FATTURARE')
002700170606     A            V0CFPF         1A  O 21 33DSPATR(HI)
002710170606     A                                      DSPATR(UL)
002720170606     A            V0CPESO        7Y 1O 21 35DSPATR(HI)
002730170606     A                                      EDTCDE(4)
002740170606     A                                      DSPATR(UL)
002750170606     A                                      TEXT('PESO KG DA FATTURARE')
002760170606     A            V1CFVB         1A  O 21 45DSPATR(HI)
002770170606     A                                      DSPATR(UL)
002780170606     A                                      TEXT('FLAG VOLUME BOLLETTATO')
002790170606     A            V1CVLB         5Y 3O 21 47DSPATR(HI)
002800170606     A                                      DSPATR(UL)
002810170606     A                                      EDTCDE(2)
002820170606     A                                      TEXT('VOLUME BOLLETTATO')
002830170606     A            V1CVLC         5Y 3O 21 55DSPATR(HI)
002840170606     A                                      DSPATR(UL)
002850170606     A                                      EDTCDE(4)
002860170606     A                                      TEXT('VOLUME CML')
002870170606     A            V1CNCR         5Y 0O 22 56DSPATR(HI)
002880170606     A                                      DSPATR(UL)
002890170606     A                                      EDTCDE(Z)
002900170606     A                                      TEXT('COLLI RILEVATI PER VOLUME CML-
002910170606     A                                      ')
002920170606     A            V0CFVOLU       1A  O 21 73DSPATR(HI)
002930170606     A                                      DSPATR(UL)
002940170606     A                                      TEXT('FLAG VOLUME DA FATTURARE')
002950170606     A            V0CVOLU        5Y 3O 21 75DSPATR(HI)
002960170606     A                                      DSPATR(UL)
002970170606     A                                      EDTCDE(4)
002980170606     A                                      TEXT('VOLUME DA FATTURARE')
002990170606     A  71        V1DLEG        20A  O 18  2DSPATR(RI)
003000170606     A  71        V1CLEG         1A  B 18 23DSPATR(HI)
003010170606     A                                 16 14'LNP Serie Numero Segnacolli'
003020170606     A                                 16  2'COLLI'
003030170606     A  70                             22 38'?'
003040170606     A            V0CVLF         5Y 3O 21 65DSPATR(HI)
003050170606     A                                      DSPATR(UL)
003060170606     A                                      EDTCDE(4)
003070170606     A                                      TEXT('VOLUME DA FATTURARE')
003080170606     A            V0CFVF         1A  O 21 63DSPATR(HI)
003090170606     A                                      DSPATR(UL)
003100170606     A                                      TEXT('FLAG VOLUME DA FATTURARE')
003110170606     A                                 22 13'Ril'
003120170606     A                                 22 52'Ril'
003130170606     A                                 19  2'-------------- P   E   S   O ------
003140170606     A                                      -------|------- V   O   L   U   M  -
003150170606     A                                       E -------'
003160040119     A*------------------------------------*
003170170612     A          R SB51D07
003180170612     A*%%TS  SD  20170612  142757  EDPRM       REL-V7R2M0  5770-WDS
003190170612     A                                      INVITE
003200170612     A                                      OVERLAY
003210170612     A                                  3  2'SPEDIZIONE:'
003220170612     A                                      DSPATR(UL)
003230170612     A            V0CLNP         3S 0O  3 15DSPATR(HI)
003240170612     A                                      DSPATR(UL)
003250170612     A                                      TEXT('FILIALE PARTENZA')
003260170612     A            V0CNRS         2Y 0O  3 20DSPATR(UL)
003270170612     A                                      DSPATR(HI)
003280170612     A                                      EDTCDE(Z)
003290170612     A                                      TEXT('NUMERO SERIE')
003300170612     A                                  3 23'-'
003310170612     A            V0CNSP         7Y 0O  3 25DSPATR(HI)
003320170612     A                                      EDTCDE(2)
003330170612     A                                      DSPATR(UL)
003340170612     A                                      TEXT('NUMERO SPEDIZIONE')
003350170612     A                                  3 37'Del'
003360170612     A            V0CDSP         8Y 0O  3 43TEXT('DATA SPEDIZIONE')
003370170612     A                                      DSPATR(HI)
003380170612     A                                      EDTWRD('  /  /    ')
003390170612     A                                      DSPATR(UL)
003400170612     A            V0DTSP        10A  O  3 56TEXT('TIPO SERVIZIO BOLLA')
003410170612     A                                      DSPATR(HI)
003420170612     A            V0DSTS        12A  O  3 69DSPATR(RI)
003430170612     A                                  4  2'Linea Arrivo'
003440170612     A            V0CLNA         3S 0O  4 15TEXT('FILIALE ARRIVO')
003450170612     A                                      DSPATR(HI)
003460170612     A            V0DLNA        15A  O  4 19DSPATR(HI)
003470170612     A                                      TEXT('DESCRIZIONE FILIALE')
003480170612     A                                  4 37'Tipo Bolla'
003490170612     A            V0CTBL         2A  O  4 51DSPATR(HI)
003500170612     A                                      TEXT('CODICE BOLLA')
003510170612     A            V0DTBL        20A  O  4 54DSPATR(HI)
003520170612     A                                      TEXT('DESCRIZIONE')
003530170612     A                                  5  2'Linea Part.'
003540170612     A            V7CLNP         3S 0O  5 15TEXT('FILIALE ARRIVO')
003550170612     A                                      DSPATR(HI)
003560170612     A            V7DLNP        15A  O  5 19DSPATR(HI)
003570170612     A                                      TEXT('DESCRIZIONE FILIALE')
003580170612     A                                  5 37'Codice Bolla'
003590170612     A            V7CCBO         2A  O  5 51DSPATR(HI)
003600170612     A                                      TEXT('CODICE BOLLA')
003610170612     A            V7DCBO        25A  O  5 54DSPATR(HI)
003620170612     A                                      TEXT('DESCRIZIONE')
003630170612     A                                  6  2'Terminal Par'
003640170612     A            V7CTFP         3Y 0O  6 15DSPATR(HI)
003650170612     A                                      TEXT('FILIALE ARRIVO')
003660170612     A            V7DTFP        15A  O  6 19DSPATR(HI)
003670170612     A                                      TEXT('DESCRIZIONE FILIALE')
003680170612     A                                  6 37'Terminal Arr'
003690170612     A            V7CTFA         3Y 0O  6 50DSPATR(HI)
003700170612     A                                      TEXT('FILIALE ARRIVO')
003710170612     A            V7DTFA        15A  O  6 54DSPATR(HI)
003720170612     A                                      TEXT('DESCRIZIONE FILIALE')
003730170612     A  09                              7  2'F9=Transiti'
003740170612     A                                      DSPATR(RI)
003750170612     A                                  8  2'Mittente'
003760170612     A            V7CRSM        48A  O  8 12DSPATR(HI)
003770170612     A                                      DSPATR(UL)
003780170612     A                                      TEXT('RAG.SOCIALE MITTENTE 1')
003790170612     A                                  8 65'P.IVA/Cd.Fiscale'
003800170612     A            V0CCCM         7Y 0O  9  2DSPATR(HI)
003810170612     A                                      EDTCDE(Z)
003820170612     A                                      TEXT('COD.CLIENTE SPEDIZIONE')
003830170612     A            V7CINM        35A  O  9 12DSPATR(HI)
003840170612     A                                      DSPATR(UL)
003850170612     A                                      TEXT('INDIRIZZO MITTENTE')
003860170612     A                                  9 51'Anteporto'
003870170612     A            V0CFAP         1A  O  9 61DSPATR(HI)
003880170612     A                                      TEXT('FL.ANTEPORTO: P-PROV BLANK-CI-
003890170612     A                                      TTA'' I=ISOLA')
003900170612     A            V7CPIM        16A  O  9 65DSPATR(HI)
003910170612     A                                      DSPATR(UL)
003920170612     A                                      TEXT('PART.IVA: MITTENTE SE FRANCO -
003930170612     A                                      DESTINAT. SE ASS.TO')
003940170612     A            V0CCAM         9A  O 10 12DSPATR(HI)
003950170612     A                                      DSPATR(UL)
003960170612     A                                      TEXT('CAP MITTENTE')
003970170612     A            V7CLOM        35A  O 10 22DSPATR(HI)
003980170612     A                                      DSPATR(UL)
003990170612     A                                      TEXT('LOCALITA'' MITTENTE')
004000170612     A            V7CPRM         2A  O 10 58DSPATR(HI)
004010170612     A                                      DSPATR(UL)
004020170612     A                                      TEXT('PROVINCIA MITTENTE')
004030170612     A            V7CNZM         3A  O 10 61DSPATR(HI)
004040170612     A                                      DSPATR(UL)
004050170612     A                                      TEXT('NAZIONE MITTENTE')
004060170612     A            V7CDFM        16A  O 10 65DSPATR(UL)
004070170612     A                                      DSPATR(HI)
004080170612     A  51                             11  2'Mittente originale'
004090170612     A  51        V7CRMO        35A  O 11 22DSPATR(HI)
004100170612     A                                      TEXT('INDIRIZZO DESTINATARIO')
004110170612     A                                 12  2'Destinat.'
004120170612     A            V7CRSD        48A  O 12 12DSPATR(HI)
004130170612     A                                      DSPATR(UL)
004140170612     A                                 12 65'P.IVA/Cd.Fiscale'
004150170612     A            V0CCCD         7Y 0O 13  2DSPATR(HI)
004160170612     A                                      EDTCDE(Z)
004170170612     A            V7CIND        35A  O 13 12DSPATR(HI)
004180170612     A                                      DSPATR(UL)
004190170612     A                                      TEXT('INDIRIZZO DESTINATARIO')
004200170612     A                                 13 53'Inoltro'
004210170612     A            V0CFIN         1A  O 13 61DSPATR(HI)
004220170612     A                                      TEXT('FL.INOLTRO  : P-PROV BLANK-CI-
004230170612     A                                      TTA'' I=ISOLA')
004240170612     A            V7CPID        16A  O 13 65DSPATR(HI)
004250170612     A                                      DSPATR(UL)
004260170612     A                                      TEXT('PART.IVA: MITTENTE SE FRANCO -
004270170612     A                                      DESTINAT. SE ASS.TO')
004280170612     A            V0CCAD         9A  O 14 12DSPATR(HI)
004290170612     A                                      DSPATR(UL)
004300170612     A                                      TEXT('CAP DESTINATARIO')
004310170612     A            V7CLOD        35A  O 14 22DSPATR(HI)
004320170612     A                                      DSPATR(UL)
004330170612     A                                      TEXT('LOCALITA'' DESTINATARIO')
004340170612     A            V7CPRD         2A  O 14 58DSPATR(HI)
004350170612     A                                      DSPATR(UL)
004360170612     A                                      TEXT('PROVINCIA DESTINATARIO')
004370170612     A            V0CNZD         3A  O 14 61DSPATR(HI)
004380170612     A                                      DSPATR(UL)
004390170612     A                                      TEXT('NAZIONE DESTINATARIO')
004400170612     A            V7CDFD        16A  O 14 65DSPATR(HI)
004410170612     A                                      DSPATR(UL)
004420170612     A                                 15  2'Referente consegna'
004430170612     A            V7CREF        35A  O 15 22DSPATR(UL)
004440170612     A                                      DSPATR(HI)
004450170612     A                                 15 61'Tel'
004460170612     A            V7CTELD       16A  O 15 65DSPATR(HI)
004470170612     A                                      DSPATR(UL)
004480170612     A                                 16  2'Immissione bolla'
004490170612     A            V7CSOP         1A  O 16 61DSPATR(HI)
004500170612     A                                      TEXT('SIGLA OPERATORE VIDEO')
004510170612     A  66        V7CPRU        10A  O 16 22DSPATR(HI)
004520170612     A  66        V7CNMTD       10A  O 16 33DSPATR(HI)
004530170612     A                                 16 63'Tratt.Merce'
004540170612     A            V7CCTM         2A  O 16 79DSPATR(HI)
004550170612     A                                      TEXT('COD.TRATTAMENTO MERCE')
004560170612     A  73        V7DFFR         2A  O  7 51DSPATR(HI)
004570170612     A  74                             17 25'Bancali'
004580170612     A  74        V0CNBA         2Y 0O 17 33DSPATR(HI)
004590170612     A  74                                  DSPATR(UL)
004600170612     A                                      EDTCDE(Z)
004610170612     A  74        V0DTBA        10A  O 17 36DSPATR(HI)
004620170612     A  74                                  DSPATR(UL)
004630170612     A  74                             17 47'/'
004640170612     A  74        V0CNB2         2Y 0O 17 49DSPATR(HI)
004650170612     A  74                                  DSPATR(UL)
004660170612     A                                      EDTCDE(Z)
004670170612     A  74        V0DTB2        10A  O 17 52DSPATR(HI)
004680170612     A  74                                  DSPATR(UL)
004690170612     A                                 17 63'DDT Cliente'
004700170612     A            V7DDDT         2A  O 17 79DSPATR(HI)
004710170612     A                                 17  2'Emessa Nota Accr.'
004720170612     A            V7DFA2         2A  O 17 21DSPATR(HI)
004730170612     A  65                             18 33'Alert Destinatario'
004740170612     A  65        V7CEMD         2A  O 18 52DSPATR(HI)
004750170612     A                                 18 63'Bolla Rientro'
004760170612     A            V7DFBR         2A  O 18 79DSPATR(HI)
004770170612     A                                      TEXT('S=BOLLA RIENTRO')
004780170612     A                                 19  2'Note'
004790170612     A N58                                  DSPATR(ND)
004800170612     A            V7DNT1        35A  O 19 10DSPATR(HI)
004810170612     A            V7DNT2        35A  O 19 46DSPATR(HI)
004820170612     A  67                             20  2'Restituz. Documenti al Mitt:(?)'
004830170612     A                                 20 57'---- Particolarita'' ----'
004840170612     A                                 21  2'Importo da Assicurare'
004850170612     A                                 21 57'Giacenza'
004860170612     A                                 21 66'Consegna'
004870170612     A                                 21 75'Varie'
004880170612     A            V7CIAS        13Y 3O 22  2DSPATR(HI)
004890170612     A                                      EDTCDE(2)
004900170612     A                                      TEXT('IMPORTO DA ASSICURARE')
004910170612     A            V7CVAS         3A  O 22 20DSPATR(HI)
004920170612     A                                      TEXT('DIVISA IMPORTO DA ASSICURARE')
004930170612     A  50                             22 24'Inserito in'
004940170612     A  50                             22 36'Fatturazione'
004950170612     A  45                             22 58'?'
004960170612     A  45        V7IGGA         1A  B 22 60VALUES(' ' '?')
004970170612     A            V7CGGA         2A  O 22 62DSPATR(HI)
004980170612     A                                      TEXT('GESTIONE PARTICOLARITA'' GIAC-
004990170612     A                                      ENZA')
005000170612     A  46                             22 67'?'
005010170612     A  46        V7IGMA         1A  B 22 69VALUES(' ' '?')
005020170612     A            V7CGMA         2A  O 22 71DSPATR(HI)
005030170612     A                                      TEXT('GESTIONE PARTICOLARITA'' CONS-
005040170612     A                                      EGNA')
005050170612     A  47                             22 75'?'
005060170612     A  47        V7IGVA         1A  B 22 77VALUES(' ' '?')
005070170612     A            V7CGVA         2A  O 22 79DSPATR(HI)
005080170612     A                                      TEXT('GESTIONE PARTICOLARITA'' VARI-
005090170612     A                                      E')
005100170612     A  67        V7IDOC         1A  B 20 34DSPATR(HI)
005110170612     A  73                              7 37'Fr. Frontiera'
005120170612     A            V1CNAS        15A  O 18  8DSPATR(HI)
005130170612     A                                 18  2'Merce'
005140170612     A                                 16 45'Sigla operatore'
005150170612     A  65        V7IEMD         1A  B 18 57VALUES(' ' '?')
005160170612     A  65                             18 55'?'
005170040603     A*         R SB51S11                   SFL
005180040608     A          R SB51S09                   SFL
005190040608     A*%%TS  SD  20040608  144909  EDPMB       REL-V4R4M0  5769-PW1
005200040608     A            V09FIL         3S 0O  8  2DSPATR(HI)
005210040608     A            V09DFL        20A  O  8  7
005220040608     A            V09DET         8  0O  8 30EDTCDE(Y)
005230040608     A  48                                  DSPATR(ND)
005240040608     A            V09DUT         8  0O  8 45EDTCDE(Y)
005250040608     A  49                                  DSPATR(ND)
005260040603     A*         R SB51C11                   SFLCTL(SB51S11)
005270040603     A          R SB51C09                   SFLCTL(SB51S09)
005280040603     A*%%TS  SD  20040603  125055  EDPMB       REL-V4R4M0  5769-PW1
005290120302     A  26                                  INVITE
005300040603     A                                      OVERLAY
005310040603     A  25                                  SFLDSP
005320040603     A  26                                  SFLDSPCTL
005330040603     A N26                                  SFLCLR
005340040603     A                                      SFLSIZ(0016)
005350040603     A                                      SFLPAG(0015)
005360040603     A                                  7  2'P.O. Transito               Data E-
005370040603     A                                      ntrata   Data Uscita               -
005380040603     A                                                '
005390040603     A                                      DSPATR(UL)
005400040603     A                                      DSPATR(HI)
005410040119     A*------------------------------------*
005420170517     A          R SB51T10
005430170517     A*%%TS  SD  20170517  125136  EDPRM       REL-V7R2M0  5770-WDS
005440170517     A            RSUT          20A  O  1  2
005450170517     A            VTCPGM        10A  O  1 60
005460170517     A                                  1 72DATE
005470170517     A                                      EDTCDE(Y)
005480170517     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
005490170517     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
005500170517     A                                  2 72TIME
005510170517     A            V0DSTS        12A  O  3 68DSPATR(RI)
005520170517     A                                  4  2'SPEDIZIONE:'
005530170517     A                                      DSPATR(UL)
005540170517     A            V0CLNP         3S 0O  4 15DSPATR(HI)
005550170517     A                                      DSPATR(UL)
005560170517     A                                      TEXT('FILIALE PARTENZA')
005570170517     A            V0CNRS         2Y 0O  4 20EDTCDE(Z)
005580170517     A                                      DSPATR(HI)
005590170517     A                                      DSPATR(UL)
005600170517     A                                      TEXT('NUMERO SERIE')
005610170517     A                                  4 23'-'
005620170517     A            V0CNSP         7Y 0O  4 25DSPATR(HI)
005630170517     A                                      EDTCDE(2)
005640170517     A                                      DSPATR(UL)
005650170517     A                                      TEXT('NUMERO SPEDIZIONE')
005660170517     A                                  4 36'del'
005670170517     A            V0CDSP         8Y 0O  4 41EDTWRD('  /  /    ')
005680170517     A                                      DSPATR(HI)
005690170517     A                                      TEXT('DATA SPEDIZIONE (GG/MM/AAAA)')
005700170517     A                                  4 55'Tipo Bolla'
005710170517     A                                  5  2'Linea Arrivo'
005720170517     A            V0CLNA         3Y 0O  5 15DSPATR(HI)
005730170517     A                                      EDTCDE(Z)
005740170517     A                                      TEXT('FILIALE ARRIVO')
005750170517     A            V0DLNA        15A  O  5 19DSPATR(HI)
005760170517     A                                      TEXT('DESCRIZIONE LINEA DI ARRIVO')
005770170517     A                                  5 36'Cli.Fatt.'
005780170517     A            VTCKSC         8Y 0O  5 46DSPATR(HI)
005790170517     A                                      EDTCDE(Z)
005800170517     A            VTDKSC        24A  O  5 55DSPATR(HI)
005810170517     A                                      TEXT('RAGIONE SOCIALE DESTINATARIO')
005820170517     A            V0CTBL         2A  O  4 66DSPATR(HI)
005830170517     A            V0DTB1        11A  O  4 69DSPATR(HI)
005840170517     A            V1CTIT        30   O  1 26DSPATR(RI)
005850170517     A                                      DSPATR(UL)
005860040119      *------------------------------------*
005870030402     A          R SB51S11                   SFL
005880030402     A            V11AAC         4S 0H
005890030402     A            V11SCE         1A  B  8  2DSPATR(HI)
005900030402     A                                      VALUES('5' ' ')
005910030402     A            V11FIL         3S 0O  8  4DSPATR(HI)
005920030402     A            V11NCA         7Y 0O  8  8DSPATR(HI)
005930030402     A                                      EDTCDE(Z)
005940030402     A            V11DCA        10A  O  8 17
005950030402     A            V11FCA         3S 0O  8 29
005960030402     A            V11DFA        48A  O  8 33
005970040119      *------------------------------------*
005980010221     A          R SB51C11                   SFLCTL(SB51S11)
005990120302     A  26                                  INVITE
006000010221     A                                      OVERLAY
006010010221     A  25                                  SFLDSP
006020010221     A  26                                  SFLDSPCTL
006030010221     A N26                                  SFLCLR
006040010221     A                                      SFLSIZ(0016)
006050010221     A                                      SFLPAG(0015)
006060010221     A                                  7  2'5|Comunicazione Anomalia |  F a s -
006070010221     A                                      e                                  -
006080010221     A                                               |'
006090010221     A                                      DSPATR(UL)
006100010221     A                                      DSPATR(HI)
006110040119     A*------------------------------------*
006120091210     A          R SB51D12
006130091210     A*%%TS  SD  20091210  103018  EDPES       REL-V5R4M0  5722-WDS
006140120302     A                                      INVITE
006150091210     A                                      OVERLAY
006160091210     A                                  7  2'Ritiro merce'
006170091210     A            V12DRT        10A  O  7 26DSPATR(HI)
006180091210     A                                  7 38'Numero'
006190091210     A            V12NRT         1Y 0O  7 45DSPATR(HI)
006200091210     A            V12FPP        10A  O  7 47DSPATR(HI)
006210091210     A                                  7 59'Portata a magazz.'
006220091210     A            V0DFDN         2A  O  7 77DSPATR(HI)
006230091210     A                                  8  2'Numero ORM'
006240091210     A            V12POE         3A  O  8 19DSPATR(HI)
006250091210     A            V12NSR         2Y 0O  8 23DSPATR(HI)
006260091210     A                                      EDTCDE(Z)
006270091210     A            V12NOR         7Y 0O  8 26DSPATR(HI)
006280091210     A                                      EDTCDE(Z)
006290091210     A            V12NRV         2Y 0O  8 34DSPATR(HI)
006300091210     A                                      EDTCDE(Z)
006310091210     A                                  8 38'Nr.Stop'
006320091210     A            V12STR         5Y 0O  8 46DSPATR(HI)
006330091210     A                                      EDTCDE(Z)
006340091210     A                                  8 52'Autotr'
006350091210     A            V12PDR         7Y 0O  8 59DSPATR(HI)
006360091210     A                                      EDTCDE(Z)
006370091210     A            V12RS1        12A  O  8 67DSPATR(HI)
006380091210     A                                  9  2'Immissione bolla'
006390091210     A            V12DIM        10A  O  9 26DSPATR(HI)
006400091210     A                                  9 38'Data Bordero'''
006410091210     A            V12DBR        10A  O  9 59DSPATR(HI)
006420091210     A                                 10  2'Partenza ultimo collo'
006430091210     A            V12DUC        10A  O 10 26DSPATR(HI)
006440091210     A                                 10 38'Arrivo merce TermArr'
006450091210     A            V12DTI        10A  O 10 59DSPATR(HI)
006460091210     A  42        V12HTI         4Y 0O 10 71DSPATR(HI)
006470091210     A                                      EDTWRD('0 :  ')
006480091210     A                                      TEXT('ORA ARRIVO REALE TRAZIONE')
006490091210     A  59                             11  2'Data invio partner'
006500091210     A  59        V12DMF        10A  O 11 26DSPATR(HI)
006510091210     A                                 11 38'Arrivo merce Fil.Arr'
006520091210     A            V12ARRED      10A  O 11 59DSPATR(HI)
006530091211     A  60        V12ARREH       4Y 0O 11 71DSPATR(HI)
006540091210     A                                      EDTWRD('0 :  ')
006550091210     A                                      TEXT('ORA ARRIVO REALE TRAZIONE')
006560091210     A                                 12  2'Consegna Richiesta'
006570091210     A            V12TCR        11A  O 12 26DSPATR(HI)
006580091210     A            V12DCR        10A  O 12 38DSPATR(HI)
006590091210     A  43        V12HCR         4Y 0O 12 50DSPATR(HI)
006600091210     A                                      EDTWRD('  :  ')
006610091210     A                                      TEXT('ORA CONSEGNA RICHIESTA')
006620091210     A                                 13  2'Prima Conseg. Parziale'
006630091210     A            V0CDCP        10A  O 13 26DSPATR(HI)
006640091210     A                                 13 38'Consegna anomala'
006650091210     A            V0CCCA         1A  O 13 56DSPATR(HI)
006660091210     A                                      TEXT('CODICE CONSEGNA ANOMALA')
006670091210     A            V0DCCA        20A  O 13 59DSPATR(HI)
006680091210     A                                      TEXT('DESCRIZIONE ITALIANO')
006690091210     A                                 15  2'CONSEGNA REALE'
006700091210     A                                      DSPATR(HI)
006710091210     A                                      DSPATR(UL)
006720091210     A            V0CDCM        10A  O 15 26DSPATR(HI)
006730091210     A  40        V0CHMC         4Y 0O 15 38EDTWRD('  :  ')
006740091210     A                                      DSPATR(HI)
006750091210     A                                      TEXT('ORA CONSEGNA MERCE (REALE)')
006760091210     A                                 15 59'Fermo Deposito'
006770091210     A            V0DFFD         3A  O 15 76DSPATR(HI)
006780091210     A                                 16  2'Distinta'
006790091210     A            V0CNDC         7Y 0O 16 12DSPATR(HI)
006800091210     A                                      EDTCDE(Z)
006810091210     A                                 16 21'del'
006820091210     A            V0CDDC        10A  O 16 26DSPATR(HI)
006830091210     A                                 16 38'Nr.Stop'
006840091210     A            V12STP         5Y 0O 16 46DSPATR(HI)
006850091210     A                                      EDTCDE(Z)
006860091210     A                                 16 52'Autotr'
006870091210     A            V12PDC         7Y 0O 16 59DSPATR(HI)
006880091210     A                                      EDTCDE(Z)
006890091210     A            V12RS2        12A  O 16 67DSPATR(HI)
006900091210     A                                 18  2'-Consegna Teorica-'
006910091210     A                                 18 28'---------------- Affidabilita'' ---
006920091210     A                                      --------------'
006930091210     A            V12DCE        10A  O 19  2DSPATR(HI)
006940091210     A  44        V12HCE         4Y 0O 19 15DSPATR(HI)
006950091210     A                                      EDTWRD('  :  ')
006960091210     A                                      TEXT('ORA CONSEGNA RICHIESTA')
006970091210     A                                 19 28'Partenza'
006980091210     A N99        V12NPI         3Y 0O 19 38DSPATR(HI)
006990091210     A                                      EDTCDE(L)
007000091210     A                                      TEXT('ORE NON CONF.PART. INTERNE')
007010091210     A                                 19 45'Cliente'
007020091210     A N99        V12NRC         3Y 0O 19 54DSPATR(HI)
007030091210     A                                      EDTCDE(L)
007040091210     A                                      TEXT('ORE NON CONF.RESA  CLIENTE')
007050091210     A                                 19 61'Consegna'
007060091210     A N99        V12NCI         3Y 0O 19 71DSPATR(HI)
007070091210     A                                      EDTCDE(L)
007080091210     A                                      TEXT('ORE NON CONF.CONS. INTERNE')
007090091210     A                                 21  2'Giorni chiusura'
007100091210     A                                 21 20'-------------------- Consegne Part-
007110091210     A                                      icolari -----------------'
007120091210     A            V12GC1         2A  O 22  5DSPATR(HI)
007130091210     A            V12GC2         2A  O 22 11DSPATR(HI)
007140091210     A            V12FTC         1A  O 22 20DSPATR(HI)
007150091210     A                                      TEXT('1 CONSEGNA PARTICOLARE')
007160091210     A            V12DTC        25A  O 22 23DSPATR(HI)
007170091210     A                                      TEXT('DESCRIZIONE')
007180091210     A            V12TC2         1A  O 22 51DSPATR(HI)
007190091210     A                                      TEXT('1 CONSEGNA PARTICOLARE')
007200091210     A            V12DC2        25A  O 22 54DSPATR(HI)
007210091210     A                                      TEXT('DESCRIZIONE')
007220040119     A*------------------------------------*
007230070524     A          R SB51S13                   SFL
007240070524     A*%%TS  SD  20070524  115820  EDPGA       REL-V5R3M0  5722-WDS
007250070524     A            V13SVN         1   O 19  2DSPATR(HI)
007260070524     A                                      TEXT('SIGLA VARIE 1')
007270070524     A  64                                  DSPATR(RI)
007280070524     A            V13VAN        13   O 19  4DSPATR(HI)
007290070524     A  64                                  DSPATR(RI)
007300070524     A            V13DSV        20A  O 19 18TEXT('DESCRIZIONE')
007310040119     A*------------------------------------*
007320170522     A          R SB51C13                   SFLCTL(SB51S13)
007330170522     A*%%TS  SD  20170522  094351  EDPRM       REL-V7R2M0  5770-WDS
007340170522     A  *DS3                                SFLLIN(0006)
007350170522     A                                      SFLSIZ(0008)
007360170522     A                                      SFLPAG(0007)
007370170522     A  26                                  INVITE
007380170522     A                                      OVERLAY
007390170522     A                                      SFLCSRRRN(&V13NRR)
007400170522     A  25                                  SFLDSP
007410170522     A  26                                  SFLDSPCTL
007420170522     A N26                                  SFLCLR
007430170522     A  25                                  SFLEND
007440170522     A            V13NRR         5S 0H
007450170522     A                                  6  2'----- Valori Fatturati ----'
007460170522     A                                  6 32'Portata a Magazzino'
007470170522     A            V0DFDN         2A  O  6 52DSPATR(HI)
007480170522     A                                  6 57'Fatturata Tar.Mitt.'
007490170522     A            V13FTM         2A  O  6 78DSPATR(HI)
007500170522     A                                  7  7'Peso'
007510170522     A            V0CFPF         1A  O  7 16DSPATR(HI)
007520170522     A                                      DSPATR(UL)
007530170522     A            V13PESO        7Y 1O  7 18DSPATR(HI)
007540170522     A                                      EDTCDE(2)
007550170522     A                                      TEXT('PESO KG DA FATTURARE')
007560170522     A                                      DSPATR(UL)
007570170522     A                                  7 32'Fermo Deposito'
007580170522     A            V0DFFD         3A  O  7 52DSPATR(HI)
007590170522     A                                  7 57'Peso Tassabile'
007600170522     A            V13PVL         5Y 0O  7 75DSPATR(HI)
007610170522     A                                      EDTCDE(Z)
007620170522     A                                  8  6'Colli'
007630170522     A            V0CNCL         5Y 0O  8 21DSPATR(HI)
007640170522     A                                      EDTCDE(2)
007650170522     A                                      TEXT('NUMERO COLLI')
007660170522     A                                      DSPATR(UL)
007670170522     A                                  8 32'-- Nazione/CAP Fat. --'
007680170522     A                                  8 57'-- Codice Tassazione --'
007690170522     A                                  9  5'Volume'
007700170522     A            V0CFVF         1A  O  9 16DSPATR(HI)
007710170522     A                                      TEXT('FLAG VOLUME DA FATTURARE')
007720170522     A                                      DSPATR(UL)
007730170522     A            V0CVLF         5Y 3O  9 21DSPATR(HI)
007740170522     A                                      EDTCDE(4)
007750170522     A                                      TEXT('VOLUME DA FATTURARE')
007760170522     A                                      DSPATR(UL)
007770170522     A                                  9 32'Mitt'
007780170522     A            V13NZM         3A  O  9 37DSPATR(HI)
007790170522     A                                  9 41'/'
007800170522     A            V13CAM         9A  O  9 43DSPATR(HI)
007810170522     A            V0CFAP         1A  O  9 53DSPATR(HI)
007820170522     A                                  9 57'Mitt'
007830170522     A            V13MCT         2A  O  9 62DSPATR(HI)
007840170522     A                                      TEXT('CODICE TASSAZIONE')
007850170522     A            V13DMT        15A  O  9 65TEXT('DESCRIZIONE')
007860170522     A                                 10  2'Quantita'''
007870170522     A            V13QFT        13Y 3O 10 12DSPATR(HI)
007880170522     A                                      EDTCDE(2)
007890170522     A                                      TEXT('QUANTITA DA FATTURARE')
007900170522     A                                      DSPATR(UL)
007910170522     A                                 10 32'Dest'
007920170522     A            V0CNZD         3A  O 10 37DSPATR(HI)
007930170522     A                                 10 41'/'
007940170522     A            V0CCAD         9A  O 10 43DSPATR(HI)
007950170522     A            V0CFIN         1A  O 10 53DSPATR(HI)
007960170522     A                                 10 57'Dest'
007970170522     A            V13CTS         2A  O 10 62DSPATR(HI)
007980170522     A                                      TEXT('CODICE TASSAZIONE')
007990170522     A            V13DCT        15A  O 10 65TEXT('DESCRIZIONE')
008000170522     A                                 12  2'--- Tariffa ---'
008010170522     A  72                             12 18'Vedi Docum.'
008020170522     A                                 12 30'Divisa'
008030170522     A                                 12 41'Importo / L.IVA / Numero / Data FA-
008040170522     A                                      TTURA'
008050170522     A            V13CTR         3S 0O 13  2DSPATR(HI)
008060170522     A            V13DTR        11A  O 13  6
008070170522     A  72        V13OTTICO      1A  B 13 23DSPATR(HI)
008080170522     A                                      VALUES(' ' '?')
008090170522     A N72                                  DSPATR(PR)
008100170522     A            V13DIV         3A  O 13 31DSPATR(RI)
008110170522     A            V13IFT        13A  O 13 36DSPATR(HI)
008120170522     A            V0CFIV         3Y 0O 13 52DSPATR(HI)
008130170522     A                                      EDTCDE(Z)
008140170522     A                                      TEXT('COD.FILIALE IVA')
008150170522     A            V0CNFT         6Y 0O 13 58DSPATR(HI)
008160170522     A                                      EDTCDE(2)
008170170522     A                                      TEXT('NUMERO FATTURA')
008180170522     A            V0CDFT        10A  O 13 69DSPATR(HI)
008190170522     A                                 15  6'Trasporto'
008200170522     A                                 15 22'Tot.Imponibile'
008210170522     A                                 15 46'I.V.A.'
008220170522     A                                 15 57'Esenzione I.V.A.'
008230170522     A            V13POR        13A  O 16  2DSPATR(HI)
008240170522     A  61                                  DSPATR(RI)
008250170522     A            V13IMV        13A  O 16 23DSPATR(HI)
008260170522     A  62                                  DSPATR(RI)
008270170522     A            V13IVA        13A  O 16 39DSPATR(HI)
008280170522     A  63                                  DSPATR(RI)
008290170522     A            V13FEI         1A  O 16 57DSPATR(HI)
008300170522     A                                      TEXT('CODICE ESENZIONE IVA')
008310170522     A            V13DEI        20A  O 16 60TEXT('DESCRIZIONE')
008320170522     A                                 18  2'-------------- Varie --------------
008330170522     A                                      --'
008340170522     A                                 18 44'-------------- Varie --------------
008350170522     A                                      --'
008360170522     A  72                             13 21'?'
008370040119      *------------------------------------*
008380000417     A          R SB51S21                   SFL
008390000417     A            V21FLS         3S 0O  9  2DSPATR(HI)
008400000417     A            V21NSC         7Y 0O  9  6DSPATR(HI)
008410000417     A                                      EDTCDE(Z)
008420000417     A            V21DCM        10A  O  9 15
008430040119      *------------------------------------*
008440010221     A          R SB51C21                   SFLCTL(SB51S21)
008450120302     A  26                                  INVITE
008460010221     A                                      OVERLAY
008470010221     A  25                                  SFLDSP
008480010221     A  26                                  SFLDSPCTL
008490010221     A N26                                  SFLCLR
008500010221     A                                      SFLSIZ(0042)
008510010221     A                                      SFLPAG(0041)
008520010221     A  *DS3                                SFLLIN(0004)
008530010221     A                                  7  1'| SEGNACOLLO |   DATA   |'
008540010221     A                                  7 28'| SEGNACOLLO |   DATA   |'
008550010221     A                                  7 55'| SEGNACOLLO |   DATA   |'
008560010221     A                                  8  1'|P.O. Numero | CONSEGNA |'
008570010221     A                                      DSPATR(UL)
008580010221     A                                  8 28'|P.O. Numero | CONSEGNA |'
008590010221     A                                      DSPATR(UL)
008600010221     A                                  8 55'|P.O. Numero | CONSEGNA |'
008610010221     A                                      DSPATR(UL)
008620040119      *------------------------------------*
008630010524     A          R SB51S08                   SFL
008640010524     A            V08NOT        35A  O  8 23DSPATR(HI)
008650010524     A            V08NSC         7Y 0O  8 10DSPATR(HI)
008660010524     A                                      EDTCDE(Z)
008670040119      *------------------------------------*
008680010525     A          R SB51C08                   SFLCTL(SB51S08)
008690010525     A                                      SFLSIZ(0160)
008700010525     A                                      SFLPAG(0015)
008710120302     A  26                                  INVITE
008720010525     A                                      OVERLAY
008730010525     A  25                                  SFLDSP
008740010525     A  26                                  SFLDSPCTL
008750010525     A N26                                  SFLCLR
008760010525     A                                  7  8'SEGNACOLLO     CODICE "CHI SONO"  -
008770010525     A                                                      '
008780010525     A                                      DSPATR(UL)
008790040119      *------------------------------------*
008800020226     A          R SB51S23                   SFL
008810020226     A            V23NOT        35A  O  8 23DSPATR(HI)
008820020226     A            V23NSC         7Y 0O  8 10DSPATR(HI)
008830020226     A                                      EDTCDE(Z)
008840040119      *------------------------------------*
008850020226     A          R SB51C23                   SFLCTL(SB51S23)
008860120302     A  26                                  INVITE
008870020226     A                                      OVERLAY
008880020226     A  25                                  SFLDSP
008890020226     A  26                                  SFLDSPCTL
008900020226     A N26                                  SFLCLR
008910020226     A                                      SFLSIZ(0160)
008920020226     A                                      SFLPAG(0015)
008930020226     A                                  7  8'SEGNACOLLO     AWB FEDEX          -
008940020226     A                                                      '
008950020226     A                                      DSPATR(UL)
008960040119      *------------------------------------*
008970030408     A          R SB51S18                   SFL
008980030408     A            V18FLG         1A  H
008990030408     A            V18AAP    R        O  9  2REFFLD(LBLAAP FNLBL00F)
009000030408     A  53                                  DSPATR(RI)
009010030408     A                                      DSPATR(UL)
009020030408     A                                      EDTCDE(Z)
009030030408     A            V18LPP    R        O  9  7REFFLD(LBLLPP FNLBL00F)
009040030408     A  53                                  DSPATR(RI)
009050030408     A                                      DSPATR(UL)
009060030408     A            V18NRP    R        O  9 11REFFLD(LBLNRP FNLBL00F)
009070030408     A  53                                  DSPATR(RI)
009080030408     A                                      DSPATR(UL)
009090030408     A                                      EDTCDE(Z)
009100030408     A            V18NSP    R        O  9 14REFFLD(LBLNSP FNLBL00F)
009110030408     A  53                                  DSPATR(RI)
009120030408     A                                      DSPATR(UL)
009130030408     A                                      EDTCDE(Z)
009140030408     A            V18LAP    R        O  9 22REFFLD(LBLLAP FNLBL00F)
009150030408     A  53                                  DSPATR(RI)
009160030408     A                                      DSPATR(UL)
009170030408     A            V18AAN    R        O  9 29REFFLD(LBLAAN FNLBL00F)
009180030408     A  54                                  DSPATR(ND)
009190030408     A  55                                  DSPATR(RI)
009200030408     A                                      DSPATR(UL)
009210030408     A                                      EDTCDE(Z)
009220030408     A            V18LPN    R        O  9 34REFFLD(LBLLPN FNLBL00F)
009230030408     A  54                                  DSPATR(ND)
009240030408     A  55                                  DSPATR(RI)
009250030408     A                                      DSPATR(UL)
009260030408     A            V18NRN    R        O  9 38REFFLD(LBLNRN FNLBL00F)
009270030408     A  54                                  DSPATR(ND)
009280030408     A  55                                  DSPATR(RI)
009290030408     A                                      DSPATR(UL)
009300030408     A                                      EDTCDE(Z)
009310030408     A            V18NSN    R        O  9 41REFFLD(LBLNSN FNLBL00F)
009320030408     A  54                                  DSPATR(ND)
009330030408     A  55                                  DSPATR(RI)
009340030408     A                                      DSPATR(UL)
009350030408     A                                      EDTCDE(Z)
009360030408     A            V18LAN    R        O  9 49REFFLD(LBLLAN FNLBL00F)
009370030408     A  54                                  DSPATR(ND)
009380030408     A  55                                  DSPATR(RI)
009390030408     A                                      DSPATR(UL)
009400030408     A            V18PRE         9A  O  9 54
009410030408     A            V18SCE         1A  B  9 65DSPATR(HI)
009420030408     A  56                                  DSPATR(ND)
009430030408     A  56                                  DSPATR(PR)
009440030408     A            V18NPRE       12A  O  9 67
009450040119      *------------------------------------*
009460030402     A          R SB51C18                   SFLCTL(SB51S18)
009470120302     A  26                                  INVITE
009480030402     A                                      OVERLAY
009490030402     A  25                                  SFLDSP
009500030402     A  26                                  SFLDSPCTL
009510030402     A N26                                  SFLCLR
009520030402     A                                      SFLSIZ(0013)
009530030402     A                                      SFLPAG(0012)
009540030402     A                                  7  2'  P R E C E D E N T E  '
009550030402     A                                      DSPATR(UL)
009560030402     A                                  7 29'    S E G U E N T E               '
009570030402     A                                      DSPATR(UL)
009580030402     A                                  8  2'Anno'
009590030402     A                                  8  7'LNP'
009600030402     A                                  8 11'Sr'
009610030402     A                                  8 14'Nr.sped'
009620030402     A                                  8 22'LNA'
009630030402     A                                  8 29'Anno'
009640030402     A                                  8 34'LNP'
009650030402     A                                  8 38'Sr'
009660030402     A                                  8 41'Nr.sped'
009670030402     A                                  8 49'LNA'
009680030402     A                                  7 65'5'
009690030402     A                                      DSPATR(UL)
009700030402     A                                      DSPATR(HI)
009710111007     A          R SB51W01
009720111007     A*%%TS  SD  20111007  122707  EDPRM       REL-V6R1M0  5761-WDS
009730111007     A                                      WINDOW(7 20 8 45)
009740120302     A                                      INVITE
009750111007     A                                      OVERLAY
009760111007     A                                  5 17'premere INVIO per continuare'
009770111007     A                                  3  1'Immagine non visualizzabile. Avvis-
009780111007     A                                      are il CED'
009790111007     A                                      DSPATR(HI)
009800111007     A            W01DES        32A  O  7  1COLOR(BLU)
009810121022     A          R SB51W02
009820121022     A*%%TS  SD  20121022  120855  EDPMB       REL-V6R1M0  5761-WDS
009830121022     A                                      WINDOW(5 10 12 60)
009840121022     A                                      INVITE
009850121022     A                                      OVERLAY
009860121022     A                                  3  1'Data inventario documenti in parte-
009870121022     A                                      nza ....:'
009880121022     A                                  1 12'Documenti da Restituire al Mittent-
009890121022     A                                      e'
009900121022     A                                      DSPATR(HI)
009910121022     A            W02DRDT        8Y 0O  3 45EDTWRD('  /  /    ')
009920121022     A                                      DSPATR(HI)
009930121022     A  69                              5  1'Documenti errati per:'
009940121022     A  69        W02MTVDT       9   O  5 23DSPATR(HI)
009950121022     A  69        W02DDTIL      11   O  5 33
009960121022     A  69        W02DIMTV       8  0O  5 45EDTWRD('  /  /    ')
009970121022     A                                      DSPATR(HI)
009980121022     A  69        W02DMTVDT     40   O  6 15DSPATR(HI)
009990121022     A                                 11 32'Premere INVIO per continuare'
010000121022     A                                  9  1'Data scannerizzazione immagine doc-
010010121022     A                                      umenti..:'
010020121022     A            W02DRID        8Y 0O  9 45EDTWRD('  /  /    ')
010030121022     A                                      DSPATR(HI)
010040121022     A            W02DFSTD      31A  O  4 24DSPATR(HI)
010050121022     A            W02LBL        12A  O 10 43DSPATR(HI)
