000001050530     A*%%***********************************************************************
000002050530     A*%%TS  RD  20050530  152727  EDPRM       REL-V4R4M0  5769-PW1
000003050530     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004050530     A*%%FI       0000000000000000000000000000000000000000000000000
000005050530     A*%%***********************************************************************
000006050530      *----------------------------------------------------------------
000007050530      * COMPILARE CON LUNG. RCD 198 E CPI 15
000008050530      *----------------------------------------------------------------
000009050530      *----------------------------------------------------------------
000010050530     A          R SB65TES
000011050530     A*%%***********************************************************************
000012050530     A*%%RI 00000
000013050530     A*%%***********************************************************************
000014050530     A                                      SPACEA(001)
000015050530     A                                     2
000016050530     A                                      '  Spedizione      '
000017050530     A                                      HIGHLIGHT
000018050530     A                                    +1
000019050530     A                                      '   Data   '
000020050530     A                                      HIGHLIGHT
000021050530     A                                    +1
000022050530     A                                      'Mittente'
000023050530     A                                      HIGHLIGHT
000024050530     A                                   +41
000025050530     A                                      'Località'
000026050530     A                                      HIGHLIGHT
000027050530     A                                   +28
000028050530     A                                      'Riferimenti mittente'
000029050530     A                                      HIGHLIGHT
000030050530     A                                     1
000031050530     A                                      SPACEB(001)
000032050530     A                                      'Anno Lnp Numero'
000033050530     A                                      HIGHLIGHT
000034050530     A                                    +5
000035050530     A                                      '  Ritiro  '
000036050530     A                                      HIGHLIGHT
000037050530     A*%%***********************************************************************
000038050530     A*%%SS                           Data
000039050530     A*%%CL 001                      Ritiro
000040050530     A*%%CL 001
000041050530     A*%%***********************************************************************
000042050530     A          R SB65SPE
000043050530     A*%%***********************************************************************
000044050530     A*%%RI 00000
000045050530     A*%%***********************************************************************
000046050530     A            TASAAS         4S 0O     1
000047050530     A                                      SPACEB(001)
000048050530     A            TASLNP         3S 0O    +1
000049050530     A            TASNRS         2S 0O    +1
000050050530     A                                      EDTCDE(Z)
000051050530     A            TASNSP         7S 0O    +1
000052050530     A                                      EDTCDE(Z)
000053050530     A            PDRT           8S 0O    +1
000054050530     A                                      EDTWRD('  /  /    ')
000055050530     A            PRSM          48A  O    +1
000056050530     A            PLOC          30A  O    +1
000057050530     A            PNAZPR         4A  O    +1
000058050530     A            WSTRRIF       35A  O    +1
000059050530     A*%%***********************************************************************
000060050530     A*%%SS
000061050530     A*%%CL 001
000062050530     A*%%CP+999CRTPRTF
000063050530     A*%%CP+    CPI(15)
000064050530     A*%%CP+    FILE(GAITRAFIL/TNSB65P)
000065050530     A*%%CP+    DEVTYPE(*SCS)
000066050530     A*%%CP     PAGESIZE(*N       198      *N     )
000067050530     A*%%***********************************************************************
