000100960911 BART107SAV: PGM
000200960827
000300960827             DCL        VAR(&RISP) TYPE(*CHAR) LEN(2)
000400960827
000500960911             SNDUSRMSG  MSG('Montare su TAP03 nastro per Salvataggi +
000600960911                          DOC." Poi rispondere: OK. ') VALUES(OK +
000700960911                          NO) DFT(OK) TOMSGQ(QSYSOPR) MSGRPY(&RISP)
000800960827
000900960827             IF         COND(&RISP *NE 'OK') THEN(GOTO CMDLBL(ENDF))
001000960827
001100960912             SAVDLO     DLO(*ALL) DEV(TAP03)
001200960827
001300960913/* RIAVVOLGE IL NASTRO                                        */
001400960913             CHKTAP     DEV(TAP03) ENDOPT(*UNLOAD)
001500960913             MONMSG     MSGID(CPF0000)
001600960911             OVRPRTF    FILE(QPJOBLOG) OUTQ(QDKT) FORMTYPE(BART107) +
001700960827                          SAVE(*YES)
001800960827             DSPJOBLOG  OUTPUT(*PRINT)
001900960827
002000960827 ENDF:       ENDPGM
