000100100524     A          R NDRCA000                  PFILE(NDRCA00F)
000200940318     A*
000300100305     A          K RCASOCIETA
000400100318     A          K RCAPOSIZ
000500100305     A          K RCAKCC
000600100305     A          K RCAKSC
000700100305     A          K RCADTPAR
000800100305     A          K RCANRPAR
000900100305     A          K RCASERPAR
001000100305     A          K RCADTSCA
001100100524     A          K RCAPROGRIM
001200100525     A          K RCAAZIONE
001300940318     A*
