000100910510 WEPCEP:     PGM        PARM(&FILEPF)
000200901011
000300910531             DCL        VAR(&FILEPF) TYPE(*CHAR) LEN(10)
000400910510
000500910513             DCLF       FILE(QSYS/QADSPDBR)
000600910423
000700910510
000800910423
000900910423/* RICERCA TUTTI GLI OGGETTI  */
001000910423
001100910513             DSPDBR     FILE(&FILEPF) OUTPUT(*OUTFILE) +
001200910513                          OUTFILE(QTEMP/§§PROGR)
001300910423
001400910513             OVRDBF     FILE(QADSPDBR) TOFILE(QTEMP/§§PROGR)
001500910423READ:
001600910423             RCVF
001700910423             MONMSG     MSGID(CPF0864) EXEC(GOTO CMDLBL(ENDF))
001800910423
001900910510
002000910513             DLTF       FILE(&WHREFI)
002100910423             MONMSG     MSGID(CPF2105)
002200910531             GOTO       CMDLBL(READ)
002300910513ENDF:        ENDPGM
