000100021028     A*------------------------------------------------------------------------*
000200060522     A* DS LETTURA CAMPI PDC IN  CNACVD0F    - TRACCIATO "A"                   *
000300021028     A*------------------------------------------------------------------------*
000400021028     A                                      REF(CNDIZION)
000500060522     A          R D§ACV_A                   TEXT('DS lettura CAMPI PDC IN -
000600060516                                            CNACVD0F')
000700060516     A            INDIVA    R               TEXT('PARTITA IVA')
000800060928     A            ACOFLG    R               TEXT('FLAG ANNULLAMENTO')
