000100021028     A*------------------------------------------------------------------------*
000200060516     A* DS LETTURA CAMPI PDC IN  CNACVD0F  - TRACCIATO 03                      *
000300021028     A*------------------------------------------------------------------------*
000400021028     A                                      REF(CNDIZION)
000500060516     A          R D§ACV03                   TEXT('DS lettura CAMPI PDC IN -
000600060516                                            CNACVD0F')
000700060516     A            INDNPN    R     S         REFFLD($NPN)
000800060516     A            INDNPR    R     S         REFFLD($NPR)
000900060516     A            INDDPR    R     S         REFFLD($DPR)
001000060516     A            CLPAGE    R     S         REFFLD($AGE)
001100060519     A            CLPCLV    R               REFFLD($CLV)
