000100021028     A*------------------------------------------------------------------------*
000200060522     A* DS LETTURA CAMPI PDC IN  CNACVD0F  - TRACCIATO "F"                     *
000300021028     A*------------------------------------------------------------------------*
000400021028     A                                      REF(CNDIZION)
000500060522     A          R D§ACV_F2                  TEXT('DS lettura CAMPI PDC IN -
000600060516                                            CNACVD0F')
000700060516     A            INDNPN    R     S         REFFLD($NPN)
000800060516     A            INDNPR    R     S         REFFLD($NPR)
000900060516     A            INDDPR    R     S         REFFLD($DPR)
