000100021028     A*------------------------------------------------------------------------*
000200060516     A* DS LETTURA CAMPI PDC IN  CNACVD0F  - TRACCIATO 02                      *
000300021028     A*------------------------------------------------------------------------*
000400021028     A                                      REF(CNDIZION)
000500060516     A          R D你CV02                   TEXT('DS lettura CAMPI PDC IN -
000600060516                                            CNACVD0F')
000700060516     A            CLPSCF    R     S         REFFLD($SCF)
000800060516     A            低LSUNI        1          TEXT('FATTURA UNIFICATA')
000900060516     A            CLPTFT    R     S         REFFLD($TFT)
001000060516     A            CLPFFT    R     S         REFFLD($FFT)
001100060516     A            低LPFUN        1          TEXT('TIPO DATA FATTURA')
001200060516     A            兌NDSIN        5S 3       TEXT('SPESE INVIO FATTURA')
001300060516     A            低LSSTM        1          TEXT('STAMPA MITTENTE OTIGINALE')
