000100890918     A*--------------------------------------------------------------*
000200071113     A*  TABELLA   AIP: IDONEITA PROFESSIONALE AUTISTI              *
000300890918     A*--------------------------------------------------------------*
000400071113     A          R D§AIP                     TEXT('IDONEITA PROFESSIONALE')
000500071113     A            §AIPDES       30A
000600071113     A                                      TEXT('DESCRIZIONE')
000700071113     A            §AIPMEAN       1A
000800071113     A                                      TEXT('OBBLIGO MESE ANNO')
