000100000328      *--------------------------------------------------------------*
000200061120      *  TIPI RECORD PER TNANF00F TIPO RECORD 1 (DETTAGLIO)          *
000300000328      *--------------------------------------------------------------*
000301061120     A                                      REF(CNDIZION)
000400061120     A          R D§ANF1                    TEXT('DS PER TIPI RECORD DI TNANF')
000500000328      *
000700061121     A            §ANF1DES      30A         TEXT('RAGIONE SOCIALE AUTOTRASP.')
