000100981229      *---------------------------------------------------------------*
000200000515      * ARCHIVIO ANOMALIE: DS DEL CAMPO DATI ANMFLO - FLAG OPERATIVI
000300981229      *---------------------------------------------------------------*
000400981229     A                                      REF(CNDIZION)
000500981229      *
000600000515     A          R D§ANM01                   TEXT('DS ANMFLO:FLAG OPERATIVI DI -
000700000515                                            FNANM00F')
000800981229      *
000900000515     A            §ANMZNC        2A         TEXT('ZONA SEGNACOLLO PER ANOM.MAN-
001000000515                                            CA RECORD')
