000100890918     A*--------------------------------------------------------------*
000200160204     A*  TABELLA  "AOP"  PARAMETRO LOG-GG
000300890918     A*--------------------------------------------------------------*
000400160204     A          R D§AOP001                  TEXT('ARCH.OTTICA - PAR.LOG-GG')
000500160204     A            §AOPLOGGG      3S 0       TEXT('GIORNI MANTENIMENTO LOG')
