000100010206      *--------------------------------------------------------------*
000200170503      *  TIPO VARIAZIONI DATI ANAGRAFICA GESTIONALE  TIPO A3
000300010206      *--------------------------------------------------------------*
000400170503     A                                      REF(CNDIZION)
000500170503     A          R DAPDA3
000600010206      *
000700170503     A            APDRSF    R               REFFLD($RSC)
000800170503     A                                      TEXT('RAGIONE SOCIALE X FATTURAZ.')
