000100010206      *--------------------------------------------------------------*
000200170504      *  TIPO VARIAZIONI DATI ANAGRAFICA GESTIONALE  TIPO T
000300010206      *--------------------------------------------------------------*
000400170503     A                                      REF(CNDIZION)
000500170504     A          R DAPDT
000600010206      *
000700170504     A            §APD4TEL      16
000800170504     A                                      TEXT('NUMERO TELEFONO AUTISTA')
