000100010206      *--------------------------------------------------------------*
000200170419      *  TIPO VARIAZIONI DATI ANAGRAFICA GESTIONALE
000300010206      *--------------------------------------------------------------*
000400170419     A          R D§APD
000500010206      *
000600170419     A            §APDDES       25          TEXT('DESCRIZIONE')
000700170419     A            §APDDES1       7          TEXT('DESCRIZIONE BREVE')
