000100000328      *--------------------------------------------------------------*
000200031022      *  SOTTODEFINIZIONE DI AR5UNI TIPO RECORD 'GEN'                *
000300021209      *   lunghezza massima 200 byte                                 *
000400130308      *                                                              *
000500021125      *     NON USARE CAMPI PACKED                                   *
000600000328      *--------------------------------------------------------------*
000700970929     A                                      REF(CNDIZION)
000800031022     A          R DAR5GEN                   TEXT('DS PER AR5UNI. TIPO RECORD -G-
000900031022     A                                      EN-')
001000031022      *
001100031022     A            §AR5REF       35A         TEXT('REFERENTE PER LA CONSEGNA')
001200031022     A            §AR5TELD  R               REFFLD($TELE)
001300031022     A                                      TEXT('TELEFONO DESTINATARIO')
001400040524     A            §AR5BVA        1A         TEXT('V=MERCE DI VALORE')
001500040122     A            §AR5ZNG       20A         TEXT('UBICAZIONE GIACENZA IN MAGAZZ-
001600040122     A                                      INO')
001700040217     A            §AR5MDP        1A         TEXT('S=MEMORIZZATI DATI PARTENZA')
001800040217     A            §AR5TCR   R               REFFLD($TCR)
001900040217     A            §AR5DCR   R     A         REFFLD($DCR)
002000040217     A            §AR5HCR   R     A         REFFLD($HCR)
002100040217     A            §AR5GC1   R               REFFLD($GC1)
002200040217     A                                      TEXT('1° GG.CHIUSURA DESTINATARIO')
002300040217     A                                      COLHDG('1°GG' 'CHIUS.' 'DEST.')
002400040217     A            §AR5GC2   R               REFFLD($GC2)
002500040217     A                                      TEXT('2° GG.CHIUSURA DESTINATARIO')
002600040217     A                                      COLHDG('2°GG' 'CHIUS.' 'DEST.')
002700040217     A            §AR5FFD   R               REFFLD($FFD)
002800040217     A            §AR5TC1   R               REFFLD($TC1)
002900040217     A            §AR5TC2   R               REFFLD($TC1)
003000040217     A                                      TEXT('2 CONSEGNA PARTICOLARE')
003100040217     A                                      COLHDG('2 CONS' 'PARTIC')
003200040217     A            §AR5TCRM  R               REFFLD($TCR)
003300040217     A                                      TEXT('RIPRISTINO MODIFICA: TIPO DAT-
003400040217     A                                      A CONSEGNA RICHIESTA')
003500040217     A                                      COLHDG('RIPR.MOD.' 'TIPO DATA CON.')
003600040217     A            §AR5DCRM  R     A         REFFLD($DCR)
003700040217     A                                      TEXT('RIPRISTINO MODIFICA: DATA CON-
003800040217     A                                      SEGNA RICHIESTA')
003900040217     A                                      COLHDG('RIPR.MOD.' 'DATA CON.RICH.')
004000040217     A            §AR5HCRM  R     A         REFFLD($HCR)
004100040217     A                                      TEXT('RIPRISTINO MODIFICA: ORA CONS-
004200040217     A                                      EGNA RICHIESTA')
004300040217     A                                      COLHDG('RIPR.MOD.' 'ORA CON.RICH.')
004400150828     A            §AR5DRDTO R     A         REFFLD($DA8)
004500120328     A                                      TEXT('DATA RICEZIONE DDT- SEDE')
004600150828     A            §AR5FSTDO R     A         REFFLD($FST)
004700120328     A                                      TEXT('S=STAMPATA RICEZIONE DDT -
004800120328     A                                      -SEDE')
004900090804     A            §AR5ASS        1A         TEXT('TP.ASSEGNATO: "T"=TRIANGOLO')
005000091001     A            §AR5TIC   R               REFFLD($TIC)
005100091001     A                                      TEXT('TP INC. C/A FORZATO DA DEST.P-
005200091001     A                                      ARTICOLARI')
005300091001     A            §AR5TCP   R               REFFLD($TC1)
005400091001     A                                      TEXT('CONS.PARTIC.FORZATA DA DEST.P-
005500091001     A                                      ARTICOLARI')
005600120405     A            §AR5TICI  R               REFFLD($TIC)
005700091104     A                                      TEXT('TP INC. C/A DA IMMISSIONE BOL-
005800091104     A                                      LE')
005900091111     A            §AR5CDI        7A         TEXT('CODICE INTESTAZIONE ASSEGNO')
006000091209     A            §AR5ARRDT      8A         TEXT('DATA ARRIVO 1°COLLO ALLA -
006100091209     A                                      LINEA ARRIVO BOLLA')
006200091209     A            §AR5ARRHM      4A         TEXT('ORA  ARRIVO 1°COLLO ALLA -
006300091209     A                                      LINEA ARRIVO BOLLA')
006400091211     A            §AR5TICMB R               REFFLD($TIC)
006500091211     A                                      TEXT('TP INC. C/A DA MANUTENZIONE B-
006600091211     A                                      OLLE ARRIVI')
006700100119     A            §AR5FLGMB      1          TEXT('S=VARIATO TIPO INCASSO')
006800110318     A            §AR5PDART      1          TEXT('S=RITIRO CON PDA')
006900110318     A            §AR5PDACO      2          TEXT('CONSEGNA CON PDA')
007000110527     A            §AR5BPRU  R               REFFLD($PRU)
007100110527     A                                      TEXT('UTENTE CHE HA IMMESSO LA -
007200110527     A                                      BOLLA')
007300110527     A            §AR5BNMTD     10          TEXT('TERMINALE CHE HA IMMESSO LA -
007400110527     A                                      BOLLA')
007500150828     A            §AR5MTVDTO     8          TEXT('MOTIVO RICEZIONE DDT ERRATI -
007600120328     A                                      SEDE')
007700150828     A            §AR5DIMTVO     8          TEXT('DATA INSERIMENTO MOTIVO DDT -
007800120328     A                                      ERRATI -SEDE')
007900130308     A            §AR5ALM        1A         TEXT('S=PRESENTE ALLEGATO/I DA IN-
008000130308     A                                      VIARE VIA MAIL')
008100130308     A            §AR5ALS        1A         TEXT('S=PRESENTE ALLEGATO/I DA ST-
008200130308     A                                      AMPARE')
008300130308     A            §AR5ALX        1A         TEXT('S=PRESENTE ALLEGATO VAX DA -
008400130308     A                                      STAMPARE')
008500130606     A            §AR5DFD        8          TEXT('DATA INSERIMENTO FERMO DEPO-
008600130606     A                                      SITO')
008700140402     A            §AR5PK2        1          TEXT('S=RITIRO IN PICKUP GIORNO -
008800140402     A                                      DOPO')
008900150206     A            §AR5DCRP       1          TEXT('P=CONS RICHIESTA VARIATA IN-
009000150206     A                                      PARTENZA')
009100160225     A            §AR5FDPD       1          TEXT('S=FORZATO INSTRADAMENTO DA -
009200160225     A                                      EEX A DPD')
009300160225     A            §AR5L1         4          TEXT('CAMPO VUOTO DA RIDURRE MAN -
009400140402     A                                      MANO CHE SERVE')
