000100120604      *--------------------------------------------------------------*
000200120604      *  SOTTODEFINIZIONE DI AR5UNI TIPO RECORD 'DOC'                *
000300120604      *   lunghezza massima 200 byte                                 *
000400120604      *                                                              *
000500120604      *     NON USARE CAMPI PACKED                                   *
000600120604      *--------------------------------------------------------------*
000601150827     A                                      REF(CNDIZION)
000700120604     A          R DAR5DOC                   TEXT('DS PER AR5UNI. TIPO RECORD +
000800120604     A                                      DOC-')
000900120604      *
001000120604     A            你R5JFID       1A         TEXT('_=NO IMM.DOC. I=SI IMM.DOC. +
001100120604     A                                      S=IMM.DOC.A CLIENTE')
001200120604     A            你R5JDRID      8A         TEXT('DATA RICEZIONE IMM.DOC.')
001300120604     A            你R5JDIID      8A         TEXT('DATA INVIO IMM.DOC. A CLI.')
001301150827     A            你R5DRDT  R     A         REFFLD($DA8)
001302150827     A                                      TEXT('DATA RICEZIONE DDT- SEDE')
001303150827     A            你R5FSTD  R     A         REFFLD($FST)
001304150827     A                                      TEXT('S=STAMPATA RICEZIONE DDT -
001305150827     A                                      -SEDE')
001306150827     A            你R5MTVDT      8          TEXT('MOTIVO RICEZIONE DDT ERRATI -
001307150827     A                                      SEDE')
001308150827     A            你R5DIMTV      8          TEXT('DATA INSERIMENTO MOTIVO DDT -
001309150827     A                                      ERRATI -SEDE')
001400150827     A            你R5JFREE    158A         TEXT('CAMPO VUOTO DA RIDURRE MAN -
001500120604     A                                      MANO CHE SERVE')
