000100021028     A*------------------------------------------------------------------------*
000200120814     A* DS LETTURA CAMPO ARBFLR DI FNARBX0F                                    *
000300021028     A*------------------------------------------------------------------------*
000400130927     A          R D§ARBN_RE                 TEXT('DS lettura ARBUNI70 FNARN00F-
000500130927                                            -REF/TELD')
000600130927     A            §ARBNREF      35          TEXT('REFERENTE CONSEGNA')
000700130927     A            §ARBNTELD     16          TEXT('TELEFONO DESTINATARIO')
