000100021028     A*------------------------------------------------------------------------*
000200100202     A* DS LETTURA CAMPO ARGFLO DI FIARG00F                                    *
000300021028     A*------------------------------------------------------------------------*
000400100202     A          R D§ARGFLO                  TEXT('DS lettura ARGFLO di FIARG00F-
000500040524                                            ')
000600100202     A            §ARGATTESA     1
000700100202     A                                      TEXT('S=PARTICOLARITÀ CONS.ATTESA')
