000100120604      *--------------------------------------------------------------*
000200180116      *  SOTTODEFINIZIONE DI ARSNOT TIPO RECORD 'J'                *
000300120604      *--------------------------------------------------------------*
000400150827     A                                      REF(CNDIZION)
000500180116     A          R DARSJ                     TEXT('DS PER ARSNOT. TIPO RECORD +
000600180116     A                                      J')
000700120604      *
000800180116     A            你RSJPEST      3S 0       TEXT('FILIALE DI SPUNTA-TFA')
000900180116     A            你RSJNPGT      1S 0       TEXT('CATEGORIA FOGLIO SPUNTA-TFA')
001000180116     A            你RSJDFVT      8S 0       TEXT('DATA FOGLIO SPUNTA-TFA')
001100180126     A            你RSJNPST      2A         TEXT('COD PISTOLA DI SPUNTA-TFA')
001200180125     A            你RSJTIPO      1A         TEXT('S=DA ANOMALIA SPUNTA J=DA FOG-
001300180125                                            LIO INCOMPATIBILE')
