000100160929      *--------------------------------------------------------------*
000200161212      *  TABELLA TIPO ASSENZA AUTISTI
000300160929      *--------------------------------------------------------------*
000400161212     A          R D§ATA                     TEXT('TIPO ASSENZA')
000500160929     A            §ATADES       25A         TEXT('DECODIFICA')
