000100981229      *---------------------------------------------------------------*
000200100308      *  ARCHIVIO ATTIVITA SU POTENZIALI
000300100308      *              DS DEL CAMPO - ATCFLO (10 CHAR)
000400031205      *---------------------------------------------------------------*
000500981229     A                                      REF(CNDIZION)
000600981229      *
000700100308     A          R D你TC                     TEXT('ATTIVITA-ATCFLO')
000800981229      *
000900100308     A            你TCESITO      1          TEXT('ESITO P=POSITIVO/N=NEGATIVO')
001000100802     A            你TCMAITR      1          TEXT('S=POTENZIALE STATO BLANK')
001100110211     A            你TCCAPO1      1          TEXT('CATEGORIA POTENZIALE IN CREA-
001200110211     A                                      ZIONE ATTIVITA')
001300110211     A            你TCCAPO2      1          TEXT('CATEGORIA POTENZIALE IN ESECU-
001400110211     A                                      ZIONE ATTIVITA')
