000100060131     A*--------------------------------------------------------------*
000200161003     A*  TABELLA ATS:
000300060131     A*--------------------------------------------------------------*
000400161003     A          R D§ATS                     TEXT('TERRITORIO SERVITO AUTISTA')
000500161027     A            D§ATSDES      30          TEXT('DESCRIZIONE')
