000100021028     A*------------------------------------------------------------------------*
000200060922     A* DS FLAG OPERATIVI DI TASFLO CAMPO DELLA DS                             *
000300021028     A*------------------------------------------------------------------------*
000400021028     A                                      REF(CNDIZION)
000500150909     A          R D§BLP01                   TEXT('DS FLAG OPERATIVI DBLP')
000600150909     A            §LPTRD         1          TEXT('I/G=TRADUTTORE VECCHIO-
000700150909     A                                      /NUOVO X IMPORT DPD')
000800160617     A            §LPSCD         3          TEXT('SERVICE CODE X VEDI PACCO-
000900160617     A                                       AUTOMATICO')
