000100981229      *---------------------------------------------------------------*
000200170421      *  FILE PER  ABILITAZIONI/BLOCCHI ALERT AFFIDAMENTO MERCE
000300170421      *              DS DEL CAMPO FLAG OPERATIVI - BLRFLO (30 CHAR)
000400981229      *---------------------------------------------------------------*
000500011106      *  ATTENZIONE: LA DS È DEFINITA PER L'INTERA LUNGHEZZA DEL CAMPO
000600170421      *              SE SI DEVONO INSERIRE NUOVI CAMPI ACCORCIARE §BLRXX
000700011106      *---------------------------------------------------------------*
000800981229     A                                      REF(CNDIZION)
000900981229      *
001000170421     A          R D§BLR                     TEXT('FLAG OPERATIVI FIBLR')
001100981229      *
001200170421     A            §BLRABI        1          TEXT('A=ALERT ABILITATO, B=ALERT -
001300170421     A                                      BLOCCATO')
003100170421     A            §BLRXX        29          TEXT('VUOTO - DA UTILIZZARE')
