000100890918     A*--------------------------------------------------------------*
000200080917     A*  DS RIDEFINIZIONE DATI DELLE C.A. PERCLIENTI - UPLOAD       *
000300890918     A*--------------------------------------------------------------*
000400990906     A                                      REF(CNDIZION)
000500080917     A          R D低ANOM                   TEXT('DS UPLOAD C.A. X CLIENTI')
000600060804     A*
000700080917     A* DATI DELLA SPEDIZIONE
000800080917     A            低AIAAS   R     A         REFFLD($AAS)
000900060804     A                                      TEXT('ANNO SPEDIZIONE')
001000080926     A            低AIMGS   R     A         REFFLD($MMG)
001100080926                                            TEXT('MESE/GIORNO SPEDIZIONE')
001200080917     A            低AILNP   R     A         REFFLD($LNP)
001300060804     A                                      TEXT('LINEA PARTENZA SPEDIZIONE')
001400080917     A            低AINRS   R     A         REFFLD($NRS)
001500060804     A                                      TEXT('SERIE SPEDIZIONE')
001600080917     A            低AINSP   R     A         REFFLD($NSP)
001700060804     A                                      TEXT('NUMERO SPEDIZIONE')
001800080917     A            低AIRMN   R     A         REFFLD($RMN)
001900080917     A*
002000080917     A            低AIRMA   R               REFFLD($RMA)
002100080917     A            低AIRSD       25          TEXT('RAGIONE SOCIALE DESTINAT.')
002200080917     A*
002300080917     A* DATI DELLA C.A.
002400080917     A            低AITAD   R               REFFLD($TAD)
002500080917     A            低AITADD      25          TEXT('DESCRIZIONE ANOMALIA')
002600080917     A            低AIAAC   R     A         REFFLD($AAA)
002700080917                                            TEXT('ANNO C.A.')
002800080917     A            低AIMGC   R     A         REFFLD($MMG)
002900080917                                            TEXT('MESE/GIORNO APERTURA CA')
003000080917     A            低AIFIL   R     A         REFFLD($FIL)
003100080917                                            TEXT('FILIALE C.A.')
003200080917     A            低AINCA   R     A         REFFLD($NCA)
003300080917     A            低AIDCH   R     A         REFFLD($DCH)
003400080917                                            TEXT('DATA CHIUSURA CA')
003500080917     A            低AICCH   R               REFFLD($CCH)
003600080917                                            TEXT('CAUSALE CHIUSURA CA')
003700080917     A            低AICCHD      25          TEXT('DESCRIZIONE CHIUSURA C.A.')
003800080926     A            低AIFCA   R     A         REFFLD($FAS)
003900080917                                            TEXT('FASE AVANZAMENTO CA')
004000080926     A            低AIFCAD      40          TEXT('DESCRIZIONE FASE C.A.')
004100080917     A            低AIDFC   R     A         REFFLD($DFC)
004200060804     A*
004300080917     A            低AIIPV   R     A         REFFLD($IPV)
004400080917                                            TEXT('IMPORTO MASSIMO RISARCIBILE')
004500080917     A            低AIVPV   R               REFFLD($VAS)
004600080917                                            TEXT('DIVISA IMP.MASS.RISARCIB.')
004700080917     A            低AIIPR   R     A         REFFLD($IPV)
004800080917     A                                      TEXT('IMPORTO RICHIESTO')
004900080917     A            低AIVPR   R               REFFLD($VAS)
005000080917     A                                      TEXT('DIVISA IMPORTO RICHIESTO')
005100080917     A            低AIIPL   R     A         REFFLD($IPL)
005200080926     A                                      TEXT('IMPORTO LIQUIDATO')
005300080917     A            低AIVPL   R               REFFLD($VAS)
005400080917     A                                      TEXT('DIVISA IMPORTO LIQUIDATO')
005500080918     A            低AIASN       10          TEXT('NUMERO ASSEGNO')
005600080918     A                                      COLHDG('NUMERO' 'ASSEGNO')
005700080918     A            低AIDEA   R     A         REFFLD($DTE)
005800080918     A            低AIABI        5          TEXT('ABI NS. PAGAMENTO')
005900080918     A            低AICAB        5          TEXT('CAB NS. PAGAMENTO')
006000080918      *
