000100141030      *PARMS MBR(*NONE)
000200890918     A*--------------------------------------------------------------*
000300160516     A*  TABELLA:  CASE  AUTOMOBILISTICHE
000400890918     A*--------------------------------------------------------------*
000500170906     A          R DCAUDS
000600160516     A            §CAUDES       30          TEXT('DESCRIZIONE CASA')
000700160516     A            §CAUUSO        1          TEXT('S=SEDE F=FILIALE" "=ENTRAMBI')
