000100010312     A*--------------------------------------------------------------*
000200980727     A*  TABELLA  "CCH"  CAUSALI CHIUSURA DANNI
000300990303     A*  ATTENZIONE! NEI PGM FNLS44R E FNLR35R LR31
000400990122     A*  LA DS E' DEFINITA INTERNAMENTE
000500990121     A*  PERCHE' NON SUPPORTA LA LUNGHEZZA DEI CAMPI
000600990121     A*  SE SI MODIFICANO LE POSIZIONI  O LUNGHEZZE CONTROLLARE !!!!
000700890918     A*--------------------------------------------------------------*
000800890918     A                                      REF(CNDIZION)
000900980727     A          R D§CCH                     TEXT('CAUSALI CHIUSURA C.A.')
001000990121     A            §CCHDESC      50A         TEXT('DESCRIZIONE')
001100990120     A            §CCHCRAN       1A         TEXT('S=DEVE CREARE L''ANOMALIA -
001200990120                                            COLLO DI CA CHIUSA')
001300990218     A            §CCHNRE        1A         TEXT('S=NON CONSIDERARE LA RESPO-
001400990218                                            NSABILITA')
001500990329     A            §CCHIMA        1A         TEXT('S=CAUSALE CHE INDICA LA PRESE-
001600990329                                            NZA DELLA MERCE/COLLI')
001700990329     A            §CCHLR52       1A         TEXT('S=NON CONSIDERARE REC.BOLLA -
001800990329                                            IN LR52, SE SOLO I COLLI -
001900990329                                            C.A.NON CONSEGNATI')
002000990311     A            §CCHGEVI       1A         TEXT('S=CAUSALE GESTIBILE A VIDEO  -
002100990311                                            " "=CAUSALE AUTOMATICA')
002200990406     A            §CCHMERP       1A         TEXT('S=DA MEMORIZZARE SUL REPORT -
002300990406                                            COME C.A. CHIUSA')
002400010312     A            §CCHINTE       1A         TEXT('S=DA USARE IN INTERNET')
002500020308     A            §CCHCHTE       1A         TEXT('S=CHIUSURA TECNICA - pgm. FID-
002600020308                                            N41R')
002700050331     A            §CCHPROT       1A         TEXT('S=CAUSALE PROTETTA IN RIAPERT-
002800050331                                            URA VEDERE UTENTI AUTORIZZATI')
002900050331     A            §CCHUTE1      10A         TEXT('1° UTENTE AUTORIZZATO RIAPERT-
003000050331                                            URA')
003100050331     A            §CCHUTE2      10A         TEXT('2° UTENTE AUTORIZZATO RIAPERT-
003200050331                                            URA')
003300050331     A            §CCHUTE3      10A         TEXT('3° UTENTE AUTORIZZATO RIAPERT-
003400050331                                            URA')
003500050331     A            §CCHUTE4      10A         TEXT('4° UTENTE AUTORIZZATO RIAPERT-
003600050331                                            URA')
003700050331     A            §CCHUTE5      10A         TEXT('5° UTENTE AUTORIZZATO RIAPERT-
003800050331                                            URA')
003900050927     A            §CCHPAGA       1A         TEXT('S=CAUSALE PER PAGAMENTI')
004000051025     A            §CCHLIBE       1A         TEXT('LIBERO')
004100050927     A            §CCHUTIL       1A         TEXT('UTILIZZO CAUSALE ; S=SOLO SED-
004200050927                                            E ; P=SOLO PO ; " "=TUTTI')
