000100890918     A*--------------------------------------------------------------*
000200040212     A*  TABELLA  "CHR"  CODICI CHIUSURA RECLAMI
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500040212     A          R D§CHR                     TEXT('CODICI CHIUSURA RECLAMI')
000600040212     A            §CHRDESC      20A         TEXT('DESCRIZIONE')
000700040420     A            §CHRRESP       1A         TEXT('TIPO RESPONSABILITA')
