000100890918     A*--------------------------------------------------------------*
000200040213     A*  TABELLA  "COR"  TIPO COMUNICAZIONE RECLAMO
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500040213     A          R D§COR                     TEXT('TIPO COMUNICAZIONE RECLAMO')
000600040213     A            §CORDESC      20A         TEXT('DESCRIZIONE')
