000100981229      *---------------------------------------------------------------*
000200031205      *  ANAGRAFICA CLIENTI POTENZIALI:
000300140910      *              DS DEL CAMPO - CPOTEL (16 CHAR)
000400031205      *---------------------------------------------------------------*
000500981229      *
000600140910     A          R D§CPO2                    TEXT('POTENZIALI - CPOTEL')
000700981229      *
000800140910     A            §CPOANNOIA     4A         TEXT('ANNO INIZIO ATTIVITA')
