000100160901      *------------------------------------------------------------------------*
000200160901      * DS LETTURA CAMPI IN TNCPVD0F - TRACCIATO "G"                           *
000300160901      *------------------------------------------------------------------------*
000400160901     A                                      REF(CNDIZION)
000500160901     A          R D§CPV_G                   TEXT('DS lettura CAMPI IN TNCPVD0F')
000600160901     A            CPOCPO    R     S         REFFLD($CPO)
