000100160704      *------------------------------------------------------------------------*
000200160704      * DS LETTURA CAMPI IN TNCPVD0F - TRACCIATO "A"                           *
000300160704      *------------------------------------------------------------------------*
000400160704     A                                      REF(CNDIZION)
000500160704     A          R D§ACV_A                   TEXT('DS lettura CAMPI IN TNCPVD0F')
000600160704     A            CPORAG    R               REFFLD(ACORAG)
000700160704     A            CPOVIA    R               REFFLD($INM)
000800160704     A                                      TEXT('INDIRIZZO')
000900160704     A            CPOCIT    R               REFFLD($LOM)
001000160705     A                                      TEXT('LOCALITA')
001100160704     A            CPOCAP    R               REFFLD($CAM)
001200160704     A                                      TEXT('CAP')
001300160704     A            CPOPRV    R               REFFLD(INDPRV)
001400160704     A            CPONAZ    R               REFFLD($NAR)
001500160705     A            CPO1TEL   R               REFFLD($TELE)
001600160705     A            CPO1FAX   R               REFFLD($TELE)
001700160705     A                                      TEXT('FAX')
