000100090416     A          R DCTT
000200090416     A                                      TEXT('Codici catastali comuni.')
000300090416     A            COMUNE        45A
000400090416     A                                      TEXT('Comune.')
000500090416     A            PROVINCIA      2A
000600090416     A                                      TEXT('Sigla provincia.')
