000100991129      *--------------------------------------------------------------*
000200010627      *  TABELLA SERIE PER DISK "C" CON PREFISSO CC
000300991129      *--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500010627     A          R D§DCC                     TEXT('DISK "C":SERIE PER PREFISSO "-
000600010627     A                                      CC"')
000700991129      *
000800010627     A            §DCCKSC        7S 0       TEXT('CODICE CLIENTE')
000900041221     A            §DCC001        1A         TEXT('FILLER (LIBERO)')
001000041221     A            §DCCKSD       45A         TEXT('DECODIFICA CLIENTE')
