000100980622      *--------------------------------------------------------------*
000200000217      *  TABELLA ERRORI SCAN ED EVENTI RICEVUTI DA DPD
000300000217      *     LEGATA ALLA TABELLA DIR
000400980622      *--------------------------------------------------------------*
000500000131     A                                      REF(CNDIZION)
000600000217     A          R D§DER                     TEXT('ERRORI SCAN DPD')
000700000131      *
000800000217     A            §DERDES       50          TEXT('DESCRIZIONE')
