000100890918     A*--------------------------------------------------------------*
000101020430     A*  TABELLA  "DGD" :
000102020430     A*
000103020430     A*  DGG = GG STANDARD: PREP. DISTINTA CONTROLLA CHE NON SI POSSANO
000104020430     A*      MANUTENZ. DIST. CON DATA ANTECED./SUCCESS.AI GG STD(15GG)
000105020430     A*      AD ESCLUSIONE DEI PERIODI DELLE TRAZ. RIDOTTE :
000106020430     A*  DEI = MESE/GIORNO INIZIO PERIODO TRAZ. RIDOTTE ESTIVE
000107020430     A*  DEF = MESE/GIORNO FINE   PERIODO TRAZ. RIDOTTE ESTIVE
000108020430     A*  DGE = GG DA APPLICARE INVECE DEI GG STANDARD NEL PERIODO
000109020430     A*      DELLE TRAZ. RIDOTTE  ESTIVE
000110020430     A*  DII = AAAA/MM/GG INIZIO PERIODO TRAZ. RIDOTTE INVERNALI
000111020430     A*  DIF = AAAA/MM/GG FINE   PERIODO TRAZ. RIDOTTE INVERNALI
000112020430     A*  DGI = GG DA APPLICARE INVECE DEI GG STANDARD NEL PERIODO
000113020430     A*      DELLE TRAZ. RIDOTTE  INVERNALI
000114020430     A*
000115020430     A*  DGDGBAR= INDICA DI QUANTI GG LAVORATIVI SI PUÒ RETRODATARE
000116020430     A*      LA DATA DI CONSEGNA DI UNA SPED. BARTOLINI RISPETTO ALLA
000117020430     A*      DATA DI CHIUSURA DELLA DISTINTA (UDATE)
000118020430     A*  DGDGPT = INDICA DI QUANTI GG LAVORATIVI SI PUÒ RETRODATARE
000119020430     A*      LA DATA DI CONSEGNA DI UNA SPED. POSTE     RISPETTO ALLA
000120020430     A*      DATA DI CHIUSURA DELLA DISTINTA (UDATE)
000121020430     A*
000122020430     A*  DGDDC = GG LAVORATIVI DALL'UDATE IN AVANTI PER L'APERTURA DI
000123020430     A*          FOGLI VARI DI CAT 4 E DISTINTE DI CONSEGNA
000124020430     A*
000600890918     A*--------------------------------------------------------------*
000700000929     A          R D§DGD                     TEXT('PERIODI DISTINTE ')
000800020430     A            §DGDGG         2S 0       TEXT('GG STD X MANUTENZ.DIST.CONS.')
000900020430     A            §DGDEI         4S 0       TEXT('MM/GG INIZ.PERIODO ESTIVO X-
001000020430     A                                      CONTROLLO CON §DGDGE')
001100020430     A            §DGDEF         4S 0       TEXT('MM/GG FINE PERIODO ESTIVO X -
001200020430     A                                      CONTROLLO CON §DGDGE')
001300020430     A            §DGDGE         3S 0       TEXT('GG X CONTROLLO NEL P. ESTIVO')
001400020430     A            §DGDII         8S 0       TEXT('AAAA/MM/GG INIZ.PERIODO INV-
001500020430     A                                      ERNALE X CONTROLLO CON §DGDGI')
001600020430     A            §DGDIF         8S 0       TEXT('AAAA/MM/GG FINE PERIODO INVER-
001700020430     A                                      ALE X CONTROLLO CON §DGDGI')
001800020430     A            §DGDGI         3S 0       TEXT('GG X CONTROLLO NEL P.INVERN.')
001900020430     A            §DGDGBAR       3S 0       TEXT('CHIUS.DIST: GG X DATA CONS.-
001901020430     A                                      SPED. BART.')
002001020430     A            §DGDGPT        3S 0       TEXT('CHIUS.DIST: GG X DATA CONS.-
002002020430     A                                      SPED. POSTE')
002100020430     A            §DGDDC         3S 0       TEXT('APERT. FOGLI/DISTINTE: GG X -
002200020430     A                                      CONTR. DATA LIMITE')
002300070731     A            §DGDTADA       8S 0       TEXT('AAAA/MM/GG INIZ.PERIODO X N-
002400070731     A                                      ON CTR PARTITE APERTI QUADRAT.GG')
002500070731     A            §DGDTAA        8S 0       TEXT('AAAA/MM/GG FINE PERIODO X NON-
002600070731     A                                       CTR PARTITE APERTE QUADRAT.GG')
