000100980622      *--------------------------------------------------------------*
000200000406      *  TABELLA PER CONVERSIONE E CONTROLLO PESO DPD
000300980622      *--------------------------------------------------------------*
000400000406      *  CHIAVE:  PESOxx  dove xx = 02 se sped con peso < 3 kg
000500000406      *                             01 per le altre
000600000128      *--------------------------------------------------------------*
000700000131     A                                      REF(CNDIZION)
000800000406     A          R D§DPP                     TEXT('PESO DPD')
000900000131      *
001000000406     A            §DPPPKB        7S 1       TEXT('PESO DA FORZARE')
001100000406     A            §DPPPKC        7S 1       TEXT('TOLLERANZA PER CONTROLLO')
001200060717     A            §DPPFMS       11S 3       TEXT('IMPORTO FUORI MISURA')
001300141209      *  AGGIUNTO IL VOLUME PER IL REPERIMENTO PESO/VOLUME GOMME PESO03
001400141209     A            §DPPVLB        5S 3       TEXT('VOLUME DA FORZARE')
