000100021028     A*------------------------------------------------------------------------*
000200080206     A* DS LETTURA CAMPO DSTFLR DI FIDST00F                                    *
000300021028     A*------------------------------------------------------------------------*
000400080206     A          R D§DSTFLR                  TEXT('DS lettura DSTFLR di FIDST00F-
000500040524                                            ')
001300080206     A            §DSTTSTPDA     1
001301080206     A                                      TEXT('TEST X PDA -
001302080206     A                                      O=ORM/C=CONSEGNE/E=-
001303080206     A                                      ENTRAMBI/BLANK=NO')
001304080206     A                                      COLHDG('TEST PDA' 'O/C/E/ ')
001400160420     A            §DSTTURNO      1
001500160420     A                                      TEXT('TURNO PIKING -
001600160420     A                                      BLANK=PRIMO/2=SECONDO')
001800160420     A                                      COLHDG('TURNO')
