000100890918     A*--------------------------------------------------------------*
000200080711     A*  TABELLA  "ECD"  ERRORI PRE-CHIUSURA DISTINTA PDA
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500080711     A          R DECD                      TEXT('ERRORI PRE-CHIUSURA DIS. PDA')
000600080711     A            §ECDDES       50A         TEXT('DESCRIZIONE')
000700080716     A            §ECDTER        1A         TEXT('ERR:F=FORZA NO ESCL/-
000800080716     A                                      B=NO FORZA NO ESCL/-
000900080716     A                                      E=NO FORZA SI ESCL')
