000100150115     A*---------------------------------------------------------------*
000200150115     A*  TABELLA  CAUSALI CAMPAGNE COMM.LI
000300150115     A*---------------------------------------------------------------*
000400150115     A          R D§ECM                     TEXT('CAU CAMPAGNE')
000500150115     A            §ECMDES       30A         TEXT('DESCRIZIONE')
000600150115      * FLAG CHE INDICA CHE LA CAUSALE È RELATIVA AD UN BLOCCO AUTOMATICO
000700150115     A            §ECMAUT        1A         TEXT('BLOCCO AUTOMATICO')
