000100091216     A                                      REF(CNDIZION)
000200091216     A          R DEON00003                 TEXT('Tabella EON: -
000300091216     A                                      TIPO_FLUSSO.')
000400091216     A            TPFLUSSO       4A         TEXT('Fatturazione telematica: -
000500091216     A                                      tipo flusso.')
