000100000328      *--------------------------------------------------------------*
000200160526      *  ORARI SERVIZIO RITIRI ESTERI                                *
000300000328      *--------------------------------------------------------------*
000400160526     A          R D§EOR                     TEXT('ORARI SERVIZIO RITIRI ESTERI')
000500000328      *
000600160526     A            §EORMIN        4S 0       TEXT('ORARIO MINIMO SERVIZIO')
000700160526     A            §EORMAX        4S 0       TEXT('ORARIO MASSIMO SERVIZIO')
000800160526     A            §EORLRG        4S 0       TEXT('ORARIO LIMITE RITIRO OGGI')
