000100991129      *--------------------------------------------------------------*
000200060628      *  DS EVBNOT
000300991129      *--------------------------------------------------------------*
000400060628     A          R DEVB01DS
000500991129      *
000501060628      * NEL EVENTO MIC IL CAMPO EVBNOT VIENE IMPOSTATO CON NR.DIST.+ AUT.
000502060628      *                DI CONSEGNA . PER LE BOLLE EXPORT DPD MEMORIZZAIMO IL
000503060628      *                DEPOT RICEVUTO CON IL LORO SCAN DI CONSEGNA .
000600060628     A            §NOTNDC        7          TEXT('NR.DISTINTA CONSEGNA')
000800060628     A            §NOTPDC        7          TEXT('AUT. CONSEGNA ')
001000060628     A            §NOTDEP        4A         TEXT('DEPOT DPD - BOLLE EXPORT')
