000100981229      *---------------------------------------------------------------*
000200030422      *  ARCHIVIO VOCI DI TARIFFA  ECEVT00F
000300030422      *                  DS DEL CAMPO DATI EVTXXX
000400981229      *---------------------------------------------------------------*
000600981229      *
000700030422     A          R D§EVT01
000800981229      *
000801030422     A            EVTRPV         3S 1       TEXT('RAPPORTO PESO TASSABILE')
000803030422     A            EVTSPS         1          TEXT('SVILUPPO PESO TASSABILE')
