000100070928     A          R D§FSC
000200070928     A                                      TEXT('FILIALI PER FORZATURA TIC "SC-
000300070928     A                                      "')
000400070928     A            §FSCDES       25A
000500060224     A                                      TEXT('Descrizione.')
