000100021028     A*------------------------------------------------------------------------*
000200021028     A* DS LETTURA CAMPO TASFLO DI TITAS                                       *
000300021028     A*------------------------------------------------------------------------*
000400021028     A                                      REF(CNDIZION)
000500050916     A          R D§GCPFLR                  TEXT('DS lettura GCPFLR di TIGCP  ')
000600050916     A            D§GCPAPP       1
000700050916     A                                      TEXT('A=APPUNTAMENTO')
000800051013     A            D§GCPDISA      1
000900051013     A                                      TEXT('DISPOSIZIONI AUTOMATICHE-
001000051013     A                                      S=AUTOMATICHE/BLANK=MANUALI')
001100170222     A            D§GCPUTEW      1
001200170222     A                                      TEXT('UTENTE CHE DA DISPOSIZIONI -
001300170222     A                                      D=DESTINATARIO M=MITTENTE')
