000100010206      *--------------------------------------------------------------*
000200171012      *  TIPO VARIAZIONI GIACENZA COMUNICAZIONI TIPO E
000300010206      *--------------------------------------------------------------*
000400171012     A          R DAPDE
000500010206      *
001300170919     A            GCPTCM         1
001400170919     A                                      TEXT('TIPO INVIO COMUNICAZIONE -
001500170919     A                                      APERTURA ')
001501170919     A            GCPTFG         1
001502170919     A                                      TEXT('TIPO INVIO COMUNICAZIONE -
001503170919     A                                      FINE GIACENZA ')
