000100010206      *--------------------------------------------------------------*
000200170920      *  TIPO VARIAZIONI GIACENZE
000300010206      *--------------------------------------------------------------*
000400170920     A          R D§GCP
000500010206      *
000600170920     A            §GCPDES       25          TEXT('DESCRIZIONE')
000700170920     A            §GCPDES1       7          TEXT('DESCRIZIONE BREVE')
