000100890918     A*--------------------------------------------------------------*
000200011024     A*  TABELLA  DEL GESTIONALE: DIVISA PAGAMENTI CONTRASSEGNI
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500011024     A          R D§GEDCA                   TEXT('GESTIONALE:DIVISE CONTRASSEG')
000600011024     A            §GEDDPC        3A         TEXT('DIVISA CONTRASSEGNI')
000700011024     A            §GEDDTPC       8S 0       TEXT('DECORRENZA DIVISA CONTRAS. DA+
000800010725     A                                      L (COMPRESO)')
