000100050908     A                                      REF(CNDIZION)
000200050908     A          R DGNPDMC915
000300050908     A                                      TEXT('Campo TIGNP00F.GNPDMC -
000400050908     A                                      prog. 915 nuova data cons.')
000500050908     A            COSTANTE      10
000600050908     A                                      TEXT('Costante descrittiva riga.')
000700050908     A            NDCR            L
000800050908     A                                      DATFMT(*EUR)
000900050908     A                                      TEXT('Nuova data consegna richiesta-
001000050908     A                                       *EUR.')
