000100991104     A*------------------------------------------------------------------------*
000200991104     A* TABELLA CAUSALI EVENTI VISUALIZZABILI IN INTERNET                      *
000300991104     A* NB. tbekey = Causale evento (3)                                        *
000400991104     A* NB. Le causali evento inseribili in questa tabella sono da controllare *
000500991104     A*     nella tabella 2A di TABEL00F                                       *
000600991104     A*------------------------------------------------------------------------*
000700991104     A                                      REF(CNDIZION)
000800991104     A          R D§ICE                     TEXT('INTERNET - CAUSALI EVENTO')
000900991104     A            §ICEDEI   R               REFFLD($DES30)
001000991104     A                                      TEXT('DESCRIZIONE ITALIANA')
001100030129     A            §ICEDEP   R               REFFLD($DES30)
001200030129     A                                      TEXT('DESCRIZIONE POSTE')
001300991104     A            §ICESRC   R               REFFLD($FLA)
001400991104     A                                      TEXT('F=FISSATO A PGM," "=DA FILE')
001500991104     A            §ICEORD        3S 0       TEXT('ORDINAMENTO')
001600991104     A            §ICEVDS   R               REFFLD($FLA)
001700991104     A                                      TEXT('VIUSAL.SE DISORDINATO N/" "')
001800991104     A            §ICEVAT   R               REFFLD($FLA)
001900991104     A                                      TEXT('A=ANNUL,S=SOSPESO," "=ATTIVO')
002000010418     A            §ICESTA   R               REFFLD($FLA)
002100030129     A                                      TEXT('S=USARE IN "STATI" T&T x BAR')
002200010418     A            §ICEGIA   R               REFFLD($FLA)
002300030129     A                                      TEXT('S=USARE IN "GIAC"  T&T x BAR')
002400030129     A            §ICESTAP  R               REFFLD($FLA)
002500030129     A                                      TEXT('S=USARE IN "STATI" T&T x PT ')
002600030129     A            §ICEGIAP  R               REFFLD($FLA)
002700030129     A                                      TEXT('S=USARE IN "GIAC"  T&T x PT ')
002800070109     A            §ICEEVAN       3A         TEXT('Evento da annullare.')
