000100890918     A*--------------------------------------------------------------*
000200040816     A*  TABELLA  "IFT"  DS TABELLA FILE / TRADUTTORI
000300890918     A*--------------------------------------------------------------*
000400040816     A          R D§IFT                     TEXT('FILE/TRADUTTORI')
000500040816     A            §IFTPGT       10A         TEXT('*PGM TRADUTTORE')
000600040816     A            §IFTFILE      10A         TEXT('FILE TRADOTTO')
000700100311     A            §IFTTMBD       1A         TEXT('TIPO MEMBRO')
