000100890918     A*--------------------------------------------------------------*
000200020218     A*  TABELLA  "ITF"  DS TABELLA TIPI FILE
000300890918     A*--------------------------------------------------------------*
000400020218     A          R D§ITF                     TEXT('TIPI FILE')
000500020218     A            §ITFDESC      30A         TEXT('DESCRIZIONE')
000600020218     A            §ITFLIBD       1A         TEXT('LIBRERIA DATI -
000700020218     A                                      G=GRUPPO A=AZIENDA')
