000100070919     A*--------------------------------------------------------------*
000200100226     A*  INFORMAZIONI COMMERCIALI TRATTATIVA - SOTTOTIPO
000300070919     A*--------------------------------------------------------------*
000400100226     A          R D§ITS                     TEXT('SOTTOTIPO INFO COMM.')
000500100226     A            §ITSDES       25A         TEXT('DESCRIZIONE CORTA')
000600100226     A            §ITSDEL       44A         TEXT('DESCRIZIONE LUNGA')
000700120607     A            §ITSANN        1A         TEXT('DA ANNULLARE SOLO IN VISUAL -
000800120607     A                                      S=FORZABILE O=OBBLIGATORIO')
