000100020513      *PARMS MBR(*NONE)
000200890918     A*--------------------------------------------------------------*
000300120403     A*  TABELLA X LIMITI SPEDIZIONI MICRO
000400890918     A*--------------------------------------------------------------*
000500120403     A          R D§LIMMIC
000600120403     A            §LIMPES        7S 1       TEXT('LIMITE PESO MICRO')
000700120403     A            §LIMVOL        5S 3       TEXT('LIMITE VOLUME MICRO')
