000100021028     A*------------------------------------------------------------------------*
000200070207     A* DS LETTURA CAMPO LTEFLO DI FILTE                                       *
000300021028     A*------------------------------------------------------------------------*
000400021028     A                                      REF(CNDIZION)
000500070207     A          R D§LTEFLO                  TEXT('DS lettura LTEFLO di FILTE')
000600070207     A            §FLOTST        1          TEXT('S=Lancio in test')
