000100040903     A                                      REF(CNDIZION)
000200040903     A          R TILVA000
000300040903     A                                      TEXT('Visualizzazioni LdV internet -
000400040903     A                                      da addebitare.')
000500040903     A            §LVAUESMMT      Z
000600040903     A                                      TEXT('Momento ultima estrazione da -
000700040903     A                                      log VAS internet.')
000800040903     A                                      COLHDG('Momento' 'ultima' -
000900040903     A                                      'estrazione')
