000100060131     A*--------------------------------------------------------------*
000200161026     A*  TABELLA MAS: MASSA MEZZO AUTISTA
000300060131     A*--------------------------------------------------------------*
000400161026     A          R D§MAS                     TEXT('MASSA')
000500161026     A            D§MASDES      30          TEXT('DESCRIZIONE')
