000100060131     A*--------------------------------------------------------------*
000200060131     A*  TABELLA ABC: ABILITAZIONI CLIENTI                           *
000300060131     A*--------------------------------------------------------------*
000400060131     A          R D你BC                     TEXT('ABILITAZIONI CLIENTI')
000500081203     A            D你BCDES      40A         TEXT('DESCRIZIONE')
000600081203     A            D你BCAUT      20A         TEXT('CHI AUTORIZZA ABILITAZIONE')
000700060209     A            D你BCORD       3S 0       TEXT('ORDINAMENTO DI VISUALIZ.')
000800060201     A            D你BCFILE     10A         TEXT('FILE TABELLA')
