000100040408      *--------------------------------------------------------------*
000200040422      *  TABELLA "MPT" - PICKING TABELLA POSTAZIONI                  *
000300040408      *--------------------------------------------------------------*
000400040422     A          R D§MPT                     TEXT('PICKING: TABELLA POSTAZIONI')
000500040408      *
000600040408     A            §MPTDES       35A         TEXT('DESCRIZIONE')
000700040422     A            §MPTSIV        1A         TEXT('PCK VDL: _=FACOLT. S=OBBLIG. -
000800040422     A                                      N=NON UTILIZZABILE')
000900040422     A            §MPTNOV        1A         TEXT('PCK NO VDL: _=FACOLT. S=OBBLI-
001000040422     A                                      G. N=NON UTILIZZABILE')
