000100890918     A*--------------------------------------------------------------*
000200040914     A*  TABELLA MRA: BART-MAILING                                   *
000300890918     A*--------------------------------------------------------------*
000400040914     A          R D§MRA
000500040914     A            §MRADES       25          TEXT('DESCRIZIONE')
000600130730     A            §MRAEM        50          TEXT('INDIRIZZO MAIL ')
000700130730     A            §MRACC        50          TEXT('INDIRIZZO MAIL CC')
