000100990120     A*------------------------------------------------------------------------*
000200990120     A* TABELLA MACCHINONE SMISTACOLLI - PACCHI CIVETTA                        *
000300991227     A* NB. tbeke1 = Filiale  (3,0)                                            *
000400991227     A*     tbeke2 = N° pacco (3,0)                                            *
000500990120     A*------------------------------------------------------------------------*
000600990120     A                                      REF(CNDIZION)
000700990120     A          R D§MSC                     TEXT('SMISTACOLLI - PACCHI CIVETTA')
000800990218     A            §MSCDES   R               REFFLD($DES30)
000900990120     A                                      TEXT('DESCRIZIONE')
001000990219     A            §MSCLNP   R     S         REFFLD($LNP)
001100990120     A                                      TEXT('LINEA PARTENZA SEGNACOLLO')
001200990219     A            §MSCLNA   R     S         REFFLD($LNA)
001300990120     A                                      TEXT('LINEA ARRIVO SEGNACOLLO')
001400990219     A            §MSCNRS   R     S         REFFLD($NRS)
001500990120     A                                      TEXT('SERIE SEGNACOLLO')
001600990219     A            §MSCNSC   R     S         REFFLD($NSC)
001700990120     A                                      TEXT('NUMERO SEGNACOLLO')
001800990219     A            §MSCZNC   R     S         REFFLD($ZSC)
001900990120     A                                      TEXT('ZONA CONSEGNA SEGNACOLLO')
002000990219     A            §MSCPES        6S 3       TEXT('PESO')
002100990315     A            §MSCVOL        7S 6       TEXT('VOLUME')
