000100890918     A*--------------------------------------------------------------*
000200040220     A*  TABELLA  "OGR"  OGGETTO RECLAMI
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500040220     A          R D§OGR                     TEXT('OGGETTI RECLAMI')
000600040220     A            §OGRDESC      30A         TEXT('DESCRIZIONE')
000700040220     A            §OGRCCHA      10A         TEXT('CHI CHIAMA ABILITATI')
