000100890918     A*--------------------------------------------------------------*
000200150325     A          R D別LP                     TEXT('ORA LIMITE PICKING FIL.')
000300150325     A            別LPORA        4S 0       TEXT('ORA LIMITE PICKING')
000301150416     A            別LPFILL       1A         TEXT('LASCIARE VUOTO')
000700150325     A            別LPDFIL      20A         TEXT('DESCRIZIONE FILIALE')
