000100981229      *---------------------------------------------------------------*
000200080310      *  ARCHIVIO ESTENSIONE TESTATA ORM
000300080310      *                  DS DEL CAMPO DATI ORGFLO - FLAG OPERATIVI
000400981229      *---------------------------------------------------------------*
000500981229     A                                      REF(CNDIZION)
000600981229      *
000700080310     A          R D§ORG                     TEXT('ORM: FLAG OPERATIVI FNORG')
000800981229      *
000900080310     A            §ORGPDA        1A         TEXT('ORM SCARICATO A PDA S=SI')
