000100981229      *---------------------------------------------------------------*
000200010730      *  ARCHIVIO ORM  : ANGRAFICA RITIRI FISSI
000300010730      *                  DS DEL CAMPO DATI ORSFLO - FLAG OPERATIVI
000400981229      *---------------------------------------------------------------*
000500981229     A                                      REF(CNDIZION)
000600981229      *
000700010730     A          R D§ORS                     TEXT('ORM: FLAG OPERATIVI FNORS')
000800981229      *
000900010730     A            §ORSDIF        8S 0       TEXT('DATA INIZIO FERIE AAAAMMGG')
001000010730     A            §ORSDFF        8S 0       TEXT('DATA FINE FERIE AAAAMMGG')
