000100991203      *--------------------------------------------------------------*
000200170914      *  D.E. SOTTODEFINIZIONE PNDETIU FILE FIPND00F PER ETICHETTA DP5
000300991203      *--------------------------------------------------------------*
000400970929     A                                      REF(CNDIZION)
000500170914     A          R DPNDDP5                   TEXT('DS PER FIPND00F CAMPO P"-
000600170914     A                                      NDETIU-ETICH. DP5')
000700991203      *
001000170914     A            §PNDICD        1A         TEXT('CHECK DIGIT PARCEL NUMBER')
001001170914     A            §PNDBUCA       3A         TEXT('DEST. BU STRING')
001002170914     A            §PNDDSORT      5A         TEXT('DESTINATION SORT')
001003170914     A            §PNDDSRVX     18A         TEXT('SERVICE CODE TEXT')
001004170914     A            §PNDDSRVM      1A         TEXT('SERIVCE MARK')
001005170914     A            §B4IBI         1A         TEXT('BARCODE ID')
001006170914     A            §PNDDDPTC      2A         TEXT('DESTINATION DEPOT COUNTRY -
001007170914     A                                        ISO2')
001008170914     A            §PNDISO2       2A         TEXT('DESTINATION COUNTRY - ISO2-
001009170914     A                                       (DA TAB. 15')
001010170914     A            §PNDNTWC       3A         TEXT('DESTINATION NETWORK CODE')
001011170914     A            §PNDSSORT      5A         TEXT('S-.SORT')
001012170914     A            §PNDOSORT      5A         TEXT('O-SORT')
001013170914     A            §PNDCSORT      5A         TEXT('C-SORT')
001014170914     A            §PNDCADP       7A         TEXT('CAP AD USO SEGNACOLLO')
001015170914     A            §PNDVERD       8A         TEXT('VERSIONE CAPPARIO DPD')
001016170914     A            §PNDREF       35A         TEXT('REFERENTE CONSEGNA')
001017170914     A            §PNDTELD      16A         TEXT('TELEFONO DESTINATARIO')
001018170914     A            §PNDDSI       40A         TEXT('DELIVERY SPECIAL INSTRUC-
001100170914                                            TION (20+20 IN STAMPA')
