000100070111      *--------------------------------------------------------------*
000200070111      *  TABELLA TIPO RECORD FILE FIPRC00R
000300070111      *--------------------------------------------------------------*
000400070111     A          R D§PRC                     TEXT('TIPO RECORD FIPRC00R')
000500070111     A            D§PRCDS       10A         TEXT('DS X LEGGERE PRCDATI')
000600070111     A            D§PRCDES      30A         TEXT('DESCRIZIONE TIPO RECORD')
