000100890918     A*--------------------------------------------------------------*
000200040323     A*  TABELLA  "PRR"  CODICI PRIORITA' RECLAMI
000300890918     A*--------------------------------------------------------------*
000400040323     A          R D§PRR                     TEXT('PRIORITA RECLAMI')
000500040323     A            §PRRDESC      30A         TEXT('DESCRIZIONE')
