000100080408      *PARMS MBR(*NONE)
000200080408      *---------------------------------------------------------------*
000300140331      *  FLAG OPERATIVI X GESTIONE OPERATIVITÀ DEL PDA
000400080408      *---------------------------------------------------------------*
000500140331     A          R D§PSPFLAG                 TEXT('DS PSP X FLAG OPERATIVI')
000600070212      *
000700140331     A            §PSPCUS        1          TEXT('OK USCIRE 0=SEMPRE ABILITATO-
000800140331     A                                      /1=CON ALERT/2=OBBLIGO ORA STIMATA')
000900140409     A            §PSPGPS        1          TEXT('COORDINATE GE0 0=ACCENDERE GP-
001000140409     A                                      S/1=NON ACCENDERE GPS')
