000100110411      */*PRM mbr(*none) size(1 0 0)
000200110411      */*END
000300090216      *--------------------------------------------------------------*
000400090216      *? Tabella "PXA": Promemoria per l'autotrasportatore (in LdV) ?*
000500090216      *--------------------------------------------------------------*
000600090216     A          R D§PXA                     TEXT('Promemoria per l''a-
000700090216     A                                      utotrasportatore in LdV')
000800110411     A            §PXATXT       76A         TEXT('Riga di testo nel b-
000900110411     A                                      ox "Promemoria per l''AUT-
001000110411     A                                      "')
