000100890918     A*--------------------------------------------------------------*
000200100617     A*  TABELLA ATR :                                               *
000300890918     A*--------------------------------------------------------------*
000400100617     A          R D你TR
000500100617      *
000600100617     A            你TRDTB        1          TEXT('BOLLE DA TRASMETTERE -
000700100617     A                                      BLANK=NEGATIVE/BLANK=ENTRAMBE')
000800100617      *
000900100617     A            你TRSGD        1          TEXT('DETTAGLIO SEGNACOLLI:-
001000100617     A                                      S=SEMPRE/N=NEGATIVI/M=MAI')
001100100617      *
001200100617     A            你TRECC        1          TEXT('S=RITORNO ECCEDENZE')
001300100615      *
001400100618     A            你TRRIF       35          TEXT('IDENTIFICATIVO CLIENTE - UNB')
003700100617      *
003900100618      *
