000100990120     A*------------------------------------------------------------------------*
000200081013     A* CAMPO FLAG OPERATIVI (RABFOP) DEL FILE FIRAB00F                        *
000300990120     A*------------------------------------------------------------------------*
000400990120     A                                      REF(CNDIZION)
000500081013     A          R D§RABFOP                  TEXT('FLAG OPERATIVI-FIRAB00F')
000600081013     A            §RABCONF       1          TEXT('S=BOLLA CONFERMATA')
000700081013     A            §RABFOP       19          TEXT('LIBERO')
