000100890918     A*--------------------------------------------------------------*
000200990129     A*  TABELLA  "RES"  ATTRIBUZIONE RESPONSABILITA' DANNI
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500990129     A          R D§RES                     TEXT('CAUSALI CHIUSURA C.A.')
000600990129     A            §RESTCR1       1A         TEXT('TABELLA P.O. RESPONSABILE')
000700990129     A            §RESTCR2       1A         TEXT('TABELLA P.O. RESPONSABILE')
000800990129     A            §RESTCR3       1A         TEXT('TABELLA P.O. RESPONSABILE')
000900990129     A            §RESTCR4       1A         TEXT('TABELLA P.O. RESPONSABILE')
001000990129     A            §RESTCR5       1A         TEXT('TABELLA P.O. RESPONSABILE')
001100990129     A            §RESTCR6       1A         TEXT('TABELLA P.O. RESPONSABILE')
001200990129     A            §RESTCR7       1A         TEXT('TABELLA P.O. RESPONSABILE')
001300990129     A            §RESTCR8       1A         TEXT('TABELLA P.O. RESPONSABILE')
001400990129     A            §RESTCR9       1A         TEXT('TABELLA P.O. RESPONSABILE')
001500990129     A            §RESTCR10      1A         TEXT('TABELLA P.O. RESPONSABILE')
001600990129     A            §RESPER1       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
001700990129                                            ''')
001800990129     A            §RESPER2       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
001900990129                                            ''')
002000990129     A            §RESPER3       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002100990129                                            ''')
002200990129     A            §RESPER4       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002300990129                                            ''')
002400990129     A            §RESPER5       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002500990129                                            ''')
002600990129     A            §RESPER6       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002700990129                                            ''')
002800990129     A            §RESPER7       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002900990129                                            ''')
003000990129     A            §RESPER8       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
003100990129                                            ''')
003200990129     A            §RESPER9       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
003300990129                                            ''')
003400990129     A            §RESPER10      5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
003500990129                                            ''')
003600990216     A            §RESTRE        4A         TEXT('TABELLA ATTRIBUZIONI RESPONSA-
003700990216                                            BILITA')
