000100140416     A          R DSAOFLO                   TEXT('DS RIDEF. FLAG OPERATIVI')
000200140416     A            §SAOFLOTIP     1A         TEXT('T=TEST')
