000100000328      *--------------------------------------------------------------*
000200160404      *  TIPI RECORD PER SISDE00F LOG
000300000328      *--------------------------------------------------------------*
000400160404     A          R D§LOG                     TEXT('DS PER TIPI RECORD LOG')
000500000328      *
000600160414     A            §LOGICMP      15S 5       TEXT('IMPORTO COMPETENZA')
