000100021002      *------------------------------------------------------------------------*
000200021002      * STATISTICHE FILIALE PARTENZE/ARRIVI DATE LANCIO
000300021002      *------------------------------------------------------------------------*
000400021002      *  CHIAVE:  TBEKE1 = Terminal di partenza
000500021002      *           TBEKE2 = BLANK
000600021002      *--------------------------------------------------------------*
000700020925     A                                      REF(CNDIZION)
000800021002     A          R D§SDF                     TEXT('Statistiche filiale ')
000900021016     A            §SDFARRP       8S 0       TEXT('Data prima elab.stat.ARRIVI')
001000021016     A            §SDFARRU       8S 0       TEXT('Data ultima elab.stat.ARRIVI')
001100021016     A            §SDFPARP       8S 0       TEXT('Data prima elab.stat.PARTITO')
001200021016     A            §SDFPARU       8S 0       TEXT('Data ultima elab.stat.PARTITO-
001300021002     A                                      ')
001400021016     A            §SDFTERP       8S 0       TEXT('Data prima elab.stat.A TERRA')
001500021016     A            §SDFTERU       8S 0       TEXT('Data ultima elab.stat.A TERRA-
001600021002     A                                      ')
001700021016     A            §SDFENTP       8S 0       TEXT('Data prima elab.stat.CONTROLL-
001800021016     A                                      O ENTRATA')
001900021016     A            §SDFENTU       8S 0       TEXT('Data ultima elab.stat.CONTROL-
002000021002     A                                      LO ENTRATA')
002100021016     A            §SDFBOLP       8S 0       TEXT('Data prima elab.stat.BOLLETTA-
002200021016     A                                      TO')
002300021016     A            §SDFBOLU       8S 0       TEXT('Data ultima elab.stat.BOLLETT-
002400021002     A                                      ATO')
002500021016     A            §SDFSTCU       6S 0       TEXT('AA/MM ultima elab.stat.COMMER-
002600021016     A                                      CIALE')
