000100000000     A*------------------------------------------------------------------------*
000200011003     A* LETTURA TIPO RECORD "CE" TABELLA GED                                   *
000300000000     A*------------------------------------------------------------------------*
000400011003     A          R DS§GEDCE                  TEXT('GED - TIPO RECORD CE')
000500011026     A            §GEDCEDIP      3A         TEXT('DIVISA CALCOLO CE PRIMA')
000600011026     A            §GEDCEDIV      3A         TEXT('DIVISA CALCOLO CD DOPO')
000700011026     A            §GEDCEDAT      8S 0       TEXT('DATA CAMBIO VALIDITA DIVISA')
