000100070919     A*--------------------------------------------------------------*
000200070919     A*  TABELLA SLO: SEQUENZA LETTURA ORM X AUTOASSEGNAZIONE        *
000300070919     A*--------------------------------------------------------------*
000400070919     A          R D§SLO                     TEXT('SEQUENZA LETTURA ORM')
000500070919     A            D§SLODES      30A         TEXT('DESCRIZIONE')
000600070919     A            D§SLOPRG       4S 0       TEXT('SEQUENZA')
