000100060131     A*--------------------------------------------------------------*
000200150304     A*  TABELLA SPC STATO DATA PREVISTA CONSEGNA                   *
000300060131     A*--------------------------------------------------------------*
000400150304     A          R D§SPC                     TEXT('SPC - STATO DATA PREV.CONS')
000500150304     A            §SPCDEC1      35          TEXT('DESCRIZIONE 1')
000600150304     A            §SPCDEC2      35          TEXT('DESCRIZIONE 2')
000700150304     A            §SPCNOT1      70          TEXT('NOTE        1')
000800150306     A            §SPCNOT2      70          TEXT('NOTE        2')
