000100060131     A*--------------------------------------------------------------*
000200101118     A*  TABELLA SQA: SISTEMA QUADRATURA DISTINTE AUTISTI            *
000300060131     A*--------------------------------------------------------------*
000400101118     A          R D§SQA                     TEXT('SISTEMA QUADRATURA DIST.AUT.')
000500101118     A            D§SQAELA       1A         TEXT('ERRORE DA MEMORIZZARE S/N')
000600101118     A            D§SQASCE       1A         TEXT('SCELTA DA PROPORRE 1=INSERIRE-
000700101118     A                                      /2=TOGLIERE/3=TRASFERIRE')
000800101118     A            D§SQADES     100A         TEXT('DESCRIZIONE ERRORE')
000900101126     A            D§SQATPD       1A         TEXT('S=DESCRIZIONE ERR DA TABELLA')
