000100890918     A*--------------------------------------------------------------*
000200151230     A*  DS PER CAMPO SREUNI DEL FILE TNSRE00F CAUSALE XAF           *
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500151230     A          R D§SREXAF                  TEXT('RETTIFICHE X FATT.FORNITORI')
000600020329      *
000700151230     A            §SREXAFDF      8  0       TEXT('DATA FATTURA ANTICIPO')
000800151230     A            §SREXAFNF      9  0       TEXT('NUMERO FATTURA ANTICIPO')
