000100890918     A*--------------------------------------------------------------*
000200151230     A*  TABELLA  SRE  RETTIFICHE SEDE FATTURE FORNITORI             *
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500151230     A          R D§SRE                     TEXT('RETTIFICHE X FATT.FORNITORI')
000600020329      *
000700151230     A            §SREDES       30A         TEXT('DESCRIZIONE ')
000800160115     A            §SRESEGNO      1A         TEXT('+=POSITIVO/-=NEGATIVO/E=ENTRA-
000900160115     A                                      MBI')
