000100890918     A*--------------------------------------------------------------*
000200050523     A*  TABELLA  "STD"  INDIRIZZO AIG
000300890918     A*--------------------------------------------------------------*
000400990204     A          R D§STD                     TEXT('STANDARD DANNI 2')
000500050519     A            §STD4RSC      35          TEXT('RAGIONE SOCIALE')
000600050519     A            §STD4IND      35          TEXT('INDIRIZZO')
000700050519     A            §STD4CAP       9          TEXT('CAP')
000800050519     A            §STD4LOC      35          TEXT('LOCALITA''')
000900050519     A            §STD4PRV       2          TEXT('PROVINCIA')
001000050523     A            §STD4DES      60          TEXT('MAIL AIG')
001100050523     A            §STD4DE2      60          TEXT('ULTERIORE DESTINATARIO MAIL')
001200050519     A            §STD4FLG       1          TEXT('L=LETTERA;M=MAIL')
