000100890918     A*--------------------------------------------------------------*
000200980525     A*  TABELLA  "STD"  DATI STANDARD DANNI
000300890918     A*--------------------------------------------------------------*
000400980525     A          R D§STD                     TEXT('STANDARD DANNI')
000500010903     A            §VUOTO02       7S 0       TEXT('CAMPO VUOTO')
000600980619     A            §STDPTL        5S 2       TEXT('PERCENTUALE DI TOLLERANZA AUM-
000700980619     A                                      ENTO IMPORTO LIQUIDAZIONE')
000800980917     A            §STDCPD        2S 0       TEXT('C.A. PER PAGINA IN DENUNCIA')
000900990226     A            §STDIPA       13S 3       TEXT('LIMITE PERIZIA PER AVARIE')
001000051116      ** SE IL CAMPO STDMOD E' UGUALE A "S" VANNO IN LINEA LE MODIFICHE
001100051116      ** CAMPO PROVVISORIO
001200051116     A            §STDMOD        1          TEXT('MODIFICA LT DEL 161105')
001300051116     A            §VUOTO         1          TEXT('CAMPO VUOTO')
001400130911     A            §STDGLD        6S 0       TEXT('DATA FUSIONE GLD IN SETRAS')
001500990211     A            §STDMTL        4S 0       TEXT('MINUTI DI TOLLERANZA SCARICO -
001600010903     A                                      PISTOLA')
001700990301     A            §STDIDA       13S 3       TEXT('IMP. LIMITE PER DOCUMENTO AVA-
001800010903     A                                      RIE')
001900990301     A            §STDVDA        3          TEXT('VALUTA IMP. LIMITE PER DOCUME-
002000010903     A                                      NTO AVARIE')
002100990301     A            §STDVPA        3          TEXT('VALUTA LIMITE PERIZIA AVARIE')
002200990301     A            §STDIAC       13S 3       TEXT('IMP. LIMITE AVARIE PER CONSUL-
002300010903     A                                      DANNI')
002400990301     A            §STDVAC        3          TEXT('VALUTA IMP. LIMITE AVARIE PER-
002500010903     A                                       CONSULDANNI')
002600990301     A            §STDILC       13S 3       TEXT('IMP. LIMITE NO AVARIA PER CON-
002700010903     A                                      SULDANNI')
002800990301     A            §STDVLC        3          TEXT('VALUTA IMP. LIMITE NO AVARIA -
002900010903     A                                      PER CONSULDANNI')
003000130806     A            FILLER3        5          TEXT('LIBERO')
003100990507     A            §STDFRC        3S 0       TEXT('FASE LIMITE INFERIORE PER INT-
003200010903     A                                      ERROGAZIONE CONSULDANNI')
003300010903     A            §STDLLT        9S 3       TEXT('LIMITE LIQUID.TRANSATTIVA IN -
003400010903     A                                      VALUTA')
003500010903     A            §STDVLL        3          TEXT('VALUTA LIMITE LIQUID.TRANSATT-
003600010903     A                                      IVA')
003700031211     A            §STDLPF1       9S 3       TEXT('1° LIMITE PRATICHE IN FRANCHI-
003800031211     A                                      GIA')
003900031211     A            §STDDLPF1      8S 0       TEXT('DATA DECORRENZA PER 1° LIMITE-
004000031211     A                                       PRATICHE IN FRANCHIGIA')
004100031211     A            §STDLPF2       9S 3       TEXT('2° LIMITE PRATICHE IN FRANCHI-
004200031211     A                                      GIA')
004300031211     A            §STDDLPF2      8S 0       TEXT('DATA DECORRENZA PER 2° LIMITE-
004400031211     A                                       PRATICHE IN FRANCHIGIA')
004500130806     A            FILLER4       10          TEXT('LIBERO')
004600050516     A            §STDLAC       13S 3       TEXT('IMP. LIMITE C.A. CHE PAGA AIG-
004700050516     A                                      ')
004800050516     A            §STDLAE       13S 3       TEXT('IMP. LIMITE EVENTO CHE PAGA -
004900050516     A                                      AIG')
005000130806     A            FILLER5       10          TEXT('LIBERO')
005100080228     A            §STDPWLT      10          TEXT('PASSWORD PGM TNTB63R LIMITI-
005200080228     A                                       LT CLIENTI')
005300081110     A            §STDIMA       13S 3       TEXT('LIMITE AMMANCHI/MANCANZE')
005400090303     A            §STDRSVAL      1S 0       TEXT('NUMERO DI VOLTE CHE MOLTIPL-
005500090303                                            ICO LA RESPONS.X COLLI DI VALORE')
005600120619     A            §STDPERMAX     5S 2       TEXT('PERCENTUALE MASSIMA RESPO -
005700120619     A                                      DANNI INSERIBILE')
