000100991124     A*------------------------------------------------------------------------*
000200991124     A* STATISTICHE: IMPORTI VARI
000300991124     A*------------------------------------------------------------------------*
000400991124     A                                      REF(CNDIZION)
000500991124     A          R D§STI                     TEXT('STATISTICHE IMPORTI VARI')
000600991124     A            §STIDE        30          TEXT('DESCRIZIONE TARIFFA')
000700991124     A            §STISI        13S 3       TEXT('IMPORTO SCAGLIONE INFERIORE')
000800991124     A            §STISF        13S 3       TEXT('IMPORTO SCAGLIONE SUPERIORE')
000900991124     A            §STITA         6S 3       TEXT('IMPORTO TARIFFA AL KG')
