000100981229      *---------------------------------------------------------------*
000200090402      *  BOLLE SEDE: ESTENSIONE
000300981229      *---------------------------------------------------------------*
000400981229     A                                      REF(CNDIZION)
000500981229      *
000600090423     A          R D§TA4M                    TEXT('BOLLE SEDE: ESTENSIONE')
000700981229      *
000800090423     A            §TA4MPOE       3S 0       TEXT('ORM - P.O. EMISSIONE')
000900090423     A            §TA4MNSR       2S 0       TEXT('ORM - NUMERO SERIE')
001000090423     A            §TA4MNOR       7S 0       TEXT('ORM - NUMERO RITIRO')
001100090423     A            §TA4MNRV       2S 0       TEXT('ORM - NUMERO VIAGGIO')
