000100150902     A*--------------------------------------------------------------*
000200150902     A*  DS PER PASSAGGIO PARAMETRI PER APPLICAZIONE AUMENTO PESO
000300150902     A*     IN TASSAZIONE SINGOLA SPEDIZIONE
000400150902     A*--------------------------------------------------------------*
000500150902     A          R D§TASPES                  TEXT('APPLICAZIONE AUMENTO PESO')
000600150902     A            TASPTLA        1A         TEXT('TIPO LANCIO: -
000700940923     A                                      " "-ELABOR E RT  L-ELABORA E LR -
000800940923     A                                      C-SOLO LR')
000900150902     A            TASPPKB        7P 1       TEXT('PESO BOLLETTATO IN KG')
001000941108     A*--------------------------------------------------------------*
001100941124     A* C A M P I   D I   O U T P U T
001200941124     A*
001300150902     A            TASPMAG        1A         TEXT('S=UTILIZZATO PESO MAGGIORATO')
001400150902     A            TASPPKM        7P 1       TEXT('PESO MAGGIORATO')
001500150902     A            TASPANNO       4  0       TEXT('ANNO STATISTICA PESI')
001600150902     A            TASPMESE       2  0       TEXT('MESE STATISTICA PESI')
001700150902     A            TASPCOLLI      5  2       TEXT('% COLLI RILEVATI')
001800150902     A            TASPSCOST      7  2       TEXT('% SCOSTAMENTO PESO')
001900150902     A            TASPNSP        7  0       TEXT('NUM.SPEDIZ. RILEVATE')
002000150902     A            TASPIMM       13  3       TEXT('IMPONIBILE PESO MAGGIORATO')
002100150902     A            TASPERR        1A         TEXT('FLAG ERRORE')
002200150902     A            TASPMSG       78A         TEXT('MESSAGGIO DI ERRORE')
