000100021028     A*------------------------------------------------------------------------*
000200060922     A* DS FLAG OPERATIVI DI TASFLO CAMPO DELLA DS                             *
000300021028     A*------------------------------------------------------------------------*
000400021028     A                                      REF(CNDIZION)
000500060922     A          R D§TAS01                   TEXT('DS FLAG OPERATIVI DTAS')
000600060922     A            §ASFBR    R               REFFLD($FBR)
000700060922     A            §ASCCA    R               REFFLD($CCA)
