000100000328      *--------------------------------------------------------------*
000200060412      *  DS INDICI TABELLE TNTBE00F
000300000328      *--------------------------------------------------------------*
000400060412     A          R D§TBE01                   TEXT('DS PER INDICI TABELLE')
000500000328      *
000600060412     A            §TBEDESC      52A         TEXT('DESCRIZIONE')
000700060412     A            §TBEFILL     193A         TEXT('LIBERO')
000800060412     A            §TBEFGLIN      1A         TEXT('FLAG TABELLA GESTITA IN LINGU-
000900060412     A                                      A S=SI')
001000060412     A            §TBEPGM       10A         TEXT('PROGRAMMA GESTIONE TAB.')
