000100890918     A*--------------------------------------------------------------*
000200050209     A*  TABELLA  "TFT"  TIPI FATTURA CLIENTI
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500050209     A          R D§TFT                     TEXT('TIPI FATTURA CLIENTI')
000600050209     A            §TFTDES       25A         TEXT('DESCRIZIONE')
000700050209     A            §TFTUTI        1A         TEXT('UTILIZZO TIPO FATTURA: F=SOLO-
000800050209                                             FILIALE S=SOLO SEDE " "=ENTRAMBI')
000900050513     A            §TFTDES1       7A         TEXT('DESCRIZIONE BREVE')
