000100890918     A*--------------------------------------------------------------*
000200991014     A*  TABELLA  "TLE"  DS TABELLA TIPI LEGAMI CLIENTI UNIFICANTI
000300890918     A*--------------------------------------------------------------*
000400991014     A          R D§TLE                     TEXT('TIPI LEGAMI ')
000500991014     A            §TLEDESC      30A         TEXT('DESCRIZIONE')
000600991014     A            §TLECU         1A         TEXT('TIPO CODICE UNIFICANTE -
000700991014     A                                            C=CLIENTE P= POTENZIALE')
000800991014     A            §TLECE         1A         TEXT('TIPO CODICE ELEMENTARE -
000900991014     A                                           C= CLIENTE P= POTENZIALE')
001000991014     A            §TLEAL1        2A         TEXT('LEGAME ALTERNATIVO 1')
001100991014     A            §TLEAL2        2A         TEXT('LEGAME ALTERNATIVO 2')
001200991014     A            §TLEAL3        2A         TEXT('LEGAME ALTERNATIVO 3')
001300000307     A            §TLEAUT        1A         TEXT('AUTORIZZAZ. FILIALE')
001400000807     A            §TLEAUS        1A         TEXT('AUTORIZZAZ. SEDE')
001500000807     A            §TLEAUE        1A         TEXT('AUTORIZZAZ. EDP')
001600090803     A            §TLEGRP        1A         TEXT('GRUPPO: W=tipo WW  S=tipo ST')
