000100070329     A*------------------------------------------------------------------*
000200070329     A*  DS RIDEFINIZIONE DATI D OUTPUT A TELLUS - DOWNLOAD ANAGR. GIRI  *
000300070329     A*------------------------------------------------------------------*
000400990906     A                                      REF(CNDIZION)
000500070329     A          R D§TLLGO                   TEXT('DS DOWNLOAD A TELLUS')
000600060804     A*
000800070329     A            §TLLGOATB R     A         REFFLD($ATB)
000900070329     A                                      TEXT('FLAG VALIDITA')
000901070329     A                                      COLHDG('FLAG. VALIDITA')
002300070329     A            §TLLGOFGS R     A         REFFLD($LNP)
002400070329     A                                      TEXT('FILIALE GESTIONE')
002500070329     A                                      COLHDG('FIL. GESTIONE')
002501070329     A            §TLLGOCGI     10A         TEXT('CODICE GIRO')
002502070329     A                                      COLHDG('CODICE GIRO')
002503070329     A            §TLLGOAIN      1A         TEXT('AMBITO INSTRADAMENTO')
002504070329     A                                      COLHDG('AMBITO INSTRADAMENTO')
002505070329     A            §TLLGODES     30A         TEXT('DESCRIZIONE GIRO')
002506070329     A                                      COLHDG('DESCRIZIONE GIRO')
002507070329     A            §TLLGOVER      8A         TEXT('VERSIONE')
002508070329     A                                      COLHDG('VERSIONE')
002600070330     A            §TLLGOFLO     20A         TEXT('FLAG OPERATIVI')
002700070330     A                                      COLHDG('FLAG OPERATIVI')
