000100890918     A*--------------------------------------------------------------*
000200060804     A*  DS RIDEFINIZIONE DATI D INPUT DA TELLUS - UPLOAD            *
000300890918     A*--------------------------------------------------------------*
000400990906     A                                      REF(CNDIZION)
000500160415     A          R D§TLLOI                   TEXT('DS UPLOAD DA TELLUS')
000600060804     A*
000700160415     A* KEY RITIRO
000800160512     A            §TLLOIAAS      2A         TEXT('ANNO FORMATO AA')
000900160504     A                                      COLHDG('ANNO FORMATO AA')
001000160415     A            §TLLOIPOE R     A         REFFLD($FIL)
001100160415     A                                      TEXT('FILIALE EMISSIONE')
001200160415     A                                      COLHDG('FIL.' 'EMI.')
001300160415     A            §TLLOINSR R     A         REFFLD($NRS)
001400160512     A            §TLLOINOR R     A         REFFLD($NRI)
001500160415     A            §TLLOINRV R     A         REFFLD($NVI)
001600060804     A*
001700060804     A* ID ELABORAZIONE
001800160415     A            §TLLOIIDB R     A         REFFLD($NRP)
001900060804     A                                      TEXT('ID ELABORAZIONE')
002000060804     A                                      COLHDG('ID ELABORAZIONE')
002100060804     A*
002200160415     A* DATI DI RITIRO
002300160415     A            §TLLOIPOR R     A         REFFLD($FIL)
002400160415     A                                      TEXT('FILIALE RITIO')
002500160415     A                                      COLHDG('FIL.' 'RIT.')
002600060804     A*
002700060804     A* DATI GEO-REFERENZIAZIONE
002800160415     A            §TLLOICGI     10A         TEXT('CODICE GIRO')
002900060804     A                                      COLHDG('CODICE GIRO')
003000160415     A            §TLLOIXLO     13A         TEXT('LONGITUDINE X')
003100060804     A                                      COLHDG('LONGITUDINE X')
003200160415     A            §TLLOIYLA     13A         TEXT('LATITUDINE Y')
003300060804     A                                      COLHDG('LATITUDINE X')
003400060804     A*
003500060804     A* DATI DI INSTRADAMENTO NORMALIZZATI
003600160415     A            §TLLOIINDN    80A
003700060804     A                                      TEXT('INDIRIZZO DEST NORMALIZZATO')
003800060804     A                                      COLHDG('INDIRIZZO DEST NORM')
003900160415     A            §TLLOICADNR               REFFLD($CAD)
004000060804     A                                      TEXT('CAP DEST NORMALIZZATO')
004100060804     A                                      COLHDG('CAP DEST NORM')
004200160415     A            §TLLOILODN    80A
004300060804     A                                      TEXT('LOCALITA DEST NORMALIZZATA')
004400060804     A                                      COLHDG('LOCALITA DEST NORM')
004500160415     A            §TLLOIPRDNR               REFFLD($PRD)
004600060804     A                                      TEXT('PROVINCIA DEST NORMALIZZATA')
004700060804     A                                      COLHDG('PROVINCIA DEST NORM')
004800160415     A            §TLLOINZDNR               REFFLD($NZD)
004900060804     A                                      TEXT('NAZIONE DEST NORMALIZZATA')
005000060804     A                                      COLHDG('NAZIONE DEST NORM')
005100060804     A*
005200060804     A* DATI RELATIVI AL GIRO CALCOLATO
005300160415     A            §TLLOISQG      3A
005400060804     A                                      TEXT('SEQUENZA CONS NEL GIRO')
005500060804     A                                      COLHDG('SEQUENZA NEL GIRO')
005600160415     A            §TLLOIDPP      8A
005700060804     A                                      TEXT('DISTANZA PARZIALE P.O.')
005800060804     A                                      COLHDG('DISTANZA PARZ P.O.')
005900160415     A            §TLLOITPP      5A
006000060804     A                                      TEXT('TEMPO PARZIALE P.O.')
006100060804     A                                      COLHDG('TEMPO PARZ P.O.')
006200160415     A            §TLLOILNO      3A
006300060804     A                                      TEXT('LIVELLO NORMALIZZAZIONE')
006400060804     A                                      COLHDG('LIVELLO NORMALIZZ')
006500160415     A            §TLLOIERR      2A
006600060804     A                                      TEXT('CODICE ERRORE TELLUS')
006700060804     A                                      COLHDG('CODICE ERRORE TELLUS')
006800070111     A*
006900070111     A* DATI AGGIUNTIVI
007000160415     A            §TLLOISCO     10A
007100070111     A                                      TEXT('SCORE NORMALIZZAZIONE')
007200070111     A                                      COLHDG('SCORE NORMALIZZ.')
