000100020510      *PARMS MBR(*NONE)
000200900307     A*---------------------------------------------------------------*
000300020510     A*  DS ESTERNA PER TNTLZ00F SU TLZFLO                            *
000400900307     A*---------------------------------------------------------------*
000500020510     A          R DTLZ000
000600020510     A            §TLZFL1        1A         TEXT('S=FOR.CON NUMERAZ. PROPRIA')
