000100991129      *--------------------------------------------------------------*
000200010627      *  TABELLA ALLEGATO TARIFFE CLIENTI
000300991129      *--------------------------------------------------------------*
000400010627     A          R D§TAA                     TEXT('ALLEGATO TARIFFE CLIENTI')
000500991129      *
000600010627     A            §DCCDAD        8S 0       TEXT('DATA DECORRENZA')
000700010627     A            §DCCDES       30          TEXT('DESCRIZIONE')
