000100890918     A*--------------------------------------------------------------*
000200990303     A*  TABELLA  "TRC"  TIPO ATTRIBUZIONE RESPONSABILITA' DANNI
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500990303     A          R D§TRC                     TEXT('TIPO ATTRIBUAZIONE RESPONSAB')
000600990303     A            §TRCDESC      25A         TEXT('DESCRIZIONE')
000700990303     A            §TRCDEUL      40A         TEXT('ULTERIORE DESCRIZIONE PER CAP-
000800990303                                            RE CHI E''')
