000100021028     A*------------------------------------------------------------------------*
000200160205     A* DS LETTURA CAMPO TRCFLR DI AITRC00F                                    *
000300021028     A*------------------------------------------------------------------------*
000400160205     A          R D§TRCFLR                  TEXT('DS lettura TRCFLR di AITRC00F-
000500040524                                            ')
000600160205     A            §TRCCOR        1
000700160211     A                                      TEXT('FLAG STATO L190/14')
003300160211     A                                      COLHDG('FLAG' 'STATO L190/14')
003400160205     A            §TRCFLR       29          TEXT('FILLER')
003500160205     A                                      COLHDG('FILLER ')
