000100890918     A*--------------------------------------------------------------*
000200990304     A*  TABELLA  "TRS"  ATTRIBUZIONE RESPONSABILITA' DANNI
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500990304     A          R D§TRS                     TEXT('CALCOLO RESPONSABILITA''')
000600990304     A            §TRSTCR1       1A         TEXT('TABELLA P.O. RESPONSABILE')
000700990304     A            §TRSTCR2       1A         TEXT('TABELLA P.O. RESPONSABILE')
000800990304     A            §TRSTCR3       1A         TEXT('TABELLA P.O. RESPONSABILE')
000900990304     A            §TRSTCR4       1A         TEXT('TABELLA P.O. RESPONSABILE')
001000990304     A            §TRSTCR5       1A         TEXT('TABELLA P.O. RESPONSABILE')
001100990304     A            §TRSTCR6       1A         TEXT('TABELLA P.O. RESPONSABILE')
001200990304     A            §TRSTCR7       1A         TEXT('TABELLA P.O. RESPONSABILE')
001300990304     A            §TRSTCR8       1A         TEXT('TABELLA P.O. RESPONSABILE')
001400990304     A            §TRSTCR9       1A         TEXT('TABELLA P.O. RESPONSABILE')
001500990304     A            §TRSTCR10      1A         TEXT('TABELLA P.O. RESPONSABILE')
001600990304     A            §TRSPER1       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
001700990129                                            ''')
001800990304     A            §TRSPER2       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
001900990129                                            ''')
002000990304     A            §TRSPER3       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002100990129                                            ''')
002200990304     A            §TRSPER4       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002300990129                                            ''')
002400990304     A            §TRSPER5       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002500990129                                            ''')
002600990304     A            §TRSPER6       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002700990129                                            ''')
002800990304     A            §TRSPER7       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
002900990129                                            ''')
003000990304     A            §TRSPER8       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
003100990129                                            ''')
003200990304     A            §TRSPER9       5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
003300990129                                            ''')
003400990304     A            §TRSPER10      5S 2       TEXT('PERCENTUALE DI RESPONSABILITA-
003500990129                                            ''')
003600990304     A            §TRSTRE        4A         TEXT('TABELLA ATTRIBUZIONI RESPONSA-
003700990916                                            BILITA'' MANCANZE/AMMANCHI')
003800990916     A            §TRSTREV       4A         TEXT('TABELLA ATTRIBUZIONI RESPONSA-
003900990916                                            BILITA'' AVARIE')
004000070711     A            §TRSDOPSPU     1A         TEXT('S=VERIFICA DOPPIA SPUNTA')
