000100021028     A*------------------------------------------------------------------------*
000200090518     A* DS LETTURA CAMPO TRSFLR DI AITRS00F                                    *
000300021028     A*------------------------------------------------------------------------*
000400130111     A          R D§TRSFLR1                 TEXT('DS lettura TRSFLR1 X AITRS00F-
000500040524                                            ')
000600130111     A            §TRSSOCPRT     3
000700130111     A                                      TEXT('SOCIETA STAMPATA NEL CONTRAT')
000800150305     A            §TRSDDURC      8          TEXT('DATA D.U.R C.')
000900150305     A                                      COLHDG('DATA' 'D.U.R.C.')
001000150305     A            §TRSDCIP       8          TEXT('DATA   C.I P.')
001100150305     A                                      COLHDG('DATA' 'C.I.P.')
