000100890918     A*--------------------------------------------------------------*
000200080214     A*  TABELLA  "TSA"  TIPO SERVIZIO PER AUT.
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500080214     A          R DTSA                      TEXT('TIPO SERVIZIO X AUT.')
000600080214     A            §TSADES       25A         TEXT('DESCRIZIONE')
000700080214     A            §TSAPDA        1A         TEXT('FLAG INVIO PDA N =NO ')
