000100991129      *--------------------------------------------------------------*
000200051121      *  TABELLA TUC CHI ESEGUE ATTIVITÀ
000300991129      *--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500051121     A          R D§TUC                     TEXT('TABELLA CHI ESEGUE ATTIVITÀ')
000600991129      *
000700051121     A            §TUCDES       20          TEXT('DESCRIZIONE')
