000100991129      *--------------------------------------------------------------*
000200051129      *  TABELLA TUT TIPO MOLTIPLICATORE
000300991129      *--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500051129     A          R D§TUT                     TEXT('TABELLA TIPO MOLTIPLICATORE')
000600991129      *
000700051213     A            §TUTDES       30          TEXT('DESCRIZIONE')
001800051212     A            §TUTRIL        1          TEXT('RILEVABILE DA PGM S/N')
001900051212     A            §TUTQTA        5S 0       TEXT('SE NON RILEVABILE QTA GG')
002000051213     A            §TUTPER        1          TEXT('PERSONALIZZAZ. P.O./CLIENTE/-
002100051213     A                                      ENTRAMBI/NESSUNO')
002200051223     A            §TUTPGM       10          TEXT('PROGRAMMA')
