000100890918     A*--------------------------------------------------------------*
000200040323     A*  TABELLA  "UGR"  UTENTI GESTIONE RECLAMI
000300890918     A*--------------------------------------------------------------*
000400040323     A          R D助GR                     TEXT('UTENTI GESTIONE RECLAMI')
000500040323     A            助GRDESC      30A         TEXT('DESCRIZIONE')
000600040420     A            助GRPREF       1A         TEXT('VALIDO INSERIRE SOLO IL-
000700040420     A                                      PREFISSO')
000800040420     A            助GRPROF       1A         TEXT('VALIDO INSERIRE IL PROFILO')
000900040617     A            助GRPOFO       3S 0       TEXT('PUNTO OPERATIVO DA FORZARE -
001000040617     A                                      IN APERTURA E CHIUSURA RICHIESTA')
