000100000328      *--------------------------------------------------------------*
000200030117      *  TIPI RECORD PER FIVAI00F                                    *
000300000328      *--------------------------------------------------------------*
000400030117     A          R D§VAI                     TEXT('DS PER TIPI RECORD DI FIVAI')
000500000328      *
000600030117     A            §VAIDESC      35A         TEXT('DESCRIZIONE')
000700030117     A            §VAIDSLE      10A         TEXT('NOME DS X LEGGERE VAIDTI')
