000100990120     A*------------------------------------------------------------------------*
000200090512     A* CAMPO ATTRIBUTI (VGDATTRIB) - TIPO 001                                 *
000300990120     A*------------------------------------------------------------------------*
000400990120     A                                      REF(CNDIZION)
000500090512     A          R D§VGD001                  TEXT('ATTRIBUTI OPERATIVI 001')
000600090512     A            §VGD001OUT    10A         TEXT('NOME FILE OUT')
000700090513     A            §VGD001NFP     2A         TEXT('NUMERO FILE X PROGRESSIVO')
000800161212     A            §VGD001RRN    10S 0       TEXT('RELATIVE RECORD NUMBER')
000900170317     A            §VGD001FL1     1A         TEXT('FLAG 1: TIPO VGD "NEW"')
