000100890918     A*--------------------------------------------------------------*
000200080901     A*  TABELLA  "VPO"  VARIABILI PROGRAMMI CONTABILI OPERATIVI
000300080901     A*  RECORD VPC      DATE DECORRENZA VARIE NEI PGM
000400890918     A*--------------------------------------------------------------*
000500030723     A                                      REF(CNDIZION)
000600080901     A          R D§VPOVPC                  TEXT('VARIABILI PGM CONTAB.OPERAT.-
000700070914     A                                      -DECORRENZE')
000800080901     A            §VPOCFPI       8S 0       TEXT('DECOR.RICHIESTA C.F. P.IVA -
000900080901     A                                      IN CHIUSURA DIS. E INC. PREPAG.')
