000100890918     A*--------------------------------------------------------------*
000200030523     A*  TABELLA  "VPO"  VARIABILI PROGRAMMI OPERATIVI
000300890918     A*--------------------------------------------------------------*
000400030723     A                                      REF(CNDIZION)
000500160916     A          R D§VPOEU21                 TEXT('VARIABILI PROGRAMMI OPERATIVI-
000600070914     A                                      ')
000700160916     A            §VPOU01   R     S         REFFLD($FIL)
000800160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
000900160916     A            §VPOU02   R     S         REFFLD($FIL)
001000160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
001100160916     A            §VPOU03   R     S         REFFLD($FIL)
001200160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
001300160916     A            §VPOU04   R     S         REFFLD($FIL)
001400160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
001500160916     A            §VPOU05   R     S         REFFLD($FIL)
001600160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
001700160916     A            §VPOU06   R     S         REFFLD($FIL)
001800160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
001900160916     A            §VPOU07   R     S         REFFLD($FIL)
002000160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
002100160916     A            §VPOU08   R     S         REFFLD($FIL)
002200160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
002300160916     A            §VPOU09   R     S         REFFLD($FIL)
002400160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
002500160916     A            §VPOU10   R     S         REFFLD($FIL)
002600160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
002700160916     A            §VPOU11   R     S         REFFLD($FIL)
002800160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
002900160916     A            §VPOU12   R     S         REFFLD($FIL)
003000160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
003100160916     A            §VPOU13   R     S         REFFLD($FIL)
003200160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
003300160916     A            §VPOU14   R     S         REFFLD($FIL)
003400160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
003500160916     A            §VPOU15   R     S         REFFLD($FIL)
003600160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
003700160916     A            §VPOU16   R     S         REFFLD($FIL)
003800160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
003900160916     A            §VPOU17   R     S         REFFLD($FIL)
004000160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
004100160916     A            §VPOU18   R     S         REFFLD($FIL)
004200160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
004300160916     A            §VPOU19   R     S         REFFLD($FIL)
004400160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
004500160916     A            §VPOU20   R     S         REFFLD($FIL)
004600160916     A                                      TEXT('COD.FILIALE GESTIONE       ')
