000100890918     A*--------------------------------------------------------------*
000200040624     A*  TABELLA  "VPO"  VARIABILI PROGRAMMI OPERATIVI  PER POSTE
000300101119     A*  RECORD   "TELLUS"
000400890918     A*--------------------------------------------------------------*
000500030723     A                                      REF(CNDIZION)
000600101119     A          R D§VPOTEL                  TEXT('VARIABILI PGM OPERATIVI-
000700101119     A                                      PER TELLUS')
000800101119     A            §VPOBOTLLS     2S 0       TEXT('NUMERO MINIMO BOLLE DA PASSAR-
000900101119     A                                      E A TELLUS X ELABORAZIONE')
001000101119     A            §VPOBOMAX      5S 0       TEXT('NUMERO MAX BOLLE PER INVIO A -
001100101119     A                                      TELLUS')
001200111124     A            §VPOATJOB      3S 0       TEXT('NUMERO MAX JOB IN ATTESA DI E-
001300111124     A                                      LABORAZIONE')
001400111124     A            §VPOATBE1      3S 0       TEXT('SECONDI ATTESA PRIMA DI ELABO-
001500111124     A                                      RARE 1 LIV')
001600111124     A            §VPOATBE2      3S 0       TEXT('SECONDI ATTESA PRIMA DI ELABO-
001700111124     A                                      RARE 2 LIV')
001800111124     A            §VPOATAF1      3S 0       TEXT('SECONDI ATTESA SE TROPPI LAVO-
001900111124     A                                      RI IN CODA 1 LIV')
002000111124     A            §VPOATAF2      3S 0       TEXT('SECONDI ATTESA SE TROPPI LAVO-
002100111124     A                                      RI IN CODA 2 LIV')
002200150304     A            §VPOUTTLLS     1A         TEXT('N=DISABILITA UTILIZZO TELLUS -
002300150304     A                                      PER RICERCA CAP')
