000100990120     A*------------------------------------------------------------------------*
000200090803     A* CAMPO DATI GENERICI (VSSDTA) DEL FILE TIVSS00F                         *
000300990120     A*------------------------------------------------------------------------*
000400990120     A                                      REF(CNDIZION)
000500090803     A          R D§VSSDTA                  TEXT('DATI GENERICI')
000600090803     A            §VSSSUBK      35          TEXT('SOTTO-INSIEME KSU')
