000100070119      *PARMS MBR(*NONE)
000200070119      *---------------------------------------------------------------*
000300070508      * DWIMUNI1 - DS CAMPO WIMUNI DEL FILE WFAIM00F TRK "1".         *
000400070119      *---------------------------------------------------------------*
000500070119     A                                      REF(CNDIZION)
000600070119      *
000700070508     A          R D§WIMUNI1                 TEXT('DS lettura campo WIM-
000800070508     A                                      UNI file WFAIM00F trk "1"')
000900070119      *
001000070508     A            §WIM1USP  R               REFFLD($PRU)
001100070119     A                                      TEXT('Utente che "spara"')
001200070508     A            §WIM1UIN  R               REFFLD($PRU)
001300070119     A                                      TEXT('Utente che inserisce-
001400070119     A                                      ')
001500070508     A            §WIM1DES      20A
001600070119     A                                      TEXT('Descrizione')
001700070508     A            §WIM1LM1       2S 0
001800070119     A                                      TEXT('Matricola in lettura-
001900070119     A                                      : lunghezza (n° char)')
002000070508     A            §WIM1IM2       2S 0
002100070130     A                                      TEXT('Matricola da riporta-
002200070119     A                                      re: posizione iniziale in -
002300070119     A                                      matricola in lettura')
002400070508     A            §WIM1LM2       2S 0
002500070119     A                                      TEXT('Matricola da riporta-
002600070119     A                                      re: lunghezza (max 15)')
002700070508     A            §WIM1NMI       4S 0
002800070129     A                                      TEXT('Numero totale di mat-
002900070129     A                                      ricole da inserire')
