000100890918     A*--------------------------------------------------------------*
000200110905     A*  TABELLA  "XCO" RCD = DTA - DS PERFECT ORDER: LIMITE DATE X CTR
000300890918     A*--------------------------------------------------------------*
000400030723     A                                      REF(CNDIZION)
000500110905     A          R D§XCOD                    TEXT('PERFECT ORDER: LIMITE DATE -
000600110905     A                                      X CTR')
000700110905     A            §XCODDTI       2S 0       TEXT('GG LIMITE X CTR DTI')
000800110905     A            §XCODDSP       2S 0       TEXT('GG LIMITE X CTR DATA SPED.')
