000100890918     A*--------------------------------------------------------------*
000200020725     A*  TABELLA  Y4O CHIUSURA OPERATORE
000300890918     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500911031     A          R DS§4O                     TEXT('CHIUSURA OPERATORE ')
000600020725     A            §4OCC1         6          TEXT('C/C INCASSI DA ATTRIBUIRE')
000700020725     A            §4OSC1         8          TEXT('S/C INCASSI DA ATTRIBUIRE')
000800020725     A            §4OCO1         4          TEXT('CAUSALE INCASSO ASSEGNATI')
000900020725     A            §4OCC2         6          TEXT('C/C CONTRASSEGNI')
001000020725     A            §4OSC2         8          TEXT('S/C CONTRASSEGNI')
001100020725     A            §4OCO2         4          TEXT('CAUSALE INCASSO C/ASSEGNI')
001200020725     A            §4OCC3         6          TEXT('C/C ABBUONI PASSIVI')
001300020725     A            §4OSC3         8          TEXT('S/C ABBUONI PASSIVI')
001400020725     A            §4OCO3         4          TEXT('CAUSALE ABBUONI PASSIVI')
001500020725     A            §4OCC4         6          TEXT('C/C ABBUONI ATTIVI')
001600020725     A            §4OSC4         8          TEXT('S/C ABBUONI ATTIVI')
001700911031     A            §4OCO4         4A         TEXT('CAUSALE ABBUONI ATTIVI')
001800021118     A            §4OCO5         4          TEXT('CAUSALE GIROCONTO INC.ATTR.')
001900060127     A            §4OCO6         4          TEXT('CAUSALE INCASSO PREPAGATI')
002000060210     A            §4OCC7         6          TEXT('Accredito POS: -
002100060210     A                                      capo conto banca.')
002200060210     A            §4OSC7         8          TEXT('Accredito POS: -
002300060210     A                                      sotto conto banca.')
002400060210     A            §4OCO7         4          TEXT('Accredito POS: -
002500060210     A                                      causale co.ge..')
002600060210     A            §4ODOM         1          TEXT('Accredito POS: -
002700060210     A                                      modalità calcolo data operazione.')
002800060210     A            §4ODOG         1S 0       TEXT('Accredito POS: -
002900060210     A                                      giorni più per data operazione.')
003000060418     A            §4OCC8         6          TEXT('Incasso in sospeso -
003100060418     A                                      postdatato: capo conto.')
003200060418     A            §4OSC8         8          TEXT('Incasso in sospeso -
003300060418     A                                      postdatato: sotto conto.')
003400060418     A            §4OCO8         4          TEXT('Incasso in sospeso -
003500060418     A                                      postdatato: causale co.ge.')
003600000000     A            §4OCO9         4          TEXT('Incasso cliente codificato: -
003700000000     A                                      causale co.ge..')
003800150304     A            §4OCCB         6          TEXT('Dist.Versam. : -
003900150304     A                                      capo conto banca.')
004000150304     A            §4OSCB         8          TEXT('Dist.Versam. : -
004100150304     A                                      sotto conto banca.')
