000100100201     A          R DYIS00001                 TEXT('Tabella YIS -
000200100201     A                                      key1 CONTO_COGE
000300100201     A                                      key2 conto co.ge.')
000400100201     A            SERVIZIO       6S 0       TEXT('Codice servizio.')
