000100010206      *--------------------------------------------------------------*
000200040419      *  MANUTENZIONE
000300010206      *--------------------------------------------------------------*
000400040419     A          R D即NA
000500010206      *
000600040419     A            即NAPWD       10          TEXT('PASSWORD')
000700040419     A            即NADTA        8S 0       TEXT('DATA CREAZ./MODIF. GGMMAAAA')
000800040419     A            即NAFIL       50          TEXT('LIBERO')
