000100000328      *--------------------------------------------------------------*
000200080305      *  FILE FIDSF00F - FASI DISTINTA AUT                           *
000300080924      *  SOTTODEFINIZIONE DI DSFDATI TIPO RECORD 'RCH'               *
000400080924      *   RICEZIONE CONTROLLO AL RIENTRO DI SPC - RITIRI             *
000500021125      *     NON USARE CAMPI PACKED                                   *
000600000328      *--------------------------------------------------------------*
000700080924     A          R FIDSFRCH                  TEXT('DS PER DSFDATI TIPO RECORD -
000800080924     A                                      -RCH- CONTR. AL RIENTRO RITIRI')
000900080924     A            §DSFSPCCOD     2          TEXT('CODICE PROFILO SPC')
001000080924     A            §DSFSPCDES    15          TEXT('DESCRIZIONE PROFILO SPC')
