000100000328      *--------------------------------------------------------------*
000200080227      *  SOTTODEFINIZIONE DI PCTDATI TIPO RECORD 'COK'               *
000300080214      *   RICEZIONE OK DELL'AUT ACCETTAZIONE SPEDIZIONE ASSEGNATA    *
000400021125      *     NON USARE CAMPI PACKED                                   *
000500000328      *--------------------------------------------------------------*
000600080221     A                                      REF(CNDIZION)
000700080227     A          R FIPCTCOK                  TEXT('DS PER PCTDATI TIPO RECORD -C-
000800080214     A                                      OK - ACCETTA SPEDIZIONE')
000900080227     A            §PCTFLGASSR               REFFLD($FLA)
001000080221     A                                      TEXT('FLAG RICHIESTA ASSISTENZA S=S-
001100070201     A                                      I " "=NO')
001200080227     A            §PCTFLGVISR               REFFLD($FLA)
001300080227     A                                      TEXT('FLAG VISIONATA RIC.ASSIST.S=S-
001400080227     A                                      I " "=NO')
001500080227     A            §PCTIDROW      2S 0       TEXT('AVANZAMENTO AGGIORNAMENTO RIG-
001600080225     A                                      A')
001700101126     A            §PCTNOTASS    35          TEXT('NOTE ASSISTENZA')
