000100000328      *--------------------------------------------------------------*
000200070111      *  SOTTODEFINIZIONE DI PRCDATI TIPO RECORD 'RES'               *
000300070111      *   lunghezza massima 250 byte                                 *
000400021125      *     NON USARE CAMPI PACKED                                   *
000500000328      *--------------------------------------------------------------*
000600070111     A          R FIPRCRES                  TEXT('DS PER PRCDATI TIPO RECORD -R-
000700070111     A                                      ES-')
000800031022      *
000900070117     A            §RESFGS        3A         TEXT('P.O. DISTINTA')
001000070117     A            §RESNDC        6A         TEXT('NUMERO DISTINTA')
001100070117     A            §RESPOE        3A         TEXT('P.O. EMISSIONE ORM')
001200070117     A            §RESNSR        2A         TEXT('SERIE ORM')
001300070117     A            §RESNOR        7A         TEXT('NUMERO ORM')
001400070117     A            §RESNRV        2A         TEXT('VIAGGIO ORM')
001500070111     A            §RESDATORA    14A         TEXT('DATA/ORA CONFERMA')
001600070117     A            §RESNCL        5A         TEXT('NUMERO COLLI RITIRATI')
001700070117     A            §RESBNC        5A         TEXT('NUMERO BANCALI RITIRATI')
001800070111     A            §RESNOTE      35A         TEXT('NOTE')
001900070131     A            §RESCMR        3A         TEXT('CAUSALE MANCATO RITIRO')
002000070111     A            §RESRSR       35A         TEXT('RAGIONE SOCIALE RITIRO MAN.')
002100070111     A            §RESINR       35A         TEXT('INDIRIZZO RITIRO MAN.')
002200070111     A            §RESRFA       15A         TEXT('RIFERIMENTO RITIRO MAN.')
002300070212     A            §RESDTORIN    14A         TEXT('DATA/ORA INSER. RECORD')
002400070111     A            §RESFLGSPC     1A         TEXT('INSERITO DA SPC')
002500080214     A            §RESCODFIS    16A         TEXT('CODICE FISCALE')
002600080219     A            §RESPIVA      16A         TEXT('PARTITA IVA')
002700080214     A            §RESISOIVA     2A         TEXT('CODICE ISO PER PARTITA IVA')
002800120515     A            §RESXLONGI     8A         TEXT('LONGITUDINE X')
002900120515     A                                      COLHDG('LONGITUDINE X')
003000120515     A            §RESYLATI      8A         TEXT('LATITUDINE Y')
003100120515     A                                      COLHDG('LATITUDINE Y')
