000100140519     A          R TIS700008                 TEXT('Istruzioni consegna: -
000101140519     A                                      PUTISTRUCO input.')
000102140519     A            FORMATO       10A         TEXT('Formato "TIS700008".')
000103140519     A                                      DFT('TIS700008')
000104140519     A            VERSIONE       1A         TEXT('Versione "A".')
000105140519     A                                      DFT('A')
000106140519     A            LINGUA         2A         TEXT('ID lingua.')
000107140519     A            CLIPADDR      15A         TEXT('Client IP address.')
000108140519     A            CTS           13S 0       TEXT('Client timestamp UTC -
000109140519     A                                      (millesimi dal 1970).')
000110140519     A            SUN            9S 0       TEXT('Strategi User Number.')
000111140519     A            KSU            8A         TEXT('ID cliente unificante.')
000112140519     A            IDBOLLA       14A         TEXT('ID bolla.')
000113140519     A            BRTCODE       19A         TEXT('BRT code.')
000114140519     A            TPELABOR       1A         TEXT('Tipo elaborazione.')
000115140519     **                                     '1' = solo controllo.
000116140519     **                                     '2' = controllo e inserimento.
000117140519     A            TPISTRUZ       1A         TEXT('Tipo istruzione.')
000118140519     **                                     '1' = appuntamento.
000119140519     **                                     '2' = fermo deposito.
000120140519     **                                     '3' = altro indirizzo.
000121140519     **                                     '4' = altra istruzioni.
000122140519     A            NEWDESTREF    35A         TEXT('Nuovo referente consegna.')
000123140519     A            NEWDESTEMA    70A         TEXT('Nuovo indirizzo e-mail.')
000124140519     A            NEWDESTMOB    16A         TEXT('Nuovo n. telefono mobile.')
000125140519     A            NEWDTCONSE    10A         TEXT('Nuova data consegna *EUR.')
000126140519     A            NEWORCONSE     4A         TEXT('Nuova ora consegna HHMM.')
000127140519     A            NEWMATTINO     1A         TEXT('Nuova preferenza mattino.')
000128140519     A            NEWPOMERIG     1A         TEXT('Nuova preferenza pomeriggio.')
000129140519     A            NEWDESTNOM    70A         TEXT('Nuovo nominativo consegna.')
000130140519     A            NEWDESTIND    35A         TEXT('Nuovo indirizzo consegna.')
000131140519     A            NEWDESTCAP     9A         TEXT('Nuovo CAP consegna.')
000132140519     A            NEWDESTLOC    35A         TEXT('Nuova località consegna.')
000133140519     A            NEWDESTPRO     2A         TEXT('Nuova provincia consegna.')
000134140519     A            ALTREISTR    200A         TEXT('Altre istruzioni.')
