000100180111     A          R TIS7DP0O0                 TEXT('REPERIM. ID BOLLA -
000200180111     A                                      DA PARCEL DPD output')
000300180111     A            FORMATO       10A         TEXT('Nome DS "TIS7DP0O0".')
000400180111     A                                      DFT('TIS7DP0O0')
000500180111     A            VERSIONE       1A         TEXT('Versione formato "A".')
000600180111     A                                      DFT('A')
000700180111     A            IDB_AAS        4S 0       TEXT('Anno Spedizione')
000800180111     A            IDB_LNP        3S 0       TEXT('Filiale Partenza')
000900180111     A            IDB_NRS        2S 0       TEXT('Numero serie')
001000180111     A            IDB_NSP        7S 0       TEXT('Numero spedizione')
