000100140519     A          R TIS700006                 TEXT('Istruzioni consegna: -
000101140519     A                                      GETISTRUCO input.')
000102140519     A            FORMATO       10A         TEXT('Formato "TIS700006".)
000103140519     A                                      DFT('TIS700006')
000104140519     A            VERSIONE       1A         TEXT('Versione "A".)
000105140519     A                                      DFT('A')
000106140519
