000100970526     A*--------------------------------------------------------------------------------------------*
000200001020     A* GESTIONE ESTENSIONE ANAGRAFICA CLIENTI ABILIATI                                            *
000300970526     A*--------------------------------------------------------------------------------------------*
000400120529     A          R S36REC                    TEXT('EST. ANAGRAFICA CLINTI ABIL.')BIL.')
000500970526    ?A*-------------------
000600970526    ?A* Parametri informativi
000700970526    ?A*-------------------
000800120529     A            S36OP0         3          TEXT('LIV PROCEDURA MENU CHIAMANTE')
000900970526     A                                      COLHDG('C01,C02,C05' 'L01,L02,L05')
001000120529     A            S36OP1         3          TEXT('LIVELLO PGM  -PGM  CHIAMANTE')
001100970526     A                                      COLHDG('Fxx')
001200120529     A            S36F03         1          TEXT('1=PREMUTO F03-FINE')
001300120529     A            S36F12         1          TEXT('1=PREMUTO F12-RITORNO')
001400120529     A            S36ERR         1          TEXT('1=ERRORE')
001500120529     A            S36MSG        78          TEXT('MESSAGGIO DI RITORNO')
001600120529     A
001700120529     A            S36STS         1A
001800120529     A                                      TEXT('STATO INVIO')
001900120529     A            S36ISV        10A
002000120529     A                                      TEXT('TIPO INVIO')
002100120529     A            S36TIP        10A
002200120529     A                                      TEXT('TIPO CAPPARIO')
002300120529     A            S36CCM         8A
002400120529     A                                      TEXT('CLIENTE')
002500120529     A            S36PRG         3S 0
002600120529     A                                      TEXT('PRG')
002700120529     A            S36DDE         8S 0
002800120529     A                                      TEXT('DATA DECORRENZA')
002900120702     A            S36CMP         1B
003000120702     A                                      TEXT('DA COMPLETARE')
003100120702     A            S36NO3C        1B
003200120702     A                                      TEXT('CLIENTE NON ATTIVO IN TAB.3C')
