000100970526     H*------------------------------------------------------------------------*
000200140627     H* Lancio verifica log upload in errore
000300970526     H*------------------------------------------------------------------------*
000400140627     h decedit('0,') datedit(*dmy/) option(*nodebugio)
000500140702     h dftactgrp(*no)
000600970526     F*------------------------------------------------------------------------*
000700970526     F* DATA BASE
000800970526     F*------------------------------------------------------------------------*
000900970526     D*------------------------------------------------------------------------*
001000970526     D* SCHIERE
001100970526     D*------------------------------------------------------------------------*
001200970526     D*------------------------------------------------------------------------*
001300970526     D* INPUT
001400970526     D*------------------------------------------------------------------------*
001500970526     D*------------
001600970526     D* ARCHITETTURA
001700970526     D*------------
001800970526     D KPJBA         E DS
001900120928
002000121003     d Status         sds
002100121003     d  SDSpgm           *proc
002200121003     d  SDSprm           *parms
002300121003     d  SDSuser              254    263
002400121003
002500140904     d DS7GIR2         ds
002600140701     d pIn_DatDa                      8s 0
002700140701     d pIn_DatA                       8s 0
002800140701     d pIn_Ksc                        8
002900140701     d pIn_Tip                        2
003000140904     d pIn_ISV                        2
003100140702     d pIn_Modo                       1
003200140701     d pOut_Esito                     2  0
003300140627
003400970526     C*------------------------------------------------------------------------*
003500000303     C* MAIN LINES
003600970526     C*------------------------------------------------------------------------*
003700140630     C     *entry        PLIST
003800140630     C                   PARM                    KPJBA
003900140904     C                   MOVEL     KPJBU         DS7GIR2
004000140702     C*
004100140702     C                   SELECT
004200140702     C* modo interattivo
004300140702     C                   WHEN      pIn_Modo = 'I'
004400140702     C                   EXSR      ModoInteratt
004500140702     C* modo batch
004600140702     C                   WHEN      pIn_Modo = 'B'
004700140702     C                   EXSR      ModoBatch
004800140702     C                   ENDSL
004900970526     C*
005000970526     C* FINE PGM
005100140702     C                   SETON                                        RT
005200140702     C*------------------------------------------------------------------------*
005300140702     C* Modo interattivo
005400140702     C*------------------------------------------------------------------------*
005500140702     C     ModoInteratt  BEGSR
005600140703     C*
005700140703     C* eseguo l'estrazione
005800140703     C                   EXSR      Esegui
005900140702     C*
006000140702     C* mostro il risultato su SFL
006100140904     C                   CALL      'TIS7GI1R4'
006200140702     C                   parm                    KPJBA
006300140702     C*
006400140702     C                   ENDSR
006500140703     C*------------------------------------------------------------------------*
006600140703     C* ESEGUI - OPERAZIONI DI LANCIO PGM
006700140703     C*------------------------------------------------------------------------*
006800140703     C     ESEGUI        BEGSR
006900140703     C*
007000140703     C* chiamo
007100140904     C                   CALL      'TIS7GI1R2'
007200140703     c                   parm                    pIn_DatDa
007300140703     c                   parm                    pIn_DatA
007400140703     c                   parm                    pIn_Ksc
007500140703     c                   parm                    pIn_Tip
007600140904     c                   parm                    pIn_ISV
007700140703     c                   parm                    pIn_Modo
007800140703     c                   parm                    pOut_Esito
007900140703     C*
008000140703     C                   ENDSR
008100140702     C*------------------------------------------------------------------------*
008200140702     C* Modo batch
008300140702     C*------------------------------------------------------------------------*
008400140702     C     ModoBatch     BEGSR
008500140702     C*
008600140703     C                   CLEAR                   KPJBU
008700140904     C                   MOVEL     DS7GIR2       KPJBU
008800140703     C* Sottometto l'azione di elaborazione
008900140904     C                   MOVEL     'SGI4'        KCOAZ
009000140703     C***                IF        ??? = ???
009100140703     C                   CALL      'BCH10'
009200140703     C                   PARM                    KPJBA
009300140703     C***                ELSE
009400140904     C***                CALL      'TIS7GI1R5'
009500140703     C***                PARM                    KPJBA
009600140703     C***                ENDIF
009700140702     C*
009800140702     C                   ENDSR
