000100000202     A*%%***********************************************************************
000200000202     A*%%TS  RD  20000202  134055  EDPFG       REL-V4R2M0  5769-PW1
000300000202     A*%%FI+10660100000000000000000000000000000000000000000000000000
000400000202     A*%%FI       0000000000000000000000000000000000000000000000000
000500000202     A*%%***********************************************************************
000600000202     A*------------------------------------------------------------------------*
000700000202     A* Compilare --> Dimensione pagina : 198
000800000202     A*               CPI               : 15
000900000202     A*               PRTQLTY           : *DRAFT
001000000202     A*               USRDTA            : ELENCO CLIENTI ABILITATI/UNIFICANTI
001100000202     A*------------------------------------------------------------------------*
001200000202     A* TESTATA
001300000202     A*------------------------------------------------------------------------*
001400000202     A          R S726TE
001500000202     A*%%***********************************************************************
001600000202     A*%%RI 00000
001700000202     A*%%FS 001
001800000202     A*%%***********************************************************************
001900000202     A                                      SKIPB(001)
002000000202     A                                      SPACEB(001)
002100000202     A            DSFIRS        20A  O     1
002200000202     A                                    30
002300000202     A                                      'TIS726R'
002400000202     A                                   +49
002500000202     A                                      '*** ELENCO CLIENTI ABILITATI ***'
002600000202     A                                   148
002700000202     A                                      'DATA:'
002800000202     A                                    +2
002900000202     A                                      DATE(*YY)
003000000202     A                                      EDTCDE(Y)
003100000202     A                                    +5
003200000202     A                                      'ORA:'
003300000202     A                                   176
003400000202     A                                      TIME
003500000202     A                                   190
003600000202     A                                      'PAG.'
003700000202     A                                   195
003800000202     A                                      PAGNBR
003900000202     A                                      EDTCDE(Z)
004000000202     A                                     1
004100000202     A                                      '-----------------------------------
004200000202     A                                      ------------------------------------
004300000202     A                                      ------------------------------------
004400000202     A                                      ------------------------------------
004500000202     A                                      ------------------------------------
004600000202     A                                      ------------------------'
004700000202     A                                      SPACEB(002)
004800000202     A                                     1
004900000202     A                                      '!'
005000000202     A                                      SPACEB(001)
005100000202     A                                    +2
005200000202     A                                      'Alla Data:'
005300000202     A            STPDAT         8S 0O    +2
005400000202     A                                      EDTCDE(Y)
005500000202     A                                    +5
005600000202     A                                      'Figli (S/N):'
005700000202     A            STPSON         1A  O    +2
005800000202     A                                    +5
005900000202     A                                      'Tipo Servizio:'
006000000202     A            STPSRV         4A  O    +2
006100000202     A            STPSRVD       30A  O    +2
006200000202     A                                   198
006300000202     A                                      '!'
006400000202     A                                     1
006500000202     A                                      '-----------------------------------
006600000202     A                                      ------------------------------------
006700000202     A                                      ------------------------------------
006800000202     A                                      ------------------------------------
006900000202     A                                      ------------------------------------
007000000202     A                                      ------------------------'
007100000202     A                                      SPACEB(001)
007200000202     A                                     1
007300000202     A                                      '!'
007400000202     A                                      SPACEB(001)
007500000202     A                                    +2
007600000202     A                                      'TIPO SRV'
007700000202     A                                      HIGHLIGHT
007800000202     A                                    +3
007900000202     A                                      'SGI USR'
008000000202     A                                      HIGHLIGHT
008100000202     A                                    +3
008200000202     A                                      'LEGAME'
008300000202     A                                      HIGHLIGHT
008400000202     A                                    +3
008500000202     A                                      'CLIENTE ABILITATO'
008600000202     A                                      HIGHLIGHT
008700000202     A                                   +39
008800000202     A                                      'DECORRENZA'
008900000202     A                                      HIGHLIGHT
009000000202     A                                    +5
009100000202     A                                      'SCADENZA'
009200000202     A                                      HIGHLIGHT
009300000202     A                                   154
009400000202     A                                      'NOTE'
009500000202     A                                      HIGHLIGHT
009600000202     A                                   198
009700000202     A                                      '!'
009800000202     A                                     1
009900000202     A                                      '!'
010000000202     A                                      SPACEB(001)
010100000202     A                                    +2
010200000202     A                                      '-------------------------->'
010300000202     A                                    +3
010400000202     A                                      'CLIENTE FIGLIO'
010500000202     A                                   +46
010600000202     A                                      '"'
010700000202     A                                   +13
010800000202     A                                      '"'
010900000202     A                                   198
011000000202     A                                      '!'
011100000202     A                                     1
011200000202     A                                      '-----------------------------------
011300000202     A                                      ------------------------------------
011400000202     A                                      ------------------------------------
011500000202     A                                      ------------------------------------
011600000202     A                                      ------------------------------------
011700000202     A                                      ------------------------'
011800000202     A                                      SPACEB(001)
011900000202     A*%%***********************************************************************
012000000202     A*%%SS
012100000202     A*%%CL 002
012200000202     A*%%CL 001
012300000202     A*%%CL 001
012400000202     A*%%CL 001
012500000202     A*%%CL 001
012600000202     A*%%CL 001
012700000202     A*%%***********************************************************************
012800000202     A*------------------------------------------------------------------------*
012900000202     A* FINE PROSPETTO
013000000202     A*------------------------------------------------------------------------*
013100000202     A          R S726VSS
013200000202     A*%%***********************************************************************
013300000202     A*%%RI 00000
013400000202     A*%%***********************************************************************
013500000202     A                                      SPACEB(001)
013600000202     A                                     1
013700000202     A                                      '!'
013800000202     A            STAISV         2A  O     8
013900000202     A                                      HIGHLIGHT
014000000202     A            STASUN         9A  O    +4
014100000202     A                                      HIGHLIGHT
014200000202     A            STATLE         2A  O    +4
014300000202     A                                      HIGHLIGHT
014400000202     A            STAKSU         8A  O    +5
014500000202     A                                      HIGHLIGHT
014600000202     A            STARAG        40A  O    +4
014700000202     A                                      HIGHLIGHT
014800000202     A            STADDE         8S 0O    +4
014900000202     A                                      EDTCDE(Y)
015000000202     A                                      HIGHLIGHT
015100000202     A            STADSC         8S 0O    +4
015200000202     A                                      EDTCDE(Y)
015300000202     A                                      HIGHLIGHT
015400000202     A                                    +5
015500000202     A                                      '!'
015600000202     A            STANOTE       65A  O    +6
015700000202     A                                      HIGHLIGHT
015800000202     A                                    +7
015900000202     A                                      '!'
016000000202     A*%%***********************************************************************
016100000202     A*%%SS
016200000202     A*%%***********************************************************************
016300000202     A*------------------------------------------------------------------------*
016400000202     A* FINE PROSPETTO
016500000202     A*------------------------------------------------------------------------*
016600000202     A          R S726KUN
016700000202     A*%%***********************************************************************
016800000202     A*%%RI 00000
016900000202     A*%%***********************************************************************
017000000202     A                                      SPACEB(001)
017100000202     A                                     1
017200000202     A                                      '!'
017300000202     A            STACOF        11S 0O    34
017400000202     A            STARAG        40A  O    46
017500000202     A            STADDE         8S 0O    90
017600000202     A                                      EDTCDE(Y)
017700000202     A            STADSC         8S 0O   104
017800000202     A                                      EDTCDE(Y)
017900000202     A                                   119
018000000202     A                                      '!'
018100000202     A                                   +78
018200000202     A                                      '!'
018300000202     A*%%***********************************************************************
018400000202     A*%%SS
018500000202     A*%%***********************************************************************
018600000202     A          R S726RIG
018700000202     A*%%***********************************************************************
018800000202     A*%%RI 00000
018900000202     A*%%***********************************************************************
019000000203     A                                      SPACEB(001)
019100000202     A                                     1
019200000202     A                                      '-----------------------------------
019300000202     A                                      ------------------------------------
019400000202     A                                      ------------------------------------
019500000202     A                                      ------------------------------------
019600000202     A                                      ------------------------------------
019700000202     A                                      ------------------------'
019800000202     A*%%***********************************************************************
019900000202     A*%%SS
020000000202     A*%%***********************************************************************
020100000202     A          R S726BLK
020200000202     A*%%***********************************************************************
020300000202     A*%%RI 00000
020400000202     A*%%***********************************************************************
020500000202     A                                      SPACEB(001)
020600000202     A                                     1
020700000202     A                                      '!                                 -
020800000202     A                                                                         -
020900000202     A                                                                         -
021000000202     A                                                    !                    -
021100000202     A                                                                         -
021200000202     A                                                             !'
021300000202     A*%%***********************************************************************
021400000202     A*%%SS
021500000202     A*%%***********************************************************************
021600000202     A*------------------------------------------------------------------------*
021700000202     A* FINE PROSPETTO
021800000202     A*------------------------------------------------------------------------*
021900000202     A          R S726FIN
022000000202     A*%%***********************************************************************
022100000202     A*%%RI 00000
022200000202     A*%%***********************************************************************
022300000202     A                                      SPACEB(001)
022400000202     A                                    81
022500000202     A                                      '***    F I N E    P R O S P E T T -
022600000202     A                                      O    ***'
022700000202     A*%%***********************************************************************
022800000202     A*%%SS
022900000202     A*%%CP+999CRTPRTF
023000000202     A*%%CP+    FILE(GAITRASRC/TIS726P)
023100000202     A*%%CP+    DEVTYPE(*SCS)
023200000202     A*%%CP     PAGESIZE(*N       198      *N     )
023300000202     A*%%***********************************************************************
023400000202     A*------------------------------------------------------------------------*
