000010021127     A*%%TS  SD  20021127  121000  EDPFG       REL-V4R4M0  5769-PW1
000020970526     A*-------------------------------------------------------------------------
000030021127     A*%%EC
000040021127     A                                      DSPSIZ(24 80 *DS3)
000050021127     A                                      CHGINPDFT(HI CS)
000060021127     A                                      PRINT
000070021127     A                                      CF01
000080021127     A                                      CF02
000090021127     A                                      CF03
000100021127     A                                      CF04
000110021127     A                                      CF05
000120021127     A                                      CF06
000130021127     A                                      CF07
000140021127     A                                      CF08
000150021127     A                                      CF09
000160021127     A                                      CF10
000170021127     A                                      CF11
000180021127     A                                      CF12
000190021127     A                                      CF13
000200021127     A                                      CF14
000210021127     A                                      CF15
000220021127     A                                      CF16
000230021127     A                                      CF17
000240021127     A                                      CF18
000250021127     A                                      CF19
000260021127     A                                      CF20
000270021127     A                                      CF21
000280021127     A                                      CF22
000290021127     A                                      CF23
000300021127     A                                      CF24
000310021127     A                                      HELP
000320970526     A*-------------------------------------------------------------------------
000330011205     A          R I7K7D01
000340011205     A*%%TS  SD  20011205  103058  EDPFG       REL-V4R4M0  5769-PW1
000350011205     A                                      TEXT('Testata')
000360011205     A            DSFIRS    R        O  1  2REFFLD(DSFIRS DSFIL)
000370011205     A                                  1 24'*    STAMPA CLIENTI UNIFICANTI    -
000380011205     A                                      *'
000390011205     A                                      DSPATR(RI)
000400011205     A                                      DSPATR(UL)
000410011205     A                                  1 61'TIS7K7R'
000420011205     A                                  1 71DATE
000430011205     A                                      EDTCDE(Y)
000440011205     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000450011205     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000460011205     A            VIDING        16A  O  2 33
000470011205     A                                  2 71TIME
000480970526     A*-------------------------------------------------------------------------
000490011205     A          R I7K7D02
000500970526     A                                      OVERLAY
000510970526     A            FUN001        19A  O 22  2
000520970526     A            FUN002        19A  O 22 22
000530970526     A            FUN003        19A  O 22 42
000540970526     A            FUN004        19A  O 22 62
000550970526     A            FUN005        19A  O 23  2
000560970526     A            FUN006        19A  O 23 22
000570970526     A            FUN007        19A  O 23 42
000580970526     A            FUN008        19A  O 23 62
000590970526     A*-------------------------------------------------------------------------
000600991216     A***********                           CHGINPDFT
000610021127     A          R I7K7D03
000620021127     A*%%TS  SD  20021127  121000  EDPFG       REL-V4R4M0  5769-PW1
000630021127     A                                      OVERLAY
000640021127     A                                  7  2'PARAMETRI DI LANCIO'
000650021127     A                                      DSPATR(HI)
000660021127     A                                  9  2'Punto Operativo ......?:'
000670021127     A            VIDFIL         3A  B  9 27CHECK(RZ)
000680021127     A                                      DSPATR(CS)
000690021127     A  59                                  DSPATR(RI)
000700021127     A  59                                  DSPATR(PC)
000710021127     A            VDDFIL        40A  O  9 40
000720021127     A                                 10  2'Tipo legame ..........?:'
000730021127     A            VIDTLE         2A  B 10 27DSPATR(CS)
000740021127     A                                      DSPATR(HI)
000750021127     A  53                                  DSPATR(PC)
000760021127     A  53                                  DSPATR(RI)
000770021127     A            VDDTLE        30A  O 10 40
000780021127     A                                 11  2'Data riferimento ......:'
000790021127     A            VIDDDE         8Y 0B 11 27EDTCDE(8)
000800021127     A                                      DSPATR(CS)
000810021127     A                                      DSPATR(HI)
000820021127     A  54                                  DSPATR(PC)
000830021127     A  54                                  DSPATR(RI)
000840021127     A                                 11 40'(gg/mm/anno)'
000850021127     A                                 13  2'SELEZIONI'
000860021127     A                                      DSPATR(HI)
000870021127     A                                 14  2'Cliente unificante ...?:'
000880021127     A            VIDKUN         7Y 0B 14 27DSPATR(CS)
000890021127     A                                      DSPATR(HI)
000900021127     A  55                                  DSPATR(PC)
000910021127     A  55                                  DSPATR(RI)
000920021127     A            VDDKUN        30A  O 14 40
000930970526     A*-------------------------------------------------------------------------
000940011205     A          R I7K7DMS                   SFL
000950970526     A                                      SFLMSGRCD(24)
000960970526     A            MSGKEY                    SFLMSGKEY
000970970526     A            MSGQUE                    SFLPGMQ
000980970526     A*-------------------------------------------------------------------------
000990011205     A          R I7K7DMC                   SFLCTL(I7K7DMS)
001000970526     A                                      OVERLAY
001010970526     A                                      SFLDSP
001020970526     A  40                                  SFLCLR
001030970526     A                                      SFLSIZ(0002)
001040970526     A                                      SFLPAG(0001)
