000100140930     A          R TIS700012                 TEXT('Istruzioni consegna: -
000101140930     A                                      GETFILIALE input.')
000102140930     A            FORMATO       10A         TEXT('Formato "TIS700012".')
000103140930     A                                      DFT('TIS700012')
000104140930     A            VERSIONE       1A         TEXT('Versione "A".')
000105140930     A                                      DFT('A')
000106140930     A            DESCRIZION    20A         TEXT('Descrizione filiale.')
000107140930     A            INDIRIZZO     20A         TEXT('Indirizzo filiale.')
000108140930     A            LOCALITA      20A         TEXT('Località filiale.')
000109140930     A            SIGLAPROV      2A         TEXT('Sigla provincia filiale.')
000110140930     A            CAP            9A         TEXT('C.A.P. filiale')
000111140930     A            TELEFONO      16A         TEXT('Telefono filiale.')
000112140930     A            EMAILADDR     70A         TEXT('Indirizzo posta elettronica.')
000113140930     A            ORAFILMATD     8A         TEXT('Orario filiale *EUR -
000114140930     A                                      mattino: dalle.')
000115140930     A            ORAFILMATA     8A         TEXT('Orario filiale *EUR -
000116140930     A                                      mattino:  alle.')
000117140930     A            ORAFILPOMD     8A         TEXT('Orario filiale *EUR -
000118140930     A                                      pomeriggio: dalle.')
000119140930     A            ORAFILPOMA     8A         TEXT('Orario filiale *EUR -
000120140930     A                                      pomeriggio:  alle.')
000121141002     A            ORAFILDESC    70A         TEXT('Descrizione orario filiale.')
000122140930     A            ORASCLMATD     8A         TEXT('Orario servizio clienti *EUR -
000123140930     A                                      mattino: dalle.')
000124140930     A            ORASCLMATA     8A         TEXT('Orario servizio clienti *EUR -
000125140930     A                                      mattino:  alle.')
000126140930     A            ORASCLPOMD     8A         TEXT('Orario servizio clienti *EUR -
000127140930     A                                      pomeriggio: dalle.')
000128140930     A            ORASCLPOMA     8A         TEXT('Orario servizio clienti *EUR -
000129140930     A                                      pomeriggio:  alle.')
000130141002     A            ORASCLDESC    70A         TEXT('Descrizione orario servizio -
000131140930     A                                      clienti.')
000132140930     A            URLFILIALE   256A         TEXT('URL filiale.')
