000100120223     A          R TIS7ST20O                 TEXT('Composizione famiglia -
000200120223     A                                      cliente: output.')
000300120223     A            FORMATO       10A         TEXT('Nome formato "TIS7ST20O".')
000400120224     A                                      DFT('TIS7ST20O')
000500120223     A            VERSIONE       1A         TEXT('Versione formato "A".')
000600120223     A                                      DFT('A')
000700120224     A            USRSPCNAME    10A         TEXT('User space name.')
000800120224     A            DATIFINITI     1A         TEXT('Dati finiti.')
000900120223     A                                      DFT('0')
001000120223     A                                      VALUES('0' '1')
001100120223     A*                                     '0' = Dati non finiti.
001200120223     A*                                     '1' = Dati finiti.
001300120223     A            NRELEMENTI     2S 0       TEXT('Numero elementi schiere.')
001400120223     A            IDCLIENTE    693A         TEXT('Schiera ID cliente -
001500120223     A                                      (99 * 7).')
001600120224     A            DZCLIENTE   7821A         TEXT('Schiera descrizione cliente -
001700120224     A                                      (99 * 79).')
