000100130307             PGM
000200130307             ADDLIBLE   LIB(FILTRAGRPF)
000300130307             MONMSG     MSGID(CPF0000)
000400130318             CALL       PGM(TIS7P2ST)
000500130307             ENDPGM
