000100180111     A          R TIS7DP0M0                 TEXT('REPERIM. ID BOLLA  -
000200180111     A                                      DA PARCEL DPD Messaggi')
000300180111     A            FORMATO       10A         TEXT('Nome DS "TIS7DP0M0"')
000400180126     A                                      DFT('TIS7DP0M0')
000500130930     A            VERSIONE       1A         TEXT('Versione formato "A"')
000600120217     A                                      DFT('A')
000700180112     A            NRMSG          1S 0       TEXT('Nr. messaggi di ritorno')
000800180112     A            IDMSG         63A         TEXT('ID Messaggio (7 * 9)')
000900180112     A            IDCAMPO       90A         TEXT('Nome Campo a cui il msg fa -
001000180112     A                                      riferimento (10 * 9)')
001100180112     A            ERRWARN        9A         TEXT('Errore/Warning (1 * 9)')
001200180112     A            TEXTMSG     2295A         TEXT('Testo messaggio (255 * 9)')
