000100140730/*PARMS DFTACTGRP(*NO) ACTGRP(BARTVAS)                                        */
000200990907/*PARMS                                                                       */
000300990907/*PARMS                                                                       */
000400990907/*PARMS                                                                       */
000500990907/*PARMS                                                                       */
000600060103             PGM        PARM(&LIB)
000700991111
000800060103             DCL        VAR(&LIB) TYPE(*CHAR) LEN(10) /* Libreria da cui prelevare file in upload */
000900170329
001000170329             DLYJOB     DLY(30)
001100991111
001200060103 GUFO:       CALL       PGM(TIS782R) PARM(&LIB)
001300991111             MONMSG     MSGID(CPF0000)
001400100624             RCLRSC
001500991111
001600120521
001700170403             DLYJOB     DLY(2)
001800000621             GOTO       CMDLBL(GUFO)
001900991111
002000990907             ENDPGM
