000100120223     A          R TIS7ST20I                 TEXT('Composizione famiglia -
000200120223     A                                      cliente: input.')
000300120223     A            FORMATO       10A         TEXT('Nome formato "TIS7ST20I".')
000400120223     A                                      DFT('TIS7ST20I')
000500120223     A            VERSIONE       1A         TEXT('Versione formato "A".')
000600120223     A                                      DFT('A')
000700120223     A            KSU            8A         TEXT('ID cliente unificante.')
000800120223     A            SUN            9S 0       TEXT('Strategi User Number.')
000900120223     A            LINISO2        2A         TEXT('ID lingua ISO2.')
001000120223     A            CLTIPADDR     15A         TEXT('Client IP address.')
001100120309     A            PRCLIENTI      3S 0       TEXT('Progressivo elementi schiere -
001200120309     A                                      clienti.')
001300120223     A                                      CMP(GE 0)
001400120309     A*                                     0     = Prima chiamata;
001500120309     A*                                     1-999 = Chiamate successive;
001600120224     A            USRSPCNAME    10A         TEXT('User space name.')
