000100000000     A*--------------------------------------------------------------*
000200991111     A* FILE SPOOL RATEI
000300000000     A*--------------------------------------------------------------*
000400991111     A          R RATEI                     TEXT('DATI RATEI DA SPOOL')
000500991111     A            RAT001         3A
000600991111     A            RATLNP         3S 0
000700991111     A            RATXX1         6A
000701991111     A            RATCLI         7S 0
000702991111     A            RATXX2         7A
000703991111     A            RATTBL         2A
000704991111     A            RATXX3         4A
000705991111     A            RATSNP         7S 0
000706991111     A            RATXX4         3A
000708991111     A            RATDGG         2S 0
000709991111     A            RATDX1         1A
000710991111     A            RATDMM         2S 0
000711991111     A            RATDX2         1A
000712991111     A            RATAAS         4S 0
000713991111     A            RATXX5         3A
000714991111     A            RATNFT         6S 0
000715991111     A            RATXX6        29A
000716991111     A            RATIMP        11S 0
001700991111     A            RATXX7        33A
