000100000000     A*--------------------------------------------------------------*
000200080909     A*  L.F. ELENCO  SOCIETA ANAGRAFICA TRAINI
000300000000     A*--------------------------------------------------------------*
000500080909     A          R AIATS000                  PFILE(AIATS00F)
000600920522     A*
000700080909     A          K ATSSOC
000800120528     A          K ATSNRC
000900080909     A          S ATSATB                    CMP(EQ ' ')
