000100000000     A*--------------------------------------------------------------*
000200150611     A*     SOCIETA' CONSORZI PER DURC E CIP CONSOCIATE
000300000000     A*--------------------------------------------------------------*
000400890919     A                                      REF(CNDIZION)
000500150611     A          R AITRC000
000600150611     A            TRCANN         1A         TEXT('FLAG ANNULLAMENTO ')
000700030611     A                                      COLHDG('ANN')
001500150611     A            TRCIVA        16A         TEXT('PARTITA IVA FORNITORE')
001600150611     A                                      COLHDG('PARTITA IVA' 'FORNITORE')
001601150611     A            TRCPICF       16A         TEXT('P.IVA/COD.FIS. CONSORZIATA')
001602150611     A                                      COLHDG('P.IVA/COD.FIS' 'CONSOR.')
001603150611     A            TRCRAGSOC     25A         TEXT('RAG.SOCIALE CONSORZIATA')
001604150611     A                                      COLHDG('RAG.SOC.' 'CONSOR.')
002101150611     A            TRCDDURC       8P 0       TEXT('DATA DURC CONSORZIATA')
002102150611     A                                      COLHDG('DATA' 'DURC' 'CONSOR.')
002103150611     A            TRCDCIP        8P 0       TEXT('DATA CIP CONSORZIATA')
002104150611     A                                      COLHDG('DATA' 'CIP' 'CONSOR.')
002105150611     A*
002106150611     A            TRCDFC         8P 0       TEXT('DATA FINE VALIDITÀ')
002107150611     A                                      COLHDG('DATA' 'FINE' 'VALIDITÀ')
005300090310     A*----
005400150611     A            TRCUTE        10A         TEXT('UTENTE CHE VARIA RECORD')
005500090316     A                                      COLHDG('UTENTE' 'VARIAZIONE')
005800150611     A            TRCDVA         8P 0       TEXT('DATA VARIAZIONE RECORD')
005900090316     A                                      COLHDG('DATA' 'VARIAZIONE')
006000090316     A*----
006100150611     A            TRCFLR        30A         TEXT('FILLER')
006200150611     A                                      COLHDG('FILLER')
