000100000000     A*--------------------------------------------------------------*
000200070608     A*     CERTIFICAZIONI AUTOTRASPORTATORI CITTA
000300000000     A*--------------------------------------------------------------*
000400890919     A                                      REF(CNDIZION)
000500030324     A          R AITRA000
000600070608     A            TRAANN         1A         TEXT('FLAG ANNULLAMENTO ')
000700030611     A                                      COLHDG('ANN')
000800070608     A            TRAFIL    R               REFFLD($FIL)
000900171120     A                                      TEXT('FILIALE AUTISTA')
001000171120     A                                      COLHDG('FIL.' 'AUTISTA')
001200090717     A            TRASOCG        3A         TEXT('SOCIETA OPERATIVA')
001300090717     A                                      COLHDG('SOCIETA' 'OPERATIVA')
001400090717     A            TRATIP         1A         TEXT('TIPO RAPPORTO - SEMPRE (C)')
001500090717     A                                      COLHDG('TIPO' 'RAPPORTO' -
001600090717     A                                      'SEMPRE->C')
001700070608     A            TRASOC        25A         TEXT('RAG.SOCIALE SOCIETA AUTISTA')
001800070608     A                                      COLHDG('SOCIETA' 'AUT')
001900070608     A            TRAAUT        25A         TEXT('NOMINATIVO AUTISTA')
002000070608     A                                      COLHDG('NOME AUTISTA')
002100170221     A            TRARIS         1A         TEXT('Particolarità tab. TPA')
002200170221     A                                      COLHDG('TAB' 'TPA')
002300070608     A            TRATIA        15A         TEXT('MARCA/MODELLO AUTOMEZZO')
002400070608     A                                      COLHDG('MARCA/MODELLO' 'AUTOMEZZO')
002500070608     A            TRASCO         1A         TEXT('S=MACCHINA DI SCORTA')
002600070608     A                                      COLHDG('MACCH.' 'SCORTA')
002700070608     A            TRATAA         8A         TEXT('TARGA AUTOMEZZO')
002800070608     A                                      COLHDG('TARGA' 'AUTOMEZZO')
002900151221     A            TRACOR         1A         TEXT('AUTISTA A PERDERE')
003000151221     A                                      COLHDG('AUT.' 'A PERDERE')
003100070608     A            TRABPO         3A         TEXT('ANTIFURTO VANO CARICO')
003200070608     A                                      COLHDG('ANTIF.VANO CAR.')
003300070608     A            TRAANT         3A         TEXT('ANTIFURTO BLOCCO MOTORE')
003400070608     A                                      COLHDG('ANTIF.BLOCCO MOTORE')
003500070608     A            TRATMP         1A         TEXT('COLORE AUTOMEZZO')
003600070608     A                                      COLHDG('COLORE' 'AUTOM.' )
003700070608     A            TRADTM         8P 0       TEXT('DATA 1°VERNICIATURA PREVISTA')
003800070608     A                                      COLHDG('DATA' '1°VER' 'PREV' )
003900070608     A            TRADASS        8P 0       TEXT('ANNO PRIMA IMMATRICOLAZIONE')
004000070608     A                                      COLHDG('ANNO 1° IMMATR')
004100151221     A            TRAUNIL        8P 0       TEXT('DATA SCADENZA UNILAV')
004200151221     A                                      COLHDG('SCAD.' 'UNILAV')
004300070608     A            TRADIN         8P 0       TEXT('DATA ACCREDITAMENTO')
004400070608     A                                      COLHDG('DATA' 'ACCREDITAM.')
004500070608     A            TRADFI         8P 0       TEXT('DATA DISACCREDITAMENTO')
004600070608     A                                      COLHDG('DATA' 'DISACCRED.')
004700160115     A            TRATUR         1A         TEXT('TURNOVER TAB. ATU')
004800070608     A                                      COLHDG('TURNOVER')
004900151221     A            TRADTSPS       8P 0       TEXT('DATA SCADENZA PERMESSO SOGG.')
005000151221     A                                      COLHDG('SCAD.' 'SOGGGIORNO')
005100151221     A            TRADTRPS       8P 0       TEXT('DATA RINNOVO PERMESSO SOGG.')
005200151221     A                                      COLHDG('RINNOVO' 'SOGGGIORNO')
005300070608     A            TRAKAU         7P 0       TEXT('CODICE AUTISTA GESTIONALE')
005400070608     A                                      COLHDG('CODICE' 'AUT.')
005500970723     A            TRAPUB         1A         TEXT('SCRITTE PUBBLICITARIE')
005600970723     A                                      COLHDG('SCRITTE' 'PUBBL.')
005700970723     A*----------------
005800070608     A            TRAFUR         1A         TEXT('TIPO ALLESTIMENTO')
005900070608     A                                      COLHDG('TIPO' 'ALLEST.')
006000070608     A            TRASPI         1A         TEXT('S/N SPONDA IDRAULICA')
006100070608     A                                      COLHDG('SPONDA' 'IDRAUL')
006200090325     A            TRABPT         7P 0       TEXT('CODICE AFF/DEF')
006300090325     A                                      COLHDG('CODICE' 'AFF/DEF')
006400070608     A            TRANT1        70A         TEXT('NOTE VERNICIATURA')
006500070608     A                                      COLHDG('NOTE VERNICIATURA')
006600070608     A            TRANT2        70A         TEXT('2° NOTE RIPRISTINO')
006700070608     A                                      COLHDG('2° NOTE RIPRISTINO')
006800070608     A            TRADT2         8P 0       TEXT('2° DATA VERNICIATURA')
006900070608     A                                      COLHDG('2°DATA' 'VERNIC.')
007000070608     A            TRADT3         8P 0       TEXT('DATA SCADENZA POLIZZA RCV')
007100070608     A                                      COLHDG('DATA' 'SCAD.' 'RCV')
007200070608     A            TRADT4         8P 0       TEXT('DATA DISDETTA POLIZZA RCV')
007300070608     A                                      COLHDG('DATA' 'DISDETTA' 'RCV')
007400070608     A            TRADRR         8P 0       TEXT('DATA ISPEZIONE AUTOMEZZO')
007500070608     A                                      COLHDG('DATA' 'ISPEZ.' 'AUTOM.')
007600070608     A            TRADPR         8P 0       TEXT('1°DATA PREVISTO RIPRISTINO')
007700070608     A                                      COLHDG('1°DATA' 'PREV.' 'RIPR.')
007800070608     A            TRADP2         8P 0       TEXT('2°DATA PREVISTO RIPRISTINO')
007900070608     A                                      COLHDG('2°DATA' 'PREV.' 'RIPR.')
008000160114     A            TRADP3         8P 0       TEXT('LIBERO')
008100151221     A            TRADP4         8P 0       TEXT('DATA IMMISSIONE')
008200151221     A                                      COLHDG('DATA' 'IMMISSIONE')
008300070608     A            TRANRP        70A         TEXT('1° NOTE RIPRISTINO')
008400070608     A                                      COLHDG('1° NOTE RIPRISTINO')
008500090325     A            TRANRC         7P 0       TEXT('NUMERO CONTRATTO')
008600070608     A                                      COLHDG('NUMERO' 'CONTRATTO')
008700070608     A            TRAFF1         1A         TEXT('CLASSE OMOLOGAZIONE')
008800070608     A                                      COLHDG('CLASSE' 'OMOLOG.')
008900070608     A            TRAFF2         1A         TEXT('TIPO ALIMENTAZIONE')
009000070608     A                                      COLHDG('TIPO' 'ALIM.')
009100170626     A            TRAATP         1A         TEXT('PICCO LAVORATIVO')
009200170626     A                                      COLHDG('PICCO' 'LAV')
009300070618     A            TRARIF         1A         TEXT('RIFRANGENTE S/N/BLANK')
009400151221     A                                      COLHDG('RIFRANGENTE')
009500150616     A            TRAFILLER     20A         TEXT('DS DTRAFILLER')
009600150616     A                                      COLHDG('DS DTRAFILLER')
009700151221     A            TRAPER        15A         TEXT('PERIFERICA')
009800151221     A                                      COLHDG('PERIFERICA')
009900151221     A            TRACEN         1A         TEXT('CENTR.SATELLITARE')
010000151221     A                                      COLHDG('CENTRALE' 'SATELLIT.')
010100151221     A            TRALOCI        1A         TEXT('FLAG CENTRO ST/LOC.TURIST.')
010200151221     A            TRADIPA        1A         TEXT('FLAG DIPENDENTE O AUTONOMO')
010300151221     A            TRAITAEST      1A         TEXT('ITALIA/ESTERO I/E')
010400151221     A            TRAFILLER1    13A         TEXT('LIBERO')
010500151221     A            TRAOREL        2P 0       TEXT('ORE SETTIMANALI LAVORATE')
010600151221     A                                      COLHDG('ORE' 'SETT.')
010700151221     A            TRALIQ         1A         TEXT('LIVELLO INQUADRAM. TAB. LIQ')
010800151221     A                                      COLHDG('INQUADRAM.')
010900151221     A            TRACNL         1A         TEXT('CCNL APPLICATO TAB. CNL')
011000151221     A                                      COLHDG('CCNL')
011100151221     A            TRAQUA         1A         TEXT('QUALIFICA PROFESS. TAB.QUA')
011200151221     A                                      COLHDG('QUALIF.')
011300151221     A            TRACF         16A         TEXT('CODICE FISCALE')
011400151221     A                                      COLHDG('COD.FISCALE')
011500151221     A            TRACAU         2A         TEXT('CASA AUTOMOBILISTICA')
011600151221     A                                      COLHDG('MARCA')
011700151221     A            TRAMAU         3A         TEXT('MODELLO AUTOMOBILISTICO')
011800151221     A                                      COLHDG('MODELLO')
011900151221     A            TRAFILLER3    50A         TEXT('LIBERO')
