000100000000     A*--------------------------------------------------------------*
000200920522     A*  L.F. ELENCO  CERTIFICAZIONI IN FILIALE X AUTISTA
000300000000     A*--------------------------------------------------------------*
000400890908     A                                      FIFO
000500030604     A          R AITRA000                  PFILE(AITRA00F)
000600920522     A*
000700030630     A          K TRAFIL
000800920522     A          K TRAAUT
