000100890907     A*---------------------------------------------------------------*
000200941031     A*  ARCHIVIO TRASMISSIONE FILE TEMPI DI PARTENZA/TRAZIONE
000300930301     A*  MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500900327     A*
000600941031     A          R AZCAS000                  FORMAT(AZCAS00F)
