000100000000     A*--------------------------------------------------------------*
000200941031     A*  L.F.: TEMPI DI TRAZIONE   X   PTA + LNA + LNP + TSP + DDE
000300000000     A*--------------------------------------------------------------*
000400941031     A          R AZCAS000                  PFILE(AZCAS00F)
000500941031     A          K CASPTA
000600941031     A          K CASLNA
000700941031     A          K CASLNP
000800941031     A          K CASTSP
000900941031     A          K CASDDE
