000100970515     A*------------------------------------------------------------------------*
000200150130     A* ANAGRAFICA CLIENTE DETTAGLIO ARTICOLO
000300970515     A*------------------------------------------------------------------------*
000400970515     A                                      UNIQUE
000500150130     A          R AZCGB100                  PFILE(AZCGB10F)
000600150130     A          K CGBKSU
000700150130     A          K CGBTIP
000800150130     A          K CGBCOD
