000100000000     A*-------------------------------------------------------------**
000200930329     A*   FILE CALENDARIO BARTOILINI
000300000000     A*-------------------------------------------------------------**
000400941109     A          R AZCLN000                  PFILE(AZCLN00F)
000500941109     A          K CLNTFP
000600941109     A          K CLNTFA
000700941109     A          K CLNANN
000800941109     A          K CLNMES
