000100970515     A*------------------------------------------------------------------------*
000200970917     A* ORGANIGRAMMA X CLIENTE:  LF -> FIL
000300970515     A*------------------------------------------------------------------------*
000400970515     A                                      UNIQUE
000500970917     A          R AZCPF000                  PFILE(AZCPF00F)
000600970917     A          K CPFFIL
