000100970515     A*------------------------------------------------------------------------*
000200021218     A* DOTAZIONI GABBIE E BANCALI
000300970515     A*------------------------------------------------------------------------*
000400970515     A                                      REF(CNDIZION)
000500021218     A          R AZDGB000                  TEXT('DOTAZIONI GABBIE/BANCALI')
000600021218     A            DGBCOP         3S 0       TEXT('CODICE P.O.')
000700021218     A                                      COLHDG('P.O.')
000800021218     A            DGBCOD        15A         TEXT('CODICE ARTICOLO')
000900021218     A                                      COLHDG('COD. ART.')
001000021218     A            DGBQDO        13S 3       TEXT('QUANTITA DOTAZIONE')
001100021218     A                                      COLHDG('QTA. DOTAZ.')
001200021218     A            DGBQSC        13S 3       TEXT('QUANTITA SCORTA')
001300021218     A                                      COLHDG('QTA. SCORTA')
001400021218     A            DGBXXX        20A         TEXT('FILLER USI FUTURI')
001500021218     A                                      COLHDG('FILLER USI FUTURI')
