000100970515     A*------------------------------------------------------------------------*
000200040618     A* FILE DESTINATARI DISAGIATI/SUPERMERCATI/APPUNTAMENTO
000300970515     A*------------------------------------------------------------------------*
000400040618     A          R AZDSTP00                  PFILE(AZDSTP0F)
000500020415     A          K DSTTIP
000600020708     A          K DSTRAG
000700020412     A          K DSTPRV
