000100970515     A*------------------------------------------------------------------------*
000200150209     A* ANAGRAFICA CLIENTE UNIFICANTE - FIGLIO GESTIONE BANCALI
000300970515     A*------------------------------------------------------------------------*
000400970515     A                                      UNIQUE
000500150209     A          R AZFGB000                  PFILE(AZFGB00F)
000600150209     A          K FGBKSU
000700150209     A          K FGBKSC
