000100060426     A*--------------------------------------------------------------*
000200060426     A*   ANAGRAFICO LINGUE
000300060426     A*--------------------------------------------------------------*
000301060510     A                                      UNIQUE
000500060426     A          R AZLIN000                  PFILE(AZLIN00F)
000600060426     A          K LINTABEL
000700060510     A          O LINTABEL                  CMP(EQ 0)
