000100060426     A*--------------------------------------------------------------*
000200060426     A*   ANAGRAFICO LINGUE
000300060426     A*--------------------------------------------------------------*
000400060426     A                                      UNIQUE
000500060426     A          R AZLIN000                  PFILE(AZLIN00F)
000600060427     A          K LINTNTBE
000700060510     A          O LINTNTBE                  CMP(EQ '0')
