000100000000     A*--------------------------------------------------------------*
000200890919     A*  L.F. ORGANIGRAMMI AZIENDALI
000300000000     A*--------------------------------------------------------------*
000400910701     A                                      UNIQUE
000500900328     A          R AZORG                     PFILE(AZORG00F)
000600000000     A*----------------
000700000000     A          K ORGFIL
