000100000000     A*--------------------------------------------------------------*
000200890919     A*  L.F. ORGANIGRAMMI AZIENDALI
000300000000     A*--------------------------------------------------------------*
000400890919     A                                      FIFO
000500900328     A          R AZORG                     PFILE(AZORG00F)
000600070111     A            ORGDIT    R
000700070111     A            ORGFIL    R
000800070111     A            ORGFVA    R
000900070111     A            ORGFAG    R
001000070111     A            ORGCTS    R
001100070111     A            ORGCAA    R
001200070111     A            ORGFL1    R
001300070111     A            ORGFL2    R
001400070111     A            ORGFL3    R
001500070111     A            ORGDES    R
001600070111     A            ORGIND    R
001700070111     A            ORGCPF    R
001800070111     A            ORGLOC    R
001900070111     A            ORGPRO    R
002000070111     A            ORGTEL    R
002100070111     A            ORGFAX    R
002200070111     A            ORGTLX    R
002300070111     A            ORGDEA    R
002400070111     A            ORGINA    R
002500070111     A            ORGCPA    R
002600070111     A            ORGLOA    R
002700070111     A            ORGPRA    R
002800070111     A            ORGTEA    R
002900070111     A            ORGFAA    R
003000070111     A            ORGTLA    R
003100070111     A            ORGCAR    R
003200070111     A            ORGCRE    R
003300070111     A            ORGD01    R
003400070111     A            ORGD02    R
003500070111     A            ORGD03    R
003600070111     A            ORGD04    R
003700070111     A            ORGD05    R
003800070111     A            ORGD06    R
003900070111     A            ORGD07    R
004000070111     A            ORGD08    R
004100070111     A            ORGD09    R
004200070111     A            ORGD10    R
004300070111     A            ORGD11    R
004400070111     A            ORGD12    R
004500070111     A            ORGD13    R
004600070111     A            ORGD14    R
004700070111     A            ORGD15    R
004800070111     A            ORGD16    R
004900070111     A            ORGD17    R
005000070111     A            ORGD18    R
005100070111     A            ORGD19    R
005200070111     A            ORGD20    R
005300070111     A            ORGD21    R
005400070111     A            ORGD22    R
005500070111     A            ORGD23    R
005600070111     A            ORGD24    R
005700070111     A            ORGD25    R
005800070111     A            ORGD26    R
005900070111     A            ORGD27    R
006000070111     A            ORGD28    R
006100070111     A            ORGD29    R
006200070111     A            ORGD30    R
006300070111     A            ORGD31    R
006400070111     A            ORGD32    R
006500070111     A            ORGD33    R
006600070111     A            ORGD34    R
006700070111     A            ORGD35    R
006800070111     A            ORGD36    R
006900070111     A            ORGD37    R
007000070111     A            ORGD38    R
007100070111     A            ORGD39    R
007200070111     A            ORGD40    R
007300070111     A            ORGD41    R
007400070111     A            ORGD42    R
007500070111     A            ORGD43    R
007600070111     A            ORGD44    R
007700070111     A            ORGD45    R
007800070111     A            ORGD46    R
007900070111     A            ORGD47    R
008000070111     A            ORGD48    R
008100070111     A            ORGD49    R
008200070111     A            ORGD50    R
008300070111     A            ORGD51    R
008400070111     A            ORGD52    R
008500070111     A            ORGD53    R
008600070111     A            ORGD54    R
008700070111     A            ORGD55    R
008800070111     A            ORGD56    R
008900070111     A            ORGD57    R
009000070111     A            ORGD58    R
009100070111     A            ORGD59    R
009200070111     A            ORGD60    R
009300070111     A            ORGD61    R
009400070111     A            ORGD62    R
009500070111     A            ORGD63    R
009600070111     A            ORGD64    R
009700070111     A            ORGD65    R
009800070111     A            ORGD66    R
009900070111     A            ORGD67    R
010000070111     A            ORGD68    R
010100070111     A            ORGD69    R
010200070111     A            ORGD70    R
010300070111     A            ORGD71    R
010400070111     A            ORGD72    R
010500070111     A            ORGD73    R
010600070111     A            ORGD74    R
010700070111     A            ORGD75    R
010800070111     A            ORGD76    R
010900070111     A            ORGD77    R
011000070111     A            ORGD78    R
011100070111     A            ORGD79    R
011200070111     A            ORGD80    R
011300070111     A            ORGD81    R
011400070111     A            ORGD82    R
011500070111     A            ORGD83    R
011600070111     A            ORGD84    R
011700070111     A            ORGD85    R
011800070111     A            ORGD86    R
011900070111     A            ORGD87    R
012000070111     A            ORGD88    R
012100070111     A            ORGD89    R
012200070111     A            ORGD90    R
012300070111     A            ORGD91    R
012400070111     A            ORGD92    R
012500070111     A            ORGD93    R
012600070111     A            ORGD94    R
012700070111     A            ORGD95    R
012800070111     A            ORGD96    R
012900070111     A            ORGD97    R
013000070111     A            ORGD98    R
013100070111     A            ORGD99    R
013200070111     A            ORGDA0    R
013300070111     A            ORGDA1    R
013400070111     A            ORGDA2    R
013500070111     A            ORGDA3    R
013600070111     A            ORGDA4    R
013700070111     A            ORGDA5    R
013800070111     A            ORGDA6    R
013900070111     A            ORGDA7    R
014000070111     A            ORGDA8    R
014100070111     A            ORGDA9    R
014200070111     A            ORGDB0    R
014300070111     A            ORGDB1    R
014400070111     A            ORGDB2    R
014500070111     A            ORGDB3    R
014600070111     A            ORGDB4    R
014700070111     A            ORGDB5    R
014800070111     A            ORGDB6    R
014900070111     A            ORGDB7    R
015000070111     A            ORGDB8    R
015100070111     A            ORGDB9    R
015200070111     A            ORGDC0    R
015300070111     A            ORGDC1    R
015400070111     A            ORGDC2    R
015500070111     A            ORGDC3    R
015600070111     A            ORGDC4    R
015700070111     A            ORGDC5    R
015800070111     A            ORGDC6    R
015900070111     A            ORGDC7    R
016000070111     A            ORGDC8    R
016100070111     A            ORGDC9    R
016200070111     A            ORGDD0    R
016300070111     A            ORGDD1    R
016400070111     A            ORGDD2    R
016500070111     A            ORGDD3    R
016600070111     A            ORGDD4    R
016700070111     A            ORGDD5    R
016800070111     A            ORGDD6    R
016900070111     A            ORGDD7    R
017000070111     A            ORGDD8    R
017100070111     A            ORGDD9    R
017200070111     A            ORGDF0    R
017300070111     A            ORGF01    R
017400070111     A            ORGF02    R
017500070111     A            ORGF03    R
017600070111     A            ORGF04    R
017700070111     A            ORGF05    R
017800070111     A            ORGF06    R
017900070111     A            ORGF07    R
018000070111     A            ORGF08    R
018100070111     A            ORGF09    R
018200070111     A            ORGF10    R
018300070111     A            ORGF11    R
018400070111     A            ORGF12    R
018500070111     A            ORGF13    R
018600070111     A            ORGF14    R
018700070111     A            ORGF15    R
018800070111     A            ORGF16    R
018900070111     A            ORGF17    R
019000070111     A            ORGF18    R
019100070111     A            ORGF19    R
019200070111     A            ORGF20    R
019300070111     A            ORGF21    R
019400070111     A            ORGF22    R
019500070111     A            ORGF23    R
019600070111     A            ORGF24    R
019700070111     A            ORGF25    R
019800070111     A            ORGF26    R
019900070111     A            ORGF27    R
020000070111     A            ORGF28    R
020100070111     A            ORGF29    R
020200070111     A            ORGF30    R
020300070111     A            ORGF31    R
020400070111     A            ORGF32    R
020500070111     A            ORGF33    R
020600070111     A            ORGF34    R
020700070111     A            ORGF35    R
020800070111     A            ORGF36    R
020900070111     A            ORGF37    R
021000070111     A            ORGF38    R
021100070111     A            ORGF39    R
021200070111     A            ORGF40    R
021300070111     A            ORGF41    R
021400070111     A            ORGF42    R
021500070111     A            ORGF43    R
021600070111     A            ORGF44    R
021700070111     A            ORGF45    R
021800070111     A            ORGF46    R
021900070111     A            ORGF47    R
022000070111     A            ORGF48    R
022100070111     A            ORGF49    R
022200070111     A            ORGF50    R
022300070111     A            ORGF51    R
022400070111     A            ORGF52    R
022500070111     A            ORGF53    R
022600070111     A            ORGF54    R
022700070111     A            ORGF55    R
022800070111     A            ORGF56    R
022900070111     A            ORGF57    R
023000070111     A            ORGF58    R
023100070111     A            ORGF59    R
023200070111     A            ORGF60    R
023300070111     A            ORGF61    R
023400070111     A            ORGF62    R
023500070111     A            ORGF63    R
023600070111     A            ORGF64    R
023700070111     A            ORGF65    R
023800070111     A            ORGF66    R
023900070111     A            ORGF67    R
024000070111     A            ORGF68    R
024100070111     A            ORGF69    R
024200070111     A            ORGF70    R
024300070111     A            ORGF71    R
024400070111     A            ORGF72    R
024500070111     A            ORGF73    R
024600070111     A            ORGF74    R
024700070111     A            ORGF75    R
024800070111     A            ORGF76    R
024900070111     A            ORGF77    R
025000070111     A            ORGF78    R
025100070111     A            ORGF79    R
025200070111     A            ORGF80    R
025300070111     A            ORGF81    R
025400070111     A            ORGF82    R
025500070111     A            ORGF83    R
025600070111     A            ORGF84    R
025700070111     A            ORGF85    R
025800070111     A            ORGF86    R
025900070111     A            ORGF87    R
026000070111     A            ORGF88    R
026100070111     A            ORGF89    R
026200070111     A            ORGF90    R
026300070111     A            ORGF91    R
026400070111     A            ORGF92    R
026500070111     A            ORGF93    R
026600070111     A            ORGF94    R
026700070111     A            ORGF95    R
026800070111     A            ORGF96    R
026900070111     A            ORGF97    R
027000070111     A            ORGF98    R
027100070111     A            ORGF99    R
027200070111     A            ORGFA0    R
027300070111     A            ORGFA1    R
027400070111     A            ORGFA2    R
027500070111     A            ORGFA3    R
027600070111     A            ORGFA4    R
027700070111     A            ORGFA5    R
027800070111     A            ORGFA6    R
027900070111     A            ORGFA7    R
028000070111     A            ORGFA8    R
028100070111     A            ORGFA9    R
028200070111     A            ORGFB0    R
028300070111     A            ORGFB1    R
028400070111     A            ORGFB2    R
028500070111     A            ORGFB3    R
028600070111     A            ORGFB4    R
028700070111     A            ORGFB5    R
028800070111     A            ORGFB6    R
028900070111     A            ORGFB7    R
029000070111     A            ORGFB8    R
029100070111     A            ORGFB9    R
029200070111     A            ORGFC0    R
029300070111     A            ORGFC1    R
029400070111     A            ORGFC2    R
029500070111     A            ORGFC3    R
029600070111     A            ORGFC4    R
029700070111     A            ORGFC5    R
029800070111     A            ORGFC6    R
029900070111     A            ORGFC7    R
030000070111     A            ORGFC8    R
030100070111     A            ORGFC9    R
030200070111     A            ORGFD0    R
030300070111     A            ORGFD1    R
030400070111     A            ORGFD2    R
030500070111     A            ORGFD3    R
030600070111     A            ORGFD4    R
030700070111     A            ORGFD5    R
030800070111     A            ORGFD6    R
030900070111     A            ORGFD7    R
031000070111     A            ORGFD8    R
031100070111     A            ORGFD9    R
031200070111     A            ORGFF0    R
031300070111     A            ORGFTR    R
031400070111     A            ORGNTR    R
031500070111     A            ORGFEL    R
031600070111     A            ORGARA             I      SST(ORGDE0 1 3)
031700070111     A                                      TEXT('RAGGRUPPAMENTO AREA')
031800070111     A*----------------
031900070111     A          K ORGFL3
032000070111     A          K ORGARA
032100070111     A          K ORGCAR
032200900405     A          K ORGDES
