000100890907     A*---------------------------------------------------------------*
000200900614     A*  ARCHIVIO TRASMISSIONE ORGANIGRAMMA AZIENDALE  1° PARTE
000300900526     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500900327     A*
000600900614     A                                      FIFO
000700900614     A          R AZORGA                    FORMAT(AZORG0AR)
000800900614     A*----------------
000900900614     A          K ORGFIL
