000100890907     A*---------------------------------------------------------------*
000200900614     A*  ARCHIVIO RICEZIONE ORGANIGRAMMA AZIENDALE  2° PARTE
000300900526     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400890907     A*---------------------------------------------------------------*
000500900327     A*
000600900614     A                                      FIFO
000700900614     A                                      REF(CNDIZION)
000800900614     A          R AZORGB                    TEXT('RICEZIONE ORGANIGRAMMA +
000900900614     A                                      AZIENDALE 2° PARTE')
001000900614     A            ORGDIT         3          TEXT('DITTA')
001100900614     A                                      COLHDG('DITTA')
001200900614     A            ORGFIL    R               REFFLD($FIL)
001300900614     A*
001400900614     A            ORGDA0        25A         TEXT('100° DESCRIZIONE')
001500900614     A                                      COLHDG('100° DESCRIZIONE')
001600900614     A            ORGDA1        25A         TEXT('101° DESCRIZIONE')
001700900614     A                                      COLHDG('101° DESCRIZIONE')
001800900614     A            ORGDA2        25A         TEXT('102° DESCRIZIONE')
001900900614     A                                      COLHDG('102° DESCRIZIONE')
002000900614     A            ORGDA3        25A         TEXT('103° DESCRIZIONE')
002100900614     A                                      COLHDG('103° DESCRIZIONE')
002200900614     A            ORGDA4        25A         TEXT('104° DESCRIZIONE')
002300900614     A                                      COLHDG('104° DESCRIZIONE')
002400900614     A            ORGDA5        25A         TEXT('105° DESCRIZIONE')
002500900614     A                                      COLHDG('105° DESCRIZIONE')
002600900614     A            ORGDA6        25A         TEXT('106° DESCRIZIONE')
002700900614     A                                      COLHDG('106° DESCRIZIONE')
002800900614     A            ORGDA7        25A         TEXT('107° DESCRIZIONE')
002900900614     A                                      COLHDG('107° DESCRIZIONE')
003000900614     A            ORGDA8        25A         TEXT('108° DESCRIZIONE')
003100900614     A                                      COLHDG('108° DESCRIZIONE')
003200900614     A            ORGDA9        25A         TEXT('109° DESCRIZIONE')
003300900614     A                                      COLHDG('109° DESCRIZIONE')
003400900614     A            ORGDB0        25A         TEXT('110° DESCRIZIONE')
003500900614     A                                      COLHDG('110° DESCRIZIONE')
003600900614     A            ORGDB1        25A         TEXT('111° DESCRIZIONE')
003700900614     A                                      COLHDG('111° DESCRIZIONE')
003800900614     A            ORGDB2        25A         TEXT('112° DESCRIZIONE')
003900900614     A                                      COLHDG('112° DESCRIZIONE')
004000900614     A            ORGDB3        25A         TEXT('113° DESCRIZIONE')
004100900614     A                                      COLHDG('113° DESCRIZIONE')
004200900614     A            ORGDB4        25A         TEXT('114° DESCRIZIONE')
004300900614     A                                      COLHDG('114° DESCRIZIONE')
004400900614     A            ORGDB5        25A         TEXT('115° DESCRIZIONE')
004500900614     A                                      COLHDG('115° DESCRIZIONE')
004600900614     A            ORGDB6        25A         TEXT('116° DESCRIZIONE')
004700900614     A                                      COLHDG('116° DESCRIZIONE')
004800900614     A            ORGDB7        25A         TEXT('117° DESCRIZIONE')
004900900614     A                                      COLHDG('117° DESCRIZIONE')
005000900614     A            ORGDB8        25A         TEXT('118° DESCRIZIONE')
005100900614     A                                      COLHDG('118° DESCRIZIONE')
005200900614     A            ORGDB9        25A         TEXT('119° DESCRIZIONE')
005300900614     A                                      COLHDG('119° DESCRIZIONE')
005400900614     A            ORGDC0        25A         TEXT('120° DESCRIZIONE')
005500900614     A                                      COLHDG('120° DESCRIZIONE')
005600900614     A            ORGDC1        25A         TEXT('121° DESCRIZIONE')
005700900614     A                                      COLHDG('121° DESCRIZIONE')
005800900614     A            ORGDC2        25A         TEXT('122° DESCRIZIONE')
005900900614     A                                      COLHDG('122° DESCRIZIONE')
006000900614     A            ORGDC3        25A         TEXT('123° DESCRIZIONE')
006100900614     A                                      COLHDG('123° DESCRIZIONE')
006200900614     A            ORGDC4        25A         TEXT('124° DESCRIZIONE')
006300900614     A                                      COLHDG('124° DESCRIZIONE')
006400900614     A            ORGDC5        25A         TEXT('125° DESCRIZIONE')
006500900614     A                                      COLHDG('125° DESCRIZIONE')
006600900614     A            ORGDC6        25A         TEXT('126° DESCRIZIONE')
006700900614     A                                      COLHDG('126° DESCRIZIONE')
006800900614     A            ORGDC7        25A         TEXT('127° DESCRIZIONE')
006900900614     A                                      COLHDG('127° DESCRIZIONE')
007000900614     A            ORGDC8        25A         TEXT('128° DESCRIZIONE')
007100900614     A                                      COLHDG('128° DESCRIZIONE')
007200900614     A            ORGDC9        25A         TEXT('129° DESCRIZIONE')
007300900614     A                                      COLHDG('129° DESCRIZIONE')
007400900614     A            ORGDD0        25A         TEXT('130° DESCRIZIONE')
007500900614     A                                      COLHDG('130° DESCRIZIONE')
007600900614     A            ORGDD1        25A         TEXT('131° DESCRIZIONE')
007700900614     A                                      COLHDG('131° DESCRIZIONE')
007800900614     A            ORGDD2        25A         TEXT('132° DESCRIZIONE')
007900900614     A                                      COLHDG('132° DESCRIZIONE')
008000900614     A            ORGDD3        25A         TEXT('133° DESCRIZIONE')
008100900614     A                                      COLHDG('133° DESCRIZIONE')
008200900614     A            ORGDD4        25A         TEXT('134° DESCRIZIONE')
008300900614     A                                      COLHDG('134° DESCRIZIONE')
008400900614     A            ORGDD5        25A         TEXT('135° DESCRIZIONE')
008500900614     A                                      COLHDG('135° DESCRIZIONE')
008600900614     A            ORGDD6        25A         TEXT('136° DESCRIZIONE')
008700900614     A                                      COLHDG('136° DESCRIZIONE')
008800900614     A            ORGDD7        25A         TEXT('137° DESCRIZIONE')
008900900614     A                                      COLHDG('137° DESCRIZIONE')
009000900614     A            ORGDD8        25A         TEXT('138° DESCRIZIONE')
009100900614     A                                      COLHDG('138° DESCRIZIONE')
009200900614     A            ORGDD9        25A         TEXT('139° DESCRIZIONE')
009300900614     A                                      COLHDG('139° DESCRIZIONE')
009400900614     A            ORGDE0        25A         TEXT('140° DESCRIZIONE')
009500900614     A                                      COLHDG('140° DESCRIZIONE')
009600900614     A            ORGDE1        25A         TEXT('141° DESCRIZIONE')
009700900614     A                                      COLHDG('141° DESCRIZIONE')
009800900614     A            ORGDE2        25A         TEXT('142° DESCRIZIONE')
009900900614     A                                      COLHDG('142° DESCRIZIONE')
010000900614     A            ORGDE3        25A         TEXT('143° DESCRIZIONE')
010100900614     A                                      COLHDG('143° DESCRIZIONE')
010200900614     A            ORGDE4        25A         TEXT('144° DESCRIZIONE')
010300900614     A                                      COLHDG('144° DESCRIZIONE')
010400900614     A            ORGDE5        25A         TEXT('145° DESCRIZIONE')
010500900614     A                                      COLHDG('145° DESCRIZIONE')
010600900614     A            ORGDE6        25A         TEXT('146° DESCRIZIONE')
010700900614     A                                      COLHDG('146° DESCRIZIONE')
010800900614     A            ORGDE7        25A         TEXT('147° DESCRIZIONE')
010900900614     A                                      COLHDG('147° DESCRIZIONE')
011000900614     A            ORGDE8        25A         TEXT('148° DESCRIZIONE')
011100900614     A                                      COLHDG('148° DESCRIZIONE')
011200900614     A            ORGDE9        25A         TEXT('149° DESCRIZIONE')
011300900614     A                                      COLHDG('149° DESCRIZIONE')
011400900614     A            ORGDF0        25A         TEXT('150° DESCRIZIONE')
011500900614     A                                      COLHDG('150° DESCRIZIONE')
011600900614     A            ORGF01    R               REFFLD($FIL)
011700900614     A                                      TEXT('1° COD.FILIALE APPARTENENZA')
011800900614     A            ORGF02    R               REFFLD($FIL)
011900900614     A                                      TEXT('2° COD.FILIALE APPARTENENZA')
012000900614     A            ORGF03    R               REFFLD($FIL)
012100900614     A                                      TEXT('3° COD.FILIALE APPARTENENZA')
012200900614     A            ORGF04    R               REFFLD($FIL)
012300900614     A                                      TEXT('4° COD.FILIALE APPARTENENZA')
012400900614     A            ORGF05    R               REFFLD($FIL)
012500900614     A                                      TEXT('5° COD.FILIALE APPARTENENZA')
012600900614     A            ORGF06    R               REFFLD($FIL)
012700900614     A                                      TEXT('6° COD.FILIALE APPARTENENZA')
012800900614     A            ORGF07    R               REFFLD($FIL)
012900900614     A                                      TEXT('7° COD.FILIALE APPARTENENZA')
013000900614     A            ORGF08    R               REFFLD($FIL)
013100900614     A                                      TEXT('8° COD.FILIALE APPARTENENZA')
013200900614     A            ORGF09    R               REFFLD($FIL)
013300900614     A                                      TEXT('9° COD.FILIALE APPARTENENZA')
013400900614     A            ORGF10    R               REFFLD($FIL)
013500900614     A                                      TEXT('10° COD.FILIALE APPARTENENZA')
013600900614     A            ORGF11    R               REFFLD($FIL)
013700900614     A                                      TEXT('11° COD.FILIALE APPARTENENZA')
013800900614     A            ORGF12    R               REFFLD($FIL)
013900900614     A                                      TEXT('12° COD.FILIALE APPARTENENZA')
014000900614     A            ORGF13    R               REFFLD($FIL)
014100900614     A                                      TEXT('13 COD.FILIALE APPARTENENZA')
014200900614     A            ORGF14    R               REFFLD($FIL)
014300900614     A                                      TEXT('14 COD.FILIALE APPARTENENZA')
014400900614     A            ORGF15    R               REFFLD($FIL)
014500900614     A                                      TEXT('15 COD.FILIALE APPARTENENZA')
014600900614     A            ORGF16    R               REFFLD($FIL)
014700900614     A                                      TEXT('16 COD.FILIALE APPARTENENZA')
014800900614     A            ORGF17    R               REFFLD($FIL)
014900900614     A                                      TEXT('17 COD.FILIALE APPARTENENZA')
015000900614     A            ORGF18    R               REFFLD($FIL)
015100900614     A                                      TEXT('18 COD.FILIALE APPARTENENZA')
015200900614     A            ORGF19    R               REFFLD($FIL)
015300900614     A                                      TEXT('19 COD.FILIALE APPARTENENZA')
015400900614     A            ORGF20    R               REFFLD($FIL)
015500900614     A                                      TEXT('20 COD.FILIALE APPARTENENZA')
015600900614     A            ORGF21    R               REFFLD($FIL)
015700900614     A                                      TEXT('21 COD.FILIALE APPARTENENZA')
015800900614     A            ORGF22    R               REFFLD($FIL)
015900900614     A                                      TEXT('22 COD.FILIALE APPARTENENZA')
016000900614     A            ORGF23    R               REFFLD($FIL)
016100900614     A                                      TEXT('23 COD.FILIALE APPARTENENZA')
016200900614     A            ORGF24    R               REFFLD($FIL)
016300900614     A                                      TEXT('24 COD.FILIALE APPARTENENZA')
016400900614     A            ORGF25    R               REFFLD($FIL)
016500900614     A                                      TEXT('25 COD.FILIALE APPARTENENZA')
016600900614     A            ORGF26    R               REFFLD($FIL)
016700900614     A                                      TEXT('26 COD.FILIALE APPARTENENZA')
016800900614     A            ORGF27    R               REFFLD($FIL)
016900900614     A                                      TEXT('27 COD.FILIALE APPARTENENZA')
017000900614     A            ORGF28    R               REFFLD($FIL)
017100900614     A                                      TEXT('28 COD.FILIALE APPARTENENZA')
017200900614     A            ORGF29    R               REFFLD($FIL)
017300900614     A                                      TEXT('29 COD.FILIALE APPARTENENZA')
017400900614     A            ORGF30    R               REFFLD($FIL)
017500900614     A                                      TEXT('30 COD.FILIALE APPARTENENZA')
017600900614     A            ORGF31    R               REFFLD($FIL)
017700900614     A                                      TEXT('31 COD.FILIALE APPARTENENZA')
017800900614     A            ORGF32    R               REFFLD($FIL)
017900900614     A                                      TEXT('32 COD.FILIALE APPARTENENZA')
018000900614     A            ORGF33    R               REFFLD($FIL)
018100900614     A                                      TEXT('33 COD.FILIALE APPARTENENZA')
018200900614     A            ORGF34    R               REFFLD($FIL)
018300900614     A                                      TEXT('34 COD.FILIALE APPARTENENZA')
018400900614     A            ORGF35    R               REFFLD($FIL)
018500900614     A                                      TEXT('35 COD.FILIALE APPARTENENZA')
018600900614     A            ORGF36    R               REFFLD($FIL)
018700900614     A                                      TEXT('36 COD.FILIALE APPARTENENZA')
018800900614     A            ORGF37    R               REFFLD($FIL)
018900900614     A                                      TEXT('37 COD.FILIALE APPARTENENZA')
019000900614     A            ORGF38    R               REFFLD($FIL)
019100900614     A                                      TEXT('38 COD.FILIALE APPARTENENZA')
019200900614     A            ORGF39    R               REFFLD($FIL)
019300900614     A                                      TEXT('39 COD.FILIALE APPARTENENZA')
019400900614     A            ORGF40    R               REFFLD($FIL)
019500900614     A                                      TEXT('40 COD.FILIALE APPARTENENZA')
019600900614     A            ORGF41    R               REFFLD($FIL)
019700900614     A                                      TEXT('41 COD.FILIALE APPARTENENZA')
019800900614     A            ORGF42    R               REFFLD($FIL)
019900900614     A                                      TEXT('42 COD.FILIALE APPARTENENZA')
020000900614     A            ORGF43    R               REFFLD($FIL)
020100900614     A                                      TEXT('43 COD.FILIALE APPARTENENZA')
020200900614     A            ORGF44    R               REFFLD($FIL)
020300900614     A                                      TEXT('44 COD.FILIALE APPARTENENZA')
020400900614     A            ORGF45    R               REFFLD($FIL)
020500900614     A                                      TEXT('45 COD.FILIALE APPARTENENZA')
020600900614     A            ORGF46    R               REFFLD($FIL)
020700900614     A                                      TEXT('46 COD.FILIALE APPARTENENZA')
020800900614     A            ORGF47    R               REFFLD($FIL)
020900900614     A                                      TEXT('47 COD.FILIALE APPARTENENZA')
021000900614     A            ORGF48    R               REFFLD($FIL)
021100900614     A                                      TEXT('48 COD.FILIALE APPARTENENZA')
021200900614     A            ORGF49    R               REFFLD($FIL)
021300900614     A                                      TEXT('49 COD.FILIALE APPARTENENZA')
021400900614     A            ORGF50    R               REFFLD($FIL)
021500900614     A                                      TEXT('50 COD.FILIALE APPARTENENZA')
021600900614     A            ORGF51    R               REFFLD($FIL)
021700900614     A                                      TEXT('51 COD.FILIALE APPARTENENZA')
021800900614     A            ORGF52    R               REFFLD($FIL)
021900900614     A                                      TEXT('52 COD.FILIALE APPARTENENZA')
022000900614     A            ORGF53    R               REFFLD($FIL)
022100900614     A                                      TEXT('53 COD.FILIALE APPARTENENZA')
022200900614     A            ORGF54    R               REFFLD($FIL)
022300900614     A                                      TEXT('54 COD.FILIALE APPARTENENZA')
022400900614     A            ORGF55    R               REFFLD($FIL)
022500900614     A                                      TEXT('55 COD.FILIALE APPARTENENZA')
022600900614     A            ORGF56    R               REFFLD($FIL)
022700900614     A                                      TEXT('56 COD.FILIALE APPARTENENZA')
022800900614     A            ORGF57    R               REFFLD($FIL)
022900900614     A                                      TEXT('57 COD.FILIALE APPARTENENZA')
023000900614     A            ORGF58    R               REFFLD($FIL)
023100900614     A                                      TEXT('58° COD.FILIALE APPARTENENZA')
023200900614     A            ORGF59    R               REFFLD($FIL)
023300900614     A                                      TEXT('59 COD.FILIALE APPARTENENZA')
023400900614     A            ORGF60    R               REFFLD($FIL)
023500900614     A                                      TEXT('60 COD.FILIALE APPARTENENZA')
023600900614     A            ORGF61    R               REFFLD($FIL)
023700900614     A                                      TEXT('61 COD.FILIALE APPARTENENZA')
023800900614     A            ORGF62    R               REFFLD($FIL)
023900900614     A                                      TEXT('62 COD.FILIALE APPARTENENZA')
024000900614     A            ORGF63    R               REFFLD($FIL)
024100900614     A                                      TEXT('63 COD.FILIALE APPARTENENZA')
024200900614     A            ORGF64    R               REFFLD($FIL)
024300900614     A                                      TEXT('64 COD.FILIALE APPARTENENZA')
024400900614     A            ORGF65    R               REFFLD($FIL)
024500900614     A                                      TEXT('65 COD.FILIALE APPARTENENZA')
024600900614     A            ORGF66    R               REFFLD($FIL)
024700900614     A                                      TEXT('66 COD.FILIALE APPARTENENZA')
024800900614     A            ORGF67    R               REFFLD($FIL)
024900900614     A                                      TEXT('67 COD.FILIALE APPARTENENZA')
025000900614     A            ORGF68    R               REFFLD($FIL)
025100900614     A                                      TEXT('68 COD.FILIALE APPARTENENZA')
025200900614     A            ORGF69    R               REFFLD($FIL)
025300900614     A                                      TEXT('69 COD.FILIALE APPARTENENZA')
025400900614     A            ORGF70    R               REFFLD($FIL)
025500900614     A                                      TEXT('70 COD.FILIALE APPARTENENZA')
025600900614     A            ORGF71    R               REFFLD($FIL)
025700900614     A                                      TEXT('71 COD.FILIALE APPARTENENZA')
025800900614     A            ORGF72    R               REFFLD($FIL)
025900900614     A                                      TEXT('72 COD.FILIALE APPARTENENZA')
026000900614     A            ORGF73    R               REFFLD($FIL)
026100900614     A                                      TEXT('73 COD.FILIALE APPARTENENZA')
026200900614     A            ORGF74    R               REFFLD($FIL)
026300900614     A                                      TEXT('74 COD.FILIALE APPARTENENZA')
026400900614     A            ORGF75    R               REFFLD($FIL)
026500900614     A                                      TEXT('75 COD.FILIALE APPARTENENZA')
026600900614     A            ORGF76    R               REFFLD($FIL)
026700900614     A                                      TEXT('76 COD.FILIALE APPARTENENZA')
026800900614     A            ORGF77    R               REFFLD($FIL)
026900900614     A                                      TEXT('77 COD.FILIALE APPARTENENZA')
027000900614     A            ORGF78    R               REFFLD($FIL)
027100900614     A                                      TEXT('78 COD.FILIALE APPARTENENZA')
027200900614     A            ORGF79    R               REFFLD($FIL)
027300900614     A                                      TEXT('79 COD.FILIALE APPARTENENZA')
027400900614     A            ORGF80    R               REFFLD($FIL)
027500900614     A                                      TEXT('80 COD.FILIALE APPARTENENZA')
027600900614     A            ORGF81    R               REFFLD($FIL)
027700900614     A                                      TEXT('81 COD.FILIALE APPARTENENZA')
027800900614     A            ORGF82    R               REFFLD($FIL)
027900900614     A                                      TEXT('82 COD.FILIALE APPARTENENZA')
028000900614     A            ORGF83    R               REFFLD($FIL)
028100900614     A                                      TEXT('83 COD.FILIALE APPARTENENZA')
028200900614     A            ORGF84    R               REFFLD($FIL)
028300900614     A                                      TEXT('84 COD.FILIALE APPARTENENZA')
028400900614     A            ORGF85    R               REFFLD($FIL)
028500900614     A                                      TEXT('85 COD.FILIALE APPARTENENZA')
028600900614     A            ORGF86    R               REFFLD($FIL)
028700900614     A                                      TEXT('86 COD.FILIALE APPARTENENZA')
028800900614     A            ORGF87    R               REFFLD($FIL)
028900900614     A                                      TEXT('87 COD.FILIALE APPARTENENZA')
029000900614     A            ORGF88    R               REFFLD($FIL)
029100900614     A                                      TEXT('88 COD.FILIALE APPARTENENZA')
029200900614     A            ORGF89    R               REFFLD($FIL)
029300900614     A                                      TEXT('89 COD.FILIALE APPARTENENZA')
029400900614     A            ORGF90    R               REFFLD($FIL)
029500900614     A                                      TEXT('90 COD.FILIALE APPARTENENZA')
029600900614     A            ORGF91    R               REFFLD($FIL)
029700900614     A                                      TEXT('91 COD.FILIALE APPARTENENZA')
029800900614     A            ORGF92    R               REFFLD($FIL)
029900900614     A                                      TEXT('92 COD.FILIALE APPARTENENZA')
030000900614     A            ORGF93    R               REFFLD($FIL)
030100900614     A                                      TEXT('93 COD.FILIALE APPARTENENZA')
030200900614     A            ORGF94    R               REFFLD($FIL)
030300900614     A                                      TEXT('94 COD.FILIALE APPARTENENZA')
030400900614     A            ORGF95    R               REFFLD($FIL)
030500900614     A                                      TEXT('95 COD.FILIALE APPARTENENZA')
030600900614     A            ORGF96    R               REFFLD($FIL)
030700900614     A                                      TEXT('96 COD.FILIALE APPARTENENZA')
030800900614     A            ORGF97    R               REFFLD($FIL)
030900900614     A                                      TEXT('97 COD.FILIALE APPARTENENZA')
031000900614     A            ORGF98    R               REFFLD($FIL)
031100900614     A                                      TEXT('98 COD.FILIALE APPARTENENZA')
031200900614     A            ORGF99    R               REFFLD($FIL)
031300900614     A                                      TEXT('99 COD.FILIALE APPARTENENZA')
031400900614     A            ORGFA0    R               REFFLD($FIL)
031500900614     A                                      TEXT('100°COD.FILIALE APPARTENENZA')
031600900614     A            ORGFA1    R               REFFLD($FIL)
031700900614     A                                      TEXT('101°COD.FILIALE APPARTENENZA')
031800900614     A            ORGFA2    R               REFFLD($FIL)
031900900614     A                                      TEXT('102°COD.FILIALE APPARTENENZA')
032000900614     A            ORGFA3    R               REFFLD($FIL)
032100900614     A                                      TEXT('103°COD.FILIALE APPARTENENZA')
032200900614     A            ORGFA4    R               REFFLD($FIL)
032300900614     A                                      TEXT('104°COD.FILIALE APPARTENENZA')
032400900614     A            ORGFA5    R               REFFLD($FIL)
032500900614     A                                      TEXT('105°COD.FILIALE APPARTENENZA')
032600900614     A            ORGFA6    R               REFFLD($FIL)
032700900614     A                                      TEXT('106°COD.FILIALE APPARTENENZA')
032800900614     A            ORGFA7    R               REFFLD($FIL)
032900900614     A                                      TEXT('107°COD.FILIALE APPARTENENZA')
033000900614     A            ORGFA8    R               REFFLD($FIL)
033100900614     A                                      TEXT('108°COD.FILIALE APPARTENENZA')
033200900614     A            ORGFA9    R               REFFLD($FIL)
033300900614     A                                      TEXT('109°COD.FILIALE APPARTENENZA')
033400900614     A            ORGFB0    R               REFFLD($FIL)
033500900614     A                                      TEXT('110°COD.FILIALE APPARTENENZA')
033600900614     A            ORGFB1    R               REFFLD($FIL)
033700900614     A                                      TEXT('111°COD.FILIALE APPARTENENZA')
033800900614     A            ORGFB2    R               REFFLD($FIL)
033900900614     A                                      TEXT('112°COD.FILIALE APPARTENENZA')
034000900614     A            ORGFB3    R               REFFLD($FIL)
034100900614     A                                      TEXT('113°COD.FILIALE APPARTENENZA')
034200900614     A            ORGFB4    R               REFFLD($FIL)
034300900614     A                                      TEXT('114°COD.FILIALE APPARTENENZA')
034400900614     A            ORGFB5    R               REFFLD($FIL)
034500900614     A                                      TEXT('115°COD.FILIALE APPARTENENZA')
034600900614     A            ORGFB6    R               REFFLD($FIL)
034700900614     A                                      TEXT('116°COD.FILIALE APPARTENENZA')
034800900614     A            ORGFB7    R               REFFLD($FIL)
034900900614     A                                      TEXT('117°COD.FILIALE APPARTENENZA')
035000900614     A            ORGFB8    R               REFFLD($FIL)
035100900614     A                                      TEXT('118°COD.FILIALE APPARTENENZA')
035200900614     A            ORGFB9    R               REFFLD($FIL)
035300900614     A                                      TEXT('119°COD.FILIALE APPARTENENZA')
035400900614     A            ORGFC0    R               REFFLD($FIL)
035500900614     A                                      TEXT('120°COD.FILIALE APPARTENENZA')
035600900614     A            ORGFC1    R               REFFLD($FIL)
035700900614     A                                      TEXT('121°COD.FILIALE APPARTENENZA')
035800900614     A            ORGFC2    R               REFFLD($FIL)
035900900614     A                                      TEXT('122°COD.FILIALE APPARTENENZA')
036000900614     A            ORGFC3    R               REFFLD($FIL)
036100900614     A                                      TEXT('123°COD.FILIALE APPARTENENZA')
036200900614     A            ORGFC4    R               REFFLD($FIL)
036300900614     A                                      TEXT('124°COD.FILIALE APPARTENENZA')
036400900614     A            ORGFC5    R               REFFLD($FIL)
036500900614     A                                      TEXT('125°COD.FILIALE APPARTENENZA')
036600900614     A            ORGFC6    R               REFFLD($FIL)
036700900614     A                                      TEXT('126°COD.FILIALE APPARTENENZA')
036800900614     A            ORGFC7    R               REFFLD($FIL)
036900900614     A                                      TEXT('127°COD.FILIALE APPARTENENZA')
037000900614     A            ORGFC8    R               REFFLD($FIL)
037100900614     A                                      TEXT('128°COD.FILIALE APPARTENENZA')
037200900614     A            ORGFC9    R               REFFLD($FIL)
037300900614     A                                      TEXT('129°COD.FILIALE APPARTENENZA')
037400900614     A            ORGFD0    R               REFFLD($FIL)
037500900614     A                                      TEXT('130°COD.FILIALE APPARTENENZA')
037600900614     A            ORGFD1    R               REFFLD($FIL)
037700900614     A                                      TEXT('131°COD.FILIALE APPARTENENZA')
037800900614     A            ORGFD2    R               REFFLD($FIL)
037900900614     A                                      TEXT('132°COD.FILIALE APPARTENENZA')
038000900614     A            ORGFD3    R               REFFLD($FIL)
038100900614     A                                      TEXT('133°COD.FILIALE APPARTENENZA')
038200900614     A            ORGFD4    R               REFFLD($FIL)
038300900614     A                                      TEXT('134°COD.FILIALE APPARTENENZA')
038400900614     A            ORGFD5    R               REFFLD($FIL)
038500900614     A                                      TEXT('135°COD.FILIALE APPARTENENZA')
038600900614     A            ORGFD6    R               REFFLD($FIL)
038700900614     A                                      TEXT('136°COD.FILIALE APPARTENENZA')
038800900614     A            ORGFD7    R               REFFLD($FIL)
038900900614     A                                      TEXT('137°COD.FILIALE APPARTENENZA')
039000900614     A            ORGFD8    R               REFFLD($FIL)
039100900614     A                                      TEXT('138°COD.FILIALE APPARTENENZA')
039200900614     A            ORGFD9    R               REFFLD($FIL)
039300900614     A                                      TEXT('139°COD.FILIALE APPARTENENZA')
039400900614     A            ORGFE0    R               REFFLD($FIL)
039500900614     A                                      TEXT('140°COD.FILIALE APPARTENENZA')
039600900614     A            ORGFE1    R               REFFLD($FIL)
039700900614     A                                      TEXT('141°COD.FILIALE APPARTENENZA')
039800900614     A            ORGFE2    R               REFFLD($FIL)
039900900614     A                                      TEXT('142°COD.FILIALE APPARTENENZA')
040000900614     A            ORGFE3    R               REFFLD($FIL)
040100900614     A                                      TEXT('143°COD.FILIALE APPARTENENZA')
040200900614     A            ORGFE4    R               REFFLD($FIL)
040300900614     A                                      TEXT('144°COD.FILIALE APPARTENENZA')
040400900614     A            ORGFE5    R               REFFLD($FIL)
040500900614     A                                      TEXT('145°COD.FILIALE APPARTENENZA')
040600900614     A            ORGFE6    R               REFFLD($FIL)
040700900614     A                                      TEXT('146°COD.FILIALE APPARTENENZA')
040800900614     A            ORGFE7    R               REFFLD($FIL)
040900900614     A                                      TEXT('147°COD.FILIALE APPARTENENZA')
041000900614     A            ORGFE8    R               REFFLD($FIL)
041100900614     A                                      TEXT('148°COD.FILIALE APPARTENENZA')
041200900614     A            ORGFE9    R               REFFLD($FIL)
041300900614     A                                      TEXT('149°COD.FILIALE APPARTENENZA')
041400900614     A            ORGFF0    R               REFFLD($FIL)
041500900614     A                                      TEXT('150°COD.FILIALE APPARTENENZA')
041600900614     A            ORGFTR    R               REFFLD($FTR)
041700900614     A            ORGNTR    R               REFFLD($DTR)
041800900614     A            ORGFEL    R               REFFLD($FIL)
041900900614     A                                      TEXT('COD.FILIALE ELABORATORE')
042000900614     A*----------------
042100900614     A          K ORGFIL
