000100000000     A*--------------------------------------------------------------*
000200910220     A*         ORGANIGRAMMI AZIENDALE DI SEDE
000201920317     A*         IN "VERTICALE" X OFFICE
000300000000     A*--------------------------------------------------------------*
000401920317     A          R AZOSE10                   TEXT('ORGANIGRAMMI AZIENDALI +
000402920317     A                                      IN VERTICALE X VOCE')
000600920317     A            OR1FIL         3S 0       TEXT('COD.FILIALE (AZIENDA)')
000700920317     A            OR1DES        20A         TEXT('DESCRIZIONE FILIALE')
000701920317     A            OR1CVO         3S 0       TEXT('CODICE VOCE')
000702920317     A            OR1DCO        35A         TEXT('DECODIFICA VOCE')
000800920317     A            OR1DVO        25A         TEXT('DESCRIZIONE VOCE')
000900920317     A            OR1CFI         3S 0       TEXT('COD.FILIALE APPARTENZA')
001100920317     A            OR1DFI        25A         TEXT('DECODIFICA FIL. APPARTENZA')
001101920317     A*
001200920317     A          K OR1FIL
001201920317     A          K OR1CVO
001202920317     A*
001300920317     A**  FILE INDICI PER:
001400920317     A**  - CODICE FILIALE(AZIENDA)
001500920317     A**  - CODICE VOCE
