000100000000     A*--------------------------------------------------------------*
000200000628     A*     CERTIFICAZIONI AUTOTRASPORTATORI
000300000000     A*--------------------------------------------------------------*
000400890919     A                                      REF(CNDIZION)
000500901009     A                                      FIFO
000600910710     A          R AZTRA
000700910710     A            TRAFIL    R               REFFLD($FIL)
000800910710     A                                      TEXT('CODICE FILIALE/AGENZIA')
000900900321     A*
001000920522     A            TRATIP         1A         TEXT('RAPPORTO: N/A/D/C')
001100000628     A                                      COLHDG('N/A/D/C/')
001200920522     A            TRASOC        25A         TEXT('NOMINATIVO SOCIETA')
001300920522     A                                      COLHDG('NOM.SOCIETA')
001400070515     A            TRAAUT        45A         TEXT('NOMINATIVO AUTISTA')
001500920522     A                                      COLHDG('AUTISTA')
001600920522     A            TRATIA        15A         TEXT('TIPO AUTOMEZZO')
001700920522     A                                      COLHDG('TIPO AUTOM.')
001800070515     A            TRATAA        11A         TEXT('TARGA AUTOMEZZO')
001900920522     A                                      COLHDG('TARGA AUTOM.')
002000970904     A            TRAIVA        16A         TEXT('PARTITA IVA')
002100910710     A                                      COLHDG('P.IVA')
002200910710     A            TRAICC         1A         TEXT('CERT.ISCR.CCIAA')
002300910710     A                                      COLHDG('CCIAA')
002400970530     A            TRAIDE         1A         TEXT('BUDGE')
002500970530     A                                      COLHDG('BUDGE')
002600910710     A            TRAPAT         1A         TEXT('FOTOCOPIA PATENTE')
002700910710     A                                      COLHDG('PATENTE')
002800920522     A            TRASPA         6P 0       TEXT('SCAD.PATENTE')
002900920522     A                                      COLHDG('SCAD.PATENTE')
003000910710     A            TRAPEN         1A         TEXT('CERTIFICATO PENALE')
003100910710     A                                      COLHDG('C.PENALE')
003200920522     A            TRACCP         1A         TEXT('CERT. CARICHI PENDENTI')
003300910710     A                                      COLHDG('CAR.PEND.')
003400970530     A            TRARES         1A         TEXT('CONTRATTO TRASP.')
003500970530     A                                      COLHDG('CONTR.TRAS.')
003600920522     A            TRATEL        12A         TEXT('NUM. TELEFONO')
003700920522     A                                      COLHDG('NUM.TEL.')
003800910710     A            TRABPO         1A         TEXT('BLOCCAPORTE')
003900910710     A                                      COLHDG('BLOCCAP.')
004000920522     A            TRAANT        10A         TEXT('TIPO ANTIFURTO')
004100910710     A                                      COLHDG('ANTIF.')
004200920522     A            TRAACT         1A         TEXT('AUTORIZZ.C/TERZI')
004300910710     A                                      COLHDG('C/TERZI')
004400920522     A            TRASCT         6P 0       TEXT('SCAD.AUTORIZZ.C/TERZI')
004500920522     A                                      COLHDG('SCAD.C/TERZI')
004600970723     A            TRATMP         1A         TEXT('COLORE AUTOMEZZO')
004700970723     A                                      COLHDG('COL' 'AUT' )
004800020827     A            TRADTM         6P 0       TEXT('DATA VERNICIATURA PREVISTA')
004900020827     A                                      COLHDG('DATA' 'VER' 'PREV' )
005000910710     A            TRAASS         1A         TEXT('FOTOCOPIA ASS.NE')
005100910710     A                                      COLHDG('ASS.NE')
005200910710     A            TRAASM         1A         TEXT('FOTOCOPIA ASS.NE MERCI')
005300920522     A                                      COLHDG('ASS.NE MER.')
005400970723     A            TRAFOT         1A         TEXT('FOTO AUTOCARRO')
005500970723     A                                      COLHDG('FOTO' 'AUT.')
005600930430     A            TRADAC         6P 0       TEXT('DATA ACCREDITAMENTO')
005700930430     A                                      COLHDG('DATA ACCRED.')
005800930430     A            TRADIN         6P 0       TEXT('DATA INIZIO RAPPORTO')
005900930430     A                                      COLHDG('DATA INIZ.RAPP.')
006000930430     A            TRADFI         6P 0       TEXT('DATA FINE RAPPORTO')
006100930430     A                                      COLHDG('DATA FINE RAPP.')
006200960518     A            TRACIA        10A         TEXT('NUM.ISCRIZ.CCIAA')
006300960518     A                                      COLHDG('N.ISCRIZ.CCIAA')
006400960518     A            TRAKAU         7P 0       TEXT('CODICE AUTISTA')
006500960518     A                                      COLHDG('CODICE' 'AUT.')
006600970723     A            TRAAIA         1A         TEXT('ISCR.ALBO IMP.ARTIGIANE')
006700970723     A                                      COLHDG('ISCR.' 'ALBO' 'ART')
006800970723     A            TRAIAA         1A         TEXT('ISCR.ALBO AUTOTRASPORT.')
006900970723     A                                      COLHDG('ISCR.' 'ALBO' 'AUTOTR')
007000970723     A            TRAPUB         1A         TEXT('SCRITTE PUBBLICITARIE')
007100970723     A                                      COLHDG('SCRITTE' 'PUBBL.')
007200970902     A            TRADCL         6P 0       TEXT('DATA CONTRATTO LOCAZ.')
007300970902     A                                      COLHDG('DATA' 'CONTR.' 'LOC')
007400000223     A            TRAFFF         2A         TEXT('DOPPIO ACCRED.')
007500000223     A                                      COLHDG('2°' 'ACCR.')
007600970723     A*----------------
007700981012     A            TRAFUR         1A         TEXT('FURGONATO')
007800981012     A                                      COLHDG('FURG.')
007900000218     A            TRA626         4A         TEXT('D.L. 626')
008000000218     A                                      COLHDG('DL626')
008100000218     A            TRADIP         4A         TEXT('HA DIPEND.?')
008200000218     A                                      COLHDG('DIP')
008300000218     A            TRA155         4A         TEXT('D.L. 155')
008400000218     A                                      COLHDG('DL155')
008500000223     A            TRASPI         1A         TEXT('SPONDA IDR.')
008600000223     A                                      COLHDG('SP' 'IDR.')
008700000223     A            TRAFF1         2A         TEXT('LIBERO1')
008800000223     A                                      COLHDG('LIB1')
008900000223     A            TRAFF2         2A         TEXT('LIBERO2')
009000000223     A                                      COLHDG('LIB2')
009100000628     A*  26.6.2000
009200000628     A            TRAPPT         1A         TEXT('S=POSTE')
009300000628     A                                      COLHDG('P.PT.')
009400000628     A            TRABPT         7P 0       TEXT('N.BADGE PT.')
009500000628     A                                      COLHDG('N.BDG' 'PT')
009600020416     A*  16.4.2002
009700020416     A            TRANT1        35A         TEXT('NOTE 1')
009800020416     A                                      COLHDG('NOTE 1')
009900020416     A            TRANT2        35A         TEXT('NOTE 2')
010000020416     A                                      COLHDG('NOTE 2')
010100020827     A*  27.8.2002
010200020827     A            TRADT2         6P 0       TEXT('DATA2 VERNICIATURA')
010300020827     A                                      COLHDG('DATA2' 'VER' 'PREV.')
010400020827     A            TRADT3         6P 0       TEXT('DATA3 VERNICIATURA')
010500020827     A                                      COLHDG('DATA3' 'VER' 'PREV.')
010600020827     A            TRADRR         6P 0       TEXT('DATA RILEVAZ.RIPRISTINO')
010700020827     A                                      COLHDG('DATA' 'RILEV.' 'RIPR.')
010800020827     A            TRADPR         6P 0       TEXT('DATA PREV.RIPRISTINO')
010900020827     A                                      COLHDG('DATA' 'PREV.' 'RIPR.')
011000020827     A            TRADP2         6P 0       TEXT('DATA2 PREV.RIPRISTINO')
011100020827     A                                      COLHDG('DATA2' 'PREV.' 'RIPR.')
011200020827     A            TRADP3         6P 0       TEXT('DATA3 PREV.RIPRISTINO')
011300020827     A                                      COLHDG('DATA3' 'PREV.' 'RIPR.')
011400020827     A            TRANRP        35A         TEXT('NOTE RIPRISTINO')
011500020827     A*
011600981012     A          K TRAFIL
011700920525     A          K TRAAUT
