000001011116     A                                      UNIQUE
000401011116     A          R AZUTE000                  PFILE(AZUTE00F)
000500010824     A          K UTEUTE
