000100000000     A*--------------------------------------------------------------*
000200111125     A*     SOCIETA' X CERTIFICAZIONE AUT DI SEDE  APPENDICI CONTRATTO
000300000000     A*--------------------------------------------------------------*
000400890919     A                                      REF(CNDIZION)
000500130107     A          R CONTRA20
000501130107     A            SOCIETA        3A
000502130107     A            IVA           16A
000600130107     A            NRC            7P 0
000800130107     A            FIL            3P 0
000801130107     A            FLG            1
006000090316     A*----
006100130107     A          K IVA
006200130107     A          K FLG
