000100970515     A*------------------------------------------------------------------------*
000200060427     A* CAPPARIO DPD - DEPOTS
000300970515     A*------------------------------------------------------------------------*
000400970515     A                                      REF(CNDIZION)
000500060427     A          R DPCDP000                  TEXT('CAPPARIO - DEPOTS')
000600060427     A            CDPVER    R     S         REFFLD($VER)
000700060426     A                                      TEXT('VERSIONE')
000800060426     A                                      COLHDG('VERSIONE')
000900060427     A            CDPDPC         4A
001000060427     A                                      TEXT('DEPOT CODE')
001100060427     A                                      COLHDG('DEPOT CODE')
001200060427     A            CDPIATA        3A
001300060427     A                                      TEXT('IATA CODE')
001400060427     A                                      COLHDG('IATA CODE')
001500060503     A            CDPGID       120A         VARLEN(12)
001600060503     A                                      TEXT('LIST GROUP ID')
001700060503     A                                      COLHDG('LIST GROUP ID')
001800060427     A            CDPNAM1       35A
001900060427     A                                      TEXT('NAME 1')
002000060427     A                                      COLHDG('NAME 1')
002100060427     A            CDPNAM2       35A
002200060427     A                                      TEXT('NAME 2')
002300060427     A                                      COLHDG('NAME 2')
002400060427     A            CDPADR1       35A
002500060427     A                                      TEXT('ADDRESS 1')
002600060427     A                                      COLHDG('ADDRESS 1')
002700060427     A            CDPADR2       35A
002800060427     A                                      TEXT('ADDRESS 2')
002900060427     A                                      COLHDG('ADDRESS 2')
003000060427     A            CDPPTC         9A
003100060427     A                                      TEXT('POSTAL CODE')
003200060427     A                                      COLHDG('POSTAL CODE')
003300060427     A            CDPCTY        60A
003400060427     A                                      TEXT('CITY')
003500060427     A                                      COLHDG('CITY')
003600060427     A            CDPISO2        2A
003700060427     A                                      TEXT('ISO ALFA 2  CODE')
003800060427     A                                      COLHDG('ISO ALFA 2 CODE')
003900060427     A            CDPPHN        35A
004000060427     A                                      TEXT('TELEPHONE NUMBER')
004100060427     A                                      COLHDG('TELEPHONE NUMBER')
004200060427     A            CDPFAX        35A
004300060427     A                                      TEXT('FAX NUMBER')
004400060427     A                                      COLHDG('FAX NUMBER')
004500060427     A            CDPEML        35A
004600060427     A                                      TEXT('E-MAIL')
004700060427     A                                      COLHDG('E-MAIL')
004800060427     A            CDPWEB        35A
004900060427     A                                      TEXT('WEB')
005000060427     A                                      COLHDG('WEB')
005100060503     A            CDPORMA        1A
005200060503     A                                      TEXT('FLAG Y/N ORM AUTOMATICO')
005300060503     A                                      COLHDG('FLAG Y/N ORM AUTOM.')
005400060427     A            CDPATB         1A
005500060426     A                                      TEXT('FLAG ANNULLAMENTO')
005600060426     A                                      COLHDG('FLAG ANNULLAMENTO')
