000100970515     A*------------------------------------------------------------------------*
000200060502     A* CAPPARIO DPD - DEPOTS =>  LF: VER+ISO2+DPC
000300970515     A*------------------------------------------------------------------------*
000400060427     A          R DPCDP000                  PFILE(DPCDP00F)
000500060427     A          K CDPVER
000600060502     A          K CDPISO2
000700060427     A          K CDPDPC
