000100970515     A*------------------------------------------------------------------------*
000200160204     A* CAPPARIO DPD - MAIL DEPOTS =>  LF: DPC + TRC
000300970515     A*------------------------------------------------------------------------*
000400171122     A          R DPIMD100                  PFILE(DPIMD10F)
000500160204     A          K IMDDPC
000600160204     A          K IMDTRC
