000100970515     A*------------------------------------------------------------------------*
000200060915     A* CAPPARIO DPD - DEPOTS =>  LF: DPC+DSC
000300970515     A*------------------------------------------------------------------------*
000400060803     A          R DPPDC000                  PFILE(DPPDC00F)
000500060803     A          K PDCDPC
000600060915     A          K PDCDSC
