000100030114     A*------------------------------------------------------------------------*
000200030114     A* C/ECON - VOCI COOP
000300030114     A*------------------------------------------------------------------------*
000400030114     A                                      REF(CNDIZION)
000500030114     A          R ECCEV000                  TEXT('C/ECON - VOCI COOP')
000600030114     A            CEVAAS    R               REFFLD($AA4)
000700030114     A            CEVLNP    R               REFFLD($LNP)
000800030114     A            CEVNRS    R               REFFLD($NRS)
000900030114     A            CEVNSP    R               REFFLD($NSP)
001000030114     A            CEVTBL    R               REFFLD($TBL)
001100030115     A            CEVMES         2  0       TEXT('MESE')
001200030115     C* CODICE
001300030115     A            CEVC01         3  0       TEXT('CODICE  VOCE 01')
001400030115     A            CEVC02         3  0       TEXT('CODICE  VOCE 02')
001500030115     A            CEVC03         3  0       TEXT('CODICE  VOCE 03')
001600030115     A            CEVC04         3  0       TEXT('CODICE  VOCE 04')
001700030115     A            CEVC05         3  0       TEXT('CODICE  VOCE 05')
001800030115     A            CEVC06         3  0       TEXT('CODICE  VOCE 06')
001900030115     A            CEVC07         3  0       TEXT('CODICE  VOCE 07')
002000030115     A            CEVC08         3  0       TEXT('CODICE  VOCE 08')
002100030115     A            CEVC09         3  0       TEXT('CODICE  VOCE 09')
002200030115     A            CEVC10         3  0       TEXT('CODICE  VOCE 10')
002300030115     A            CEVC11         3  0       TEXT('CODICE  VOCE 11')
002400030115     A            CEVC12         3  0       TEXT('CODICE  VOCE 12')
002500030115     A            CEVC13         3  0       TEXT('CODICE  VOCE 13')
002600030115     A            CEVC14         3  0       TEXT('CODICE  VOCE 14')
002700030115     A            CEVC15         3  0       TEXT('CODICE  VOCE 15')
002800030115     A            CEVC16         3  0       TEXT('CODICE  VOCE 16')
002900030115     A            CEVC17         3  0       TEXT('CODICE  VOCE 17')
003000030115     A            CEVC18         3  0       TEXT('CODICE  VOCE 18')
003100030115     A            CEVC19         3  0       TEXT('CODICE  VOCE 19')
003200030115     A            CEVC20         3  0       TEXT('CODICE  VOCE 20')
003300030115     A            CEVC21         3  0       TEXT('CODICE  VOCE 21')
003400030115     A            CEVC22         3  0       TEXT('CODICE  VOCE 22')
003500030115     A            CEVC23         3  0       TEXT('CODICE  VOCE 23')
003600030115     A            CEVC24         3  0       TEXT('CODICE  VOCE 24')
003700030115     A            CEVC25         3  0       TEXT('CODICE  VOCE 25')
003800030115     A            CEVC26         3  0       TEXT('CODICE  VOCE 26')
003900030115     A            CEVC27         3  0       TEXT('CODICE  VOCE 27')
004000030115     A            CEVC28         3  0       TEXT('CODICE  VOCE 28')
004100030115     A            CEVC29         3  0       TEXT('CODICE  VOCE 29')
004200030115     A            CEVC30         3  0       TEXT('CODICE  VOCE 30')
004300030115     A            CEVC31         3  0       TEXT('CODICE  VOCE 31')
004400030115     A            CEVC32         3  0       TEXT('CODICE  VOCE 32')
004500030115     A            CEVC33         3  0       TEXT('CODICE  VOCE 33')
004600030115     A            CEVC34         3  0       TEXT('CODICE  VOCE 34')
004700030115     A            CEVC35         3  0       TEXT('CODICE  VOCE 35')
004800030115     A            CEVC36         3  0       TEXT('CODICE  VOCE 36')
004900030115     A            CEVC37         3  0       TEXT('CODICE  VOCE 37')
005000030115     A            CEVC38         3  0       TEXT('CODICE  VOCE 38')
005100030115     A            CEVC39         3  0       TEXT('CODICE  VOCE 39')
005200030115     A            CEVC40         3  0       TEXT('CODICE  VOCE 40')
005300030115     A            CEVC41         3  0       TEXT('CODICE  VOCE 41')
005400030115     A            CEVC42         3  0       TEXT('CODICE  VOCE 42')
005500030115     A            CEVC43         3  0       TEXT('CODICE  VOCE 43')
005600030115     A            CEVC44         3  0       TEXT('CODICE  VOCE 44')
005700030115     A            CEVC45         3  0       TEXT('CODICE  VOCE 45')
005800030115     A            CEVC46         3  0       TEXT('CODICE  VOCE 46')
005900030115     A            CEVC47         3  0       TEXT('CODICE  VOCE 47')
006000030115     A            CEVC48         3  0       TEXT('CODICE  VOCE 48')
006100030115     A            CEVC49         3  0       TEXT('CODICE  VOCE 49')
006200030115     A            CEVC50         3  0       TEXT('CODICE  VOCE 50')
006300030115     C* IMPORTO
006400030114     A            CEVI01         7  3       TEXT('IMPORTO VOCE 01')
006500030114     A            CEVI02         7  3       TEXT('IMPORTO VOCE 02')
006600030114     A            CEVI03         7  3       TEXT('IMPORTO VOCE 03')
006700030114     A            CEVI04         7  3       TEXT('IMPORTO VOCE 04')
006800030114     A            CEVI05         7  3       TEXT('IMPORTO VOCE 05')
006900030114     A            CEVI06         7  3       TEXT('IMPORTO VOCE 06')
007000030114     A            CEVI07         7  3       TEXT('IMPORTO VOCE 07')
007100030114     A            CEVI08         7  3       TEXT('IMPORTO VOCE 08')
007200030114     A            CEVI09         7  3       TEXT('IMPORTO VOCE 09')
007300030114     A            CEVI10         7  3       TEXT('IMPORTO VOCE 10')
007400030114     A            CEVI11         7  3       TEXT('IMPORTO VOCE 11')
007500030114     A            CEVI12         7  3       TEXT('IMPORTO VOCE 12')
007600030114     A            CEVI13         7  3       TEXT('IMPORTO VOCE 13')
007700030114     A            CEVI14         7  3       TEXT('IMPORTO VOCE 14')
007800030114     A            CEVI15         7  3       TEXT('IMPORTO VOCE 15')
007900030114     A            CEVI16         7  3       TEXT('IMPORTO VOCE 16')
008000030114     A            CEVI17         7  3       TEXT('IMPORTO VOCE 17')
008100030114     A            CEVI18         7  3       TEXT('IMPORTO VOCE 18')
008200030114     A            CEVI19         7  3       TEXT('IMPORTO VOCE 19')
008300030114     A            CEVI20         7  3       TEXT('IMPORTO VOCE 20')
008400030114     A            CEVI21         7  3       TEXT('IMPORTO VOCE 21')
008500030114     A            CEVI22         7  3       TEXT('IMPORTO VOCE 22')
008600030114     A            CEVI23         7  3       TEXT('IMPORTO VOCE 23')
008700030114     A            CEVI24         7  3       TEXT('IMPORTO VOCE 24')
008800030114     A            CEVI25         7  3       TEXT('IMPORTO VOCE 25')
008900030114     A            CEVI26         7  3       TEXT('IMPORTO VOCE 26')
009000030114     A            CEVI27         7  3       TEXT('IMPORTO VOCE 27')
009100030114     A            CEVI28         7  3       TEXT('IMPORTO VOCE 28')
009200030114     A            CEVI29         7  3       TEXT('IMPORTO VOCE 29')
009300030114     A            CEVI30         7  3       TEXT('IMPORTO VOCE 30')
009400030114     A            CEVI31         7  3       TEXT('IMPORTO VOCE 31')
009500030114     A            CEVI32         7  3       TEXT('IMPORTO VOCE 32')
009600030114     A            CEVI33         7  3       TEXT('IMPORTO VOCE 33')
009700030114     A            CEVI34         7  3       TEXT('IMPORTO VOCE 34')
009800030114     A            CEVI35         7  3       TEXT('IMPORTO VOCE 35')
009900030114     A            CEVI36         7  3       TEXT('IMPORTO VOCE 36')
010000030114     A            CEVI37         7  3       TEXT('IMPORTO VOCE 37')
010100030114     A            CEVI38         7  3       TEXT('IMPORTO VOCE 38')
010200030114     A            CEVI39         7  3       TEXT('IMPORTO VOCE 39')
010300030114     A            CEVI40         7  3       TEXT('IMPORTO VOCE 40')
010400030114     A            CEVI41         7  3       TEXT('IMPORTO VOCE 41')
010500030114     A            CEVI42         7  3       TEXT('IMPORTO VOCE 42')
010600030114     A            CEVI43         7  3       TEXT('IMPORTO VOCE 43')
010700030114     A            CEVI44         7  3       TEXT('IMPORTO VOCE 44')
010800030114     A            CEVI45         7  3       TEXT('IMPORTO VOCE 45')
010900030114     A            CEVI46         7  3       TEXT('IMPORTO VOCE 46')
011000030114     A            CEVI47         7  3       TEXT('IMPORTO VOCE 47')
011100030114     A            CEVI48         7  3       TEXT('IMPORTO VOCE 48')
011200030114     A            CEVI49         7  3       TEXT('IMPORTO VOCE 49')
011300030114     A            CEVI50         7  3       TEXT('IMPORTO VOCE 50')
