000100000000     A*------------------------------------------------------------------------*
000200000000     A* ECECT00F - TESTATA COMPETENZE DI CONTO ECONOMICO                       *
000300000000     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500000000     A          R ECECT                     TEXT('C/ECON - COMPETENZE TESTATA')
000600000000     A            ECTCMP    R               REFFLD($CMP)
000700000000     A            ECTDDC    R               REFFLD($DA8)
000800000000     A                                      TEXT('DATA DECORRENZA COMPETENZA')
000900000000     A            ECTDSC    R               REFFLD($DA8)
001000000000     A                                      TEXT('DATA SCADENZA COMPETENZA')
001100000000     A            ECTCMD    R               REFFLD($DES30)
001200000000     A                                      TEXT('DESCRIZIONE COMPETENZA')
001300000000     A            ECTFCR    R               REFFLD($FLAG)
001400000000     A                                      TEXT('FLAG C=COMPETENZA,R=RICAVO')
001500000000     A            ECTMCE    R               REFFLD($FLAG)
001600940719     A                                      TEXT('AGGIORNAMENTO C/E (S/N)')
001700980310     A            ECTRIC    R               REFFLD($RIC)
001800020130     A            ECTFDR    R               REFFLD($FLA)
001900020130     A                                      TEXT('FLAG DATA RIFERIMENTO 0-DSP, -
002000020130     A                                      1=DCM')
002100020130     A                                      COLHDG('0=DSP, 1=DCM')
002200000000     A            ECTNBC    R               REFFLD($NBC)
002300000000     A            ECTFTR    R               REFFLD($FTR)
002400000000     A            ECTDTR    R               REFFLD($DA8)
002500000000     A                                      TEXT('DATA TRASMISSIONE')
002600000000     A                                      COLHDG('DATA' 'TRASM.')
002700000000     A            ECTATB    R               REFFLD($FLAG)
