000100980305     A*------------------------------------------------------------------------*
000200980305     A* FATTURAZIONE INFRAGRUPPO - MCUBI                                       *
000300980305     A*------------------------------------------------------------------------*
000400980305     A                                      REF(CNDIZION)
000500980305     A          R ECFIM000                  TEXT('FATT.INFRAGRUPPO-MC')
000600980305     A            FIMAAS    R               REFFLD($AA4)
000700980305     A            FIMLNP    R               REFFLD($LNP)
000800980305     A            FIMNRS    R               REFFLD($NRS)
000900980305     A            FIMNSP    R               REFFLD($NSP)
001000980305     A            FIMTBL    R               REFFLD($TBL)
001100980310     A            FIMTFP    R               REFFLD($TFP)
001200980310     A            FIMTFA    R               REFFLD($TFA)
001300980305     A            FIMDDO    R               REFFLD($DA8)
001400980305     A                                      TEXT('DATA DOCUMENTO')
001500980310     A                                      COLHDG('DATA DOC')
001600980312     A            FIMSMC    R               REFFLD($VLF)
001700980312     A                                      TEXT('SALDO MCUBI (+/-)')
001800980305     A                                      COLHDG('MCUBI')
001900990324     A            FIMMES    R               REFFLD($MMM)
