000100000000     A*------------------------------------------------------------------------*
000200100518     A* DETTAGLIO VOCI FILIALE IMPORTO                                         *
000300000000     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500100518     A          R ESVOC010                  TEXT('C/E - DETT. VOCI -TARIFFE-')
000600100518     A            V10VOC    R               REFFLD($VOC)
000602100518     A            V10DAT    R               REFFLD($DA8)
000603091007     A                                      TEXT('DATA')
000604091007     A                                      COLHDG('DATA')
001100100518     A            V10FIL    R               REFFLD($FIL)
001200000000     A                                      TEXT('FIL.PART/TERM.PART/TRANS')
001300091007     A                                      COLHDG('COD.' 'FIL.')
005000100518     A            V10IMP        13  5       TEXT('IMPORTO VOCE')
