000100940422     A*------------------------------------------------------*
000200940422     A*- VISTA LOGICA X DATA/NUMERO DOC. NOTA CREDITO       -*
000300940422     A*------------------------------------------------------*
000400940511     A                                      UNIQUE
000500940422     A          R FTNCT000                  PFILE(FTNCT00F)
000600940502     A*
000700940422     A          K NCTDRG
000800940422     A          K NCTNRG
