000100940422     A*------------------------------------------------------*
000200940427     A*- VISTA LOGICA X DATA/NUM. DOC./RIGA NOTA CREDITO    -*
000300940422     A*------------------------------------------------------*
000400940511     A                                      UNIQUE
000500940427     A          R FTNCD000                  PFILE(FTNCD00F)
000600940426     A*
000700940427     A          K NCDDRG
000800940427     A          K NCDNRG
000900940427     A          K NCDNRN
