000100000000     A*----------------------------------------------------------------
000200890918     A*  L.F. ANAGR.AUTOMEZZI -PNEUMATICI- X  NUMERO RIFERIMENTO      *
000300000000     A*----------------------------------------------------------------
000400890918     A                                      FIFO
000500000000     A          R GAAMP000                  PFILE(GAAMP00F)
000600000000      *
000700000000     A          K AMPNRF
000800890918     A*  AMPNRF  - NUMERO RIFERIMENTO
