000100970826     A*------------------------------------------------------------------------*
000200970826     A* SALDI PC - STATISTICA AFFIDABILITA' PARTENZA
000300970826     A*------------------------------------------------------------------------*
000400970826     A                                      REF(CNDIZION)
000500970901     A          R PCDLP000                  TEXT('STAT.AFFIDABILITA'' PARTENZA')
000600970826     A            PCPANN    R     S         REFFLD($AAA)
000700970826     A            PCPMES    R     S         REFFLD($MMM)
000800100125     A            PCPDIV         1          TEXT('DIREZIONE COMMERCIALE')
000900970826     A                                      COLHDG('DIV')
001000970826     A            PCPARE         3S 0       TEXT('AREA')
001100970826     A                                      COLHDG('AREA')
001200091222     A            PCPTFP    R     S         REFFLD($FIL)
001300091222     A                                      TEXT('TERMINAL PARTENZA')
001400091222     A                                      COLHDG('TER' 'PART')
001500091222     A            PCPFLP    R     S         REFFLD($FIL)
001600091222     A                                      TEXT('FILIALE PARTENZA')
001700091222     A                                      COLHDG('FIL' 'PAR')
001800970826     A            PCPIOE         1          TEXT('DATI IN STATISTICA')
001900970826     A                                      COLHDG('DATI' 'STAT')
002000970826     A            PCPTSP    R               REFFLD($TSP)
002100970826     A            PCPNSP         7S 0       TEXT('NUMERO SPEDIZIONI TOTALI')
002200970826     A                                      COLHDG('SPED' 'TOTALI')
002300970826     A            PCPNSD         7S 0       TEXT('NUMERO SPEDIZIONI IN ORARIO')
002400970826     A                                      COLHDG('SPED IN' 'ORARIO')
