000100000000     A*------------------------------------------------------------------------*
000200000000     A* FILE SALDI MOVIMENTO IN ARRIVO PER PC  - STATISTICA MOVIMENTO ARRIVO - *
000300000000     A*------------------------------------------------------------------------*
000400000000     A          R SIPCA000                  TEXT('SALDI MOVIMENTO ARRIVO')
000500000000     A            PCAIOE         1          TEXT('DATI IN STATISTICA (I/M/X/ )')
000600000000     A                                      COLHDG('DATI' 'IN' 'STAT')
000700000000     A            PCAFLA         3S 0       TEXT('FILIALE ARRIVO')
000800000000     A                                      COLHDG('FIL.' 'ARR.')
000900000000     A            PCAFPE         2          TEXT('FASCIA DI PESO')
001000000000     A                                      COLHDG('FASCIA')
001100020325     A            PCANTP         3          TEXT('NETWORK PARTENZA')
001200000000     A                                      COLHDG('NW PAR')
001300020325     A            PCANTA         3          TEXT('NETWORK ARRIVO')
001400000000     A                                      COLHDG('NW ARR')
001500000000     A*------------------------------------------------------------------------*
001600001115     A            PCANS1         7S 0       TEXT('N.SPED. 1° MESE ')
001700000000     A                                      COLHDG('SPED' '1° MM.')
001800001115     A            PCANS2         7S 0       TEXT('N.SPED. 2° MESE ')
001900000000     A                                      COLHDG('SPED' '2° MM.')
002000001115     A            PCANS3         7S 0       TEXT('N.SPED. 3° MESE ')
002100000000     A                                      COLHDG('SPED' '3° MM.')
002200001115     A            PCANS4         7S 0       TEXT('N.SPED. 4° MESE ')
002300000000     A                                      COLHDG('SPED' '4° MM.')
002400001115     A            PCANS5         7S 0       TEXT('N.SPED. 5° MESE ')
002500000000     A                                      COLHDG('SPED' '5° MM.')
002600001115     A            PCANS6         7S 0       TEXT('N.SPED. 6° MESE ')
002700000000     A                                      COLHDG('SPED' '6° MM.')
002800001115     A            PCANS7         7S 0       TEXT('N.SPED. 7° MESE ')
002900000000     A                                      COLHDG('SPED' '7° MM.')
003000001115     A            PCANS8         7S 0       TEXT('N.SPED. 8° MESE ')
003100000000     A                                      COLHDG('SPED' '8° MM.')
003200001115     A            PCANS9         7S 0       TEXT('N.SPED. 9° MESE ')
003300000000     A                                      COLHDG('SPED' '9° MM.')
003400001115     A            PCANS0         7S 0       TEXT('N.SPED. 10°MESE ')
003500000000     A                                      COLHDG('SPED' '10°MM.')
003600001115     A            PCANSA         7S 0       TEXT('N.SPED. 11°MESE ')
003700000000     A                                      COLHDG('SPED' '11°MM.')
003800001115     A            PCANSB         7S 0       TEXT('N.SPED. 12°MESE ')
003900000000     A                                      COLHDG('SPED' '12°MM.')
004000000000     A*------------------------------------------------------------------------*
004100010227     A            PCAPQ1         8S 2       TEXT('QUINTALI 1° MESE')
004200000000     A                                      COLHDG('PESO' '1° MM')
004300010227     A            PCAPQ2         8S 2       TEXT('QUINTALI 2° MESE')
004400000000     A                                      COLHDG('PESO' '2° MM')
004500010227     A            PCAPQ3         8S 2       TEXT('QUINTALI 3° MESE')
004600000000     A                                      COLHDG('PESO' '3° MM')
004700010227     A            PCAPQ4         8S 2       TEXT('QUINTALI 4° MESE')
004800000000     A                                      COLHDG('PESO' '4° MM')
004900010227     A            PCAPQ5         8S 2       TEXT('QUINTALI 5° MESE')
005000000000     A                                      COLHDG('PESO' '5° MM')
005100010227     A            PCAPQ6         8S 2       TEXT('QUINTALI 6° MESE')
005200000000     A                                      COLHDG('PESO' '6° MM')
005300010227     A            PCAPQ7         8S 2       TEXT('QUINTALI 7° MESE')
005400000000     A                                      COLHDG('PESO' '7° MM')
005500010227     A            PCAPQ8         8S 2       TEXT('QUINTALI 8° MESE')
005600000000     A                                      COLHDG('PESO' '8° MM')
005700010227     A            PCAPQ9         8S 2       TEXT('QUINTALI 9° MESE')
005800000000     A                                      COLHDG('PESO' '9° MM')
005900010227     A            PCAPQ0         8S 2       TEXT('QUINTALI 10°MESE')
006000000000     A                                      COLHDG('PESO' '10°MM')
006100010227     A            PCAPQA         8S 2       TEXT('QUINTALI 11°MESE')
006200000000     A                                      COLHDG('PESO' '11°MM')
006300010227     A            PCAPQB         8S 2       TEXT('QUINTALI 12°MESE')
006400000000     A                                      COLHDG('PESO' '12°MM')
006500000000     A*------------------------------------------------------------------------*
006600000000     A            PCANC1         7S 0       TEXT('N.COLLI 1° MESE')
006700000000     A                                      COLHDG('COLLI' '1° MM')
006800000000     A            PCANC2         7S 0       TEXT('N.COLLI 2° MESE')
006900000000     A                                      COLHDG('COLLI' '2° MM')
007000000000     A            PCANC3         7S 0       TEXT('N.COLLI 3° MESE')
007100000000     A                                      COLHDG('COLLI' '3° MM')
007200000000     A            PCANC4         7S 0       TEXT('N.COLLI 4° MESE')
007300000000     A                                      COLHDG('COLLI' '4° MM')
007400000000     A            PCANC5         7S 0       TEXT('N.COLLI 5° MESE')
007500000000     A                                      COLHDG('COLLI' '5° MM')
007600000000     A            PCANC6         7S 0       TEXT('N.COLLI 6° MESE')
007700000000     A                                      COLHDG('COLLI' '6° MM')
007800000000     A            PCANC7         7S 0       TEXT('N.COLLI 7° MESE')
007900000000     A                                      COLHDG('COLLI' '7° MM')
008000000000     A            PCANC8         7S 0       TEXT('N.COLLI 8° MESE')
008100000000     A                                      COLHDG('COLLI' '8° MM')
008200000000     A            PCANC9         7S 0       TEXT('N.COLLI 9° MESE')
008300000000     A                                      COLHDG('COLLI' '9° MM')
008400000000     A            PCANC0         7S 0       TEXT('N.COLLI 10°MESE')
008500000000     A                                      COLHDG('COLLI' '10°MM')
008600000000     A            PCANCA         7S 0       TEXT('N.COLLI 11°MESE')
008700000000     A                                      COLHDG('COLLI' '11°MM')
008800000000     A            PCANCB         7S 0       TEXT('N.COLLI 12°MESE')
008900000000     A                                      COLHDG('COLLI' '12°MM')
009000000000     A*------------------------------------------------------------------------*
009100010227     A            PCAVO1         9S 3       TEXT('VOLUME 1° MESE')
009200000000     A                                      COLHDG('VOL.' '1° MM')
009300010227     A            PCAVO2         9S 3       TEXT('VOLUME 2° MESE')
009400000000     A                                      COLHDG('VOL.' '2° MM')
009500010227     A            PCAVO3         9S 3       TEXT('VOLUME 3° MESE')
009600000000     A                                      COLHDG('VOL.' '3° MM')
009700010227     A            PCAVO4         9S 3       TEXT('VOLUME 4° MESE')
009800000000     A                                      COLHDG('VOL.' '4° MM')
009900010227     A            PCAVO5         9S 3       TEXT('VOLUME 5° MESE')
010000000000     A                                      COLHDG('VOL.' '5° MM')
010100010227     A            PCAVO6         9S 3       TEXT('VOLUME 6° MESE')
010200000000     A                                      COLHDG('VOL.' '6° MM')
010300010227     A            PCAVO7         9S 3       TEXT('VOLUME 7° MESE')
010400000000     A                                      COLHDG('VOL.' '7° MM')
010500010227     A            PCAVO8         9S 3       TEXT('VOLUME 8° MESE')
010600000000     A                                      COLHDG('VOL.' '8° MM')
010700010227     A            PCAVO9         9S 3       TEXT('VOLUME 9° MESE')
010800000000     A                                      COLHDG('VOL.' '9° MM')
010900010227     A            PCAVO0         9S 3       TEXT('VOLUME 10°MESE')
011000000000     A                                      COLHDG('VOL.' '10°MM')
011100010227     A            PCAVOA         9S 3       TEXT('VOLUME 11°MESE')
011200000000     A                                      COLHDG('VOL.' '11°MM')
011300010227     A            PCAVOB         9S 3       TEXT('VOLUME 12°MESE')
011400000000     A                                      COLHDG('VOL.' '12°MM')
011500000000     A*------------------------------------------------------------------------*
