000100941206     A*------------------------------------------------------------------------*
000200991018     A* FILE DI LAVORO PER STAMPA STATISTICA PESI AUTOMATICI/VDL               *
000300941206     A*------------------------------------------------------------------------*
000400890911     A                                      REF(CNDIZION)
000500050105     A          R SIPES000                  TEXT('WF STAT.PESI')
000600050105     A            PESANN    R               REFFLD($AAA)
000700050105     A            PESMES    R               REFFLD($MMM)
000800050105     A            PESKSC    R               REFFLD($CSC)
000900050105     A            PESCTR    R               REFFLD($CTR)
001000050105     A            PESPSC         9  1       TEXT('PESO VDL')
001100991025     A                                      COLHDG('PESO VDL')
001200050105     A            PESNCV         7  0       TEXT('N.COLLI VDL')
001300991025     A                                      COLHDG('N.COLLI VDL')
001400050105     A            PESPSB         9  1       TEXT('PESO BOLL. "DI VDL"')
001500991105     A                                      COLHDG('PESO BOLL.')
001600050105     A            PESNCL         7  0       TEXT('NUMERO COLLI BOLL. "DI VDL"')
001700991025     A                                      COLHDG('N.COLLI BOLL.')
001800050105     A            PESNSP         7  0       TEXT('NUM.SPEDIZIONI "DI VDL"')
001900930625     A                                      COLHDG('N.SPED.')
002000050105     A            PESTCL         7  0       TEXT('TOT. COLL. BOLL.')
002100991025     A                                      COLHDG('TOT.COLLI BOLL.')
002200050105     A            PESTPB         9  1       TEXT('TOT. PESO  BOLL.     ')
002300991025     A                                      COLHDG('TOT.PESO BOLL.')
002400050105     A            PESTNS         7  0       TEXT('TOT. NUM. SPED.')
002500991025     A                                      COLHDG('TOT.NUM. SPED.')
