000100941206     A*------------------------------------------------------------------------*
000200991117     A* FILE DI LAVORO PER STAMPA STATISTICA LOG DI SERVIZI STRATEGI           *
000300941206     A*------------------------------------------------------------------------*
000400991117     A                                      REF(CNDIZION)
000500050706     A          R SISTL000                  TEXT('WF STAT.STRATELOG')
000600050706     A            STLDIV         1          TEXT('DIVISIONE')
000700930615     A                                      COLHDG('DIV.')
000800050706     A            STLARE         3  0       TEXT('AREA')
000900930615     A                                      COLHDG('AREA')
001000050706     A            STLFIL    R               REFFLD($FIL)
001100930625     A                                      TEXT('FILIALE')
001200050706     A            STLKSC    R               REFFLD($CSC)
001300050706     A            STLDAT         8  0       TEXT('DATA')
001400991117     A                                      COLHDG('DATA')
001500050706     A            STLRAG        40          TEXT('RAGIONE SOCIALE')
001600991105     A                                      COLHDG('RAG. SOC.')
001700050706     A            STLDRC         5  0       TEXT('DWNLOAD RICHIESTE')
001800991117     A                                      COLHDG('DWNL RICH.')
001900050706     A            STLDFS         5  0       TEXT('DWNLOAD FILE SCAR')
002000991117     A                                      COLHDG('DWNL FILE SCAR.')
002100050706     A            STLDTN         5  0       TEXT('DWNLOAD TENTATIVI')
002200991117     A                                      COLHDG('DWNL TENTATIVI')
002300050706     A            STLURC         5  0       TEXT('UPLOAD RICHIESTE')
002400991117     A                                      COLHDG('UPL RICH.')
002500050706     A            STLUFS         5  0       TEXT('UPLOAD FILE INV.')
002600010917     A                                      COLHDG('UPL FILE INV.')
002700050706     A            STLUTN         5  0       TEXT('UPLOAD TENTATIVI')
002800991117     A                                      COLHDG('UPL TENTATIVI')
002900050706     A            STLTTT         5  0       TEXT('T&T TOTALI')
003000991117     A                                      COLHDG('T&T TOT.')
003100050706     A            STLTDB         5  0       TEXT('T&T OPER. DB')
003200991117     A                                      COLHDG('T&T OPER. DB.')
003300050706     A            STLDBL         5  0       TEXT('T&T DB LINK')
003400041214     A                                      COLHDG('T&T DB LINK')
003500050706     A            STLTT2         5  0       TEXT('T&T RINTRACCIA GIAC.')
003600041207     A                                      COLHDG('T&T FIND GIAC.')
003700050706     A            STLTT3         5  0       TEXT('T&T RINTRACCIA ORM')
003800041207     A                                      COLHDG('T&T FIND ORM')
003900050706     A            STLORM         5  0       TEXT('DATA ENTRY - ORM')
004000010917     A                                      COLHDG('DATA ENTRY - ORM')
004100050706     A            STLVAG         5  0       TEXT('DATA ENTRY - VAG')
004200010917     A                                      COLHDG('DATA ENTRY - VAG')
004300050706     A            STLGML         5  0       TEXT('DISP. GIAC. - LINK')
004400041207     A                                      COLHDG('DISP. GIAC. - LINK')
004500050706     A            STLPOD         5  0       TEXT('P.O.D. IMAGE')
004600041207     A                                      COLHDG('P.O.D. IMAGE')
004700050706     A            STLCDL         5  0       TEXT('CLIENTI DL')
004800011220     A                                      COLHDG('CLIENTI DL')
004900050706     A            STLCUL         5  0       TEXT('CLIENTI UL')
005000011220     A                                      COLHDG('CLIENTI UL')
005100050706     A            STLCDB         5  0       TEXT('CLIENTI DB')
005200011220     A                                      COLHDG('CLIENTI DB')
005300050706     A            STLCT2         5  0       TEXT('CLIENTI T2')
005400041214     A                                      COLHDG('CLIENTI T2')
005500050706     A            STLCT3         5  0       TEXT('CLIENTI T3')
005600041214     A                                      COLHDG('CLIENTI T3')
005700050706     A            STLCOR         5  0       TEXT('CLIENTI ORM INT.')
005800041214     A                                      COLHDG('CLIENTI ORM INT.')
005900050706     A            STLCVG         5  0       TEXT('CLIENTI VAG INT.')
006000041214     A                                      COLHDG('CLIENTI VAG INT.')
006100050706     A            STLCGL         5  0       TEXT('CLIENTI VAG LINK')
006200041214     A                                      COLHDG('CLIENTI VAG LINK')
006300050706     A            STLCPO         5  0       TEXT('CLIENTI POD IMG.')
006400041214     A                                      COLHDG('CLIENTI POD IMG.')
