000100941206     A*------------------------------------------------------------------------*
000200050105     A* FILE DI SALDI             STATISTICA VOLUMI AUTOMATICI/CML             *
000300941206     A*------------------------------------------------------------------------*
000400890911     A                                      REF(CNDIZION)
000500050105     A          R SIVOL000                  TEXT('WF STAT.VOLUMI')
000600050105     A            VLMANN    R               REFFLD($AAA)
000700050105     A            VLMMES    R               REFFLD($MMM)
000800050105     A            VLMKSC    R               REFFLD($CSC)
000900050105     A            VLMCTR    R               REFFLD($CTR)
001000050105     A            VLMFVB    R               REFFLD($FVB)
001100991105     A                                      TEXT('FLAG VOL REALE O NON REALE')
001200950628     A                                      COLHDG('REALE' 'NO REALE')
001300050105     A            VLMVLB         8  3       TEXT('VOL BOLLETTATO')
001400991028     A                                      COLHDG('VOL. BOLL.')
001500050105     A            VLMVLC         8  3       TEXT('VOLUME MACCH.SMISTACOLLI')
001600991105     A                                      COLHDG('VOL. CML.')
001700050105     A            VLMNCL         7  0       TEXT('NUMERO COLLI')
001800930625     A                                      COLHDG('N.COLLI')
001900050105     A            VLMPKB         9  1       TEXT('PESO BOLL. IN KG')
002000930625     A                                      COLHDG('PESO')
002100050105     A            VLMNSP         7  0       TEXT('NUMERO SPEDIZIONI')
002200930625     A                                      COLHDG('N.SPED.')
002300050105     A            VLMNCR         7  0       TEXT('NUMERO COLLI CML')
002400991029     A                                      COLHDG('N.COLLI CML')
002500050105     A            VLMTCL         7  0       TEXT('TOT COLLI BOLL.')
002600991029     A                                      COLHDG('TOT COLLI BOLL.')
