000100000000     A*---------------------------------------------------------------*
000200000000     A*  ARCHIVIO RICEZIONE FILE SALDI CLIENTE AFFIDABILITA'
000300000000     A*  MBR=*NONE  -  MAXMBRS=*NOMAX
000400000000     A*---------------------------------------------------------------*
000500000000     A                                      REF(SLSDA00F)
000600000000     A          R SLSDA                     TEXT('SALDI CLIENTE-AFFIDABILITA')
000700000000     A            SDAANN    R
000800000000     A            SDAMES    R
000900000000     A            SDAKSC    R
001000000000     A            SDATSP    R
001100000000     A            SDADLV    R
001200000000     A            SDANSP    R
