000100010115     A          R SPOOL000
000200010116     A*
000300010116     A            JOBNAME       10
000400010116     A            USRNAME       10
000500010116     A            JOBNUM         6  0
000600010116     A            SPLFNAME      10
000700010116     A            SPLFNUM        4  0
000800010116     A            USERDTA       10
000900010124     A            TOTPAGES       9  0
001000010117     A            SPLFSTAT      10
001100010116     A            FORMTYP       10
001200010117     A            SPLFDAT        7
001300010117     A            SPLFORA        6
