000100000000     A*------------------------------------------------------------------------*
000200000000     A* TARIFFE DA CONTO ECONOMICO - WORKFILE PER COMPETENZE
000300000000     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500010924     A          R TEETWC00                  TEXT('TARIFFE DA C/E-WF COMPETENZE')
000600980504     A            EWCUSR        10          TEXT('NOME UTENTE')
000700980504     A                                      COLHDG('NOME' 'UTE')
000800980504     A            EWCDSF    R               REFFLD($FLA)
000900980504     A                                      TEXT('DATI SEDE/FILIALE')
001000980504     A                                      COLHDG('S/F')
001100000000     A            EWCCTO    R               REFFLD($FLA)
001200000000     A                                      TEXT('CODICE TARIFFA/OFFERTA')
001300000000     A                                      COLHDG('T/O')
001400000000     A            EWCKSC    R               REFFLD($CSC)
001500000000     A                                      TEXT('CLIENTE')
001600000000     A                                      COLHDG('KSC')
001700000000     A            EWCCTR    R               REFFLD($CTR)
001800000000     A                                      TEXT('TARIFFA')
001900000000     A                                      COLHDG('CTR')
002000000000     A            EWCPRG    R               REFFLD($PRG)
002100000000     A                                      TEXT('PROGRESSIVO')
002200000000     A                                      COLHDG('PRG')
002300000000     A            EWCCTS    R               REFFLD($CTS)
002400000000     A            EWCSGL    R               REFFLD($SGL)
002500000000     A                                      TEXT('SCAGLIONE SUPERIORE')
002600000000     A            EWCVOC         3  0       TEXT('CODICE VOCE C.E.')
002700000000     A                                      COLHDG('COD' 'VOCE')
002800000000     A            EWCRDL         3  0       TEXT('RAGGR. DELTA')
002900000000     A                                      COLHDG('RAGGR' 'DELTA')
003000010924     A            EWCIMP        15  5       TEXT('IMPORTO VOCE')
003100010924     A                                      COLHDG('IMP' 'VOCE')
