000100991027      *PARMS MBR(*NONE) MAXMBRS(*NOMAX)
000200910516     A                                      REF(CNDIZION)
000300030409     A          R TELE2X05                  TEXT('TELE2 - RIMBORSO +
000400030409     A                                      CONTRASSEGNI')
000500030409     A            T25XDTA     1024A         TEXT('CAMPO DATI FLAT')
