000100991027      *PARMS MBR(*NONE) MAXMBRS(*NOMAX)
000200910516     A                                      REF(CNDIZION)
000300030409     A          R TELE2X03                  TEXT('DATI CONSEGNE TELE2 +
000400030409     A                                      - ALTRI MOTIVI')
000500030409     A            T23XDTA     1024A         TEXT('CAMPO DATI FLAT')
