000100000000     A*--------------------------------------------------------------*
000200050927     A* L.F. ANAGRAFICO PARTICOLARITA' CLIENTI PROVVISORIO PER TARIFFE
000300000000     A*--------------------------------------------------------------*
000400050927     A                                      UNIQUE
000500050927     A          R CNCLP000                  PFILE(TFCLP00F)
000600050927     A          K CLPKUT
000700050927     A          K CLPKCC
000800050927     A          K CLPAGE
000900050927     A          K CLPKSC
