000100950911      *---------------------------------------------------------------*
000200170623      *  FILIALI DA NON PULIRE DALLA DATA
000300950911      *---------------------------------------------------------------*
000400170623     A          R WFNLVP5                   TEXT('X PULIZIA X FILIALE')
000500131203      **
000600170623     A            VP5FGS         3S 0       TEXT('DISTINTA NR')
000700120620     A                                      COLHDG('DISTINTA NR')
000800170623     A            VP5DPUL        8S 0       TEXT('DA PULIRE DOPO IL')
000900170623     A                                      COLHDG('DA PULIRE DOPO IL')
