000100001020     A          R TIABL000                  PFILE(TIABL00F)
000200001020     A          K ABLTIP
000300001020     A          K ABLUTE
000400001020     A          K ABLISV
