000100001020     A          R TIABL000                  PFILE(TIABL00F)
000200010918     A          K ABLSUN
000300090622     A          K ABLISV
000400001020     A          K ABLUTE
