000100001020     A                                      UNIQUE
000200001020     A          R TIABL000                  PFILE(TIABL00F)
000300001020     A          K ABLSUN
000400001020     A          K ABLISV
000500001020     A          K ABLTIP
