000100000000     A*--------------------------------------------------------------*
000200140127     A*  L.F. SU TARIFFA CARTELLO AC BASE
000300000000     A*--------------------------------------------------------------*
000400000000     A                                      UNIQUE
000500140127     A          R TIACB000                  PFILE(TIACB00F)
000600140127     A          K ACBCLV
000700140127     A          K ACBDTD                    DESCEND
