000100000913     A*------------------------------------------------------------------------*
000200060901     A* CONTROLLO ASSORBIMENTO X LNA
000300000913     A*------------------------------------------------------------------------*
000400060901     A          R TIALA000                  PFILE(TIALA00F)
000500060901     A          K ALANAZ
000600060901     A          K ALACAP
000700060901     A          K ALALOC
