000100000710     A                                      UNIQUE
000200000727     A          R TIANV000                  PFILE(TIANV00F)
000300000727     A          K ANVCLI
