000100090604      **************************************************************************
000200090624      * FILE ATTIVITA' ORDINATO PER POTENZIALE/CLIENTE/TRATTATIVA
000300090604      **************************************************************************
000400090604     A          R TIATC000                  PFILE(TIATC00F)
000500090624     A          K ATCCPO
000600090624     A          K ATCKSC
000700090624     A          K ATCNRV
000800090610     A          K ATCDCO
000900090610     A          K ATCHCO
