000100000000     A*--------------------------------------------------------------*
000200141009     A*           CLIENTI IN CAMPAGNE COMMERCIALI                    *
000300000000     A*--------------------------------------------------------------*
000400141009     A                                      REF(CNDIZION)
000500141009     A          R TICMC000                  TEXT('CLIENTE CAMPAGNE COMMERCIALI')
000600141009     A            CMCNCM    R               REFFLD($NCM)
000700141009     A                                      TEXT('NUMERO CAMPAGNA')
000800141024     A            CMCKSU    R               REFFLD($KSC)
000900141028     A                                      TEXT('COD.CLIENTE UNIFICANTE')
001000141028     A                                      COLHDG('COD' 'UNI')
001100141009     A            CMCKSC    R               REFFLD($KSC)
001200141028     A                                      TEXT('COD.CLIENTE')
001300141028     A                                      COLHDG('COD' 'KSC')
001400141009     A            CMCCPO    R               REFFLD($CPO)
001500141009     A            CMCPRU    R               REFFLD($PRU)
001600141009     A                                      TEXT('UTENTE INSERIMENTO')
001700141009     A                                      COLHDG('UTE' 'INS')
001800141009     A            CMCDIN    R               REFFLD($DA8)
001900141009     A                                      TEXT('DATA INSERIMENTO')
002000141009     A                                      COLHDG('DTA' 'INS')
002100141010     A            CMCUFE    R               REFFLD($ACM)
002200141010     A                                      TEXT('ULTIMA FASE ESEGUITA')
002300141010     A                                      COLHDG('ULTIMA' 'FASE' 'ESEGUITA')
002400141010     A            CMCCCH    R               REFFLD($CCH)
002500141010     A                                      TEXT('CAUSALE CHIUSURA/ESITO')
002600141010     A                                      COLHDG('CAUS' 'CHIUS')
002700141010     A            CMCDCH    R               REFFLD($DA8)
002800141010     A                                      TEXT('DATA CHIUSURA/ESITO')
002900141010     A                                      COLHDG('DTA' 'CHIUS')
003000141009     A            CMCFLO        15          TEXT('FLAG OPERATIVI')
