000100111013     A*--------------------------------------------------------------*
000200111013     A* FILE INFO COMMERCIALI POTENZIALI   X QL                      *
000300111013     A*--------------------------------------------------------------*
000400111013     A          R TICPIQ00                  PFILE(TICPIQ0F)
000500111013     A          K CPQNRV
