000100090604      **************************************************************************
000200120706      * STORICO ATTIVITÀ PER CODICE POTENZIALE
000300090604      **************************************************************************
000400120706     A          R TICRM000                  PFILE(TICRM00F)
000500120706     A          K CRMCPO
