000100991115      *---------------------------------------------------------------*
000200060411      *  BOLLE DPD: NUOVO PARCEL E DEPOT
000300991115      *---------------------------------------------------------------*
000400991115      *
000500060505     A          R TIDP1000                  TEXT('FILE IGATEAVIS DPD')
000600991115      *
000700060523     A            I1SDEPOT       4          TEXT('DEPOT: HUB DI PROVENIENZA')
000800060411     A                                      COLHDG('HUB PROVENIENZA')
000900060523     A            I1DATE         8S 0       TEXT('DATA')
001000060411     A                                      COLHDG('DATA')
001100060411     A                                      EDTWRD('    /  /  ')
001200060523     A            I1TIME         6S 0       TEXT('TIME')
001300060411     A                                      COLHDG('TIME')
001400060411     A                                      EDTWRD('  :  :  ')
001500060523     A            I1PARCEL      14A         TEXT('NEW PARCEL')
001600060411     A                                      COLHDG('NEW PARCEL')
001700060523     A            I1SERVICE      3S 0       TEXT('SERVICE CODE')
001800060411     A                                      COLHDG('SERVICE CODE')
001900060523     A            I1RDEPOT       4          TEXT('HUB DI DESTINO')
002000060411     A                                      COLHDG('HUB DESTINO')
002100060523     A            I1DNAME1      35          TEXT('NAME RAG.SOC. DESTINATARIO')
002200060411     A                                      COLHDG('PRIMA RAG.SOC.')
002300060523     A            I1DNAME2      35          TEXT('2° RAG.SOC. DESTINATARIO')
002400060411     A                                      COLHDG('SECONDA RAG.SOC.')
002500060523     A            I1DCONTACT    35          TEXT('NOME CONTATTO')
002600060411     A                                      COLHDG('NOME CONTATTO')
002700060523     A            I1DSTREET     35          TEXT('INDIRIZZO')
002800060411     A                                      COLHDG('INDIRIZZO')
002900060523     A            I1DCOUNTRY     3S 0       TEXT('A ISO COUNTRY CODE')
003000060411     A                                      COLHDG('A ISO COUNTRY CODE')
003100060411     A                                      EDTCDE(Z)
003200060523     A            I1DPOSTAL      9          TEXT('A CAP')
003300060411     A                                      COLHDG('A CAP')
003400060523     A            I1DCITY       35          TEXT('CITY - LOCALITA'' DESTINATARI-
003500060411     A                                      O')
003600060411     A                                      COLHDG('LOCALITA'' DEST.')
003700060523     A            I1DPROV       35          TEXT('PROVINCIA - PROVINCIA DESTINA-
003800060411     A                                      TARIO')
003900060411     A                                      COLHDG('PROVINCIA DEST.')
004000060523     A            I1TCOUNTRY     3S 0       TEXT('DA ISO COUNTRY CODE ')
004100060411     A                                      COLHDG('DA ISO COUNTRY CODE')
004200060411     A                                      EDTCDE(Z)
004300060523     A            I1TPOSTAL      9          TEXT('DA CAP')
004400060411     A                                      COLHDG('DA CAP')
004500060523     A            I1DPHONE      30          TEXT('TELEFONO DESTINTARIO')
004600060411     A                                      COLHDG('TELEFONO DEST.')
004700060523     A            I1DFAX        30          TEXT('FAX DESTINATARIO')
004800060411     A                                      COLHDG('FAX DEST.')
004900060523     A            I1DEMAIL      40          TEXT('IND E-MAIL DESTINATARIO')
005000060411     A                                      COLHDG('IND E-MAIL DEST.')
005100060523     A            I1COMPANY     20          TEXT('NOME PARTNER')
005200060411     A                                      COLHDG('NOME PARTNER')
005300060523     A            I1GEOID        3S 0       TEXT('037 CODE VALUE X CHAR%')
005400060411     A                                      COLHDG('037 CODE VALUE')
005500060411     A                                      EDTCDE(Z)
005600060523     A            I1REMARK      35          TEXT('LORRY ID - IDENTIFICATIVO CAM-
005700060411     A                                      ION')
005800060411     A                                      COLHDG('ID CAMION')
005900060523     A            I1MEMBER      10          TEXT('NOME DEL MEMBRO')
006000060411     A                                      COLHDG('NOME DEL MEMBRO')
