000100131213     A*--------------------------------------------------------------*
000200131213     A*                   DATA PREZZO BASE GASOLIO                   *
000300131213     A*--------------------------------------------------------------*
000400131213     A                                      REF(CNDIZION)
000500131213     A          R TIDPB000                  TEXT('DATA PREZZO BASE GASOLIO')
000600131213     A            DPBDTD    R               REFFLD($DA8)
000700131213     A                                      TEXT('DATA DECORRENZA')
000800131213     A                                      COLHDG('DATA' 'DECOR.')
000900131213     A            DPBDPB    R               REFFLD($DA8)
001000131213     A                                      TEXT('DATA PREZZO BASE GASOLIO')
001100131213     A                                      COLHDG('DATA' 'PREZZO' 'BASE')
001200140115     A            DPBPMA         5  3
001300140221     A                                      TEXT('% MINIMA DI APPLICAZIONE')
001400140115     A                                      COLHDG('MINIMO' ' IN % ')
001500140220     A            DPBVMA    R               REFFLD(PMGPMG     TIPMG00F)
001600140220     A                                      TEXT('VALORE MINIMO DI APPLICAZIONE-
001700140220     A                                      ')
001800140221     A                                      COLHDG('V.M.A.' 'EURO/LT')
001900140224     A            DPBSVM    R               REFFLD(PMGSCA     TIPMG00F)
002000140224     A                                      TEXT('SCAGLIONE DEL VALORE MINIMO A-
002100140224     A                                      PPLICAZ.')
002200140224     A                                      COLHDG('SCAGL.' 'V.M.A.')
002300131213     A            DPBUTE    R               REFFLD($PRU)
002400131213     A            DPBDTI    R               REFFLD($DA8)
002500131213     A                                      TEXT('DATA INSERIMENTO')
002600131213     A                                      COLHDG('DATA' 'INSER.')
