000100991129      *---------------------------------------------------------------*
000200000203      *  L.F. FILE SCAN DPD
000300991129      *---------------------------------------------------------------*
000400060613     A          R TIDPW41                   PFILE(TIDP410W)
000500060620     A          K W41LEN
000600031205     A          K W41DEP
000700060620     A          K W41TYP
000800031205     A          K W41DAT
000900031205     A          K W41TIM
