000100080314     A          R TIESV000                  TEXT('VAS - Easy Sped - Versioni')
000200080314     A            ESVEKSC        7S 0       TEXT('Codice cliente invio dati')
000300080314     A                                      COLHDG('Cod. cli. invio dati')
000400080314     A            ESVEDAT        8S 0       TEXT('Data inserimento dati')
000500080314     A                                      COLHDG('Data inserim. dati')
000600080314     A            ESVEVER       15A         TEXT('Versione Easy Sped')
000700080314     A                                      COLHDG('Versione Easy Sped')
000800080314     A            ESVCVER        5S 0       TEXT('Versione cappario')
000900080314     A                                      COLHDG('Versione cappario')
001000080314     A            ESVCDSC        8S 0       TEXT('Scadenza cappario')
001100080314     A                                      COLHDG('Scadenza cappario')
001200080314     A            ESVSNCD        7S 0       TEXT('Segnacollo DA')
001300080314     A                                      COLHDG('Segnacollo DA')
001400080314     A            ESVSNCA        7S 0       TEXT('Segnacollo A')
001500080314     A                                      COLHDG('Segnacollo A')
001600080314     A            ESVSNCC        7S 0       TEXT('Segnacollo corrente')
001700080314     A                                      COLHDG('Segnacollo corrente')
001800080710     A            ESVNRS         2A         TEXT('Numero serie')
001900080710     A                                      COLHDG('Numero serie')
002000090605     A            ESVOBJ        15A         TEXT('Oggetto email')
002100090604     A                                      COLHDG('Oggetto email')
002200090605     A            ESVCORPO      15A         TEXT('Corpo email')
002300090604     A                                      COLHDG('Corpo email')
002400090604     A            ESVTYPWEB      2A         TEXT('Tipo aggior. web')
002500090604     A                                      COLHDG('Tipo aggior. web')
002600090708     A            ESVCVERMAX     5S 0       TEXT('Versione cappario Max')
002700090708     A                                      COLHDG('Vers. cappario Max')
002800090708     A            ESVCDDEMAX     8S 0       TEXT('Decorrenza cappario Max')
002900090708     A                                      COLHDG('Decorr. cappario Max')
003000090708     A            ESVCDSCMAX     8S 0       TEXT('Scadenza cappario Max')
003100090708     A                                      COLHDG('Scad. cappario Max')
003200090604     A            ESVFLO       256A         VARLEN(10)
003300080314     A                                      TEXT('Flag operativi')
003400080314     A                                      COLHDG('Flag operativi')
