000100000000     A*--------------------------------------------------------------*
000200050214     A*  L.F. BOLLE IN GIACENZA
000300000000     A*--------------------------------------------------------------*
000400050214     A          R TIGCP000                  PFILE(TIGCP00F)
000500050214     A          K GCPLNP
000600050214     A          K GCPDMM
000700050214     A          K GCPSCM
000800050214     A          O GCPSEDE                   COMP(NE ' ')
000900940922     A          O GCPFRG                    CMP(NE 0)
