000100000000     A*--------------------------------------------------------------*
000200060329     A*  L.F.  RIEPILOGO INVIAO FATTURE PER CODICE BOLLETTAZIONE
000300000000     A*--------------------------------------------------------------*
000400060329
000500060329     A          R TIIFT000                  PFILE(TIIFT00F)
000600060329     A          K IFTCBO
