000100050301     A          R TILAC000                  PFILE(TILAC00F)
000200050318     A          K LACELA
000300050318     A          K LACCOP
000400050318     A          K LACXX1
