000100120601     A          R TIJDC000                  PFILE(TIJDC00F)
000200050301     A          K LACAAS
000300050301     A          K LACLNP
000400050301     A          K LACNRS
000500050301     A          K LACNSP
000600050301     A          K LACCOP
