000401180213      *--------------------------------------------------------------*
000402180213      *  L.F. SU TILAC00F - X data e flag elaborazione
000403180213      *--------------------------------------------------------------*
000404180213     A          R TILAC000                  PFILE(TILAC00F)
000405180213     A          K LACTIM
000406180213     A          K LACELA
