000001050705     A                                      UNIQUE
000100050705     A          R TILAD000                  PFILE(TILAD00F)
000200050705     A          K LADAAS
000300050705     A          K LADLNP
000400050705     A          K LADNRS
000500050705     A          K LADNSP
