000100130905     A          R TIMAP000                  TEXT('Mailing Automatico - PROCESSI-
000200130905     A                                        IN BALANCING')
000300130905     A            MAPIDP         1          TEXT('ID Processo')
000400130905     A                                      COLHDG('ID Processo')
000500130905     A            MAPCOUNT      15  0       TEXT('Contatore per IDP')
000600130905     A                                      COLHDG('Contatore per IDP')
