000100890907     A*---------------------------------------------------------------*
000200940427     A*  ARCHIVIO  VISITE/OFFERTE   - DETTAGLIO -                     *
000300890907     A*---------------------------------------------------------------*
000400990608     A          R TITPD000                  FORMAT(TITPD00F)
