000100000918      *--------------------------------------------------------------*
000200011015      *  FILE  -  O.R.M. DA CLIENTI VIA INTERNET
000300000918      *--------------------------------------------------------------*
000400000918     A                                      REF(CNDIZION)
000500011015     A          R TIORI000                  TEXT('O.R.M. DA CLIENTI VIA INTERNE-
000600011015                                            T')
000700011015      *
000800011016     A            ORIPRG         7P 0       TEXT('PROGRESSIVO')
000900011017                                            EDTCDE(Z)
001000011017     A            ORIDER    R               REFFLD($DA8)
001100011017     A                                      TEXT('DATA ELABORAZIONE RECORD')
001200011017     A            ORIOER    R               REFFLD($ORV)
001300011017     A                                      TEXT('ORA ELABORAZIONE RECORD')
001400011017     A            ORIIDC         8          TEXT('IDENTIFICATIVO CLIENTE')
001500011016     A            ORIPOE    R               REFFLD($FIL)
001600011016     A                                      TEXT('P.O. EMITTENTE EFFETTIVO')
001700011017                                            EDTCDE(Z)
001800011016     A            ORINSR    R               REFFLD($NRS)
001900011016     A                                      TEXT('SERIE EFFETTIVA')
002000011016     A            ORINOR    R               REFFLD($NRI)
002100011016     A                                      TEXT('N. ORM EFFETTIVO')
002200011017                                            EDTCDE(Z)
002300011016     A            ORINRV    R               REFFLD($NVI)
002400011016     A                                      TEXT('VIAGGIO EFFETTIVO')
002500011016     A            ORIFLO    R               REFFLD($FLV)
002600011015      *
002700011015      * REPLICA DI FNVAO00F
002800001115     A            VAOATB    R               REFFLD($ATB)
002900001115     A            VAOPOE    R               REFFLD($FIL)
003000001005     A                                      TEXT('PUNTO OPERATIVO EMITTENTE')
003100001005     A                                      COLHDG('P.O.' 'EMI.')
003200001005     A                                      EDTCDE(Z)
003300001115     A            VAONSR    R               REFFLD($NRS)
003400001115     A            VAONOR    R               REFFLD($NRI)
003500001115     A            VAONRV    R               REFFLD($NVI)
003600001115     A            VAOTOR    R               REFFLD($TIPO)
003700001115     A                                      TEXT('TIPO ORM')
003800001115     A                                      COLHDG('TIPO' 'ORM')
003900001129     A            VAOTCO    R               REFFLD($TIPO)
004000001129     A                                      TEXT('TIPO COMUNICAZIONE ORM')
004100001129     A                                      COLHDG('TIPO' 'COM' 'ORM')
004200001115     A            VAODAO    R               REFFLD($DA8)
004300001115     A                                      TEXT('DATA AP.ORM/CHIAMATA')
004400001115     A                                      COLHDG('DATA' 'AP.' 'ORM')
004500001115     A            VAOOAO    R               REFFLD($ORV)
004600001115     A                                      TEXT('ORA AP.ORM/CHIAMATA')
004700001115     A                                      COLHDG('ORA' 'AP.' 'ORM')
004800001115     A            VAOCOR    R               REFFLD($CRO)
004900001005     A                                      TEXT('CODICE ORDINANTE')
005000001005     A                                      COLHDG('CODICE' 'ORDINANTE')
005100001115     A            VAORSO    R               REFFLD($RSC)
005200001013     A                                      TEXT('RAGIONE SOC.ORDINANTE')
005300001013     A                                      COLHDG('RAG.' 'SOC.' 'ORDINANTE')
005400001115     A            VAOINO    R               REFFLD($IND)
005500001013     A                                      TEXT('INDIRIZZO ORDINANTE')
005600001013     A                                      COLHDG('IND.' 'ORDINANTE')
005700001115     A            VAOCAO    R               REFFLD($CAD)
005800001013     A                                      TEXT('CAP ORDINANTE')
005900001013     A                                      COLHDG('CAP' 'ORDINANTE')
006000001115     A            VAOLOO    R               REFFLD($LOC)
006100001013     A                                      TEXT('LOCALITA ORDINANTE')
006200001013     A                                      COLHDG('LOC.' 'ORDINANTE')
006300001115     A            VAOPRO    R               REFFLD($PRO)
006400001013     A                                      TEXT('PROVINCIA ORDINANTE')
006500001013     A                                      COLHDG('PROV.' 'ORDINANTE')
006600001115     A            VAONAO    R               REFFLD($NAR)
006700001013     A                                      TEXT('NAZIONE ORDINANTE')
006800001013     A                                      COLHDG('NAZ.' 'ORDINANTE')
006900001115     A            VAOCRA    R               REFFLD($CRO)
007000001005     A                                      TEXT('CODICE RITIRO')
007100001005     A                                      COLHDG('CODICE' 'RITIRO')
007200001115     A            VAORSR    R               REFFLD($RSC)
007300001013     A                                      TEXT('RAGIONE SOC.RITIRO')
007400001013     A                                      COLHDG('RAG.' 'SOC.' 'RITIRO')
007500001115     A            VAOINR    R               REFFLD($IND)
007600001013     A                                      TEXT('INDIRIZZO RITIRO')
007700001013     A                                      COLHDG('IND.' 'RITIRO')
007800001115     A            VAOCAR    R               REFFLD($CAD)
007900001013     A                                      TEXT('CAP RITIRO')
008000001013     A                                      COLHDG('CAP' 'RITIRO')
008100001115     A            VAOLOR    R               REFFLD($LOC)
008200001013     A                                      TEXT('LOCALITA RITIRO')
008300001013     A                                      COLHDG('LOC.' 'RITIRO')
008400001115     A            VAOPRR    R               REFFLD($PRO)
008500001013     A                                      TEXT('PROVINCIA RITIRO')
008600001013     A                                      COLHDG('PROV.' 'RITIRO')
008700001115     A            VAONAR    R               REFFLD($NAR)
008800001013     A                                      TEXT('NAZIONE RITIRO')
008900001013     A                                      COLHDG('NAZ.' 'RITIRO')
009000001115     A            VAORER    R               REFFLD($RSC)
009100001005     A                                      TEXT('REFERENTE RITIRO')
009200001005     A                                      COLHDG('REFERENTE ' 'RITIRO')
009300001115     A            VAOTER    R               REFFLD($TELE)
009400001005     A                                      TEXT('TELEFONO RITIRO')
009500001005     A                                      COLHDG('TELEFONO ' 'RITIRO')
009600001115     A            VAOCRC    R               REFFLD($CRO)
009700001005     A                                      TEXT('CODICE CONSEGNA')
009800001005     A                                      COLHDG('CODICE' 'CONSEGNA')
009900001115     A            VAORSC    R               REFFLD($RSC)
010000001005     A                                      TEXT('RAGIONE SOC.CONSEGNA')
010100001005     A                                      COLHDG('RAG.' 'SOC.' 'CONSEGNA')
010200001115     A            VAOINC    R               REFFLD($IND)
010300001005     A                                      TEXT('INDIRIZZO CONSEGNA')
010400001005     A                                      COLHDG('IND.' 'CONSEGNA')
010500001115     A            VAOCAC    R               REFFLD($CAD)
010600001005     A                                      TEXT('CAP CONSEGNA')
010700001005     A                                      COLHDG('CAP' 'CONSEGNA')
010800001115     A            VAOLOC    R               REFFLD($LOC)
010900001005     A                                      TEXT('LOCALITA CONSEGNA')
011000001005     A                                      COLHDG('LOC.' 'CONSEGNA')
011100001115     A            VAOPRC    R               REFFLD($PRO)
011200001005     A                                      TEXT('PROVINCIA CONSEGNA')
011300001005     A                                      COLHDG('PROV.' 'CONSEGNA')
011400001115     A            VAONAC    R               REFFLD($NAR)
011500001005     A                                      TEXT('NAZIONE CONSEGNA')
011600001005     A                                      COLHDG('NAZ.' 'CONSEGNA')
011700001115     A            VAOFFD    R               REFFLD($FLA)
011800001005     A                                      TEXT('S=FERMO DEPOSITO')
011900001005     A                                      COLHDG('F' 'F' 'D')
012000001115     A            VAODAR    R               REFFLD($DA8)
012100001013     A                                      TEXT('DATA RITIRO RICHIESTA')
012200001013     A                                      COLHDG('DATA' 'RIT.' 'RICH.')
012300001115     A            VAOORR    R               REFFLD($HM)
012400001005     A                                      TEXT('ORA RITIRO RICHIESTA')
012500001005     A                                      COLHDG('ORA' 'RIT.' 'RICH.')
012600001115     A            VAORMP    R               REFFLD($FLA)
012700001005     A                                      TEXT('FLAG RITIRO:M-MATTINO -
012800001005     A                                      P-POMERIGGIO')
012900001005     A                                      COLHDG('M/P' 'RITIRO' 'MERCE')
013000001115     A            VAONAM    R               REFFLD($NTM)
013100001115     A            VAONCL    R               REFFLD($NCL)
013200001115     A            VAOPKG    R               REFFLD($PKL)
013300001115     A            VAOVLM    R               REFFLD($VLU)
013400001115     A            VAOBNC    R               REFFLD($NBN)
013500001115     A            VAOBLC    R               REFFLD($NBI)
013600001115     A            VAOATT    R               REFFLD($NAU)
013700001115     A            VAOMTC    R               REFFLD($NMO)
013800001115     A            VAOPAG    R               REFFLD($FLA)
013900001005     A                                      TEXT('FLAG CHI PAGA:M=MITT.+
014000001005     A                                      D=DESTIN. O=ORDINANTE')
014100001005     A                                      COLHDG('PAG.' 'M/D/O')
014200001115     A            VAOKSC    R               REFFLD($KSC)
014300001005     A                                      TEXT('COD.CLIENTE PAGANTE')
014400001005     A                                      COLHDG('COD.' 'CLI.' 'PAG.')
014500010201     A            VAOCTR    R               REFFLD($CTRA)
014600001115     A            VAOPOR    R               REFFLD($FIL)
014700001005     A                                      TEXT('PUNTO OPERATIVO RITIRO')
014800001005     A                                      COLHDG('P.O.' 'RIT.')
014900001005     A                                      EDTCDE(Z)
015000001115     A            VAOZOR    R               REFFLD($ZNR)
015100001115     A            VAOPOC    R               REFFLD($FIL)
015200001005     A                                      TEXT('PUNTO OPERATIVO CONSEGNA')
015300001005     A                                      COLHDG('P.O.' 'CONS.')
015400001005     A                                      EDTCDE(Z)
015500001115     A            VAONO1    R               REFFLD($NOT)
015600001013     A                                      TEXT('NOTE - 1')
015700001013     A                                      COLHDG('NOTE - 1')
015800001115     A            VAONO2    R               REFFLD($NOT)
015900001013     A                                      TEXT('NOTE - 2')
016000001013     A                                      COLHDG('NOTE - 2')
016100001115     A            VAODDT    R               REFFLD($FLA)
016200001024     A                                      TEXT('FLAG DDT S/N')
016300001024     A                                      COLHDG('DDT' 'S/N')
016400001115     A            VAORFA    R               REFFLD($DES15)
016500001027     A                                      TEXT('RIFERIMENTO ALFANUM.')
016600001027     A                                      COLHDG('RIF.' 'ALF.')
016700001129     A            VAOSTO    R               REFFLD($STO)
016800010118     A            VAOSPI    R               REFFLD($FLA)
016900010118     A                                      TEXT('FLAG SPONDA IDRAULICA: S=SI')
017000010118     A                                      COLHDG('FLG' 'SPO.' 'IDR.')
017100001115     A            VAOFLO    R               REFFLD($FLV)
