000100011016      *--------------------------------------------------------------*
000200011016      *  L.F. -  O.R.M. DA CLIENTI VIA INTERNET                      *
000300011016      *--------------------------------------------------------------*
000400011016     A                                      UNIQUE
000500011016     A          R TIORI000                  PFILE(TIORI00F)
000600011016     A          K ORIPRG
