000100011016      *--------------------------------------------------------------*
000200011016      *  L.F. -  O.R.M. DA CLIENTI VIA INTERNET                      *
000300011016      *--------------------------------------------------------------*
000400011016     A          R TIORI000                  PFILE(TIORI00F)
000500011022     A          K ORIDER
000600011022     A          K ORIOER
