000100000000     A*--------------------------------------------------------------*
000200110719     A*  L.F. SU PARTNER EUROEXPRESS
000300000000     A*--------------------------------------------------------------*
000400000000     A                                      UNIQUE
000500110719     A          R TIPEX000                  PFILE(TIPEX00F)
000600110719     A          K PEXFIL
000700110719     A          K PEXDDS
