000100941206     A*------------------------------------------------------------------------*
000200031103     A*  L.F. X  KSC+FTR+DAS+ORS
000300941206     A*------------------------------------------------------------------------*
000400031031     A          R TISTB000                  PFILE(TISTB00F)
000500031104     A          K STBKSU
000600031103     A          K STBFTR
000700031103     A          K STBDAS
000800031103     A          K STBORS
