000100000000     A*--------------------------------------------------------------*
000200050131     A*  L.F.BOLLE PER RIFER. MITT. NUMERICO E XCO                   *
000300000000     A*--------------------------------------------------------------*
000400890915     A                                      FIFO
000500990608     A          R TITAS000                  PFILE(TITAS00F)
000600050131     A          K TASXCO
000700981203     A          S TASFIC                    CMP(EQ ' ')
000800050203     A          S TASXCO                    CMP(NE ' ')
