000100000000     A*--------------------------------------------------------------*
000200940427     A*         TARIFFE CLIENTI  -  DETTAGLIO                        *
000300000000     A*--------------------------------------------------------------*
000400890918     A                                      REF(CNDIZION)
000500990427     A          R TITAD000                  TEXT('TARIFFE CLIENTI - DETTAGLIO')
000600890918     A            TADATB    R               REFFLD($ATB)
000700890918     A            TADKSC    R               REFFLD($CSC)
000800940428     A            TADCTR    R               REFFLD($CTR)
000900890918     A            TADPRG    R               REFFLD($PRG)
001000890918     A            TADLNP    R               REFFLD($LNP)
001100890918     A            TADCTS    R               REFFLD($CTS)
001200990427     A            TADNAZ    R               REFFLD($NAZ)
001201990427     A            TADCAP         9          TEXT('C.A.P.')
001300990427     A                                      COLHDG('CAP')
001400940427     A            TADSGL    R               REFFLD($SGL)
001500940428     A*
001600940427     A            TADITR    R               REFFLD($ITR)
001700890918     A            TADINO    R               REFFLD($INO)
001800890918     A            TADRPV    R               REFFLD($RPV)
001900940427     A            TADORP    R               REFFLD($ORP)
002000940428     A            TADMIN    R               REFFLD($MIN)
002300940428     A            TADMAX    R               REFFLD($MAX)
002600940427     A*
002700940427     A            TADFTR    R               REFFLD($FTR)
002800940427     A            TADDTR    R               REFFLD($DTR)
