000100890907     A*---------------------------------------------------------------*
000200000831     A*  BOLLE SEDE: ESTENSIONE DETTAGLIO SEGNACOLLI
000300890907     A*---------------------------------------------------------------*
000400910911     A                                      REF(CNDIZION)
000500910911     A*
000600000831     A          R TITAH000                  TEXT('BOLLE SEDE: ESTENS.DETTAGLIO +
000700990602     A                                      SEGNACOLLI')
000800000831     A            TAHAAS    R               REFFLD($AAS)
000900000831     A            TAHLNP    R               REFFLD($LNP)
001000000831     A            TAHNRS    R               REFFLD($NRS)
001100000831     A            TAHNSP    R               REFFLD($NSP)
001200000831     A            TAHTRC    R               REFFLD($TRC)
001300000831     A            TAHNOT    R               REFFLD($NOT)
001400010524     A            TAHNSC    R               REFFLD($NSC)
