000100000000     A*--------------------------------------------------------------*
000200990608     A*  COMB. TITAS00F+TITAS10F+TITASP0F
000300000712     A*  PER: - LINEA PARTENZA
000400000712     A*         DESTINATARIO
000500000000     A*--------------------------------------------------------------*
000600990608     A          R TITAS000                  PFILE(TITAS00F)
000700000712     A            TASAAS    R
000800000712     A            TASLNP    R
000900000712     A            TASNRS    R
001000000712     A            TASNSP    R
001100000712     A            TASTBL    R
001200000712     A            TASCBO    R
001300000712     A            TASMGS    R
001400000712     A            TASKSC    R
001500000712     A            TASLNA    R
001600000712     A            TASNCL    R
001700000712     A            TASPKB    R
001800000712     A            TASFPB    R
001900000712     A            TASPKC    R
002000000712     A            TASNCP    R
002100000712     A            TASPKF    R
002200000712     A            TASFPF    R
002300000712     A            TASPVL    R
002400000712     A            TASFVB    R
002500000712     A            TASVLB    R
002600000712     A            TASVLC    R
002700000712     A            TASNCR    R
002800000712     A            TASVLF    R
002900000712     A            TASFVF    R
003000000712     A            TASQFT    R
003100000712     A            TASIAS    R
003200000712     A            TASVAS    R
003300000712     A            TASFCM    R
003400000712     A            TASCTR    R
003500000712     A            TASTSP    R
003600000712     A            TASRSD    R
003700000712     A            TASIND    R
003800000712     A            TASCAD    R
003900000712     A            TASLOD    R
004000000712     A            TASPRD    R
004100000712     A            TASNZD    R
004200000712     A            TASCPD    R
004300000712     A            TASCTS    R
004400000712     A            TASFIN    R
004500000712     A            TASCCM    R
004600000712     A            TASRMN    R
004700000712     A            TASMCT    R
004800000712     A            TASFAP    R
004900000712     A            TASFTM    R
005000000712     A            TASNAS    R
005100000712     A            TASFLB    R
005200000712     A            TASFLP    R
005300000712     A            TASFL2    R
005400000712     A            TASTFA    R
005500000712     A            TASTFP    R
005600000712     A            TASDIM    R
005700000712     A            TASSOP    R
005800000712     A            TASPDR    R
005900000712     A            TASDRT    R
006000000712     A            TASHRT    R
006100000712     A            TASNRT    R
006200000712     A            TASFPP    R
006300000712     A            TASSTR    R
006400000712     A            TASCTM    R
006500000712     A            TASFNS    R
006600000712     A            TASFLS    R
006700000712     A            TASNCD    R
006800000712     A            TASNCA    R
006900000712     A            TASXCO    R
007000000712     A            TASDBR    R
007100000712     A            TASDUC    R
007200000712     A            TASDTI    R
007300000712     A            TASHTI    R
007400000712     A            TASZNC    R
007500000712     A            TASPDC    R
007600000712     A            TASNDC    R
007700000712     A            TASDDC    R
007800000712     A            TASSTP    R
007900000712     A            TASDCE    R
008000000712     A            TASHCE    R
008100000712     A            TASDCP    R
008200000712     A            TASDCM    R
008300000712     A            TASHMC    R
008400000712     A            TASCCA    R
008500000712     A            TASNPI    R
008600000712     A            TASNCI    R
008700000712     A            TASNRC    R
008800000712     A            TASFDN    R
008900000712     A            TASFFD    R
009000000712     A            TASFTC    R
009100000712     A            TASTC2    R
009200000712     A            TASGC1    R
009300000712     A            TASGC2    R
009400000712     A            TASTCR    R
009500000712     A            TASDCR    R
009600000712     A            TASHCR    R
009700000712     A            TASFBR    R
009800000712     A            TASLL1    R
009900000712     A            TASLL2    R
010000000712     A            TASFA2    R
010100000712     A            TASFCA    R
010200000712     A            TASFA1    R
010300000712     A            TASFGC    R
010400000712     A            TASFDA    R
010500000712     A            TASGUF    R
010600000712     A            TASFLO    R
010700000712     A            TASGGS    R
010800000712     A            TASGGA    R
010900000712     A            TASGMA    R
011000000712     A            TASGVA    R
011100000712     A            TASNZM    R
011200000712     A            TASCAM    R
011300000712     A            TASDIV    R
011400000712     A            TASPOR    R
011500000712     A            TASSV1    R
011600000712     A            TASVA1    R
011700000712     A            TASSV2    R
011800000712     A            TASVA2    R
011900000712     A            TASSV3    R
012000000712     A            TASVA3    R
012100000712     A            TASIMV    R
012200000712     A            TASDFT    R
012300000712     A            TASNFT    R
012400000712     A            TASFIV    R
012500000712     A            TASFEI    R
012600000712     A            TASFTS    R
012700000712     A            TASFIC    R
012800000712     A            TASSCL    R
012900000712     A            TASD15             I      SST(TASRSD 1 15)
013000000712     A                                      TEXT('PRIMI 15 CARATTERI DEL DESTIN-
013100000712     A                                      ATARIO')
013200000712     A          K TASLNP
013300000712     A          K TASD15
013400890915     A*
013500990608     A          R TITAS010                  PFILE(TITAS10F)
013600000712     A            TASAAS    R
013700000712     A            TASLNP    R
013800000712     A            TASNRS    R
013900000712     A            TASNSP    R
014000000712     A            TASTBL    R
014100000712     A            TASCBO    R
014200000712     A            TASMGS    R
014300000712     A            TASKSC    R
014400000712     A            TASLNA    R
014500000712     A            TASNCL    R
014600000712     A            TASPKB    R
014700000712     A            TASFPB    R
014800000712     A            TASPKC    R
014900000712     A            TASNCP    R
015000000712     A            TASPKF    R
015100000712     A            TASFPF    R
015200000712     A            TASPVL    R
015300000712     A            TASFVB    R
015400000712     A            TASVLB    R
015500000712     A            TASVLC    R
015600000712     A            TASNCR    R
015700000712     A            TASVLF    R
015800000712     A            TASFVF    R
015900000712     A            TASQFT    R
016000000712     A            TASIAS    R
016100000712     A            TASVAS    R
016200000712     A            TASFCM    R
016300000712     A            TASCTR    R
016400000712     A            TASTSP    R
016500000712     A            TASRSD    R
016600000712     A            TASIND    R
016700000712     A            TASCAD    R
016800000712     A            TASLOD    R
016900000712     A            TASPRD    R
017000000712     A            TASNZD    R
017100000712     A            TASCPD    R
017200000712     A            TASCTS    R
017300000712     A            TASFIN    R
017400000712     A            TASCCM    R
017500000712     A            TASRMN    R
017600000712     A            TASMCT    R
017700000712     A            TASFAP    R
017800000712     A            TASFTM    R
017900000712     A            TASNAS    R
018000000712     A            TASFLB    R
018100000712     A            TASFLP    R
018200000712     A            TASFL2    R
018300000712     A            TASTFA    R
018400000712     A            TASTFP    R
018500000712     A            TASDIM    R
018600000712     A            TASSOP    R
018700000712     A            TASPDR    R
018800000712     A            TASDRT    R
018900000712     A            TASHRT    R
019000000712     A            TASNRT    R
019100000712     A            TASFPP    R
019200000712     A            TASSTR    R
019300000712     A            TASCTM    R
019400000712     A            TASFNS    R
019500000712     A            TASFLS    R
019600000712     A            TASNCD    R
019700000712     A            TASNCA    R
019800000712     A            TASXCO    R
019900000712     A            TASDBR    R
020000000712     A            TASDUC    R
020100000712     A            TASDTI    R
020200000712     A            TASHTI    R
020300000712     A            TASZNC    R
020400000712     A            TASPDC    R
020500000712     A            TASNDC    R
020600000712     A            TASDDC    R
020700000712     A            TASSTP    R
020800000712     A            TASDCE    R
020900000712     A            TASHCE    R
021000000712     A            TASDCP    R
021100000712     A            TASDCM    R
021200000712     A            TASHMC    R
021300000712     A            TASCCA    R
021400000712     A            TASNPI    R
021500000712     A            TASNCI    R
021600000712     A            TASNRC    R
021700000712     A            TASFDN    R
021800000712     A            TASFFD    R
021900000712     A            TASFTC    R
022000000712     A            TASTC2    R
022100000712     A            TASGC1    R
022200000712     A            TASGC2    R
022300000712     A            TASTCR    R
022400000712     A            TASDCR    R
022500000712     A            TASHCR    R
022600000712     A            TASFBR    R
022700000712     A            TASLL1    R
022800000712     A            TASLL2    R
022900000712     A            TASFA2    R
023000000712     A            TASFCA    R
023100000712     A            TASFA1    R
023200000712     A            TASFGC    R
023300000712     A            TASFDA    R
023400000712     A            TASGUF    R
023500000712     A            TASFLO    R
023600000712     A            TASGGS    R
023700000712     A            TASGGA    R
023800000712     A            TASGMA    R
023900000712     A            TASGVA    R
024000000712     A            TASNZM    R
024100000712     A            TASCAM    R
024200000712     A            TASDIV    R
024300000712     A            TASPOR    R
024400000712     A            TASSV1    R
024500000712     A            TASVA1    R
024600000712     A            TASSV2    R
024700000712     A            TASVA2    R
024800000712     A            TASSV3    R
024900000712     A            TASVA3    R
025000000712     A            TASIMV    R
025100000712     A            TASDFT    R
025200000712     A            TASNFT    R
025300000712     A            TASFIV    R
025400000712     A            TASFEI    R
025500000712     A            TASFTS    R
025600000712     A            TASFIC    R
025700000712     A            TASSCL    R
025800000712     A            TASD15             I      SST(TASRSD 1 15)
025900000712     A                                      TEXT('PRIMI 15 CARATTERI DEL DESTIN-
026000000712     A                                      ATARIO')
026100000712     A          K TASLNP
026200000712     A          K TASD15
026300941116     A*
026400990608     A          R TITASP00                  PFILE(TITASP0F)
026500000712     A            TASAAS    R
026600000712     A            TASLNP    R
026700000712     A            TASNRS    R
026800000712     A            TASNSP    R
026900000712     A            TASTBL    R
027000000712     A            TASCBO    R
027100000712     A            TASMGS    R
027200000712     A            TASKSC    R
027300000712     A            TASLNA    R
027400000712     A            TASNCL    R
027500000712     A            TASPKB    R
027600000712     A            TASFPB    R
027700000712     A            TASPKC    R
027800000712     A            TASNCP    R
027900000712     A            TASPKF    R
028000000712     A            TASFPF    R
028100000712     A            TASPVL    R
028200000712     A            TASFVB    R
028300000712     A            TASVLB    R
028400000712     A            TASVLC    R
028500000712     A            TASNCR    R
028600000712     A            TASVLF    R
028700000712     A            TASFVF    R
028800000712     A            TASQFT    R
028900000712     A            TASIAS    R
029000000712     A            TASVAS    R
029100000712     A            TASFCM    R
029200000712     A            TASCTR    R
029300000712     A            TASTSP    R
029400000712     A            TASRSD    R
029500000712     A            TASIND    R
029600000712     A            TASCAD    R
029700000712     A            TASLOD    R
029800000712     A            TASPRD    R
029900000712     A            TASNZD    R
030000000712     A            TASCPD    R
030100000712     A            TASCTS    R
030200000712     A            TASFIN    R
030300000712     A            TASCCM    R
030400000712     A            TASRMN    R
030500000712     A            TASMCT    R
030600000712     A            TASFAP    R
030700000712     A            TASFTM    R
030800000712     A            TASNAS    R
030900000712     A            TASFLB    R
031000000712     A            TASFLP    R
031100000712     A            TASFL2    R
031200000712     A            TASTFA    R
031300000712     A            TASTFP    R
031400000712     A            TASDIM    R
031500000712     A            TASSOP    R
031600000712     A            TASPDR    R
031700000712     A            TASDRT    R
031800000712     A            TASHRT    R
031900000712     A            TASNRT    R
032000000712     A            TASFPP    R
032100000712     A            TASSTR    R
032200000712     A            TASCTM    R
032300000712     A            TASFNS    R
032400000712     A            TASFLS    R
032500000712     A            TASNCD    R
032600000712     A            TASNCA    R
032700000712     A            TASXCO    R
032800000712     A            TASDBR    R
032900000712     A            TASDUC    R
033000000712     A            TASDTI    R
033100000712     A            TASHTI    R
033200000712     A            TASZNC    R
033300000712     A            TASPDC    R
033400000712     A            TASNDC    R
033500000712     A            TASDDC    R
033600000712     A            TASSTP    R
033700000712     A            TASDCE    R
033800000712     A            TASHCE    R
033900000712     A            TASDCP    R
034000000712     A            TASDCM    R
034100000712     A            TASHMC    R
034200000712     A            TASCCA    R
034300000712     A            TASNPI    R
034400000712     A            TASNCI    R
034500000712     A            TASNRC    R
034600000712     A            TASFDN    R
034700000712     A            TASFFD    R
034800000712     A            TASFTC    R
034900000712     A            TASTC2    R
035000000712     A            TASGC1    R
035100000712     A            TASGC2    R
035200000712     A            TASTCR    R
035300000712     A            TASDCR    R
035400000712     A            TASHCR    R
035500000712     A            TASFBR    R
035600000712     A            TASLL1    R
035700000712     A            TASLL2    R
035800000712     A            TASFA2    R
035900000712     A            TASFCA    R
036000000712     A            TASFA1    R
036100000712     A            TASFGC    R
036200000712     A            TASFDA    R
036300000712     A            TASGUF    R
036400000712     A            TASFLO    R
036500000712     A            TASGGS    R
036600000712     A            TASGGA    R
036700000712     A            TASGMA    R
036800000712     A            TASGVA    R
036900000712     A            TASNZM    R
037000000712     A            TASCAM    R
037100000712     A            TASDIV    R
037200000712     A            TASPOR    R
037300000712     A            TASSV1    R
037400000712     A            TASVA1    R
037500000712     A            TASSV2    R
037600000712     A            TASVA2    R
037700000712     A            TASSV3    R
037800000712     A            TASVA3    R
037900000712     A            TASIMV    R
038000000712     A            TASDFT    R
038100000712     A            TASNFT    R
038200000712     A            TASFIV    R
038300000712     A            TASFEI    R
038400000712     A            TASFTS    R
038500000712     A            TASFIC    R
038600000712     A            TASSCL    R
038700000712     A            TASD15             I      SST(TASRSD 1 15)
038800000712     A                                      TEXT('PRIMI 15 CARATTERI DEL DESTIN-
038900000712     A                                      ATARIO')
039000000712     A          K TASLNP
039100000712     A          K TASD15
