000100000000     A*--------------------------------------------------------------*
000200000114     A*  DATI FATTURAZIONE DI RITORNO AI CLIENTI MITTENTI  DAL 2000
000300941217     A*  MBR=*NONE  -  MAXMBRS=*NOMAX
000400000114     A*  PER        : CAMPI TRASFORMATI IN ALFABETICO ED EDITATI
000500000114     A*  INTERNET     CON SPAZIO A SX (PER SEGNO)
000600000000     A*--------------------------------------------------------------*
000701000114     A          R TIVAFAA                   FORMAT(TIVAFAAT)
