000100990901     A                                      UNIQUE
000200990831     A          R TIVIR000                  PFILE(TIVIR00F)
000300990831     A          K VIRKSC
000400990901     A          K VIRTIP
000500990901     A          K VIRDTI
