000100991018     A          R TIVIR000                  TEXT('File via Internet: regole p-
000200990913     A                                      er cliente.')
000300990920     A            VIRKSC         8          TEXT('Codice cliente unificante')
000400990831     A                                      COLHDG('Codice' 'cliente'          -
000500990831     A                                      'unificante')
000600990831     A            VIRSEQ         3  0       TEXT('Sequenza')
000700990831     A                                      COLHDG('Sequenza')
000800990831     A                                      EDTCDE(Z)
000900990831     A            VIRTIP         2          TEXT('Tipo file')
001000990831     A                                      COLHDG('Tipo' 'file')
001100990831     A            VIRDES        50          TEXT('Descrizione file')
001200990831     A                                      COLHDG('Descrizione' 'file')
001300990831     A            VIRCTL        50          TEXT('Nome file da controllare')
001400990831     A                                      COLHDG('Nome file' 'da controllare')
001500990831     A            VIRDTI         8  0       TEXT('Data inizio validità')
001600990831     A                                      COLHDG('Data' 'inizio' 'validità')
001700990901     A                                      EDTWRD('0    /  /  ')
001800990831     A            VIRDTF         8  0       TEXT('Data fine   validità')
001900990831     A                                      COLHDG('Data' 'fine' 'validità')
002000990901     A                                      EDTWRD('0    /  /  ')
002100991018     A            VIRFID        10          TEXT('File da tradurre')
002200991018     A                                      COLHDG('File da' 'tradurre')
002300991018     A            VIRFIS        10          TEXT('File storico')
002400991018     A                                      COLHDG('File' 'storico')
002500991018     A            VIRFIT        10          TEXT('File tradotto')
002600991018     A                                      COLHDG('File' 'tradotto')
002700990913     A            VIRPGT        10          TEXT('Programma traduttore')
002800990831     A                                      COLHDG('Programma' 'traduttore')
002900990913     A            VIRPPT        50          TEXT('Parametri per traduttore')
003000990831     A                                      COLHDG('Parametri per' 'traduttore')
003100991018     A            VIRPGI        10          TEXT('Programma importatore')
003200991018     A                                      COLHDG('Programma' 'importatore')
003300991018     A            VIRPPI        50          TEXT('Parametri per importatore')
003400991018     A                                      COLHDG('Parametri per' -
003500991018     A                                      'importatore')
003600990831     A            VIRPOI         3  0       TEXT('Filiale a cui inviare file')
003700990831     A                                      COLHDG('Filiale' 'a cui' 'inviare')
003800990831     A                                      EDTCDE(Z)
003900991018     A            VIRPTH       100          TEXT('Ultimo path upload')
004000991018     A                                      COLHDG('Ultimo' 'path' 'upload')
004100000628     A            VIRFI1         2          TEXT('Tipo Servizio Cliente/File')
004200000628     A                                      COLHDG('Servizio' 'Cliente/File')
004300010524     A            VIRFI2         2          TEXT('Libreria Aziend/Gruppo')
004400010524     A                                      COLHDG('Lib Aziend/Gruppo')
004500991018     A            VIRFI3        10          TEXT('Libero')
004600991018     A            VIRFI4        10          TEXT('Libero')
