000100990913      *PARMS SYSTEM(*RMT)
000200990901     A          R TIVLR000                  PFILE(TIVLR00F)
000300120112     A          K VLRFLG
000400120112     A          O VLRFLG                    COMP(EQ '1')
