000100991105     A          R TIVLT000                  PFILE(TIVLT00F)
000200991117     A          K VLTKSC
000300991115     A          K VLTDAT                    DESCEND
000400991115     A          K VLTORA                    DESCEND
000500991115     A          K VLTTIP
000600991115     A          K VLTSQZ                    DESCEND
000700991115     A          K VLTSTS
