000100031008     A          R TIVLT000                  PFILE(TIVLT00F)
000200030512     A          K VLTFLD
000300030512     A          K VLTMBD
000400031008     A          K VLTKSC
