000100990913      *PARMS SYSTEM(*RMT)
000200990901     A          R TIVLR000                  PFILE(TIVLR00F)
000300000710     A          K VLRPRG
000400000710     A          K VLRKSC
000500000710     A          K VLRTIP
000600000710     A          K VLRFL2
