000100010524     A          R TIVPI000                  TEXT('Upload via Internet: dati')
000200010524     A            VPITIP         2          TEXT('Tipo file')
000300010524     A                                      COLHDG('Tipo file')
000400010524     A            VPIISV         2          TEXT('Servizio')
000500010524     A                                      COLHDG('Servizio')
000600010525     A            VPISUN         9          TEXT('SGI User Number')
000700010525     A                                      COLHDG('SGI User Number')
000800010524     A            VPIKSU         8          TEXT('Cliente Unificante')
000900010524     A                                      COLHDG('Cliente Unificante')
001000010524     A            VPIDTA      2048          TEXT('Dati')
001100990910     A                                      COLHDG('Dati')
001200010524     A            VPIXXX        10          TEXT('Filler')
001300010524     A                                      COLHDG('Filler')
