000001121219     A                                      UNIQUE
000200121107     A          R TIVRB000                  PFILE(TIVRB00F)
000300121107     A          K VRBAAS
000400121107     A          K VRBLNP
000500121107     A          K VRBNRS
000600121107     A          K VRBNSP
000700121107     A          K VRBTBL
000701121130     A          K VRBCVB
001000121107     A          O VRBDELA                   CMP(NE 0)
