000100000710     A                                      UNIQUE
000200000703     A          R TIVRE000                  PFILE(TIVRE00F)
000300000703     A          K VREKSC
000400000703     A          K VRETIP
000500000703     A          K VREDTI
000600000707     A          K VREORD
000700000703     A          K VRETFL
