000100990920     A                                      UNIQUE
000200990920     A          R TIVTF000                  PFILE(TIVTF00F)
000300990920     A          K VTFTIP
