000100991020     A                                      REF(CNDIZION)
000200040414     A          R TIVTB000
000300040414     A                                      TEXT('INTERNET - Segnacolli e -
000400040414     A                                      "chi sono" per clienti iscritti.')
000500040414     A            VTBKSU         8
000600040414     A                                      TEXT('Codice cliente unificante.')
000700040414     A                                      COLHDG('Cliente' 'unificante')
000800040415     A            VTBAAS    R
000900040414     A                                      REFFLD($AAS)
001000040414     A                                      EDTCDE(Z)
001100040415     A            VTBLNP    R
001200040414     A                                      REFFLD($LNP)
001300040414     A                                      EDTCDE(Z)
001400040415     A            VTBNRS    R
001500040414     A                                      REFFLD($NRS)
001600040414     A                                      EDTCDE(Z)
001700040415     A            VTBNSP    R
001800040414     A                                      REFFLD($NSP)
001900040414     A                                      EDTCDE(Z)
002000040414     A            VTBTBL    R
002100040414     A                                      REFFLD($TBL)
002200040415     A            VTBDSP    R
002300040414     A                                      REFFLD($DA8)
002400040414     A                                      TEXT('Data spedizione.')
002500040414     A                                      COLHDG('Data' 'spedizione')
002600991104     A                                      EDTWRD('    /  /  ')
002700040415     A            VTBLNA    R
002800040414     A                                      REFFLD($LNA)
002900040414     A                                      EDTCDE(Z)
003000040415     A            VTBFLS    R
003100040414     A                                      REFFLD($FLS)
003200040414     A                                      EDTCDE(Z)
003300040415     A            VTBNSC    R
003400040414     A                                      REFFLD($NSC)
003500040414     A                                      EDTCDE(Z)
003600040414     A            VTBCHISONOR
003700040414     A                                      REFFLD($NOT)
003800040414     A                                      TEXT('Codice "chi sono".')
003900040414     A                                      COLHDG('Codice chi sono')
004000040415     A                                      VARLEN
