000100040414     A          R TIVTB000
000200040414     A                                      PFILE(TIVTB00F)
000300040414     A          K VTBKSU
000400040505     A          K VTBAAS
000500040414     A          K VTBLNP
000600040414     A          K VTBNRS
000700040414     A          K VTBNSP
000800040414     A          K VTBTBL
000900040429     A          K VTBCHISONO
001000040429     A          K VTBFLS
001100040429     A          K VTBNRS
001200040429     A          K VTBNSC
001300040429     A          K VTBLNA
