000100000000     A*------------------------------------------------------------------------*
000200030718     A*  TABELLA CAUSALI VARIE X RAGGRUPPAMENTO                                *
000300000000     A*------------------------------------------------------------------------*
000400030722     A                                      REF(CNDIZION)
000500040115     A          R TNCFP000                  TEXT('CAUSALI RAGGR. VARIE')
000600030718      *
000700040115     A            CFPCAU        15A         TEXT('CAUSALE ORIGINALI')
000800040115     A                                      COLHDG('CAUSALE')
000900030718      *
001000040115     A            CFPNTW         3A         COLHDG('NETWORK')
001100030722     A                                      TEXT('NETWORK')
001200030722      *
001300040115     A            CFPFIL    R               REFFLD($FIL)
001400030620      *
001500040115     A            CFPDDA    R               REFFLD($DTR)
001600030722     A                                      COLHDG('DA' 'DATA')
001700030718     A                                      TEXT('DA DATA')
001800030718      *
001900040115     A            CFPADA    R               REFFLD($DTR)
002000030722     A                                      COLHDG('A' 'DATA')
002100030722     A                                      TEXT('A DATA')
002200030722      *
002300040115     A            CFPDES        40A         TEXT('DESCRIZIONE')
002400030722     A                                      COLHDG('DESCRIZIONE')
002500030623      *
002600040115     A            CFPGRP         3A         COLHDG('TIPO' 'RAGGRUPPAMENTO')
002700030718     A                                      TEXT('RAGGRUPPAMENTO')
002800030623      *
002900040115     A            CFPANN         1A         COLHDG('FLG' 'ANNULLATO')
003000030723     A                                      TEXT('ANNULLATO')
003100030723      *
