000100000000     A*--------------------------------------------------------------*
000200981012     A*  L.F. CLIENTI POTENZIALI
000300000000     A*--------------------------------------------------------------*
000400981012     A          R TNCPO000                  PFILE(TNCPO00F)
000500920414     A          K CPOCPO
000600981012     A* VISTA LOGICA PER:
000700981012     A* CODICE POTENZIALE
