000100871021     A*--------------------------------------------------------------*
000200981009     A* STORICO STATI CLIENTI POTENZIALI
000300840614     A*--------------------------------------------------------------*
000400920414     A                                      REF(CNDIZION)
000500981009     A          R TNCPS000                  TEXT('STORICO STATI POTEN+
000600981009     A                                      ZIALI')
000700920414     A*
000800981009     A            CPSATB    R               REFFLD($ATB)
000900981009     A            CPSCPO    R               REFFLD($CPO)
001000981009     A            CPSCMM    R               REFFLD($CMM)
001100981009     A            CPSFST         2A         TEXT('STATO CLI.POT (TABELLA 1Q)')
001200981009                                            COLHDG('STATO' 'CLIENTE')
001300981009     A            CPSDST         8P 0       TEXT('DATA STATO CLI.POT')
001400981009                                            COLHDG('DATA' 'STATO')
001500981009     A            CPSCLT         2A         TEXT('CODICE TESTO LETTERA')
001600981009     A            CPSCNC         2A         TEXT('CAUSALE NON CONTATTO')
001700981009     A            CPSKSC    R               REFFLD($KSC)
001800981109     A                                      TEXT('COD.CLIENTE')
001900981109     A            CPSNRV    R               REFFLD($NRV)
002000981009     A            CPSDIM    R               REFFLD($DIM)
002100981009     A            CPSHIM    R               REFFLD($HIM)
002200981009     A            CPSPRU    R               REFFLD($PRU)
002300981009     A            CPSFLE    R               REFFLD($FLE)
002400981009                                            TEXT('P.O. IMMISSIONE')
002500981009                                            COLHDG('PO' 'IMMISSIONE')
002600981009     A            CPSFTR    R               REFFLD($FTR)
002700981009     A            CPSDTR    R               REFFLD($DTR)
