000100000000     A*--------------------------------------------------------------*
000200120110     A*         ARCHIVIO ASSEGNI MITTENTE                            *
000300000000     A*--------------------------------------------------------------*
000400890908     A                                      REF(CNDIZION)
000500120326     A          R TNCPM000                  TEXT('ASSEGNI MITTENTI')
000600120326     A            CPMKEY    R               REFFLD($NRA)
000700120221     A                                      COLHDG('LEGAME' 'SPED/ASS')
000800120221     A                                      TEXT('LEGAME SPED/ASSEGNI (CSBNRA)')
000900120326     A            CPMIDC    R               REFFLD($IDC)
001000110804     A                                      TEXT('IMPORTO ASSEGNO')
001100110804     A                                      COLHDG('IMPORTO' 'ASSEGNO')
001200120326     A            CPMDIV    R               REFFLD($DIV)
001300120326     A            CPMNRA    R               REFFLD($NRA)
001400910611     A                                      TEXT('NR. RIF. ASSEGNO INCASSATO')
001500910611     A                                      COLHDG('NR.ASSEGNO' 'INCASSATO')
001600120326     A            CPMDTE    R               REFFLD($DTE)
001700910611     A                                      TEXT('DATA ASSEGNO INCASSATO')
001800910611     A                                      COLHDG('DATA' 'ASSEGNO' 'INC.')
001900120326     A            CPMABI    R               REFFLD($ABI)
002000910611     A                                      TEXT('COD. ABI ASSEGNO INC.')
002100120326     C            CPMCAB    R               REFFLD($CAB)
002200910611     A                                      TEXT('COD. CAB ASSEGNO INC.')
002300120326     A            CPMTPA    R               REFFLD($TPA)
002400120326     A            CPMTPI    R               REFFLD($TPI)
002500120326     A            CPMFLA    R               REFFLD($FLA)
002600111216     A                                      TEXT('FORZATO S=SI')
002700111216     A                                      COLHDG('FORZA')
002800120326     A            CPMATB    R               REFFLD($ATB)
002900120326     A            CPMPRU    R               REFFLD($PRU)
003000120326     A            CPMDATORA     14  0
003100111115     A                                      TEXT('WRK-DATA/ORA ULT.VAR.  AAAAMM-
003200111115     A                                      GGHHMMSS')
003300111115     A                                      COLHDG('DATA/ORA')
