000100000000     A*--------------------------------------------------------------*
000200080206     A*  L.F. CLIENTI POTENZIALI X PARTITA IVA
000300000000     A*--------------------------------------------------------------*
000400981023     A          R TNCPO000                  PFILE(TNCPO00F)
000500080206     A          K CPOPIV
