000100121204      *--------------------------------------------------------------*
000200140714      * STORICO ANAGRAFICO CLIENTI POTENZIALI - ESTENSIONE
000300121204      *--------------------------------------------------------------*
000400140714     A          R TNCPO100                  FORMAT(TNCPO10F)
