000100000000     A*--------------------------------------------------------------*
000200120110     A* LEGAME TRA SPEDIZIONI E ASSEGNI                            --*
000300000000     A*--------------------------------------------------------------*
000400110810     A          R TNCSS000                  PFILE(TNCSS00F)
000500120110     A          K CSSKEY
000600120112     A          K CSSFGS
000700120112     A          K CSSNDC
