000100000000     A*--------------------------------------------------------------*
000200910617     A*  L.F. ANAGRAFICA CONTRASSEGNI X AAS-LNP-NRS-NSP
000300000000     A*--------------------------------------------------------------*
000400941028     A                                      UNIQUE
000500941025     A          R TNCSA000                  PFILE(TNCSA00F)
000600910704     A          K CSAAAS
000700910617     A          K CSALNP
000800910617     A          K CSANRS
000900910617     A          K CSANSP
