000100000000     A*------------------------------------------------------------------------*
000200030620     A* CONTROLLO FATTURE PARTNERS ESTERO                                      *
000300000000     A*------------------------------------------------------------------------*
000400030625     A          R TNECF000                  PFILE(TNECF00F)
000500030620      *
000600030829     A          K ECFNTW
000700030829     A          K ECFRIF
000800030723     A          K ECFGRP
