000100890907     A*---------------------------------------------------------------*
000200170607     A*  ARCHIVIO CONTEGGIO BOLLE GIACENZA (IMA TOTALIZZATO)
000300890907     A*---------------------------------------------------------------*
000400890907     A                                      REF(CNDIZION)
000500900327     A*
000600170607     A          R TNIMAG50                  TEXT('ARCHIVIO BOLLE GIACENZA (+
000700170512     A                                      IMA E IMG)')
000800170607     A            IMAGDTA   R               REFFLD($DTA)
000900170510     A                                      TEXT('DATA LAVORAZIONE MERCE')
001000170510     A                                      COLHDG('LAVORAZIONE' 'MERCE')
001100170607     A            IMAGFGS   R               REFFLD($FGS)
001200170515     A                                      TEXT('FIL. LAVORAZIONE MERCE')
001300170515     A                                      COLHDG('FIL.LAVORA' 'MERCE')
001400170607     A            IMAGFDES      30A
001500170530     A                                      TEXT('DESCR.FILIALE')
001600170530     A                                      COLHDG('DESCR.FILIALE')
001700170607     A            IMAGNBL1       8  0
001800170515     A                                      TEXT('IMA 1° GG: BOLLE')
001900170515     A                                      COLHDG('NR.BOLLE' '1° GG IMA')
002000170607     A            IMAGNCL1       8  0
002100170515     A                                      TEXT('IMA 1° GG: COLLI')
002200170515     A                                      COLHDG('NR.COLLI' '1° GG IMA')
002300170607     A            IMAGPKL1      13  1
002400170515     A                                      TEXT('IMA 1° GG: PESO')
002500170515     A                                      COLHDG('PESO' '1° GG IMA')
002600170607     A            IMAGVLU1      13  3
002700170515     A                                      TEXT('IMA 1° GG: VOLUME')
002800170515     A                                      COLHDG('VOLUME' '1° GG IMA')
002900170607     A            IMAGNBL2       8  0
003000170515     A                                      TEXT('IMA 2° GG: BOLLE')
003100170515     A                                      COLHDG('NR.BOLLE' '2° GG IMA')
003200170607     A            IMAGNCL2       8  0
003300170515     A                                      TEXT('IMA 2° GG: COLLI')
003400170607     A                                      COLHDG('NR.COLLI' '2° GG IMA')
003500170607     A            IMAGPKL2      13  1
003600170515     A                                      TEXT('IMA 2° GG: PESO')
003700170515     A                                      COLHDG('PESO' '2° GG IMA')
003800170607     A            IMAGVLU2      13  3
003900170515     A                                      TEXT('IMA 2° GG: VOLUME')
004000170515     A                                      COLHDG('VOLUME' '2° GG IMA')
004100170607     A            IMAGNBLO       8  0
004200170515     A                                      TEXT('IMA OLTRE 2 GG: BOLLE')
004300170515     A                                      COLHDG('NR.BOLLE' -
004400170515     A                                      'OLTRE' '2 GG IMA')
004500170607     A            IMAGNCLO       8  0
004600170515     A                                      TEXT('IMA OLTRE 2 GG: COLLI')
004700170515     A                                      COLHDG('COLLI' -
004800170515     A                                      'OLTRE' '2 GG IMA')
004900170607     A            IMAGPKLO      13  1
005000170515     A                                      TEXT('IMA OLTRE 2 GG: PESO')
005100170515     A                                      COLHDG('PESO' -
005200170515     A                                      'OLTRE' '2 GG IMA')
005300170607     A            IMAGVLUO      13  3
005400170515     A                                      TEXT('IMA OLTRE 2 GG: VOLUME')
005500170515     A                                      COLHDG('VOLUME' -
005600170515     A                                      'OLTRE' '2 GG IMA')
