000100151111     A*------------------------------------------------------------------------*
000200151111     A* TARIFFE NUOVE RITASSAZIONE SPEDIZIONI - DETTAGLIO
000300151111     A*------------------------------------------------------------------------*
000400050322     A                                      REF(CNDIZION)
000500151111     A          R TNRSD000                  TEXT('TAR.NUOVE RITASSAZIONE -
000600151111     A                                      SPED. - DETTAGLIO')
000700151111     A            RSDKSC    R               REFFLD($CSC)
000800151111     A            RSDCTR    R               REFFLD($CTR)
000900151111     A            RSDPRG    R               REFFLD($PRG)
001000151111     A            RSDDTE    R               REFFLD($DA8)
001100151123     A                                      TEXT('DATA ELABORAZIONE')
001200151123     A                                      COLHDG('DATA' 'ELABORAZIONE')
001300151111     A            RSDTRC    R               REFFLD($TRC)
001400151201     A                                      TEXT('SIGLA VARIA - .=PORTO')
001500151201     A                                      COLHDG('SIGLA VARIA' '.=PORTO')
001600151111     A            RSDIMPF   R               REFFLD($IMV)
001700151123     A                                      TEXT('VALORE FATTURATO')
001800151123     A                                      COLHDG('VALORE' 'FATTURATO')
001900151111     A            RSDIMPR   R               REFFLD($IMV)
002000151123     A                                      TEXT('VALORE RITASSATO')
002100151123     A                                      COLHDG('VALORE' 'RITASSATO')
002200160212     A            RSDNRSVF       9P 0       TEXT('N. VARIE TROVATE FATTURATE')
002300151124     A                                      COLHDG('N.' 'VARIE' 'FATT.')
002400160212     A            RSDNRSVR       9P 0       TEXT('N. VARIE TROVATE RITASSATE')
002500151124     A                                      COLHDG('N.' 'VARIE' 'RITAS.')
