000100000000     A*----------------------------------------------------------------
000200150529     A* ADDEBITI AL CLIENTE IN DELTA E CE
000300000000     A*----------------------------------------------------------------
000400150601     A          R TNSTP000
000700150727     A            YCOSTPANN      1          TEXT('FLAG ANNULLAMENTO')
000701150727     A            YCOSTPTRE      3          TEXT('CAUSALE GESTIONE')
000702150727     A            YCOSTPCAU      4          TEXT('CAUSALE CONTABILE')
000703151001     A            YCOSTPIMP     19  3       TEXT('IMPORTO TOTALE')
000707151001     A            YCOSTPMOL      3  0       TEXT('NUMERO REGISTRAZIONI')
000708151001     A            YCOSTPCR       3  0       TEXT('TIPO REGISTRAZIONE TAB.CRC')
000709150724     A            YCOSTPINI       L         TEXT('DATA INIZIO RIPARTIZIONE')
000710151106     A            YCOSTPUTEE    10          TEXT('UTENTE ELABORAZIONE')
000711150806     A            YCOSTPELA       L         TEXT('DATA ELABORAZIONE')
000712151106     A            YCOSTPORAE     6  0       TEXT('ORA ELABORAZIONE')
001300150724     A            YCOSTPVOCD     8          TEXT('VOCE ANALITICA DARE')
001301150724     A            YCOSTPCDCD     8          TEXT('CDC DARE')
001302150724     A            YCOSTPKCCD     6          TEXT('CAPOCONTO DARE')
001303150724     A            YCOSTPKSCD     8          TEXT('SOTTOCONTO DARE')
001400150724     A            YCOSTPVOCA     8          TEXT('VOCE ANALITICA AVERE')
001500150724     A            YCOSTPCDCA     8          TEXT('CDC AVERE')
001600150724     A            YCOSTPKCCA     6          TEXT('CAPOCONTO AVERE')
001700150724     A            YCOSTPKSCA     8          TEXT('SOTTOCONTO AVERE')
001800150806     A            YCOSTPUTE     10          TEXT('UTENTE AGGIORNAMENTO')
001801150806     A            YCOSTPUPD       L         TEXT('DATA AGGIORNAMENTO')
001802151106     A            YCOSTPORAA     6  0       TEXT('ORA AGGIORNAMENTO')
001900150806     A            YCOSTPFVL      1          TEXT('FLAG CONVALIDA')
002000150727     A            YCOSTPOK        L         TEXT('DATA CONVALIDA')
002100151001     A            YCOSTPNR       9  0       TEXT('NUMERO RICHIESTA ADDEBITO')
002200151106     A            YCOSTPNRAZ     9  0       TEXT('NUMERO AZIONE CONTABILIZZAZ.')
002300151106     A            YCOSTPHDL     10          TEXT('RIFERIMENTO STRATEGI DA MAIL')
