000100000000     A*--------------------------------------------------------------*
000200150721     A*  L.F.:  TIPO CAUSALE E CLIENTE
000300000000     A*--------------------------------------------------------------*
000400150721     A          R TNSTP000                  PFILE(TNSTP00F)
000500150721     A          K YCOSTPTRE
000600150727     A          K YCOSTPKCCD
000700150727     A          K YCOSTPKSCD
000800150728     A          K YCOSTPELA
