000100000000     A*--------------------------------------------------------------*
000200940427     A*         TARIFFE CLIENTI  -  TESTATA                          *
000300000000     A*--------------------------------------------------------------*
000400890913     A                                      REF(CNDIZION)
000500940603     A          R TNTAM000                  TEXT('TARIFFE CLIENTI - TESTATA')
000600890913     A            TAMATB    R               REFFLD($ATB)
000700890913     A            TAMKSC    R               REFFLD($CSC)
000800940428     A            TAMCTR    R               REFFLD($CTR)
000900890913     A            TAMPRG    R               REFFLD($PRG)
001000940428     A*
001100940428     A            TAMDDT    R               REFFLD($DDT)
001200940428     A            TAMDST    R               REFFLD($DST)
001300940428     A            TAMDUV    R               REFFLD($DUV)
001400940428     A            TAMDCV    R               REFFLD($DES15)
001500940428     A                                      TEXT('DESCRIZ.VARIAB COD.TAR')
001600940428     A            TAMDIF    R               REFFLD($DIF)
001700940428     A            TAMFLI    R               REFFLD($FLI)
001800101015     A                                      TEXT('LIBERO')
001900940428     A            TAMPRI    R               REFFLD($PRI)
002000940428     A            TAMFMP    R               REFFLD($FMP)
002100101015     A                                      TEXT('RINUNCIA AC BASE')
002200101015     A                                      COLHDG('RIN' 'AC' 'BASE')
002300940428     A            TAMLRC    R               REFFLD($LRC)
002400101015     A                                      TEXT('SPEDIZIONI ANNUE MIN.')
002500101015     A                                      COLHDG('SPED' 'ANNO' 'MIN')
002600940428     A            TAMLAS    R               REFFLD($LAS)
002700101015     A                                      TEXT('SPEDIZIONI ANNUE MAX.')
002800101015     A                                      COLHDG('SPED' 'ANNO' 'MAX')
002900940428     A            TAMPAG    R               REFFLD($PAG)
003000041201     A                                      TEXT('ADD.GEST.ANNI PRECEDENTI')
003100940428     A            TAMPPA    R               REFFLD($PPA)
003200041201     A                                      TEXT('ADD.GEST.CORRENTE')
003300940428     A            TAMMPA    R               REFFLD($MPA)
003400940428     A                                      TEXT('MINIMO PROV.ASS. BARTOLINI')
003500940428     A            TAMPAM    R               REFFLD($PPA)
003600940524     A                                      TEXT('PROVV. ASSEGNO   MITTENTE')
003700940428     A            TAMMPM    R               REFFLD($MPA)
003800940428     A                                      TEXT('MINIMO PROV.ASS. MITTENTE')
003900940428     A            TAMTIN    R               REFFLD($TIN)
004000940428     A                                      TEXT('TIPO CALCOLO VOLUME          +
004100940428     A                                      K=PESO   C=COLLI')
004200940428     A            TAMKPM    R               REFFLD($KPM)
004300940428     A                                      TEXT('RAPPORTO PESO VOLUME')
004400940517     A            TAMARL    R               REFFLD($ARL)
004500940428     A            TAMARF    R               REFFLD($ARF)
004600940428     A            TAMARO    R               REFFLD($ARO)
004700940428     A            TAMRAT    R               REFFLD($RAT)
004800940517     A                                      TEXT('RIFERIM. ALTRA TARIFFA: +
004900940517     A                                      COD. CLIENTE')
005000940517     A                                      COLHDG('RIFER.' 'A TAR' 'CLI')
005100940517     A            TAMRCT    R               REFFLD($CTR)
005200101015     A                                      TEXT('FLAG ISTAT')
005300101015     A                                      COLHDG('FLAG' 'ISTAT')
005400940428     A            TAMSC2         3P 1       TEXT('SCONTO LISTINO')
005500940428     A                                      COLHDG('SCONTO' 'LIST')
005600940428     A            TAMEDS    R               REFFLD($EDS)
005700150924     A                                      TEXT('S=VIS.TARIFFA SU INTERNET')
005800150924     A                                      COLHDG('VIS' 'TAR' 'INTERNET')
005900940428     A            TAMARS    R               REFFLD($ARS)
006000940517     A            TAMATA    R               REFFLD($ATA)
006100940428     A            TAMFTP    R               REFFLD($FTP)
006200940428     A            TAMBAP    R               REFFLD($BAP)
006300940428     A            TAMTSP    R               REFFLD($TSP)
006400940428     A            TAMFIE    R               REFFLD($FIE)
006500940517     A            TAMFIS    R               REFFLD($FIS)
006600940517     A            TAMSIS    R               REFFLD($SIS)
006700940804     A            TAMFVD    R               REFFLD($FVD)
006800940517     A            TAMFTS    R               REFFLD($FTS)
006900940517     A                                      TEXT('FLAG TASSAZIONE ASSEGNATI')
007000940517     A                                      COLHDG('FL TAS.ASS.')
007100940427     A            TAMNAS    R               REFFLD($NAS)
007200940427     A            TAMNOT    R               REFFLD($NOT)
007300940427     A                                      TEXT('DESCRIZONE/NOTE')
007400940517     A                                      COLHDG('NOTE')
007500940427     A            TAMFTM    R               REFFLD($FTM)
007600940427     A            TAMGCA    R               REFFLD($GCA)
007700940427     A            TAMGGA    R               REFFLD($GGA)
007800940530     A            TAMGMA    R               REFFLD($GMA)
007900940427     A            TAMGVA    R               REFFLD($GVA)
008000970123     A            TAMBAM    R               REFFLD($BAM)
008100970123     A            TAMTPR    R               REFFLD($TPR)
008200150924     A                                      TEXT('NO=NO APPL.PESO DESUNTO')
008300150924     A                                      COLHDG('NO' 'PESO' 'DESUNTO')
008400970123     A            TAMFLO    R               REFFLD($FLO)
008500970123     A            TAMDAT    R               REFFLD($DA8)
008600940428     A*
008700940427     A            TAMFTR    R               REFFLD($FTR)
008800940427     A            TAMDTR    R               REFFLD($DTR)
