000100000000     A*--------------------------------------------------------------*
000200970821     A* FILE TABELLE     IN AZM CON SISTEMA INFORMATIVO DAVANTI
000300970821     A*                  '   ' = TUTTE LE AZIENDE
000400000000     A*--------------------------------------------------------------*
000500000000     A                                      REF(CNDIZION)
000600970821     A          R TNTBE000                  TEXT('FILE TABELLE')
000700970821     A            TBEATB    R               REFFLD($ATB)
000800900413     A*
000900971016     A            TBESIF    R               REFFLD($SIF)
001000970821     A            TBELIN    R               REFFLD($CDLINGUA)
001100971009     A            TBEAPL    R    2          REFFLD($APL)
001200970821     A            TBECOD         3A         TEXT('CODICE TABELLA')
001300970821     A            TBEKE1        15A         TEXT('CHIAVE TABELLA 1')
001400970821     A            TBEKE2        15A         TEXT('CHIAVE TABELLA 2')
001500971009     A            TBEUNI       256A         TEXT('CAMPO UNICO')
001600970821     A            TBEFTT    R               REFFLD($FTT)
001700970821     A                                      TEXT('TIPO TRASMISS: BLK=NO S=SI')
001800970821     A* SE IMPOSTATA UNA FILIALE VERRA' TRASMESSA SOLO A QUELLA
001900970821     A            TBEFLT    R               REFFLD($FLT)
002000970821     A            TBEFTR    R               REFFLD($FTR)
002100970821     A            TBEDTR    R               REFFLD($DTR)
