000100000000     A*--------------------------------------------------------------*
000200981013     A*   RICEZIONE    TABELLE
000300900522     A* MBR=*NONE  -  MAXMBRS=*NOMAX                                 *
000400000000     A*--------------------------------------------------------------*
000500980727     A                                      REF(CNDIZION)
000600980727     A          R TNTBE000                  FORMAT(TNTBE00F)
