000100950726     A*------------------------------------------------------------------------*
000200000807     A* RICEZIONE TNTLZ00F
000300950726     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400950726     A*------------------------------------------------------------------------*
000500950726     A                                      REF(CNDIZION)
000600950726     A          R TNTLZ000                  FORMAT(TNTLZ00F)
