000100951204     A*------------------------------------------------------------------------*
000200110510     A* GESTIONE TRAINI - RICEZIONE ARCHIVIO PUNTI SCAMBIO
000300951204     A* MBR = *NONE / MAXMBRS = *NOMAX
000400951204     A*------------------------------------------------------------------------*
000500951204     A                                      REF(CNDIZION)
000600110510     A          R TNTLS000                  FORMAT(TNTLS00F)
