000100940503     A*------------------------------------------------------------------------*
000200950725     A* TRAINI - TESTATA TRAINI
000300940503     A*------------------------------------------------------------------------*
000400890911     A                                      REF(CNDIZION)
000500950728     A          R TNTLT000                  TEXT('TRAINI - TESTATA TRAINI')
000600950725     A            TLTTRN    R               REFFLD($TRN)
000700950725     A            TLTDDE    R               REFFLD($DA8)
000800950725     A                                      TEXT('DATA DECORRENZA')
000900951102     A                                      COLHDG('DECORRENZA')
001000950725     A            TLTDSC    R               REFFLD($DA8)
001100950725     A                                      TEXT('DATA SCADENZA')
001200951102     A                                      COLHDG('SCADENZA')
001300950725     A            TLTTFP    R               REFFLD($TFP)
001400950725     A            TLTTFA    R               REFFLD($TFA)
001500950727     A            TLTTTR    R               REFFLD($TTR)
001600950727     A                                      TEXT('TIPO TRAINO: C=CHIUSO,S=SOLO +
001700950725     A                                      ANDATA,D=DEFL,A=AFFL.')
001800950727     A            TLTGSE         7          TEXT('GIORNI SETTIMANA PARTENZA: 1=+
001900950725     A                                      LUN,2=MAR,3=MER,ECC. ')
002000950727     A            TLTBIS         1          TEXT('B=BIS , E=ECCEZIONALE')
002100950727     A            TLTTMZ         2          TEXT('TIPO AUTOMEZZO (TAB. 3U)')
002200951024     A            TLTFES    R               REFFLD($FIL)
002300951024     A                                      TEXT('FILIALE CHE ESPONE IMPORTO SU+
002400951024     A                                       F.V.')
002500950727     A            TLTDIR    R               REFFLD($DA8)
002600950727     A                                      TEXT('DATA INSERIMENTO RECORD')
002700951102     A                                      COLHDG('DATA INSERIMENTO')
002800950727     A            TLTDUV    R               REFFLD($DA8)
002900950727     A                                      TEXT('DATA ULTIMA VARIAZIONE')
003000951102     A                                      COLHDG('DATA VARIAZIONE')
003100951102     A            TLTFTR    R               REFFLD($FTR)
003200950725     A            TLTDTR    R               REFFLD($DTR)
003300950725     A            TLTATB    R               REFFLD($ATB)
