000100000000     A*--------------------------------------------------------------*
000200060116     A*  VALORIZZAZIONE TEMPI STANDARD ATTIVITÀ ATT/PRG/DTA
000300000000     A*--------------------------------------------------------------*
000500060116     A          R TNTUS000                  PFILE(TNTUS00F)
000600060116     A          K TUSATT
000700060116     A          K TUSPRG
000800060116     A          K TUSDTA
000900060118     A          K TUSFIL
001000060118     A          K TUSREP
