000100991027      *PARMS MBR(*NONE) MAXMBRS(*NOMAX)
000200910516     A                                      REF(CNDIZION)
000300991027     A          R TNVXS000                  TEXT('C/ASSEGNI AL CLIENTE +
000400991027     A                                      VIA INTERNET')
000500020611     A            VXSLNP    R     A         REFFLD($LNP)
000600020611     A            VXSLNA    R     A         REFFLD($LNA)
000700020611     A            VXSAAS    R     A         REFFLD($AAS)
000800020611     A            VXSNRS    R     A         REFFLD($NRS)
000900020611     A            VXSNSP    R     A         REFFLD($NSP)
001000020611     A            VXSRMN    R     A         REFFLD($RMN)
001100020611     A            VXSCAS    R     A         REFFLD($CAS)
001200941202     A            VXSVCA    R               REFFLD($VCA)
001300941202     A            VXSNRA    R               REFFLD($NRA)
001400910611     A                                      TEXT('NR. RIF. ASSEGNO INCASSATO')
001500910611     A                                      COLHDG('NR.ASSEGNO' 'INCASSATO')
001600020611     A            VXSDTE    R     A         REFFLD($DTE)
001700910611     A                                      TEXT('DATA ASSEGNO INCASSATO')
001800910611     A                                      COLHDG('DATA' 'ASSEGNO' 'INCAS.')
001900941202     A            VXSTPI         1          TEXT('TIPO INTEST. M=MITTENTE')
002000020611     A            VXSABI    R     A         REFFLD($ABI)
002100910611     A                                      TEXT('COD. ABI ASSEGNO INC.')
002200020611     A            VXSCAI    R     A         REFFLD($CAB)
002300910611     A                                      TEXT('COD. CAB ASSEGNO INC.')
002400020611     A            VXSNDP    R     A         REFFLD($NDP)
002500020611     A            VXSDDP    R     A         REFFLD($DDP)
002600941202     A            VXSCCB    R               REFFLD($CCB)
002700020611     A            VXSABP    R     A         REFFLD($ABI)
002800910611     A                                      TEXT('COD. ABI PAGAM.')
002900020611     A            VXSCAP    R     A         REFFLD($CAB)
003000910611     A                                      TEXT('COD. CAB PAGAM.')
003100941202     A            VXSFPC    R               REFFLD($FLA)
003200910625     A                                      TEXT('TIPO PAGAM. C/A')
003300020611     A            VXSDVA    R     A         TEXT('DATA VALUTA')
003400940926     A                                      REFFLD($DA8)
003500020611     A            VXSKSC    R     A         TEXT('CODICE CLIENTE MITTENTE')
003600921127     A                                      REFFLD($KSC)
003700941202     A            VXSRMA    R               REFFLD($RMA)
