000100000000     A*--------------------------------------------------------------*
000200070608     A*     CERTIFICAZIONI AUTOTRASPORTATORI CITTA
000300000000     A*--------------------------------------------------------------*
000400120914     A          R TRACDF0
000500120914     A            TRALOCI        1A         TEXT('FLAG CENTRO ST/LOC.TURIST.')
000600120914     A                                      COLHDG('CEN' 'ST/LOC')
000601130710     A            TRADIPA        1A         TEXT('FLAG DIPENDENTE O AUTONOMO')
000602130710     A                                      COLHDG('DIP.' 'AUTON.')
000700130710     A            TRALIBERO     14A         TEXT('LIBERO')
000800020827     A*
