000100000000     A*------------------------------------------------------------------------*
000200000000     A* UNITA' EDP
000300000000     A*------------------------------------------------------------------------*
000400000000     A          R UNANA000                  PFILE(UNANA00F)
000500000000     A          K UNADSM
000600000000     A*-----------------
000700000000     A* INDICI -->
000800000000     A* . DATA SCADNEZA MANUTENZIONE
000900000000     A*-----------------
