000100000000     A*------------------------------------------------------------------------*
000200140321     A* COMODATI
000300000000     A*------------------------------------------------------------------------*
000400140321     A          R UNCMD000                  PFILE(UNCMD00F)
000500140324     A          K CMDCNN
000900000000     A*-----------------
001000000000     A* INDICI -->
001100140324     A* . NUMERO CONTRATTO
