000100000000     A*------------------------------------------------------------------------*
000200000000     A* MOVIMENTI UNITA' EDP
000300000000     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500000000     A          R UNMOV000                  TEXT('MOVIMENTI UNITA'' EDP')
000600000000     A            UNMTIP         2  0       TEXT('TIPO UNITA')
000700000000     A                                      COLHDG('TIPO' 'UNITA''')
000800000000     A            UNMCOD         5  0       TEXT('CODICE UNITA''')
000900000000     A                                      COLHDG('CODICE' 'UNITA''')
001000110406     A            UNMMAT        15A         TEXT('MATRICOLA')
001100110406     A                                      COLHDG('MATRICOLA')
001200000000     A            UNMCAU         4A         TEXT('CAUSALE MOVIMENTO')
001300000000     A                                      COLHDG('CAUS' 'MOV')
001400000000     A            UNMTMO         1A         TEXT('TIPO MOVIMENTO')
001500000000     A                                      COLHDG('TIPO' 'MOV')
001600971009     A            UNMDTM         8  0       TEXT('DATA MOVIMENTO')
001700000000     A                                      COLHDG('DATA' 'MOV')
001800000000     A            UNMPRG         7  0       TEXT('PROGRESSIVO MOVIMENTO')
001900000000     A                                      COLHDG('PRG' 'MOV')
002000000000     A            UNMMAG         3  0       TEXT('MAGAZZINO MOVIMENTO')
002100000000     A                                      COLHDG('MAG' 'MOV')
002200000000     A            UNMMGC         3  0       TEXT('MAGAZZINO CORRELATO')
002300000000     A                                      COLHDG('MAG' 'CORR')
002400000000     A            UNMDES        30A         TEXT('DESCRIZIONE MOVIMENTO')
002500000000     A                                      COLHDG('DESCRIZIONE')
002600000000     A            UNMDOC         7  0       TEXT('DOCUMENTO')
002700000000     A                                      COLHDG('DOCUMENTO')
002800971009     A            UNMDDO         8  0       TEXT('DATA DOCUMENTO')
002900000000     A                                      COLHDG('DATA' 'DOCUMENTO')
003000000000     A            UNMCNT         9  0       TEXT('CONTATORE')
003100000000     A                                      COLHDG('CONTATORE')
003200020320     A            UNMKSC         7  0       TEXT('CLIENTE')
003300020320     A                                      COLHDG('CLIENTE')
003400000000     A            UNMFTR    R               REFFLD($FTR)
003500000000     A            UNMDTR    R               REFFLD($DTR)
003600000000     A            UNMATB    R               REFFLD($ATB)
003700100908     A            UNMRESO        1A         TEXT('UNITÀ VRESA')
003800100908     A            UNMMAUT        1A         TEXT('S=MOVIMENTO AUTOMATICO CREATO-
003900100908     A                                       DAI MOV.GIORNALIERI')
004000100908     A            UNMDAT         8  0       TEXT('DATA LIBERA')
004100100908     A                                      COLHDG('DATA')
004200100908     A            UNMFLO        15A         TEXT('DA UTILIZ')
