000100000000     A*--------------------------------------------------------------*
000200160209     A*     CERTIFICAZIONI AUTOTRASPORTATORI SOCIETA'
000300000000     A*--------------------------------------------------------------*
000400890919     A                                      REF(CNDIZION)
000500160209     A          R WAITRAM
000600050801     A
000700050801     A            TRADIST        1A         TEXT('DISTRETTO')
000800050801     A                                      COLHDG('DIST.')
000900050803     A            TRAAREA        3P 0       TEXT('AREA')
001000050801     A                                      COLHDG('AREA')
001100910710     A            TRAFIL    R               REFFLD($FIL)
001200910710     A                                      TEXT('CODICE FILIALE/AGENZIA')
001300920522     A            TRAAUT        25A         TEXT('NOMINATIVO AUTISTA')
001400920522     A                                      COLHDG('AUTISTA')
001500090625     A            TRAKAU         7P 0       TEXT('COD AUT.CITTÀ')
001600090625     A                                      COLHDG('COD AUT.CITTÀ')
001700160209     A            TRABPT         7P 0       TEXT('COD AUT.AF/DE')
001800160209     A                                      COLHDG('COD AUT.AF/DE')
001900160209     A            TRSIVA        16A         TEXT('PARTITA IVA SOCIETÀ')
002000160209     A                                      COLHDG('PART. I.V.A.SOC')
002100160209     A            TRAIVAS       16A         TEXT('PARTITA IVA CONSORZIATA')
002200160209     A                                      COLHDG('P.I.V.A.CONSORZIATA')
002300151116     A            TRASOCL       44A         TEXT('NOMINATIVO SOCIETA')
002400151116     A                                      COLHDG('NOM.SOCIETA ESTESO')
002500160209     A            TRADURC        8P 0       TEXT('DATA DURC')
002600160209     A            TRAUNIL        8P 0       TEXT('DATA UNILAV')
002700170628     A            TRADIPA        1A         TEXT('DIPEN/AUTON/INTERIN')
002800160210     A            TRAITAEST      1A         TEXT('ITALIA ESTERO I/E')
002900160209     A            TRADTSPS       8P 0       TEXT('DATA SCAD.PERM.SOGGIORNO')
003000160209     A            TRADTRPS       8P 0       TEXT('DATA RINN.PERM.SOGGIORNO')
003100160210     A            TRANRC         7P 0       TEXT('NUMERO CONTRATTO')
003200160210     A                                      COLHDG('NUMERO' 'CONTRATTO')
003300050802     A          K TRAFIL
003400160210     A          K TRANRC
003500020827     A*
