000100100510      *---------------------------------------------------------------*
000200150909      *?WORKFILE N.ORM PER MITTENTE CODIFICATO E LNP BOLLA LEGATA    ?*
000300100510      *---------------------------------------------------------------*
000400100510     A                                      REF(CNDIZION)
000500100510     A          R WFACV000                  TEXT('WF VISITE COMM.LI CO-
000600100510     A                                      N RAGGR.AREA <> DA UNIF.')
000700100510      * Parametri di lancio
000800100510     A            WACUTE    R               REFFLD($PRU)
000900100510     A                                      TEXT('Profilo utente')
001000100510     A                                      COLHDG('Utente' +
001100100510     A                                             'Lancio')
001200100510     A            WACDTA    R               REFFLD($DA8)
001300100510     A                                      TEXT('Data di lancio')
001400100510     A                                      COLHDG('Data  ' +
001500100510     A                                             'Lancio')
001600100510     A                                      EDTWRD('    /  /  ')
001700100510      * Visita
001800100510     A            WACNRV    R               REFFLD($NRV)
001900100510     A                                      TEXT('Numero visita')
002000100510     A                                      COLHDG('Numero' +
002100100510     A                                             'Visita')
002200100510     A            WACDVI    R               REFFLD($DVI)
002300100510     A                                      TEXT('Data visita')
002400100510     A                                      COLHDG('Data  ' +
002500100510     A                                             'Visita')
002600100510      * Commerciale
002700100510     A            WACCMM    R               REFFLD($CMM)
002800100510     A                                      TEXT('Codice commerciale')
002900100510     A                                      COLHDG('Codice ' +
003000100510     A                                             'Comm.le')
003100100510     A            WACCMMD   R               REFFLD($CMD)
003200100510     A                                      TEXT('Decodifica commercia-
003300100510     A                                      le')
003400100510     A                                      COLHDG('Decod. ' +
003500100510     A                                             'Comm.le')
003600100510      * Raggruppamento Area Commerciale
003700100510     A            WACARA    R     P         REFFLD($CAR)
003800100510     A                                      TEXT('Raggruppamento area -
003900100510     A                                      commerciale')
004000100510     A                                      COLHDG('Ragg.Area' +
004100100510     A                                             '  Comm.le')
004200100510     A            WACARAD   R               REFFLD(§05DES    DS05)
004300100510     A                                      TEXT('Descrizione raggrupp-
004400100510     A                                      amento area commerciale')
004500100510     A                                      COLHDG('Descr. Ragg.' +
004600100510     A                                             'Area Comm.le')
004700100510      * Commerciale Unificante
004800100510     A            WACCMU    R               REFFLD($CMM)
004900100510     A                                      TEXT('Codice commerciale u-
005000100510     A                                      nificante da tab. "01"')
005100100510     A                                      COLHDG('Comm.le' +
005200100510     A                                             'Unific.')
005300100510     A            WACCMUD   R               REFFLD($CMD)
005400100510     A                                      TEXT('Decodifica commercia-
005500100510     A                                      le unificante')
005600100510     A                                      COLHDG('    Decodifca' +
005700100510     A                                             'Comm.le Unif.')
005800100510      * Raggruppamento Area Commerciale Unificante
005900100510     A            WACARU    R     P         REFFLD($CAR)
006000100510     A                                      TEXT('Raggruppamento area -
006100100510     A                                      unificante')
006200100510     A                                      COLHDG('Ragg.Area' +
006300100510     A                                             '    Unif.')
006400100510     A            WACARUD   R               REFFLD(§05DES    DS05)
006500100510     A                                      TEXT('Descrizione raggrupp-
006600100510     A                                      amento area comm.le unificante')
006700100510     A                                      COLHDG('Descr. Ragg.' +
006800100510     A                                             '  Area Unif.')
