000100100510      *---------------------------------------------------------------*
000200150909      *?WORKFILE N.ORM PER MITTENTE CODIFICATO E LNP BOLLA LEGATA    ?*
000300100510      *---------------------------------------------------------------*
000400100510     A                                      REF(CNDIZION)
000500150909     A          R WFACR000                  TEXT('WF N.ORM X CRA E LNP')
000600150909
000700150909     A            WACRCRA   R               REFFLD($CRO)
000800150909     A                                      TEXT('CODICE MITTENTE RITIRO')
000900150909     A                                      COLHDG('CODICE' 'MITTENTE' 'RITIRO')
001000150909     A            WACRRAG   R               REFFLD($RSC)
001100150909     A                                      TEXT('RAGIONE SOCIALE')
001200150909     A                                      COLHDG('RAGIONE' 'SOCIALE')
001300150909     A            WACRLNP   R               REFFLD($FIL)
001400150909     A                                      TEXT('LINEA DI PARTENZA')
001500150909     A                                      COLHDG('LNP')
001600150909     A            WACRORM        5S 0       TEXT('N.ORM')
001700150909     A                                      COLHDG('N.ORM')
001800150909     A            WACRPER        5S 2       TEXT('% INCIDENZA')
001900150909     A                                      COLHDG('%')
