000100000000     A*--------------------------------------------------------------*
000200061121     A* ARCHIVIO STORICO ANAGRAFICHE FORNITORI IN AUTOFATTURAZ.
000300000000     A*--------------------------------------------------------------*
000400931005     A                                      REF(CNDIZION)
000500061121     A          R TNANF000                  TEXT('STORICO ANAGRAFICA +
000600061121     A                                       FORNITORI IN AUTOFAT.')
000700061120     A            ANFATB    R               REFFLD($ATB)
001300061121     A            ANFTRC    R               REFFLD($TRC)
001301080919     A                                      TEXT('0=TESTA/1=RIGA/2=ADEG.CARB.')
001304061121     A            ANFTIP    R               REFFLD($TIP)
001305061120     A                                      TEXT('A=AUTOTR./C=COOP/+
001306070607     A                                      D=AFF+DEFL/T=TRAZION.')
001308070607     A            ANFTSR    R               REFFLD($TSR)
001309070607     A                                      TEXT('A=AUTOTR./C=COOP/+
001310070607     A                                      D=AFF+DEFL/T=TRAZION./+
001311070607     A                                      O=OCCASIONALI')
001400061120     A            ANFSOC    R               REFFLD($SOC)
001500061120     A            ANFCDF    R               REFFLD($CDF)
001600061120     A            ANFNFF    R               REFFLD($NFF)
001700061120     A            ANFDFT    R               REFFLD($DFT)
001701061121     A            ANFPDR    R               REFFLD($PDR)
001800080919     A            ANFUNI      1000          TEXT('DS DANF0/DANF1/DANF2')
001900061120     A                                      VARLEN
