000100180307      *-----------------------------------------------------------------------*
000200180307      *  WORK-FILE ANALISI RA PER OBIETTIVO - Dettaglio Spedizione            *
000300180307      *-----------------------------------------------------------------------*
000400180309     A          R WFARA100                  TEXT('ANALISI RA X OBIETTIVO -
000500180312     A                                      Dettaglio Sped.')
000600180307
000700180307     A            ARA1USER      10A         TEXT('Profilo Utente')
000800180309     A                                      COLHDG('Profilo' 'Utente')
000900180307     A            ARA1DTINI      8S 0       TEXT('Data Inizio Elaborazione')
001000180309     A                                      COLHDG('Inizio' 'Elab.')
001100180307     A            ARA1DTFIN      8S 0       TEXT('Data Fine Elaborazione')
001200180309     A                                      COLHDG('Fine' 'Elab.')
001300180312     A            ARA1AREA       3S 0       TEXT('Area Richiesta')
001400180312     A                                      COLHDG('Area' 'Rich.')
001500180312     A            ARA1FIL        3S 0       TEXT('Filiale Richiesta')
001600180312     A                                      COLHDG('Fil' 'Rich.')
001700180312     A            ARA1AAS        4S 0       TEXT('Anno Spedizione')
001800180312     A                                      COLHDG('Anno')
001900180312     A            ARA1LNP        3S 0       TEXT('Linea di Partenza')
002000180312     A                                      COLHDG('Linea' 'Partenza')
002100180312     A            ARA1NRS        2S 0       TEXT('Serie')
002200180312     A                                      COLHDG('Serie')
002300180312     A            ARA1NSP        7S 0       TEXT('N. Spedizione')
002400180312     A                                      COLHDG('Nr.' 'Sped.')
002500180312     A            ARA1DSP        8S 0       TEXT('Data Spedizione')
002600180312     A                                      COLHDG('Data' 'Sped.')
002700180312     A            ARA1DCM        8S 0       TEXT('Data Consegna')
002800180312     A                                      COLHDG('Data' 'Cons.')
002900180312     A            ARA1HMC        6S 0       TEXT('Ora Consegna')
003000180312     A                                      COLHDG('Ora' 'Cons.')
003100180312     A            ARA1POT        3S 0       TEXT('Filiale apertura RA')
003200180312     A                                      COLHDG('Filiale' 'Apertura')
003300180307     A            ARA1MAD        3          TEXT('Motivo apertura RA')
003400180309     A                                      COLHDG('Motivo' 'Apertura')
003500180308     A            ARA1DAC        8S 0       TEXT('Data Apertura RA')
003600180309     A                                      COLHDG('Data' 'Apertura')
003700180308     A            ARA1ORC        6S 0       TEXT('Ora Apertura RA')
003800180309     A                                      COLHDG('Ora' 'Apertura')
003900180307     A            ARA1D82        8S 0       TEXT('Data Alert 82')
004000180309     A                                      COLHDG('Data' 'A82')
004100180307     A            ARA1H82        6S 0       TEXT('Ora Alert 82')
004200180309     A                                      COLHDG('Ora' 'A82')
004300180307     A            ARA1D81        8S 0       TEXT('Data Alert 81')
004400180309     A                                      COLHDG('Data' 'A81')
004500180307     A            ARA1H81        6S 0       TEXT('Ora Alert 81')
004600180309     A                                      COLHDG('Ora' 'A81')
004700180307     A            ARA1D84        8S 0       TEXT('Data Alert 84')
004800180309     A                                      COLHDG('Data' 'A84')
004900180307     A            ARA1H84        6S 0       TEXT('Ora Alert 84')
005000180309     A                                      COLHDG('Ora' 'A84')
005100180307     A            ARA1D87        8S 0       TEXT('Data Alert 87')
005200180309     A                                      COLHDG('Data' 'A87')
005300180307     A            ARA1H87        6S 0       TEXT('Ora Alert 87')
005400180309     A                                      COLHDG('Ora' 'A87')
