000100000000     A*------------------------------------------------------------------------*
000200101221     A*  FILE WORK - PER AUMENTO OFFERTE                                       *
000300030311     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500101221     A          R WFAUT000                  TEXT('WF PER AUMENTO OFFERTE')
001500101221     A            WFANRV    R               REFFLD($NRV)
001501101221     A            WFARAG    R               REFFLD(ACORAG)
001502101221     A            WFACMM    R               REFFLD($CMM)
006200031031     A            WFAELA         1          TEXT('FLAG ELABORATO: S/ =SOLO PER +
006300081127     A                                       AUMENTO TARIFFE')
006400081127     A            WFACTRV        3S 0       TEXT('TARIFFA CLIENTE')
006500081127     A            WFAPRGV        3S 0       TEXT('PROGRESSIVO TARIFFA CLIENTE')
006700081127     A            WFADDTV   R     S         REFFLD($DDT)
006800081127     A                                      EDTWRD('    /  /  ')
006900081127     A            WFADSTV   R     S         REFFLD($DST)
007000081127     A                                      EDTWRD('    /  /  ')
007100101216     A            WFARPVV   R               REFFLD($RPV)
008400101216     A            WFARPVN   R               REFFLD($RPV)
