000100000000     A*------------------------------------------------------------------------*
000200150413     A*  FILE WORK - BANCALI DA RENDERE CLIENTI E FILIALI SEDE
000300030311     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500150413     A          R WFBAS000                  TEXT('WF PER CONTROLLO BANCALI')
000600150402     A            WGBKSU    R               REFFLD($KSU)
000700150408     A                                      TEXT('CODICE CLI/FIL')
000800150402     A            WGBRAGS       44A
000900150408     A                                      TEXT('RAGIONE SOCIALE CLI/FIL')
001000150408     A                                      COLHDG('RAG.SOC.CLI/FIL')
001100150402     A            WGBCOD1       15A
001200150402     A                                      TEXT('COD.ARTICOLO ')
001300150402     A                                      COLHDG('COD.ART.')
001400150408     A            WGBCODD       20A
001500150408     A                                      TEXT('DES.ARTICOLO ')
001600150408     A                                      COLHDG('DES.ART.')
001700150408     A            WGBBAN        10  0       TEXT('NUMERO BANCALI DA RENDERE')
001800150413     A            WPETIP         3A
001900150413     A                                      TEXT('TIPO ANAGRAFICA')
002000150413     A                                      COLHDG('TP.ANAG.')
002100150402     A            WPERAG    R               REFFLD($RSM)
002200150402     A                                      TEXT('RAGIONE SOCIALE             ')
002300150402     A            WPEIND    R               REFFLD($INM)
002400150402     A                                      TEXT('INDIRIZZO                   ')
002500150402     A            WPECAP    R               REFFLD($CAM)
002600150402     A                                      TEXT('C.A.P.                      ')
002700150402     A            WPELOC    R               REFFLD($LOM)
002800150402     A                                      TEXT('LOCALITA"                   ')
002900150402     A            WPEPRO    R               REFFLD($PRM)
003000150402     A                                      TEXT('PROVINCIA')
003100150402     A            WPENAZ    R               REFFLD($NZM)
003200150402     A                                      TEXT('NAZIONE ')
003300150402     A            WPETEL    R               REFFLD(INDTEL)
003400150402     A            WPEPER        35A         TEXT('PERSONA A CUI RIVOLGERSI    ')
