000100000913     A*------------------------------------------------------------------------*
000200110218     A* VISTA LOGICA WF PER BANCALI                                            *
000300000913     A*------------------------------------------------------------------------*
000400110218     A          R WFBAN000                  PFILE(WFBAN00F)
000500110218     A          K BANLNP
000600110218     A          K BANLNA
000700110218     A          K BANTIPB
000800031105      *
