000100100219     A          R WFCLN000                  TEXT('AFFIDABILITA C.L.N.')
000200071023     A*
000300100219     A            WCLNCCM        7S 0       TEXT('CCM CLIENTE')
000400100219     A            WCLNAAAAMM     6S 0       TEXT('ANNO/MESE')
000500100219     A            WCLNREG       25A         TEXT('REGIONE')
000600100219     A            WCLNPRD        2A         TEXT('PROVINCIA')
000700100219     A            WCLNCAD        9A         TEXT('CAP')
000800100219     A            WCLNISO        1A         TEXT('I=ISOLA')
000900100219     A            WCLNANOM       1A         TEXT('S=DIR+GIAC+CCA')
001000100219     A*
001100100219     A            WCLNDLYTRC     3S 0       TEXT('TEMPO RESA CLI. TEORICO')
001200100219     A            WCLNANT        7S 0       TEXT('NUM. SPED. >= -999 <= -24')
001300100222     A            WCLNM12        7S 0       TEXT('NUM. SPED. >   -24 <= -12')
001400100222     A            WCLNOKS        7S 0       TEXT('NUM. SPED. >   -12 <=   0')
001500150210     A            WCLNR12        7S 0       TEXT('NUM. SPED. >     0 <=  12')
001600150210     A            WCLNR24        7S 0       TEXT('NUM. SPED. >    12 <=  24')
001700150210     A            WCLNRIT        7S 0       TEXT('NUM. SPED. >    24')
001800100219     A            WCLNTOT        7S 0       TEXT('NUM. SPED. TOTALI')
001900050526     A*
002000100219     A          K WCLNCCM
002100100219     A          K WCLNAAAAMM
002200100219     A          K WCLNPRD
002300100219     A          K WCLNCAD
002400100219     A          K WCLNISO
002500100219     A          K WCLNANOM
