000100020604     A*------------------------------------------------------------------------*
000200020604     A*                 - WORKFILE STAMPA CLIENTI POTENZIALI -                 *
000300020604     A*------------------------------------------------------------------------*
000400020604     A                                      REF(CNDIZION)
000500020604     A          R WFCPO000                  TEXT('WFILE STAMPA CLIENTI POTENZIA-
000600020604     A                                      LI')
000700020604     A            WFCDIS    R               REFFLD($DIT)
000800020604     A                                      TEXT('Codice Distretto')
000900020604     A                                      COLHDG('Cod.' 'Dis.')
001000020604     A            WFCARE    R               REFFLD($CAR)
001100020604     A                                      TEXT('Codice Area')
001200020604     A                                      COLHDG('Cod.' 'Area')
001300020604     A            WFCUNI    R               REFFLD($CSC)
001400020604     A                                      TEXT('Codice Cliente Unificante')
001500020604     A                                      COLHDG('Cliente' 'Unific.')
001600020604     A            WFCCMM    R               REFFLD($CMM)
001700020604     A                                      TEXT('Codice Cliente Commerciale')
001800020604     A                                      COLHDG('Cliente' 'Commer.')
001900020604     A            WFCCPO    R               REFFLD($CPO)
002000020604     A                                      TEXT('Codice Potenziale')
002100020604     A                                      COLHDG('Codice' 'Potenziale')
002200090521     A            WFCRST        35
002300090521     A                                      TEXT('DATI IN DS DCPO01')
002400090521     A                                      COLHDG('DS DCPO01')
002500090521     A            WFCRAG    R               REFFLD(ACORAG)
