000100121204      *--------------------------------------------------------------*
000200140721      * WORK-FILE ANAGRAFICO CLIENTI POTENZIALI - DA TFACO00F        *
000300121204      *--------------------------------------------------------------*
000400140723     A          R TNCPO000                  FORMAT(TNCPO00F)
