000100120208     A*------------------------------------------------------------------------*
000200120315     A*  WILE WORK - TOTALI TASSAZIONE AZIENDA VARIAZIONE PESI                 *
000300120208     A*------------------------------------------------------------------------*
000400120208     A                                      REF(CNDIZION)
000500120315     A          R WFCTP100                  TEXT('WF CONTR.TASSAZ.(TOTALI)')
000600120315     A            CTP1TPR        1A         TEXT('TIPO TASSAZIONE:0=PESO UGUALE+
000700120323     A                                      ;3=PESO-3%;6=PESO-6%;9=PESO-9%;M=MA+
000701120323     A                                      NCA TAR,;S=SCARTATE; =CONSIDERATE')
000800120315     A            CTP1TPES      13S 1       TEXT('TOTALE PESO USATO TASSAZIONE')
000900120315     A            CTP1TIMV      13S 3       TEXT('TOTALE IMPONIBILE')
001000120315     A            CTP1TPOR      13S 3       TEXT('TOTALE PORTO')
001100120315     A            CTP1TVA2      13S 3       TEXT('TOTALE VARIA 2-INOLTRO')
001200120315     A            CTP1TVA5      13S 3       TEXT('TOTALE VARIA 5-DIR.PESAT')
001300120315     A            CTP1TVAAPA    13S 3       TEXT('TOTALE VARIA &-ANN.P/ASSEGNA-
001400120315     A                                      TO')
001500120315     A            CTP1TVADIR    13S 3       TEXT('TOTALE VARIA *-DIROTTAMENTO')
001600120315     A            CTP1TVASCA    13S 3       TEXT('TOTALE VARIA +-SUPPL.CARBURA-
001700120315     A                                      NTE')
001800120315     A            CTP1TVARBA    13S 3       TEXT('TOTALE VARIA =-RESO BANCALI')
001900120315     A            CTP1TVAAA     13S 3       TEXT('TOTALE VARIA a-POD IMAGE')
002000120315     A            CTP1TVAA      13S 3       TEXT('TOTALE VARIA A-APPUNTAMENTO')
002100120315     A            CTP1TVABB     13S 3       TEXT('TOTALE VARIA b-ADD.GEST.C.')
002200120315     A            CTP1TVAB      13S 3       TEXT('TOTALE VARIA B-CONS.DDT')
002300120315     A            CTP1TVACC     13S 3       TEXT('TOTALE VARIA c-L.AVVISO')
002400120315     A            CTP1TVAC      13S 3       TEXT('TOTALE VARIA C-FACCH.ARR.')
002500120315     A            CTP1TVADD     13S 3       TEXT('TOTALE VARIA d-A.C. BASE')
002600120315     A            CTP1TVAD      13S 3       TEXT('TOTALE VARIA D-INVIO FATT.')
002700120315     A            CTP1TVAEE     13S 3       TEXT('TOTALE VARIA e-PRIORITY')
002800120315     A            CTP1TVAFF     13S 3       TEXT('TOTALE VARIA f-FUEL SURCH.')
002900120315     A            CTP1TVAF      13S 3       TEXT('TOTALE VARIA F-FUORI MISURA')
003000120315     A            CTP1TVAG      13S 3       TEXT('TOTALE VARIA G-COMP.ASSEGNO')
003100120315     A            CTP1TVAHH     13S 3       TEXT('TOTALE VARIA h-H 10:30')
003200120315     A            CTP1TVAH      13S 3       TEXT('TOTALE VARIA H-DIR.FISSO')
003300120315     A            CTP1TVAI      13S 3       TEXT('TOTALE VARIA I-SP.GIACENZA')
003400120315     A            CTP1TVAJ      13S 3       TEXT('TOTALE VARIA J-ISOLA')
003500120315     A            CTP1TVAK      13S 3       TEXT('TOTALE VARIA K-LOC.DISAGIATA')
003600120315     A            CTP1TVAL      13S 3       TEXT('TOTALE VARIA L-I.S.T.A.T.')
003700120315     A            CTP1TVAMM     13S 3       TEXT('TOTALE VARIA m-AVV.AFFID.')
003800120315     A            CTP1TVAM      13S 3       TEXT('TOTALE VARIA M-SPESE INSOL.')
003900120315     A            CTP1TVAN      13S 3       TEXT('TOTALE VARIA N-ANTEPORTO')
004000120315     A            CTP1TVAO      13S 3       TEXT('TOTALE VARIA O-RIC.DOCUM.')
004100120315     A            CTP1TVAP      13S 3       TEXT('TOTALE VARIA P-AI PIANI')
004200120315     A            CTP1TVAQ      13S 3       TEXT('TOTALE VARIA Q-ZTL')
004300120315     A            CTP1TVAR      13S 3       TEXT('TOTALE VARIA R-A.C. PLUS')
004400120315     A            CTP1TVAS      13S 3       TEXT('TOTALE VARIA S-SUPERMERC.')
004500120315     A            CTP1TVAT      13S 3       TEXT('TOTALE VARIA T-RITIRO COMM.')
004600120315     A            CTP1TVAU      13S 3       TEXT('TOTALE VARIA U-RITIRO')
004700120315     A            CTP1TVAW      13S 3       TEXT('TOTALE VARIA W-REC.C/ASSEGNI')
004800120315     A            CTP1TVAX      13S 3       TEXT('TOTALE VARIA X-CONS.DISAG.')
004900120315     A            CTP1TVAY      13S 3       TEXT('TOTALE VARIA Y-RITIRO ANN.')
005000120315     A            CTP1TVAZ      13S 3       TEXT('TOTALE VARIA Z-ADD.GEST.AP')
005100120319     A            CTP1TOS       10S 0       TEXT('TOT. SPED. ELABORATE')
