000100020222      *--------------------------------------------------------------------*
000200090811      * WORKFILE STATISTICA DANNI X CLIENTE                                *
000300020222      *--------------------------------------------------------------------*
000400980727     A                                      REF(CNDIZION)
000500090811     A          R WFDAN100                  TEXT('WFILE STATISTICA DANNI X -
000600090811                                            CLIENTE')
000700090811
000800090811     A            DANDATA        8S 0       TEXT('AAAA/MM/GG ELABORAZIONE')
000900090811                                            COLHDG('AAAA/MM/GG' 'ELABORAZIONE')
001000090811     A            DANORA         6S 0       TEXT('HH/MM/SS ELABORAZIONE')
001100090811                                            COLHDG('HH/MM/SS' 'ELABORAZIONE')
001200090811     A            DANPRU        10          TEXT('UTENTE ELABORAZIONE')
001300090811                                            COLHDG('UTENTE' 'ELABORAZIONE')
001400020311     A            DANDIP         6S 0       TEXT('AAAA/MM INIZIO PERIODO ELABOR-
001500020311                                            ATO')
001600020311                                            COLHDG('AAAA/MM INIZIO' 'PERIODO EL-
001700020311                                            ABORATO')
001800020311                                            EDTWRD('    /  ')
001900020311     A            DANDFP         6S 0       TEXT('AAAA/MM FINE PERIODO ELABORAT-
002000020312                                            O')
002100020311                                            COLHDG('AAAA/MM FINE' 'PERIODO ELAB-
002200020311                                            ORATO')
002300020311                                            EDTWRD('    /  ')
002400020222     A            DANKSC    R     S         REFFLD($KSC)
002500020301                                            TEXT('CODICE CLIENTE BOLLA')
002600020409                                            COLHDG('CODICE CLIENTE' 'BOLLA')
002700020222     A            DANRAG    R               REFFLD($RSM)
002800020222                                            TEXT('RAGIONE SOCIALE CLIENTE')
002900020409                                            COLHDG('RAG.SOC. CLIENTE' 'BOLLA')
003000020222     A            DANKUN    R     S         REFFLD($KSC)
003100020222                                            TEXT('CODICE CLIENTE UNIFICANTE')
003200020222                                            COLHDG('COD. CLI.' 'UNIFICANTE')
003300020222     A            DANURA    R               REFFLD($RSM)
003400020222                                            TEXT('RAGIONE SOCIALE CLIENTE UNIFI-
003500020222                                            CANTE')
003600020409                                            COLHDG('RAG.SOC. CLI.' 'UNIFICANTE')
003700020222     A            DANPOR    R     S         REFFLD($FIL)
003800090811                                            TEXT('FIL. UNIFICANTE')
003900090811                                            COLHDG('FIL. UNIFICANTE')
004000090811     A            DANDPR        20          TEXT('DESCRIZIONE FIL. UNIFICANTE')
004100090811                                            COLHDG('DESCRIZIONE' 'FIL.UNIFICANT-
004200090811                                            E')
004300020222     A            DANDIV    R               REFFLD($DIT)
004400090811                                            TEXT('COD. DISTRETTO UNIFICANTE')
004500090811                                            COLHDG('COD.DISTRETTO' 'UNIFICANTE')
004600090811     A            DANDDV        25          TEXT('DISTRETTO FIL. UNIFICANTE')
004700090811                                            COLHDG('DISTRETTO' 'FIL.UNIFICANTE')
004800020222     A            DANARE    R     S         REFFLD($CAR)
004900090811                                            TEXT('CODICE AREA FIL. UNIFICANTE')
005000090811                                            COLHDG('COD. AREA' 'FIL.UNIFICANTE')
005100090811     A            DANDAR        25          TEXT('AREA FIL. UNIFICANTE')
005200090811                                            COLHDG('AREA' 'FIL. UNIFICANTE')
005300020222     A            DANEMA         9S 2       TEXT('EVENTO-MANCANZA: NUM. C.A.')
005400020222                                            COLHDG('NUMERO C.A.' 'EVENTO-MANCAN-
005500020222                                            ZA')
005600020411     A            DANEMC         9S 2       TEXT('EVENTO-MANCANZA: NUM. COLLI')
005700020411                                            COLHDG('NUM. COLLI' 'EVENTO-MANCANZ-
005800020411                                            A')
005900020222     A            DANEMI        13S 3       TEXT('EVENTO-MANCANZA: IMPORTO C.A.-
006000020222                                            ')
006100020222                                            COLHDG('IMPORTO C.A.' 'EVENTO-MANCA-
006200020222                                            NZA')
006300050912     A            DANEMR        13S 3       TEXT('EVENTO-MANCANZA: MAX RIS C.A.-
006400050912                                            ')
006500050912                                            COLHDG('MAX RIS C.A.' 'EVENTO-MANCA-
006600050912                                            NZA')
006700050923     A            DANEMRC        9S 2       TEXT('EVENTO-MANCANZA: COLLI MAX RI-
006800050923                                            S')
006900050923                                            COLHDG('COLLI MAX RIS' 'EVENTO MANC-
007000050923                                            ANZA')
007100020222     A            DANEAM         9S 2       TEXT('EVENTO-AMMANCO: NUM. C.A.')
007200020222                                            COLHDG('NUMERO C.A.' 'EVENTO-AMMANC-
007300020222                                            O')
007400020411     A            DANEAC         9S 2       TEXT('EVENTO-AMMANCO: NUM. COLLI')
007500020411                                            COLHDG('NUM. COLLI' 'EVENTO-AMMANCO-
007600020411                                            ')
007700020222     A            DANEAI        13S 3       TEXT('EVENTO-AMMANCO: IMPORTO C.A.')
007800020222                                            COLHDG('IMPORTO C.A.' 'EVENTO-AMMAN-
007900020222                                            CO')
008000050912     A            DANEAR        13S 3       TEXT('EVENTO-AMMANCO: MAX RIS C.A.')
008100050912                                            COLHDG('MAX RIS C.A.' 'EVENTO-AMMAN-
008200050912                                            CO')
008300050923     A            DANEARC        9S 2       TEXT('EVENTO-AMMANCO: COLLI MAX RIS-
008400050923                                            ')
008500050923                                            COLHDG('COLLI MAX RIS' 'EVENTO AMMA-
008600050923                                            NCO')
008700020222     A            DANEAV         9S 2       TEXT('EVENTO-AVARIA: NUM. C.A.')
008800020222                                            COLHDG('NUMERO C.A.' 'EVENTO-AVARIA-
008900020222                                            ')
009000020411     A            DANEVC         9S 2       TEXT('EVENTO-AVARIA: NUM. COLLI')
009100020411                                            COLHDG('NUM. COLLI' 'EVENTO-AVARIA')
009200020222     A            DANEVI        13S 3       TEXT('EVENTO-AVARIA: IMPORTO C.A')
009300020222                                            COLHDG('IMPORTO C.A.' 'EVENTO-AVARI-
009400020222                                            A')
009500050912     A            DANEVR        13S 3       TEXT('EVENTO-AVARIA: MAX RIS C.A')
009600050912                                            COLHDG('MAX RIS C.A.' 'EVENTO-AVARI-
009700050912                                            A')
009800050923     A            DANEVRC        9S 2       TEXT('EVENTO-AVARIA: COLLI MAX RIS')
009900050923                                            COLHDG('COLLI MAX RIS' 'EVENTO AVAR-
010000050923                                            IA')
010100020311     A            DANMAN         9S 2       TEXT('MANCANZE: NUM. C.A.')
010200020222                                            COLHDG('NUMERO C.A.' 'MANCANZE')
010300020411     A            DANMAC         9S 2       TEXT('MANCANZE: NUM. COLLI')
010400020411                                            COLHDG('NUM. COLLI' 'MANCANZE')
010500020222     A            DANMAI        13S 3       TEXT('MANCANZE: IMPORTO C.A.')
010600020222                                            COLHDG('IMPORTO C.A.' 'MANCANZE')
010700050912     A            DANMAR        13S 3       TEXT('MANCANZE: MAX RIS C.A.')
010800050912                                            COLHDG('MAX RIS C.A.' 'MANCANZE')
010900050923     A            DANMARC        9S 2       TEXT('MANCANZE: COLLI MAX RIS')
011000050923                                            COLHDG('COLLI MAX RIS' 'MANCANZE')
011100020311     A            DANAMM         9S 2       TEXT('AMMANCO: NUM. C.A.')
011200020222                                            COLHDG('NUMERO C.A.' 'AMMANCO')
011300020411     A            DANAMC         9S 2       TEXT('AMMANCO: NUM. COLLI')
011400020411                                            COLHDG('NUM. COLLI' 'AMMANCO')
011500020222     A            DANAMI        13S 3       TEXT('AMMANCO: IMPORTO C.A.')
011600020222                                            COLHDG('IMPORTO C.A.' 'AMMANCO')
011700050912     A            DANAMR        13S 3       TEXT('AMMANCO: MAX RIS C.A.')
011800050912                                            COLHDG('MAX RIS C.A.' 'AMMANCO')
011900051003     A            DANAMRC        9S 2       TEXT('AMMANCO: COLLI MAX RIS')
012000051003                                            COLHDG('COLLI MAX RIS' 'AMMANCO')
012100020311     A            DANAVA         9S 2       TEXT('AVARIA: NUM. C.A.')
012200020409                                            COLHDG('NUM. C.A.' 'AVARIA')
012300020411     A            DANAVC         9S 2       TEXT('AVARIA: NUM. COLLI')
012400020411                                            COLHDG('NUM. COLLI' 'AVARIA')
012500020222     A            DANAVI        13S 3       TEXT('AVARIA: IMPORTO C.A.')
012600020222                                            COLHDG('IMPORTO C.A.' 'AVARIA')
012700050912     A            DANAVR        13S 3       TEXT('AVARIA: MAX RIS C.A.')
012800050912                                            COLHDG('MAX RIS C.A.' 'AVARIA')
012900051003     A            DANAVRC        9S 2       TEXT('AVARIA: COLLI MAX RIS')
013000051003                                            COLHDG('COLLI MAX RIS' 'AVARIA')
013100020311     A            DANCHT         9S 2       TEXT('CHIUSURA TECNICA: NUM. C.A.')
013200020222                                            COLHDG('NUMERO C.A.' 'CHIUSURA TECN-
013300020222                                            ICA')
013400020411     A            DANCHC         9S 2       TEXT('CHIUSURA TECNICA: NUM. COLLI')
013500020411                                            COLHDG('NUM. COLLI' 'CHIUSURA TECNI-
013600020411                                            CA')
013700020222     A            DANCHI        13S 3       TEXT('CHIUSURA TECNICA: IMPORTO C.A-
013800020222                                            .')
013900020222                                            COLHDG('IMPORTO C.A.' 'CHIUSURA TEC-
014000020222                                            NICA')
014100050912     A            DANCHR        13S 3       TEXT('CHIUSURA TECNICA: MAX RIS C.A-
014200050912                                            .')
014300050912                                            COLHDG('MAX RIS C.A.' 'CHIUSURA TEC-
014400050912                                            NICA')
014500051003     A            DANCHRC        9S 2       TEXT('CHIUSURA TECNICA: COLLI MAX R-
014600051003                                            IS')
014700051003                                            COLHDG('COLLI MAX RIS' 'CHIUSURA TE-
014800051003                                            CNICA')
014900020222     A            DANTIR        13S 3       TEXT('TOTALE IMPORTO RIMBORSATO')
015000020222                                            COLHDG('TOTALE IMPORTO' 'RIMBORSATO-
015100020222                                            ')
015200020311     A            DANTIT        13S 3       TEXT('TOTALE IMPORTO TRATTENUTO')
015300020311                                            COLHDG('TOTALE IMPORTO' 'TRATTENUTO-
015400020311                                            ')
015500020311     A            DANSPE         9S 0       TEXT('SPEDIZIONI CLIENTE NEL PERIOD-
015600020222                                            O')
015700020222                                            COLHDG('SPEDIZIONI CLIENTE' 'NEL PE-
015800020222                                            RIODO')
015900020412     A            DANCOL         9S 0       TEXT('COLLI CLIENTE NEL PERIODO')
016000020411                                            COLHDG('COLLI CLIENTE' 'NEL PERIODO-
016100020411                                            ')
016200020311     A            DANFAT        15S 3       TEXT('FATTURATO CLIENTE NEL PERIODO-
016300020222                                            ')
016400020222                                            COLHDG('FATTURATO CLIENTE' 'NEL PER-
016500020222                                            IODO')
016600040223     A            DANRIR        16S 3       TEXT('RICAVO REALE CLIENTE NEL PERI-
016700040223                                            ODO - DELTA')
016800040223                                            COLHDG('RICAVO REALE CLI.' 'NEL PER-
016900040223                                            IODO')
017000040223     A            DANRIP        16S 3       TEXT('RICAVO PRESUNTO CLIENTE NEL P-
017100040223                                            ERIODO - DELTA')
017200040223                                            COLHDG('RICAVO PRES. CLI.' 'NEL PER-
017300040223                                            IODO')
