000100871021     A*--------------------------------------------------------------*
000200090206     A* WFILE  MAPPATURA COMMERCIALE, TOTALI POTENZIALI
000300840614     A*--------------------------------------------------------------*
000400920414     A                                      REF(CNDIZION)
000500090210     A          R WFDEMR00                  TEXT('% DI SPESA PRESUNTA TRASPORTI-
000600090210                                             SUL FATTURATO')
000700920414     A*
000800090202     A            DEMARE         3S 0       TEXT('AREA')
000900090206     A            DEMCMERC       5A
001000090210     A            DEMPPERC       5S 2       TEXT('% DI SPESA PRESUNTA TRASP.SUL-
001100090210                                             FATTURATO-AZ.PICCOLE')
001200090212     A            DEMPCLI        7S 0       TEXT('NUMERO CLIENTI BASE DATI PER -
001300090212                                            CALCOLO DELLA %')
001400090210     A            DEMMPERC       5S 2       TEXT('% DI SPESA PRESUNTA TRASP.SUL-
001500090210                                             FATTURATO-AZ.MEDIE')
001600090212     A            DEMMCLI        7S 0       TEXT('NUMERO CLIENTI BASE DATI PER -
001700090212                                            CALCOLO DELLA %')
001800090210     A            DEMGPERC       5S 2       TEXT('% DI SPESA PRESUNTA TRASP.SUL-
001900090210                                             FATTURATO-AZ.GRANDI')
002000090212     A            DEMGCLI        7S 0       TEXT('NUMERO CLIENTI BASE DATI PER -
002100090212                                            CALCOLO DELLA %')
