000100070129      *---------------------------------------------------------------*
000200081120     A          R WFDEI000                  PFILE(WFDEI00F)
000300070129      *
000400081120     A          K DEIARE
000500081120     A          K DEIFIL
000600081216     A          K DEICMMU
000700090126     A          K DEIORD
000800090126     A          K DEICLV
000900090126     A          K DEIRAG
