000100000000     A*------------------------------------------------------------------------*
000200090204     A* STATISTICHE DELTA - DATI ITALIA        UNIFICATO PER PARTITA           *
000300090204     A*                     IVA/CDF
000400030311     A*------------------------------------------------------------------------*
000500000000     A                                      REF(CNDIZION)
000600090205     A          R WADELPC0                  TEXT('WF PC STATISTICA DELTA')
000700090205     A
000800090205     A            WAPUNIO        1          TEXT('U=UNITO PER PIV/CDF' )
000900090205     A            WAPCLIUNI      7S 0       TEXT('CODICE DI UNIONE')
001000090205     A            WAPAAD    R               REFFLD($AAA)
001100090205     A                                      TEXT('ANNO DA')
001200090205     A                                      COLHDG('ANNO DA')
001300090205     A            WAPMMD    R               REFFLD($MMM)
001400090205     A                                      TEXT('MESE DA')
001500090205     A                                      COLHDG('MESE DA')
001600090205     A            WAPAAA    R               REFFLD($AAA)
001700090205     A                                      TEXT('ANNO A')
001800090205     A                                      COLHDG('ANNO A')
001900090205     A            WAPMMA    R               REFFLD($MMM)
002000090205     A                                      TEXT('MESE A')
002100090205     A                                      COLHDG('MESE A')
002200090205     A            WAPIOE    R               REFFLD($FLA)
002300090205     A                                      TEXT('DATI ITALIA/ESTERO ')
002400090205     A                                      COLHDG('ITA/EST')
002500090205     A            WAPDIV    R               REFFLD($DIT)
002600090205     A                                      TEXT('DISTRETTO CLIENTE')
002700090205     A                                      COLHDG('DIS. CLI')
002800090205     A            WAPDID        25          TEXT('DESRIZIONE DISTRETTO')
002900090205     A                                      COLHDG('DES. DISTRETTO')
003000090205     A            WAPARE    R               REFFLD($CAR)
003100090205     A                                      TEXT('AREA CLIENTE')
003200090205     A                                      COLHDG('ARE CLI')
003300090205     A            WAPARD        25          TEXT('DESRIZIONE AREA')
003400090205     A                                      COLHDG('DES. AREA')
003500090205     A            WAPFIL    R               REFFLD($FIL)
003600090205     A                                      TEXT('FILIALE CLIENTE')
003700090205     A                                      COLHDG('FIL CLI')
003800090205     A            WAPFID        25          TEXT('DESRIZIONE FILIALE')
003900090205     A                                      COLHDG('DES. FILIALE')
004000090205     A            WAPCLV    R               REFFLD($CLV)
004100090205     A                                      TEXT('CODICE IMPORTANZA CLIENTE')
004200090205     A                                      COLHDG('QLT')
004300090205     A            WAPCLI    R               REFFLD($KSC)
004400090205     A                                      TEXT('CLIENTE')
004500090205     A                                      COLHDG('CLIENTE')
004600090205     A            WAPCLD        25          TEXT('DESRIZIONE CLIENTE')
004700090205     A                                      COLHDG('DES. CLIENTE')
004800090205     A            WAPITC        25          TEXT('CATEGORIA CLIENTE')
004900090205     A                                      COLHDG('CATEGORIA CLI.')
005000090205     A            WAPCLN         1          TEXT('CLIENTE NUOVO/ACQUISITO')
005100090205     A                                      COLHDG('CLI. NUOVO/ACQ.')
005200090205     A            WAPAGE    R               REFFLD($AGE)
005300090205     A                                      TEXT('AGENTE')
005400090205     A                                      COLHDG('AGENTE')
005500090205     A            WAPAGD        25          TEXT('DESRIZIONE AGENTE')
005600090205     A                                      COLHDG('DES. AGENTE')
005700090205      *-
005800090205     A            WAPSAP        11  0       TEXT('NUMERO SPED. ANNO PREC.')
005900090205     A                                      COLHDG('SPED ANNO PREC.')
006000090205     A            WAPFAP        15  3       TEXT('FATTURATO ANNO PREC.')
006100090205     A                                      COLHDG('FATTURATO ANNO PREC.')
006200090205     A            WAPDAP         4  1       TEXT('% DELTA ANNO PREC.')
006300090205     A                                      COLHDG('% DELTA ANNO PREC.')
006400090205     A            WAPSAC        11  0       TEXT('NUMERO SPED. ANNO CORR.')
006500090205     A                                      COLHDG('SPED ANNO CORR.')
006600090205     A            WAPFAC        15  3       TEXT('FATTURATO ANNO CORR.')
006700090205     A                                      COLHDG('FATTURATO ANNO CORR.')
006800090205     A            WAPDAC         4  1       TEXT('% DELTA ANNO CORR.')
006900090205     A                                      COLHDG('% DELTA ANNO CORR.')
007000090205     A            WAPBLO         1          TEXT('CLIENTE BLOCCATO')
007100090205     A                                      COLHDG('CLI. BLOCCATO')
007200090205      ** DATI AGGIUNTI
007300090205      *
007400090205     A            WAPNS_01AP    11  0       TEXT('N.SPED. 01 ANNO PREC.')
007500090205     A                                      COLHDG('SPED 01' 'ANNO PREC.')
007600090205     A            WAPRR_01AP    15  3       TEXT('R.REALI 01 ANNO PREC.')
007700090205     A                                      COLHDG('R.REALI 01' 'ANNO PREC.')
007800090205     A            WAPRP_01AP    15  3       TEXT('R.PRES. 01 ANNO PREC.')
007900090205     A                                      COLHDG('R.PRES. 01' 'ANNO PREC.')
008000090205      *-
008100090205     A            WAPNS_02AP    11  0       TEXT('N.SPED. 02 ANNO PREC.')
008200090205     A                                      COLHDG('SPED 02' 'ANNO PREC.')
008300090205     A            WAPRR_02AP    15  3       TEXT('R.REALI 02 ANNO PREC.')
008400090205     A                                      COLHDG('R.REALI 02' 'ANNO PREC.')
008500090205     A            WAPRP_02AP    15  3       TEXT('R.PRES. 02 ANNO PREC.')
008600090205     A                                      COLHDG('R.PRES. 02' 'ANNO PREC.')
008700090205      *-
008800090205     A            WAPNS_03AP    11  0       TEXT('N.SPED. 03 ANNO PREC.')
008900090205     A                                      COLHDG('SPED 03' 'ANNO PREC.')
009000090205     A            WAPRR_03AP    15  3       TEXT('R.REALI 03 ANNO PREC.')
009100090205     A                                      COLHDG('R.REALI 03' 'ANNO PREC.')
009200090205     A            WAPRP_03AP    15  3       TEXT('R.PRES. 03 ANNO PREC.')
009300090205     A                                      COLHDG('R.PRES. 03' 'ANNO PREC.')
009400090205      *-
009500090205     A            WAPNS_04AP    11  0       TEXT('N.SPED. 04 ANNO PREC.')
009600090205     A                                      COLHDG('SPED 04' 'ANNO PREC.')
009700090205     A            WAPRR_04AP    15  3       TEXT('R.REALI 04 ANNO PREC.')
009800090205     A                                      COLHDG('R.REALI 04' 'ANNO PREC.')
009900090205     A            WAPRP_04AP    15  3       TEXT('R.PRES. 04 ANNO PREC.')
010000090205     A                                      COLHDG('R.PRES. 04' 'ANNO PREC.')
010100090205      *-
010200090205     A            WAPNS_05AP    11  0       TEXT('N.SPED. 05 ANNO PREC.')
010300090205     A                                      COLHDG('SPED 05' 'ANNO PREC.')
010400090205     A            WAPRR_05AP    15  3       TEXT('R.REALI 05 ANNO PREC.')
010500090205     A                                      COLHDG('R.REALI 05' 'ANNO PREC.')
010600090205     A            WAPRP_05AP    15  3       TEXT('R.PRES. 05 ANNO PREC.')
010700090205     A                                      COLHDG('R.PRES. 05' 'ANNO PREC.')
010800090205      *-
010900090205     A            WAPNS_06AP    11  0       TEXT('N.SPED. 06 ANNO PREC.')
011000090205     A                                      COLHDG('SPED 06' 'ANNO PREC.')
011100090205     A            WAPRR_06AP    15  3       TEXT('R.REALI 06 ANNO PREC.')
011200090205     A                                      COLHDG('R.REALI 06' 'ANNO PREC.')
011300090205     A            WAPRP_06AP    15  3       TEXT('R.PRES. 06 ANNO PREC.')
011400090205     A                                      COLHDG('R.PRES. 06' 'ANNO PREC.')
011500090205      *-
011600090205     A            WAPNS_07AP    11  0       TEXT('N.SPED. 07 ANNO PREC.')
011700090205     A                                      COLHDG('SPED 07' 'ANNO PREC.')
011800090205     A            WAPRR_07AP    15  3       TEXT('R.REALI 07 ANNO PREC.')
011900090205     A                                      COLHDG('R.REALI 07' 'ANNO PREC.')
012000090205     A            WAPRP_07AP    15  3       TEXT('R.PRES. 07 ANNO PREC.')
012100090205     A                                      COLHDG('R.PRES. 07' 'ANNO PREC.')
012200090205      *-
012300090205     A            WAPNS_08AP    11  0       TEXT('N.SPED. 08 ANNO PREC.')
012400090205     A                                      COLHDG('SPED 08' 'ANNO PREC.')
012500090205     A            WAPRR_08AP    15  3       TEXT('R.REALI 08 ANNO PREC.')
012600090205     A                                      COLHDG('R.REALI 08' 'ANNO PREC.')
012700090205     A            WAPRP_08AP    15  3       TEXT('R.PRES. 08 ANNO PREC.')
012800090205     A                                      COLHDG('R.PRES. 08' 'ANNO PREC.')
012900090205      *-
013000090205     A            WAPNS_09AP    11  0       TEXT('N.SPED. 09 ANNO PREC.')
013100090205     A                                      COLHDG('SPED 09' 'ANNO PREC.')
013200090205     A            WAPRR_09AP    15  3       TEXT('R.REALI 09 ANNO PREC.')
013300090205     A                                      COLHDG('R.REALI 09' 'ANNO PREC.')
013400090205     A            WAPRP_09AP    15  3       TEXT('R.PRES. 09 ANNO PREC.')
013500090205     A                                      COLHDG('R.PRES. 09' 'ANNO PREC.')
013600090205      *-
013700090205     A            WAPNS_10AP    11  0       TEXT('N.SPED. 10 ANNO PREC.')
013800090205     A                                      COLHDG('SPED 10' 'ANNO PREC.')
013900090205     A            WAPRR_10AP    15  3       TEXT('R.REALI 10 ANNO PREC.')
014000090205     A                                      COLHDG('R.REALI 10' 'ANNO PREC.')
014100090205     A            WAPRP_10AP    15  3       TEXT('R.PRES. 10 ANNO PREC.')
014200090205     A                                      COLHDG('R.PRES. 10' 'ANNO PREC.')
014300090205      *-
014400090205     A            WAPNS_11AP    11  0       TEXT('N.SPED. 11 ANNO PREC.')
014500090205     A                                      COLHDG('SPED 11' 'ANNO PREC.')
014600090205     A            WAPRR_11AP    15  3       TEXT('R.REALI 11 ANNO PREC.')
014700090205     A                                      COLHDG('R.REALI 11' 'ANNO PREC.')
014800090205     A            WAPRP_11AP    15  3       TEXT('R.PRES. 11 ANNO PREC.')
014900090205     A                                      COLHDG('R.PRES. 11' 'ANNO PREC.')
015000090205      *-
015100090205     A            WAPNS_12AP    11  0       TEXT('N.SPED. 12 ANNO PREC.')
015200090205     A                                      COLHDG('SPED 12' 'ANNO PREC.')
015300090205     A            WAPRR_12AP    15  3       TEXT('R.REALI 12 ANNO PREC.')
015400090205     A                                      COLHDG('R.REALI 12' 'ANNO PREC.')
015500090205     A            WAPRP_12AP    15  3       TEXT('R.PRES. 12 ANNO PREC.')
015600090205     A                                      COLHDG('R.PRES. 12' 'ANNO PREC.')
015700090205      *-
015800090205     A            WAPNS_01AC    11  0       TEXT('N.SPED. 01 ANNO CORR')
015900090205     A                                      COLHDG('SPED 01' 'ANNO CORR')
016000090205     A            WAPRR_01AC    15  3       TEXT('R.REALI 01 ANNO CORR')
016100090205     A                                      COLHDG('R.REALI 01' 'ANNO CORR')
016200090205     A            WAPRP_01AC    15  3       TEXT('R.PRES. 01 ANNO CORR')
016300090205     A                                      COLHDG('R.PRES. 01' 'ANNO CORR')
016400090205      *-
016500090205     A            WAPNS_02AC    11  0       TEXT('N.SPED. 02 ANNO CORR')
016600090205     A                                      COLHDG('SPED 02' 'ANNO CORR')
016700090205     A            WAPRR_02AC    15  3       TEXT('R.REALI 02 ANNO CORR')
016800090205     A                                      COLHDG('R.REALI 02' 'ANNO CORR')
016900090205     A            WAPRP_02AC    15  3       TEXT('R.PRES. 02 ANNO CORR')
017000090205     A                                      COLHDG('R.PRES. 02' 'ANNO CORR')
017100090205      *-
017200090205     A            WAPNS_03AC    11  0       TEXT('N.SPED. 03 ANNO CORR')
017300090205     A                                      COLHDG('SPED 03' 'ANNO CORR')
017400090205     A            WAPRR_03AC    15  3       TEXT('R.REALI 03 ANNO CORR')
017500090205     A                                      COLHDG('R.REALI 03' 'ANNO CORR')
017600090205     A            WAPRP_03AC    15  3       TEXT('R.PRES. 03 ANNO CORR')
017700090205     A                                      COLHDG('R.PRES. 03' 'ANNO CORR')
017800090205      *-
017900090205     A            WAPNS_04AC    11  0       TEXT('N.SPED. 04 ANNO CORR')
018000090205     A                                      COLHDG('SPED 04' 'ANNO CORR')
018100090205     A            WAPRR_04AC    15  3       TEXT('R.REALI 04 ANNO CORR')
018200090205     A                                      COLHDG('R.REALI 04' 'ANNO CORR')
018300090205     A            WAPRP_04AC    15  3       TEXT('R.PRES. 04 ANNO CORR')
018400090205     A                                      COLHDG('R.PRES. 04' 'ANNO CORR')
018500090205      *-
018600090205     A            WAPNS_05AC    11  0       TEXT('N.SPED. 05 ANNO CORR')
018700090205     A                                      COLHDG('SPED 05' 'ANNO CORR')
018800090205     A            WAPRR_05AC    15  3       TEXT('R.REALI 05 ANNO CORR')
018900090205     A                                      COLHDG('R.REALI 05' 'ANNO CORR')
019000090205     A            WAPRP_05AC    15  3       TEXT('R.PRES. 05 ANNO CORR')
019100090205     A                                      COLHDG('R.PRES. 05' 'ANNO CORR')
019200090205      *-
019300090205     A            WAPNS_06AC    11  0       TEXT('N.SPED. 06 ANNO CORR')
019400090205     A                                      COLHDG('SPED 06' 'ANNO CORR')
019500090205     A            WAPRR_06AC    15  3       TEXT('R.REALI 06 ANNO CORR')
019600090205     A                                      COLHDG('R.REALI 06' 'ANNO CORR')
019700090205     A            WAPRP_06AC    15  3       TEXT('R.PRES. 06 ANNO CORR')
019800090205     A                                      COLHDG('R.PRES. 06' 'ANNO CORR')
019900090205      *-
020000090205     A            WAPNS_07AC    11  0       TEXT('N.SPED. 07 ANNO CORR')
020100090205     A                                      COLHDG('SPED 07' 'ANNO CORR')
020200090205     A            WAPRR_07AC    15  3       TEXT('R.REALI 07 ANNO CORR')
020300090205     A                                      COLHDG('R.REALI 07' 'ANNO CORR')
020400090205     A            WAPRP_07AC    15  3       TEXT('R.PRES. 07 ANNO CORR')
020500090205     A                                      COLHDG('R.PRES. 07' 'ANNO CORR')
020600090205      *-
020700090205     A            WAPNS_08AC    11  0       TEXT('N.SPED. 08 ANNO CORR')
020800090205     A                                      COLHDG('SPED 08' 'ANNO CORR')
020900090205     A            WAPRR_08AC    15  3       TEXT('R.REALI 08 ANNO CORR')
021000090205     A                                      COLHDG('R.REALI 08' 'ANNO CORR')
021100090205     A            WAPRP_08AC    15  3       TEXT('R.PRES. 08 ANNO CORR')
021200090205     A                                      COLHDG('R.PRES. 08' 'ANNO CORR')
021300090205      *-
021400090205     A            WAPNS_09AC    11  0       TEXT('N.SPED. 09 ANNO CORR')
021500090205     A                                      COLHDG('SPED 09' 'ANNO CORR')
021600090205     A            WAPRR_09AC    15  3       TEXT('R.REALI 09 ANNO CORR')
021700090205     A                                      COLHDG('R.REALI 09' 'ANNO CORR')
021800090205     A            WAPRP_09AC    15  3       TEXT('R.PRES. 09 ANNO CORR')
021900090205     A                                      COLHDG('R.PRES. 09' 'ANNO CORR')
022000090205      *-
022100090205     A            WAPNS_10AC    11  0       TEXT('N.SPED. 10 ANNO CORR')
022200090205     A                                      COLHDG('SPED 10' 'ANNO CORR')
022300090205     A            WAPRR_10AC    15  3       TEXT('R.REALI 10 ANNO CORR')
022400090205     A                                      COLHDG('R.REALI 10' 'ANNO CORR')
022500090205     A            WAPRP_10AC    15  3       TEXT('R.PRES. 10 ANNO CORR')
022600090205     A                                      COLHDG('R.PRES. 10' 'ANNO CORR')
022700090205      *-
022800090205     A            WAPNS_11AC    11  0       TEXT('N.SPED. 11 ANNO CORR')
022900090205     A                                      COLHDG('SPED 11' 'ANNO CORR')
023000090205     A            WAPRR_11AC    15  3       TEXT('R.REALI 11 ANNO CORR')
023100090205     A                                      COLHDG('R.REALI 11' 'ANNO CORR')
023200090205     A            WAPRP_11AC    15  3       TEXT('R.PRES. 11 ANNO CORR')
023300090205     A                                      COLHDG('R.PRES. 11' 'ANNO CORR')
023400090205      *-
023500090205     A            WAPNS_12AC    11  0       TEXT('N.SPED. 12 ANNO CORR')
023600090205     A                                      COLHDG('SPED 12' 'ANNO CORR')
023700090205     A            WAPRR_12AC    15  3       TEXT('R.REALI 12 ANNO CORR')
023800090205     A                                      COLHDG('R.REALI 12' 'ANNO CORR')
023900090205     A            WAPRP_12AC    15  3       TEXT('R.PRES. 12 ANNO CORR')
024000090205     A                                      COLHDG('R.PRES. 12' 'ANNO CORR')
024100090205      *-  DATI ANAGRAFICI
024200090205      *
024300090205     A            WAPIND        30          TEXT('INDIRIZZO UNIFICANTE')
024400090205     A                                      COLHDG('INDIRIZZO UNIF.')
024500090205     A            WAPCAP         9          TEXT('CAP UNIFICANTE')
024600090205     A                                      COLHDG('CAP UNIF.')
024700090205     A            WAPLOC        30          TEXT('LOCALITA UNIFICANTE')
024800090205     A                                      COLHDG('LOCALITA UNIF.')
024900090205     A            WAPPRV         2          TEXT('PROVINCIA UNIFICANTE')
025000090205     A                                      COLHDG('PROVINCIA UNIF.')
025100090205     A            WAPNAZ         4          TEXT('NAZIONE UNIFICANTE')
025200090205     A                                      COLHDG('NAZIONE UNIF.')
025300090205     A            WAPRESP       60          TEXT('RESP.TRASPORTO')
025400090205     A                                      COLHDG('RESP.TRASPORTO')
025500090205     A            WAPEMAR       60          TEXT('EMAIL RESP.TRASPORTO')
025600090205     A                                      COLHDG('EMAIL RESP.' 'TRASPORTO')
025700090205      *-
025800090205     A            WAPCDF        16          TEXT('COD.FISCALE')
025900090205     A                                      COLHDG('COD.FISCALE')
026000090205     A            WAPIVA        16          TEXT('PART.IVA')
026100090205     A                                      COLHDG('PART.IVA')
026200090205      *-
026300090205     A            WAPTEL        16          TEXT('TELEFONO')
026400090205     A                                      COLHDG('TELEFONO')
026500090205      *-
026600090205     A            WAPNEW_MES     2S 0       TEXT('X NUOVO, MESE DI INIZIO')
026700090205     A                                      COLHDG('MESE' 'DI INIZIO')
026800090205      *-
026900090205     A            WAPAUC    R               REFFLD($AGE)
027000090205     A                                      TEXT('AGENTE UNIFICANTE')
027100090205     A                                      COLHDG('AGENTE' 'UNIFICANTE')
027200090205     A            WAPAUD        25          TEXT('DESRIZIONE AGENTE UNIFICANTE')
027300090205     A                                      COLHDG('DES. AGENTE UNIF')
027400090205      *-
027500090205     A            WAPARAU   R               REFFLD($CAR)
027600090205     A                                      TEXT('AREA AGENTE UNIFICANTE')
027700090205     A                                      COLHDG('ARE AGE UNIF.')
027800090205     A            WAPARAUD      25          TEXT('DESR. AREA AGE UNIF.')
027900090205     A                                      COLHDG('DES. AREA AGE UNIF.')
028000090205      *-
028100090205     A            WAPKG_01AP    15  1       TEXT('PESO KG 01 ANNO PREC.')
028200090205     A                                      COLHDG('PESO KG.01' 'ANNO PREC.')
028300090205     A            WAPKG_02AP    15  1       TEXT('PESO KG 02 ANNO PREC.')
028400090205     A                                      COLHDG('PESO KG.02' 'ANNO PREC.')
028500090205     A            WAPKG_03AP    15  1       TEXT('PESO KG 03 ANNO PREC.')
028600090205     A                                      COLHDG('PESO KG.03' 'ANNO PREC.')
028700090205     A            WAPKG_04AP    15  1       TEXT('PESO KG 04 ANNO PREC.')
028800090205     A                                      COLHDG('PESO KG.04' 'ANNO PREC.')
028900090205     A            WAPKG_05AP    15  1       TEXT('PESO KG 05 ANNO PREC.')
029000090205     A                                      COLHDG('PESO KG.05' 'ANNO PREC.')
029100090205     A            WAPKG_06AP    15  1       TEXT('PESO KG 06 ANNO PREC.')
029200090205     A                                      COLHDG('PESO KG.06' 'ANNO PREC.')
029300090205     A            WAPKG_07AP    15  1       TEXT('PESO KG 07 ANNO PREC.')
029400090205     A                                      COLHDG('PESO KG.07' 'ANNO PREC.')
029500090205     A            WAPKG_08AP    15  1       TEXT('PESO KG 08 ANNO PREC.')
029600090205     A                                      COLHDG('PESO KG.08' 'ANNO PREC.')
029700090205     A            WAPKG_09AP    15  1       TEXT('PESO KG 09 ANNO PREC.')
029800090205     A                                      COLHDG('PESO KG.09' 'ANNO PREC.')
029900090205     A            WAPKG_10AP    15  1       TEXT('PESO KG 10 ANNO PREC.')
030000090205     A                                      COLHDG('PESO KG.10' 'ANNO PREC.')
030100090205     A            WAPKG_11AP    15  1       TEXT('PESO KG 11 ANNO PREC.')
030200090205     A                                      COLHDG('PESO KG.11' 'ANNO PREC.')
030300090205     A            WAPKG_12AP    15  1       TEXT('PESO KG 12 ANNO PREC.')
030400090205     A                                      COLHDG('PESO KG.12' 'ANNO PREC.')
030500090205     A            WAPKGP        15  1       TEXT('PESO KG.ANNO PREC.')
030600090205     A                                      COLHDG('PESO KG.ANNO PREC.')
030700090205     A            WAPKG_01AC    15  1       TEXT('PESO KG 01 ANNO CORR')
030800090205     A                                      COLHDG('PESO KG.01' 'ANNO CORR')
030900090205     A            WAPKG_02AC    15  1       TEXT('PESO KG 02 ANNO CORR')
031000090205     A                                      COLHDG('PESO KG.02' 'ANNO CORR')
031100090205     A            WAPKG_03AC    15  1       TEXT('PESO KG 03 ANNO CORR')
031200090205     A                                      COLHDG('PESO KG.03' 'ANNO CORR')
031300090205     A            WAPKG_04AC    15  1       TEXT('PESO KG 04 ANNO CORR')
031400090205     A                                      COLHDG('PESO KG.04' 'ANNO CORR')
031500090205     A            WAPKG_05AC    15  1       TEXT('PESO KG 05 ANNO CORR')
031600090205     A                                      COLHDG('PESO KG.05' 'ANNO CORR')
031700090205     A            WAPKG_06AC    15  1       TEXT('PESO KG 06 ANNO CORR')
031800090205     A                                      COLHDG('PESO KG.06' 'ANNO CORR')
031900090205     A            WAPKG_07AC    15  1       TEXT('PESO KG 07 ANNO CORR')
032000090205     A                                      COLHDG('PESO KG.07' 'ANNO CORR')
032100090205     A            WAPKG_08AC    15  1       TEXT('PESO KG 08 ANNO CORR')
032200090205     A                                      COLHDG('PESO KG.08' 'ANNO CORR')
032300090205     A            WAPKG_09AC    15  1       TEXT('PESO KG 09 ANNO CORR')
032400090205     A                                      COLHDG('PESO KG.09' 'ANNO CORR')
032500090205     A            WAPKG_10AC    15  1       TEXT('PESO KG 10 ANNO CORR')
032600090205     A                                      COLHDG('PESO KG.10' 'ANNO CORR')
032700090205     A            WAPKG_11AC    15  1       TEXT('PESO KG 11 ANNO CORR')
032800090205     A                                      COLHDG('PESO KG.11' 'ANNO CORR')
032900090205     A            WAPKG_12AC    15  1       TEXT('PESO KG 12 ANNO CORR')
033000090205     A                                      COLHDG('PESO KG.12' 'ANNO CORR')
033100090205     A            WAPKGC        15  1       TEXT('PESO KG.ANNO CORR.')
033200090205     A                                      COLHDG('PESO KG.ANNO CORR.')
