000100000000     A*------------------------------------------------------------------------*
000200030311     A* STATISTICHE DELTA - FILE PC ESTRAZIONE STAMPA                          *
000300030311     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500030311     A          R WFDELPC0                  TEXT('WF PC STATISTICA DELTA')
000600030311     A            WFPAAD    R               REFFLD($AAA)
000700030311     A                                      TEXT('ANNO DA')
000800030311     A                                      COLHDG('ANNO DA')
000900030311     A            WFPMMD    R               REFFLD($MMM)
001000030311     A                                      TEXT('MESE DA')
001100030311     A                                      COLHDG('MESE DA')
001200030311     A            WFPAAA    R               REFFLD($AAA)
001300030311     A                                      TEXT('ANNO A')
001400030311     A                                      COLHDG('ANNO A')
001500030311     A            WFPMMA    R               REFFLD($MMM)
001600030311     A                                      TEXT('MESE A')
001700030311     A                                      COLHDG('MESE A')
001800030311     A            WFPIOE    R               REFFLD($FLA)
001900030311     A                                      TEXT('DATI ITALIA/ESTERO ')
002000030311     A                                      COLHDG('ITA/EST')
002100030311     A            WFPDIV    R               REFFLD($DIT)
002200030311     A                                      TEXT('DISTRETTO CLIENTE')
002300030311     A                                      COLHDG('DIS. CLI')
002400030311     A            WFPDID        25          TEXT('DESRIZIONE DISTRETTO')
002500030311     A                                      COLHDG('DES. DISTRETTO')
002600030311     A            WFPARE    R               REFFLD($CAR)
002700000000     A                                      TEXT('AREA CLIENTE')
002800000000     A                                      COLHDG('ARE CLI')
002900030311     A            WFPARD        25          TEXT('DESRIZIONE AREA')
003000030311     A                                      COLHDG('DES. AREA')
003100030311     A            WFPFIL    R               REFFLD($FIL)
003200000000     A                                      TEXT('FILIALE CLIENTE')
003300000000     A                                      COLHDG('FIL CLI')
003400030311     A            WFPFID        25          TEXT('DESRIZIONE FILIALE')
003500030311     A                                      COLHDG('DES. FILIALE')
003600030311     A            WFPCLV    R               REFFLD($CLV)
003700000000     A                                      TEXT('CODICE IMPORTANZA CLIENTE')
003800000000     A                                      COLHDG('QLT')
003900030311     A            WFPCLI    R               REFFLD($KSC)
004000000000     A                                      TEXT('CLIENTE')
004100000000     A                                      COLHDG('CLIENTE')
004200030311     A            WFPCLD        25          TEXT('DESRIZIONE CLIENTE')
004300030311     A                                      COLHDG('DES. CLIENTE')
004400030311     A            WFPITC        25          TEXT('CATEGORIA CLIENTE')
004500030311     A                                      COLHDG('CATEGORIA CLI.')
004600030311     A            WFPCLN         1          TEXT('CLIENTE NUOVO/ACQUISITO')
004700030311     A                                      COLHDG('CLI. NUOVO/ACQ.')
004800030311     A            WFPAGE    R               REFFLD($AGE)
004900000000     A                                      TEXT('AGENTE')
005000000000     A                                      COLHDG('AGENTE')
005100030311     A            WFPAGD        25          TEXT('DESRIZIONE AGENTE UNIFICANTE')
005200030311     A                                      COLHDG('DES. AGENTE UNIF')
005300030311     A            WFPSAP        11  0       TEXT('NUMERO SPED. ANNO PREC.')
005400030311     A                                      COLHDG('SPED ANNO PREC.')
005500030311     A            WFPFAP        15  3       TEXT('FATTURATO ANNO PREC.')
005600030311     A                                      COLHDG('FATTURATO ANNO PREC.')
005700030311     A            WFPDAP         4  1       TEXT('% DELTA ANNO PREC.')
005800030311     A                                      COLHDG('% DELTA ANNO PREC.')
005900030311     A            WFPSAC        11  0       TEXT('NUMERO SPED. ANNO CORR.')
006000030311     A                                      COLHDG('SPED ANNO CORR.')
006100030311     A            WFPFAC        15  3       TEXT('FATTURATO ANNO CORR.')
006200030311     A                                      COLHDG('FATTURATO ANNO CORR.')
006300030311     A            WFPDAC         4  1       TEXT('% DELTA ANNO CORR.')
006400030311     A                                      COLHDG('% DELTA ANNO CORR.')
