000100070129      *---------------------------------------------------------------*
000200090205     A          R WADELPC0                  PFILE(WFDEMI0F)
000300070129      *
000400090205     A          K WAPCLIUNI
