000100941206     A*------------------------------------------------------------------------*
000200000225     A*  L.F. X  RSD+IND+LOD+PRD+NZD+DAC
000300941206     A*------------------------------------------------------------------------*
000400000225     A          R WFDES000                  PFILE(WFDES00F)
000500000225     A          K WFDRSD
000600000225     A          K WFDIND
000700000225     A          K WFDLOD
000800000225     A          K WFDPRD
000900000225     A          K WFDNZD
