000100941102     A*------------------------------------------------------------------------*
000200091105     A* WF STATISTICA DIROTTAMENTI  - DETTAGLIO SPEDIZIONI                     *
000300941102     A*------------------------------------------------------------------------*
000400090203     A                                      REF(CNDIZION)
000500090203     A*
000600091105     A          R WFDIRS00                  TEXT('STATISTICA DIROTTAMENTI - DET-
000601091105     A                                      TAGLIO SPEDIZIONI')
000700091105     A            DIRSAAS   R               REFFLD($AAS)
000701091203     A                                      TEXT('ANNO SPEDIZIONE MAMMA')
000800091105     A            DIRSLNP   R               REFFLD($LNP)
000801091203     A                                      TEXT('LNP SPEDIZIONE MAMMA')
001200091105     A            DIRSNRS   R               REFFLD($NRS)
001201091203     A                                      TEXT('SERIE SPEDIZIONE MAMMA')
001300091105     A            DIRSNSP   R               REFFLD($NSP)
001301091203     A                                      TEXT('NUMERO SPEDIZIONE MAMMA')
001302091105     A            DIRSLNA   R               REFFLD($LNA)
001303091203     A                                      TEXT('LINEA DI ARR.SPED. MAMMA')
001304091105     A*
001305091106     A* POSSIBILI VALORI DEL FLAG:
001306091106     A* "C" - LA SPEDIZIONE PRESENTA UN CAP GENERICO
001307091106     A* "L" - LA LINEA DI ARRIVO DELLA SPEDIZIONE È DIVERSA DA QUELLA
001308091105     A*       DESUNTA DAL CAPPARIO
001309091105     A* "S" - COME "L" MA SPEDIZIONE CON CONSEGNA A SUPERMERCATO
001310091105     A* "G" - SPEDIZIONE CHE HA AVUTO GIACENZA
001311091105     A* "R" - SPEDIZIONE DI RESO
001312091105     A*
001313091105     A            DIRSFLG        1A         TEXT('FLAG PARTICOLARITA''DIROTTAME-
001400091105     A                                      NTO')
001401091204     A            DIRSCCM   R               REFFLD($CCM)
001500091203     A            DIRSSOP   R               REFFLD($SOP)
001600091203     A                                      TEXT('SIGLA OPERATORE MAMMA')
001700091203     A            DIRSRSD   R               REFFLD($RSD)
001800091203     A                                      TEXT('RAGIONE SOC.DEST. MAMMA')
001900091203     A            DIRSIND   R               REFFLD($IND)
002000091203     A                                      TEXT('INDIRIZZO DESTIN. MAMMA')
002100091203     A            DIRSCAD   R               REFFLD($CAD)
002200091203     A                                      TEXT('CAP DESTINATARIO MAMMA')
002300091203     A            DIRSLOD   R               REFFLD($LOD)
002400091203     A                                      TEXT('LOCALITA DESTIN. MAMMA')
002500091203     A            DIRSPRD   R               REFFLD($PRD)
002600091203     A                                      TEXT('PROVINCIA DESTIN. MAMMA')
002700091203     A            DIRSNZD   R               REFFLD($NZD)
002800091203     A                                      TEXT('NAZIONE DESTIN. MAMMA')
002801091203     A            DIRSNCL   R               REFFLD($NCL)
002802091203     A                                      TEXT('COLLI BOLLETTATI MAMMA')
002803091203     A            DIRSPKB   R               REFFLD($PKB)
002804091203     A                                      TEXT('PESO BOLLETTATO MAMMA')
002805091203     A            DIRSVLB   R               REFFLD($VLB)
002806091203     A                                      TEXT('VOLUME BOLLETTATO MAMMA')
002807091203     A*
002900091203     A            DIRSAASF  R               REFFLD($AAS)
003000091203     A                                      TEXT('ANNO SPEDIZIONE FIGLIA')
003100091203     A            DIRSLNPF  R               REFFLD($LNP)
003200091203     A                                      TEXT('LNP SPEDIZIONE FIGLIA')
003300091203     A            DIRSNRSF  R               REFFLD($NRS)
003400091203     A                                      TEXT('SERIE SPEDIZIONE FIGLIA')
003500091203     A            DIRSNSPF  R               REFFLD($NSP)
003600091203     A                                      TEXT('NUMERO SPEDIZIONE FIGLIA')
003700091203     A            DIRSMGSF  R               REFFLD($MMG)
003800091203     A                                      TEXT('MESE/GIORNO SPED. FIGLIA')
003900091203     A            DIRSLNAF  R               REFFLD($LNA)
004000091203     A                                      TEXT('LINEA DI ARR.SPED. FIGLIA')
004100091203     A            DIRSRSDF  R               REFFLD($RSD)
004200091203     A                                      TEXT('RAGIONE SOC.DEST. FIGLIA')
004300091203     A            DIRSINDF  R               REFFLD($IND)
004400091203     A                                      TEXT('INDIRIZZO DESTIN. FIGLIA')
004500091203     A            DIRSCADF  R               REFFLD($CAD)
004600091203     A                                      TEXT('CAP DESTINATARIO FIGLIA')
004700091203     A            DIRSLODF  R               REFFLD($LOD)
004800091203     A                                      TEXT('LOCALITA DESTIN. FIGLIA')
004900091203     A            DIRSPRDF  R               REFFLD($PRD)
005000091203     A                                      TEXT('PROVINCIA DESTIN. FIGLIA')
005100091203     A            DIRSNZDF  R               REFFLD($NZD)
005200091203     A                                      TEXT('NAZIONE DESTIN. FIGLIA')
005300091203     A            DIRSNCLF  R               REFFLD($NCL)
005400091203     A                                      TEXT('COLLI BOLLETTATI FIGLIA')
005500091203     A            DIRSPKBF  R               REFFLD($PKB)
005600091203     A                                      TEXT('PESO BOLLETTATO FIGLIA')
005700091203     A            DIRSVLBF  R               REFFLD($VLB)
005800091203     A                                      TEXT('VOLUME BOLLETTATO FIGLIA')
