000100950626     A*------------------------------------------------------------------------*
000200030220     A*  L.F. X  FLA+DDC+NDC
000300950626     A*------------------------------------------------------------------------*
000400030220     A          R WFDIS1                    PFILE(WFDIS10F)
000500030220     A          K WF1FLA
000501030220     A          K WF1DDC
000600030220     A          K WF1NDC
