000100000000     A*------------------------------------------------------------------------*
000200150513     A*  DATI ORIGINALI DA ANALIZZARE    MENSILMENTE (GEOPOST-ICS)             *
000300000000     A*------------------------------------------------------------------------*
000400150513     A          R WFDPDBA0                  TEXT('CONTROLLO FATTURE PARTNERS')
000500030620      *
000600150513     A            DBAPRN        14A         COLHDG('PARCEL_NO')
000700140227     A                                      TEXT('PARCEL_NO')
000800150513     A            DBAYMO         7A         COLHDG('PERIOD' 'YYYY-MM')
000900140227     A                                      TEXT('PERIOD')
001000140227      *
001100150513     A            DBAPROD       15A         COLHDG('PRODUCT')
001200140227     A                                      TEXT('PRODUCT')
001300140227      *
001400150513     A            DBACRBU       59A         COLHDG('CREDIT' 'BU')
001500140227     A                                      TEXT('CREDIT BU')
001600140227      *
001700150513     A            DBADEBU       59A         COLHDG('DEBIT' 'BU')
001800140227     A                                      TEXT('DEBIT BU')
001900140227      *
002000150513     A            DBACRBUC       6A         COLHDG('CRE_BU' 'CODE')
002100140227     A                                      TEXT('CRE_BU CODE')
002200140227      *
002300150513     A            DBADEBUC       6A         COLHDG('DEB_BU' 'CODE')
002400140227     A                                      TEXT('DEB_BU CODE')
002500140227      *
002600150513     A            DBACRSAP       7A         COLHDG('CRE_SAP' 'ACC.')
002700140227     A                                      TEXT('CRE_SAP ACCOUNT')
002800140227      *
002900150513     A            DBADESAP       7A         COLHDG('DEB_SAP' 'ACC.')
003000140227     A                                      TEXT('DEB_SAP ACCOUNT')
003100140227      *
003200150513     A            DBACRSTE      20A         COLHDG('CRE_STATO' 'NR_EU')
003300140227     A                                      TEXT('CRE_STATO NR_EU')
003400140227      *
003500150513     A            DBADESTE      20A         COLHDG('DEB_STATO' 'NR_EU')
003600140227     A                                      TEXT('DEB_STATO NR_EU')
003700140227      *
003800150513     A            DBAPROC       17A         COLHDG('PROCESS' 'CAUSALE')
003900140227     A                                      TEXT('PROCESS/CAUSALE')
004000140227      *
004100150513     A            DBAELEM       24A         COLHDG('ELEMENT')
004200140227     A                                      TEXT('ELEMENT')
004300140227      *
004400150513     A            DBARAKE        9A         COLHDG('RATE' 'KEY')
004500140227     A                                      TEXT('RATE KEY')
004600140227      *
004700150513     A            DBAWGHT       15A         COLHDG('COD' 'WEIGHT')
004800140227     A                                      TEXT('COD WEIGHT')
004900140227      *
005000150513     A            DBAQTY         6S 0       COLHDG('QUANTITY')
005100140227     A                                      TEXT('QUANTITY')
005200140227      *
005300150513     A            DBAVAL        15S 5       COLHDG('VALUE')
005400140227     A                                      TEXT('VALUE')
005500140227      *
005600150513     A            DBAVAT         1S 0       COLHDG('VAT')
005700140227     A                                      TEXT('VAT')
005800140227      *
005900150513     A            DBACREDP       4A         COLHDG('CRE' 'DEPOT')
006000140227     A                                      TEXT('CRE DEPOT')
006100140227      *
006200150513     A            DBADEBDP       4A         COLHDG('DEB' 'DEPOT')
006300140227     A                                      TEXT('DEB DEPOT')
006400140227      *
006500150513     A            DBAAMO        15S 5       COLHDG('AMOUNT')
006600140227     A                                      TEXT('AMOUNT')
006700140227      *
006800030620      *-----------------------------------------------------------------------
