000100970515     A*------------------------------------------------------------------------*
000200060426     A* WRKF CAPPARIO DPD - COUNTRY CODE ISO
000300970515     A*------------------------------------------------------------------------*
000400970515     A                                      REF(CNDIZION)
000500060426     A          R WFDPCCC0                  TEXT('WRKF CAPPARIO - COUNTRY CODE')
000600060426     A            WDCCCDTA     256A
000700060426     A                                      TEXT('CAMPO DATI FLAT')
000800060426     A                                      COLHDG('CAMPO DATI FLAT')
