000100000000     A*------------------------------------------------------------------------*
000200140227     A*  DATI X SINGOLO PARCEL ELABORATI MENSILMENTE (GEOPOST-ICS)             *
000300000000     A*------------------------------------------------------------------------*
000400060726     A          R TIDPC000                  TEXT('CONTROLLO FATTURE PARTNERS')
000500030620      *
000600140303     A            DPCPRN        14A         COLHDG('PARCEL_NO')
000700140227     A                                      TEXT('PARCEL_NO')
000800140303     A            DPCYMO         7A         COLHDG('PERIOD' 'YYYY-MM')
000900140227     A                                      TEXT('PERIOD')
001000140227      *
001100140303     A            DPCPROD       15A         COLHDG('PRODUCT')
001200140227     A                                      TEXT('PRODUCT')
001300140227      *
001400140303     A            DPCCRBU       59A         COLHDG('CREDIT' 'BU')
001500140227     A                                      TEXT('CREDIT BU')
001600140227      *
001700140303     A            DPCDEBU       59A         COLHDG('DEBIT' 'BU')
001800140227     A                                      TEXT('DEBIT BU')
001900140227      *
002000140303     A            DPCCRBUC       6A         COLHDG('CRE_BU' 'CODE')
002100140227     A                                      TEXT('CRE_BU CODE')
002200140227      *
002300140303     A            DPCDEBUC       6A         COLHDG('DEB_BU' 'CODE')
002400140227     A                                      TEXT('DEB_BU CODE')
002500140227      *
002600140303     A            DPCCRSAP       7A         COLHDG('CRE_SAP' 'ACC.')
002700140227     A                                      TEXT('CRE_SAP ACCOUNT')
002800140227      *
002900140303     A            DPCDESAP       7A         COLHDG('DEB_SAP' 'ACC.')
003000140227     A                                      TEXT('DEB_SAP ACCOUNT')
003100140227      *
003200140227     A            DPCCRSTE      20A         COLHDG('CRE_STATO' 'NR_EU')
003300140227     A                                      TEXT('CRE_STATO NR_EU')
003400140227      *
003500140227     A            DPCDESTE      20A         COLHDG('DEB_STATO' 'NR_EU')
003600140227     A                                      TEXT('DEB_STATO NR_EU')
003700140227      *
003800140303     A            DPCPROC       17A         COLHDG('PROCESS' 'CAUSALE')
003900140227     A                                      TEXT('PROCESS/CAUSALE')
004000140227      *
004100140303     A            DPCELEM       24A         COLHDG('ELEMENT')
004200140227     A                                      TEXT('ELEMENT')
004300140227      *
004400140303     A            DPCRAKE        9A         COLHDG('RATE' 'KEY')
004500140227     A                                      TEXT('RATE KEY')
004600140227      *
004700140227     A            DPCWGHT       15A         COLHDG('COD' 'WEIGHT')
004800140227     A                                      TEXT('COD WEIGHT')
004900140227      *
005000140319     A            DPCQTY         6A         COLHDG('QUANTITY')
005100140227     A                                      TEXT('QUANTITY')
005200140227      *
005300140319     A            DPCVAL        15A         COLHDG('VALUE')
005400140227     A                                      TEXT('VALUE')
005500140227      *
005600140319     A            DPCVAT         1A         COLHDG('VAT')
005700140227     A                                      TEXT('VAT')
005800140227      *
005900140227     A            DPCCREDP       4A         COLHDG('CRE' 'DEPOT')
006000140227     A                                      TEXT('CRE DEPOT')
006100140227      *
006200140227     A            DPCDEBDP       4A         COLHDG('DEB' 'DEPOT')
006300140227     A                                      TEXT('DEB DEPOT')
006400140227      *
006500140319     A            DPCAMO        15A         COLHDG('AMOUNT')
006600140227     A                                      TEXT('AMOUNT')
006700140227      *
006800030620      *-----------------------------------------------------------------------
