000100020222      *--------------------------------------------------------------------*
000200020222      * WORKFILE STATISTICA AMMINISTRATIVA DANNI                  -IN GRU- *
000300020222      *--------------------------------------------------------------------*
000400980727     A                                      REF(CNDIZION)
000500060310     A          R WFDRCV00                  TEXT('WFILE STATISTICA AMMINISTRATI-
000600060310                                            VA DANNI SOLO RCV')
000700060310
000800060310     A            DRCVDIP        6S 0       TEXT('AAAA/MM INIZIO PERIODO ELABOR-
000900020311                                            ATO')
001000020311                                            COLHDG('AAAA/MM INIZIO' 'PERIODO EL-
001100020311                                            ABORATO')
001200020311                                            EDTWRD('    /  ')
001300060310     A            DRCVDFP        6S 0       TEXT('AAAA/MM FINE PERIODO ELABORAT-
001400020312                                            O')
001500020311                                            COLHDG('AAAA/MM FINE' 'PERIODO ELAB-
001600020311                                            ORATO')
001700020311                                            EDTWRD('    /  ')
001800060310     A            DRCVIVA       16A         TEXT('PARTITA IVA/CODICE FISCALE')
001900060310                                            COLHDG('P.IVA' 'CD.FISCALE')
002000060310     A            DRCVCLV        1A         TEXT('COD.IMPORTANZA CLIENTE')
002100060310                                            COLHDG('COD' 'IMP.' 'CLI')
002200060310     A            DRCVKSC   R     S         REFFLD($KSC)
002300020301                                            TEXT('CODICE CLIENTE BOLLA')
002400020409                                            COLHDG('CODICE CLIENTE' 'BOLLA')
002500060310     A            DRCVRAG   R               REFFLD($RSM)
002600020222                                            TEXT('RAGIONE SOCIALE CLIENTE')
002700020409                                            COLHDG('RAG.SOC. CLIENTE' 'BOLLA')
002800060310     A            DRCVNCA        9S 2       TEXT('NUMERO C.A.')
002900060310                                            COLHDG('NUMERO C.A.')
003000060310     A            DRCVPES        9S 2       TEXT('PESO')
003100060310                                            COLHDG('PESO')
003200060310     A            DRCVIMP       13S 3       TEXT('IMPORTO C.A.')
003300060310                                            COLHDG('IMPORTO C.A.')
003400060310     A            DRCVMR        13S 3       TEXT('MAX RISARCIBILE C.A.')
003500060310                                            COLHDG('MAX RIS C.A.')
003600060310     A            DRCVMRP        9S 2       TEXT('PESO MAX RISARCIBILE')
003700060310                                            COLHDG('PESO MAX RIS')
