000100000913     A*------------------------------------------------------------------------*
000200110217     A* ERRORI INDIRIZZO DESTINATARIO SULLE BOLLE                              *
000300000913     A*------------------------------------------------------------------------*
000400000913     A                                      REF(CNDIZION)
000500111216     A          R WFEIV000                  TEXT('ERRORI INDIRIZZO BOLLE -
000600111216     A                                      DA FNVAB')
000700111220     A            EIVJOB        10          TEXT('NOME JOB PER ELABORAZ.EXTRA -
000800111220     A                                      IMMISSIONE BOLLE')
000900000913     A*---
001000111216     A            EIVCCM    R               REFFLD($CCM)
001100111216     A            EIVCCU    R               REFFLD($CCM)
001200111216     A                                      TEXT('CLIENTE UNIFICANTE')
001300111216     A                                      COLHDG('CLIENTE' 'UNIFIC.')
001400111216     A            EIVRSC    R               REFFLD($RSC)
001500111216     A* UTENTE
001600111216     A            EIVPRU    R               REFFLD($PRU)
001700111216     A            EIVPOU         3S 0       TEXT('FIL UTENTE')
001800111216     A* SIGLA OPERATORE
001900111216     A            EIVSOP    R               REFFLD($SOP)
002000111216     A*
002100111220     A            EIVDRF    R               REFFLD($DA8)
002200111220     A                                      TEXT('DATA DI RIFERIMENTO')
002300111220     A                                      COLHDG('DATA' 'RIFER')
002400111220     A            EIVRMN    R               REFFLD($RMN)
002500111216     A            EIVRMA    R               REFFLD($RMA)
002600111216     A            EIVRSD    R               REFFLD($RSD)
002700110712     A                                      TEXT('RAG.SOC DESTINATARIO')
002800110712     A                                      COLHDG('RAG.SOC.' 'DEST.')
002900111216     A            EIVIND    R               REFFLD($IND)
003000110712     A                                      TEXT('INDIRIZZO DESTINATARIO')
003100110712     A                                      COLHDG('INDIRIZZO' 'DEST.')
003200111216     A            EIVNZD    R               REFFLD($NAR)
003300110218     A                                      TEXT('NAZIONE BOLLA')
003400110218     A                                      COLHDG('NAZIONE' 'BOLLA')
003500111216     A            EIVCAD    R               REFFLD($CAD)
003600110218     A                                      TEXT('CAP BOLLA')
003700110218     A                                      COLHDG('CAP' 'BOLLA')
003800111216     A            EIVLOD    R               REFFLD($LOC)
003900110218     A                                      TEXT('LOCALITA''BOLLA')
004000110218     A                                      COLHDG('LOC' 'BOLLA')
004100111216     A            EIVPRD    R               REFFLD($PRD)
004200110218     A                                      TEXT('PROVINCIA BOLLA')
004300110218     A                                      COLHDG('PRV' 'BOLLA')
004400111216     A            EIVLNA    R               REFFLD($LNA)
004500111216     A                                      TEXT('LINEA ARRIVO BOLLA')
004600111216     A                                      COLHDG('LNA' 'BOLLA')
004700111219     A            EIVZNC    R               REFFLD($ZNC)
004800111219     A                                      TEXT('ZONA CONSEGNA BOLLA')
004900111219     A                                      COLHDG('ZONA' 'BOLLA')
005000111216     A* DATI PROPOSTI
005100111219     A            EIVNARP   R               REFFLD($NAR)
005200110218     A                                      TEXT('NAZIONE PROPOSTA')
005300110218     A                                      COLHDG('NAZIONE' 'PROPOSTA')
005400111219     A            EIVCAPP   R               REFFLD($CAD)
005500110218     A                                      TEXT('CAP PROPOSTO')
005600110218     A                                      COLHDG('CAP' 'PROPOSTO')
005700111219     A            EIVLOCP   R               REFFLD($LOC)
005800110218     A                                      TEXT('LOCALITA''PROPOSTA')
005900110218     A                                      COLHDG('LOC' 'PROPOSTA')
006000111219     A            EIVPRVP   R               REFFLD($PRD)
006100110218     A                                      TEXT('PROVINCIA PROPOSTA')
006200110218     A                                      COLHDG('PRV' 'PROPOSTA')
006300111219     A            EIVLNAP   R               REFFLD($LNA)
006400111216     A                                      TEXT('LINEA ARRIVO PROPOSTA')
006500111216     A                                      COLHDG('LNA' 'PROPOSTA')
006600111219     A            EIVZNCP   R               REFFLD($ZNC)
006700111219     A                                      TEXT('ZONA CONSEGNA PROPOSTA')
006800111219     A                                      COLHDG('ZONA' 'PROPOSTA')
006900111220     A            EIVLILP        1          TEXT('TIPO LNA PROPOSTA: -
007000111220     A                                       =STD,O=OLTRE,S=SOTTO,F=F.DEP,2=OLT-
007100111220     A                                      RE 2')
007200111216     A            EIVLIV         1          TEXT('LIV. CORREZIONE')
007300111216     A            EIVCOD         2          TEXT('COD. ERRORE')
007400111216     A            EIVERR        78          TEXT('ERRORE')
007500110218     A                                      COLHDG('ERRORE')
007600111219     A            EIVDIV         1          TEXT('L=LINEA ARRIVO DIVERSA -
007700111219     A                                      Z=ZONA CONSEGNA DIVERSA X STESSA -
007800111219     A                                      LINEA N=NON PRESENTE LNA')
007900111222     A            EIVFL1         1          TEXT('FLAG 1')
008000111222     A            EIVDTR    R               TEXT('DATA TRASMISSIONE')
008100111222     A                                      REFFLD($DA8)
