000100111012      *---------------------------------------------------------------*
000200111012      * Work-File * Errori Versioni EasySped - VAS (da file TIESV00F) *
000300111012      *---------------------------------------------------------------*
000400111012     A                                      REF(TIESV00F)
000500111012      *
000600111012     A          R WFESV000                  TEXT('WF VAS - Errori Vers-
000700111012     A                                      ioni EasySped')
000800111012      *
000900111012      * "Chiavi" di accesso:
001000111012     A            WESKSC    R     P         REFFLD(ESVEKSC)
001100111014     A                                      EDTWRD('   .    ')
001200111012     A            WESERR    R               REFFLD($ALFA2     CNDIZION)
001300111012     A                                      TEXT('Codice/Gravità ERROR-
001400111012     A                                      E')
001500111012     A                                      COLHDG('Codice ERRORE')
001600111012      *
001700111012      * Messaggio di errore:
001800111020     A            WESMSG       150A
001900111012     A                                      TEXT('Messaggio di ERRORE')
002000111012     A                                      COLHDG('Messaggio ERRORE')
002100111012      *
002200111012      * Dati statistici:
002300111014     A            WESDT1    R     P         REFFLD(ESVEDAT)
002400111012     A                                      TEXT('Data 1° inserimento')
002500111012     A                                      COLHDG('   Data 1ª' +
002600111012     A                                             'occorrenza')
002700111012     A                                      EDTWRD('    /  /  ')
002800111014     A            WESDT9    R     P         REFFLD(ESVEDAT)
002900111012     A                                      TEXT('Data ultima occorren-
003000111012     A                                      za')
003100111012     A                                      COLHDG(' Data ult.' +
003200111012     A                                             'occorrenza')
003300111012     A                                      EDTWRD('    /  /  ')
003400111012     A            WESTGO    R               REFFLD($SNA       CNDIZION)
003500111012     A                                      TEXT('Totale giorni di occ-
003600111012     A                                      orrenza')
003700111012     A                                      COLHDG('  Tot. gg.' +
003800111012     A                                             'occorrenza')
003900111012     A                                      EDTCDE(J)
004000111020     A            WESNSOL        3  0
004100111020     A                                      TEXT('Numero Solleciti inv-
004200111020     A                                      iati')
004300111020     A                                      COLHDG('   Numero' +
004400111020     A                                             'Solleciti')
004500111012      *
004600111012      * Ultimi dati (errati) rilevati:
004700111012     A            WESEVER   R               REFFLD(ESVEVER   )
004800111012     A            WESCVER   R     P         REFFLD(ESVCVER   )
004900111012     A            WESCDSC   R     P         REFFLD(ESVCDSC   )
005000111012     A                                      EDTWRD('    /  /  ')
005100111012     A            WESSNCD   R     P         REFFLD(ESVSNCD   )
005200111012     A            WESSNCA   R     P         REFFLD(ESVSNCA   )
005300111012     A            WESSNCC   R     P         REFFLD(ESVSNCC   )
005400111012     A            WESNRS    R               REFFLD(ESVNRS    )
005500111012     A            WESOBJ    R               REFFLD(ESVOBJ    )
005600111012     A            WESCORPO  R               REFFLD(ESVCORPO  )
005700111012     A            WESTYPWEB R               REFFLD(ESVTYPWEB )
005800111012     A            WESCVERMAXR     P         REFFLD(ESVCVERMAX)
005900111012     A            WESCDDEMAXR     P         REFFLD(ESVCDDEMAX)
006000111012     A                                      EDTWRD('    /  /  ')
006100111012     A            WESCDSCMAXR     P         REFFLD(ESVCDSCMAX)
006200111012     A                                      EDTWRD('    /  /  ')
