000100000000     A*--------------------------------------------------------------*
000200060411     A* WRK-FILE X GEO REFERENZIAZIONE INDIRIZZI
000300000000     A*--------------------------------------------------------------*
000400890913     A                                      REF(CNDIZION)
000500060411     A          R WFGRI000                  TEXT('WRKF X GEO-REF. INDIRIZZI')
000600060411     A            GRIAAS    R     S         REFFLD($AAS)
000700060411     A            GRILNP    R     S         REFFLD($LNP)
000800060411     A            GRINRS    R     S         REFFLD($NRS)
000900060411     A            GRINSP    R     S         REFFLD($NSP)
001000060411     A            GRITBL    R               REFFLD($TBL)
001100060411     A            GRICBO    R               REFFLD($CBO)
001200060411     A            GRIMGS    R     S         REFFLD($MMG)
001300940913     A                                      TEXT('MESE/GIORNO SPEDIZIONE')
001400990728     A                                      EDTWRD('  /  ')
001500060411     A            GRILNA    R     S         REFFLD($LNA)
001600060411     A            GRINCL    R     S         REFFLD($NCL)
001700990602     A* PESO
001800060411     A            GRIPKF    R     S         REFFLD($PKF)
001900990602     A* VOLUME
002000060411     A            GRIVLF    R     S         REFFLD($VLF)
002100060411     A            GRITSP    R               REFFLD($TSP)
002200990602     A* DESTINATARIO
002300060411     A            GRIIND    R               REFFLD($IND)
002400060411     A            GRICAD    R               REFFLD($CAD)
002500060411     A            GRILOD    R               REFFLD($LOD)
002600060508     A            GRILODN   R               REFFLD($LOD)
002700060508     A                                      TEXT('LOCALITA DEST. NORMALIZZATA')
002800060508     A                                      COLHDG('LOC. DEST. NORM.')
002900060411     A            GRIPRD    R               REFFLD($PRD)
003000060411     A            GRINZD    R               REFFLD($NZD)
003100060411     A            GRIFIN    R               REFFLD($FIN)
003200990602     A* MITTENTE
003300060630     A            GRIRSM    R               REFFLD($RSM)
003400060630     A            GRIINM    R               REFFLD($INM)
003500060630     A            GRICAM    R               REFFLD($CAM)
003600060630     A            GRILOM    R               REFFLD($LOM)
003700060630     A            GRIPRM    R               REFFLD($PRM)
003800060630     A            GRINZM    R               REFFLD($NZM)
003900060411     A            GRIPDC    R     S         REFFLD($PDR)
004000990602     A                                      TEXT('COD.PADRONCINO CONSEGNA')
004100990602     A                                      COLHDG('PADR' 'CONSEGNA')
004200060630     A            GRIFDC    R               REFFLD($LNA)
004300060630     A                                      TEXT('P.O. GESTIONE DISTINTA CONSEG+
004400060630     A                                      NA')
004500060630     A                                      COLHDG('PO GEST.' 'DIST.CONS.')
004600060630     A            GRINDC    R               REFFLD($NDC)
004700060630     A                                      TEXT('NR.DISTINTA CONSEGNA')
004800060630     A                                      COLHDG('NUM' 'DIST.CONS')
004900060411     A            GRIDDC    R     S         REFFLD($DDC)
005000990602     A                                      TEXT('DATA DISTINTA CONSEGNA')
005100990602     A                                      COLHDG('DATA' 'DIST.CONS')
005200060411     A            GRISTP    R     S         REFFLD($STP)
005300060411     A            GRIDCM    R     S         REFFLD($DCM)
005400060411     A            GRIHMC    R     S         REFFLD($HMC)
005500060411     A            GRICCA    R               REFFLD($CCA)
005600060411     A            GRIFFD    R               REFFLD($FFD)
005700060411     A            GRIFTC    R               REFFLD($CCP)
005800990602     A                                      TEXT('COD. 1°CONSEGNA PARTICOLARE')
005900060411     A            GRITC2    R               REFFLD($CCP)
006000990602     A                                      TEXT('COD. 2°CONSEGNA PARTICOLARE')
006100990602     A                                      COLHDG('2 CONS' 'PARTIC')
006200060411     A            GRIGC1    R               REFFLD($GC1)
006300060411     A            GRIGC2    R               REFFLD($GC2)
006400060411     A            GRITCR    R               REFFLD($TCR)
006500060411     A            GRIDCR    R     S         REFFLD($DCR)
006600060411     A            GRIHCR    R     S         REFFLD($HCR)
006700990602     A* FLAG BOLLA
006800060411     A            GRIFBR    R               REFFLD($FBR)
006900060411     A            GRILL1         1A         TEXT('FLAG DDT')
007000990602     A                                      COLHDG('FLAG' 'DDT')
007100060411     A* FLAG DESTINATARI PARTICOLARI
007200060411     A            GRIDST         1A         TEXT('DESTINATARIO PARTICOLARE')
007300060411     A* FLAG OPERATIVI
007400060411     A            GRIAIN         1A         TEXT('AMBITO INSTRADAMENTO')
007500060412     A* FLAG DI STATO
007600060412     A            GRIERR         1A         TEXT('CODICE ERRORE')
