000100150413      */*END
000200150413      *===============================================================*
000300150413      *?Indice Pubbliche Amministrazioni (iPA): Unità Organizzative  ?*
000400150413      *===============================================================*
000500150413     A                                      REF(CNDIZION)
000600150413      *
000700160916     A          R WFIPA200                  TEXT('iPA: UNITÀ ORGANIZZA-
000800160916     A                                      TIVE - download dal sito')
000900150413      *
001000150413     A            IP2COD       100          TEXT('Cod. dell''Unità Org-
001100150413     A                                      anizzativa')
001200150413     A                                      COLHDG('Codice  Unità' +
001300150413     A                                             'Organizzativa')
001400150413     A            IP2AOO       100          TEXT('Cod. Area Organizzat-
001500150413     A                                      iva Omogenea dell''ufficio')
001600150413     A                                      COLHDG('Area Organizzat.' +
001700150413     A                                             'Omogenea Ufficio')
001800150413     A            IP2DES      1000          TEXT('Denominazione dell''-
001900150413     A                                      Unità Organizzativa')
002000150413     A                                      COLHDG('Denomin.Unità' +
002100150413     A                                             'Organizzativa')
002200150413     A*//                                   VARLEN(100)
002300150413     A            IP2LOC       100          TEXT('Comune della sede de-
002400150413     A                                      ll''Unità Organizzativa')
002500150413     A                                      COLHDG('Comune Unità' +
002600150413     A                                             'Organizzativa')
002700150413     A*//         IP2CAP         5S 0
002800150413     A            IP2CAP         5          TEXT('CAP del comune della-
002900150413     A                                       sede dell''Unità Organizz-
003000150413     A                                      ativa')
003100150413     A                                      COLHDG('C.A.P.')
003200150413     A            IP2PRV         4          TEXT('Provincia della sede-
003300150413     A                                       dell''Unità Organizzativa')
003400150413     A                                      COLHDG('Prov.')
003500150413     A            IP2REG        50          TEXT('Regione della sede d-
003600150413     A                                      ell''Unità Organizzativa')
003700150413     A                                      COLHDG('Regione')
003800150413     A            IP2IND       200          TEXT('Indirizzo dell''Unit-
003900150413     A                                      à Organizzativa')
004000150413     A                                      COLHDG('Indirizzo')
004100150413     A*//         IP2TEL        50S 0
004200150413     A            IP2TEL        50          TEXT('Telefono dell''Unità-
004300150413     A                                       Organizzativa')
004400150413     A                                      COLHDG('Telefono')
004500150413     A            IP2RNM        50          TEXT('Nome del Responsabil-
004600150413     A                                      e dell''Unità Organizzativa')
004700150413     A                                      COLHDG('Nome Respons.')
004800150413     A            IP2RCG        50          TEXT('Cognome del Responsa-
004900150413     A                                      bile dell''Unità Organizza-
005000150413     A                                      tiva')
005100150413     A                                      COLHDG('Cognome Respons.')
005200150413     A            IP2REML      256          TEXT('Mail del Responsabil-
005300150413     A                                      e dell''Unità Organizzativa')
005400150413     A                                      COLHDG('Mail Respons.')
005500150413     A*//                                   VARLEN(30)
005600150413     A            IP2RTEL       50          TEXT('Tel. del Responsabil-
005700150413     A                                      e dell''Unità Organizzativa')
005800150413     A                                      COLHDG('Tel. Respons.')
005900150413     A            IP2CAMM      100          TEXT('Cod. dell''Ente a cu-
006000150413     A                                      i l''U.O. appartiene')
006100150413     A                                      COLHDG('Codice Ente')
006200150413     A            IP2OUP       100          TEXT('Cod. dell''Unità Org-
006300150413     A                                      anizzativa Padre')
006400150413     A                                      COLHDG('Codice Padre')
006500150413     A*//         IP2FAX        50S 0
006600150413     A            IP2FAX        50          TEXT('Fax dell''Unità Orga-
006700150413     A                                      nizzativa')
006800150413     A                                      COLHDG('Fax')
006900150413     A            IP2UFF         6          TEXT('Cod. Univoco dell''U-
007000150413     A                                      fficio all''interno dell''-
007100150413     A                                      IPA')
007200150413     A                                      COLHDG('Cod.Univoco')
007300150413     A            IP2MAIL1     256          TEXT('Mail dell''Unità Org-
007400150413     A                                      anizzativa')
007500150413     A                                      COLHDG('Mail')
007600150413     A*//                                   VARLEN(30)
007700150413     A            IP2TMAI1       7          TEXT('Tipo di mail (PEC/CE-
007800150413     A                                      C-PAC/ecc.)')
007900150413     A                                      COLHDG('Tipo' 'Mail')
008000150413     A            IP2MAIL2     256          TEXT('Mail dell''Unità Org-
008100150413     A                                      anizzativa')
008200150413     A                                      COLHDG('Mail')
008300150413     A*//                                   VARLEN(30)
008400150413     A            IP2TMAI2       7          TEXT('Tipo di mail (PEC/CE-
008500150413     A                                      C-PAC/ecc.)')
008600150413     A                                      COLHDG('Tipo' 'Mail')
008700150413     A            IP2MAIL3     256          TEXT('Mail dell''Unità Org-
008800150413     A                                      anizzativa')
008900150413     A                                      COLHDG('Mail')
009000150413     A*//                                   VARLEN(30)
009100150413     A            IP2TMAI3       7          TEXT('Tipo di mail (PEC/CE-
009200150413     A                                      C-PAC/ecc.)')
009300150413     A                                      COLHDG('Tipo' 'Mail')
