000100941206     A*------------------------------------------------------------------------*
000200020301     A*  L.F. X  IVA+PAD DESCEND
000300941206     A*------------------------------------------------------------------------*
000400991214     A          R WFKUN000                  PFILE(WFKUN00F)
000500020301     A          K WFKIVA
000600020301     A          K WFKPAD                    DESCEND
