000100010604     A*------------------------------------------------------------------------*
000200060814     A* WORKFILE STAMPA LDV NON SCANNERRIZZATE - DETTAGLIO            -IN AZM- *
000300010604     A*------------------------------------------------------------------------*
000400010604     A                                      REF(CNDIZION)
000500060814     A          R WFLDVD00                  TEXT('WFILE LDV NON SCANNERIZZATE --
000501060814                                            DETTAGLIO')
000600060814     A            DLDVAAS   R               REFFLD($AAS)
000700060814     A            DLDVLNP   R               REFFLD($LNP)
000900060814     A            DLDVNRS   R               REFFLD($NRS)
000901060814     A            DLDVNSP   R               REFFLD($NSP)
001300060814     A            DLDVLNA   R               REFFLD($LNA)
001400060814     A            DLDVDCM   R               REFFLD($DCM)
001500060814     A            DLDVDPD        1A         TEXT('IMPORT DPD')
001700060814     A                                      COLHDG('IMPORT' 'DPD')
