000100970515     A*------------------------------------------------------------------------*
000200120903     A* SALDI STATISTICA MENSILE "REPORT SETTIMANALE"                          *
000300970515     A*------------------------------------------------------------------------*
000400120903     A                                      UNIQUE
000500120903     A          R WSLSS600                  PFILE(WSLSS60F)
000600120903     A          K WSSTIE
000700120903     A          K WSSTIP
000800120903     A          K WSSLIN
000900120903     A          K WSSKGF
