000100970522     A*------------------------------------------------------------------------*
000200030107     A* WRK-FILE MOVIMENTI GABBIE/BANCALI - RICEZIONE
000300970522     A* MBR=*NONE  -  MAXMBRS=*NOMAX
000400970522     A*------------------------------------------------------------------------*
000500021213     A          R WFMGB000                  FORMAT(WFMGB00F)
