000100941102     A*------------------------------------------------------------------------*
000200090805     A* WF STATISTICA DIROTTAMENTI                                             *
000300941102     A*------------------------------------------------------------------------*
000400090203     A                                      REF(CNDIZION)
000500090203     A*
000600090828     A          R WFMSP000                  TEXT('MONITORAGGIO SPED.CLIENTI')
000700090828     A            MSPDEL         8S 0       TEXT('DATA ELABORAZIONE')
000800090828     A            MSPUSR    R               REFFLD($PRU)
000900090828     A            MSPDAL         8S 0       TEXT('DATA DAL')
001000090828     A            MSPALL         8S 0       TEXT('DATA AL')
001100090828     A            MSPRDL         8S 0       TEXT('DATA RIFERIMENTO DAL')
001200090828     A            MSPRAL         8S 0       TEXT('DATA RIFERIMENTO AL')
001300090915     A            MSPAGE    R     S         REFFLD($AGE)
001400090915     A                                      TEXT('COD.COMMERCIALE UNIFICANTE')
001500090915     A            MSPDAG        25          TEXT('RAGIONE SOCIALE COMM.LE')
001600090828     A            MSPDIV    R               REFFLD($DIT)
001700090914     A                                      TEXT('DISTRETTO DEL COMM.LE UNIF.')
001800090828     A            MSPDDI        25A         TEXT('DESCR. DISTRETTO')
001900090828     A            MSPCAR    R               REFFLD($CAR)
002000090914     A                                      TEXT('COD. AREA DEL COMM.LE UNIF.')
002100090828     A            MSPDAR        25          TEXT('DESCRIZIONE AREA')
002200090204     A                                      COLHDG('DESCR.' 'AREA')
002300090915     A            MSPCLI    R     S         REFFLD($CCM)
002400090914     A                                      TEXT('CODICE CLIENTE UNIFICANTE')
002500090914     A            MSPRAG    R               REFFLD($RAGSOC)
002600090914     A                                      TEXT('RAGIONE SOCIALE')
002700110805     A            MSPBLO         1          TEXT('S=UNIFICANTE COMPLETAMENTE-
002800110805     A                                       BLOCCATO')
002900090828     A            MSPLNP    R    3S 0       REFFLD($LNP)
003000090828     A            MSPDLA        20          TEXT('DESCRIZIONE FILIALE')
003100090204     A                                      COLHDG('DESCR.' 'FILIALE')
003200090828     A            MSPCLV    R               REFFLD($CLV)
003300090828     A            MSPSPR         8S 0       TEXT('TOT. SPEDIZIONI RIFERIMENTO')
003400090915     A            MSPSPP         8S 0       TEXT('TOT. SPEDIZIONI PERIODO')
003500090915     A            MSPSMR         8S 0       TEXT('TOT. SPEDIZIONI MEDIE RIF.')
003600090915     A            MSPSMP         8S 0       TEXT('TOT. SPEDIZIONI MEDIE PERIOD')
003700090924     A            MSPSPC        12S 2       TEXT('% SCOST. MEDIE SPED.')
003800090915     A*
003900090924     A            MSPPKR        11S 1       TEXT('TOT. PESO KG    RIFERIMENTO')
004000090924     A            MSPPKP        11S 1       TEXT('TOT. PESO KG    PERIODO')
004100090924     A            MSPPMR        11S 1       TEXT('TOT. PESO MEDIO KG RIFERIM.')
004200090924     A            MSPPMP        11S 1       TEXT('TOT. PESO MEDIO KG PERIODO ')
004300090924     A            MSPPPC        14S 2       TEXT('% SCOST. MEDIE PESI')
004400090915     A*
004500090828     A            MSPNCR         8S 0       TEXT('TOT. COLLI      RIFERIMENTO')
004600090915     A            MSPNCP         8S 0       TEXT('TOT. COLLI      PERIODO')
004700090924     A            MSPVLR        11S 3       TEXT('TOT. VOLUME     RIFERIMENTO')
004800090924     A            MSPVLP        11S 3       TEXT('TOT. VOLUME     PERIODO')
