000100000000     A*--------------------------------------------------------------*
000200130910     A                                      REF(CNDIZION)
000300130910     A          R WFDPDC00                  TEXT('KSC NON PULIBILI DA -
000400130910     A                                      PDC')
000500130910      *
000600130910     A            SOCIETA        3A         TEXT('SOCIETA')
