000100140513      *------------------------------------------------------------------------*
000200140513      * WORKFILE - CLIENTI CON ORM COMMISSIONATI                               *
000300140513      *------------------------------------------------------------------------*
000400010604     A                                      REF(CNDIZION)
000500140513     A          R WFORC000                  TEXT('CLIENTI ORM COMMISSIONATI')
000600140513      * Parametri di lancio
000700140513     A            ORCUTE    R               REFFLD($PRU)
000800140513     A                                      TEXT('Profilo utente')
000900140513     A                                      COLHDG('Utente' 'Lancio')
001000140513     A            ORCDTA    R     S         REFFLD($DA8)
001100140513     A                                      TEXT('Data di lancio')
001200140513     A                                      COLHDG('Data' 'Lancio')
001300140513     A            ORCPOE    R     S         REFFLD($FIL)
001400140515     A                                      TEXT('Filiale Elaborata')
001500140515     A                                      COLHDG('Fil.' 'Elab.')
001600140513     A            ORCDPOE       25A         TEXT('Descrizione Filiale')
001700140513     A                                      COLHDG('Des' 'Filiale')
001800140513     A            ORCDTAD   R     S         REFFLD($DA8)
001900140513     A                                      TEXT('Data Inserimento Dal')
002000140513     A                                      COLHDG('Data' 'Dal')
002100140513     A            ORCDTAA   R     S         REFFLD($DA8)
002200140513     A                                      TEXT('Data Inserimento Al')
002300140513     A                                      COLHDG('Data' 'Al')
002400140513      * Dati elaborati
002500140513     A            ORCDIT    R               REFFLD($DIT)
002600140513     A                                      TEXT('Distretto Unificante')
002700140513     A                                      COLHDG('Distretto' 'Uni.')
002800140513     A            ORCDDIT       25A         TEXT('Descrizione Distretto')
002900140513     A                                      COLHDG('Des.' 'Distretto')
003000140513     A            ORCCAR    R               REFFLD($CAR)
003100140513     A                                      TEXT('Area Unificante')
003200140513     A                                      COLHDG('Area' 'Uni.')
003300140513     A            ORCDCAR       25A         TEXT('Descrizione Area')
003400140513     A                                      COLHDG('Des.' 'Area')
003500140513     A            ORCCMM    R               REFFLD($CMM)
003600140513     A                                      TEXT('Comm.le Unificante')
003700140513     A                                      COLHDG('Comm.le' 'Unificante')
003800140513     A            ORCDCMM   R               REFFLD($CMD)
003900140513     A                                      TEXT('Descrizione Unificante')
004000140513     A                                      COLHDG('Des' 'Unificante')
004100140513     A            ORCCOR    R               REFFLD($CRO)
004200140513     A                                      TEXT('Codice Ordinante')
004300140513     A                                      COLHDG('Cod.' 'Ordinante')
004400140513     A            ORCRSO    R               REFFLD($RSC)
004500140513     A                                      TEXT('Rag. Soc. Ordinante')
004600140513     A                                      COLHDG('Rag.' 'Soc.' 'Ordinante')
004700140520     A            ORCLOO    R               REFFLD($LOC)
004800140520     A                                      TEXT('Località Ordinante')
004900140520     A                                      COLHDG('Loc.' 'Ordinante')
005000140520     A            ORCPRO    R               REFFLD($PRO)
005100140520     A                                      TEXT('Provincia Ordinante')
005200140520     A                                      COLHDG('Prv.' 'Ordinante')
005300140513     A            ORCCOM         5S 0       TEXT('Tot. ORM Commissionati')
005400140513     A                                      COLHDG('Tot.' 'ORM' 'Comm')
005500140513     A            ORCVAS         5S 0       TEXT('Tot. da VAS')
005600140513     A                                      COLHDG('Tot.' 'VAS')
005700140513     A            ORCVDATI       5S 0       TEXT('Di cui VAS con Mail/SMS')
005800140513     A                                      COLHDG('VAS' 'Mail' 'SMS')
005900140513     A            ORCVMAIL       5S 0       TEXT('Di cui VAS con Mail')
006000140513     A                                      COLHDG('VAS' 'Mail')
006100140513     A            ORCVSMS        5S 0       TEXT('Di cui VAS con SMS')
006200140513     A                                      COLHDG('VAS' 'SMS')
006300140515     A            ORCMAN         5S 0       TEXT('Tot. Manuali')
006400140513     A                                      COLHDG('Tot.' 'Manuali')
006500140513     A            ORCMDATI       5S 0       TEXT('Di cui Man. con Mail/SMS')
006600140513     A                                      COLHDG('Man.' 'Mail' 'SMS')
006700140513     A            ORCMMAIL       5S 0       TEXT('Di cui Man. con Mail')
006800140513     A                                      COLHDG('Man.' 'Mail')
006900140513     A            ORCMSMS        5S 0       TEXT('Di cui Man. con SMS')
007000140513     A                                      COLHDG('Man.' 'SMS')
