000100980727     A*------------------------------------------------------------------------*
000200990503     A* WORKFILE REPORT CONTROLLO QUALITA'                                     *
000300980727     A*------------------------------------------------------------------------*
000400990406     A                                      UNIQUE
000500010123     A          R WFRCQ000                  PFILE(WFRCQ10F)
000600990507     A          K RCQFIL
000700990507     A          K RCQDAT
