000100100423     A*------------------------------------------------------------------------*
000200100423     A* WORKFILE REPORT COMMERCIALE ATTIVITA ' DI FILIALE                      *
000300100423     A*------------------------------------------------------------------------*
000400980727     A                                      REF(CNDIZION)
000500100423     A          R WFRCA000                  TEXT('WFILE REPORT ATTIVITA FIL')
000600100423     A            RCADIV    R               REFFLD($DIT)
000700100423     A                                      TEXT('DISTRETTO UNIFICANTE')
000800100423     A            RCADID        25          TEXT('DESCRIZIONE DISTRETTO')
000900100423     A            RCAARE    R     S         REFFLD($CAR)
001000100423     A            RCAARD        25          TEXT('DESRIZIONE AREA')
001100100423     A            RCAFIL    R     S         REFFLD($FIL)
001200100423     A            RCAFID        25          TEXT('DESRIZIONE FILIALE')
001300100517     A            RCAPDA         8S 0       TEXT('PERIODO CONSUNTIVO DAL')
001400100517     A            RCAPAL         8S 0       TEXT('PERIODO CONSUNTIVO AL')
001500100423     A            RCARGF    R     S         REFFLD($AGE)
001600100423     A                                      TEXT('AGENTE UNIFICANTE')
001700100423     A                                      COLHDG('AGE UNIF')
001800100423     A            RCADRG        25          TEXT('DESCRIZIONE AGENTE')
001900100423     A                                      COLHDG('DESCRIZIONE AGE UNIF')
002000100423     A            RCAFUN         5          TEXT('FUNZIONE AZIENDALE')
002100100423     A                                      COLHDG('FUNZIONE AZIENDALE')
002200100423     A            RCATEPM        6S 0       TEXT('TEL.ESEG. POT. MAI TRATTATI')
002300100423     A                                      COLHDG('T.ESEG' 'POTENZ' 'MAI TRA-
002400100423     A                                      T')
002500110419     A            RCACAAPM      70A         TEXT('SK 35 CAU.POTENZ.MAI TRATT.')
002600110419     A                                      COLHDG('35 CAUSALI' 'POTENZ.MAI TRA-
002700100604     A                                      TT.')
002800110419     A            RCANRAPM     175A         TEXT('35 QTA POTENZ.MAI TRATTATI')
002900100604     A                                      COLHDG('QTÀ POT.MAI TRAT.' 'X CAUS')
003000110419     A            RCATEPG        6S 0       TEXT('TEL.ESEG. POT. GIA TRATTATI')
003100110419     A                                      COLHDG('T.ESEG' 'POTENZ' 'GIA TRA-
003200110419     A                                      T')
003300110419     A            RCACAAPG      70A         TEXT('SK 35 CAU.POTENZ.GIA TRATTAT')
003400110419     A                                      COLHDG('35 CAUSALI' 'POTENZ.MAI TRA-
003500110419     A                                      TT.')
003600110419     A            RCANRAPG     175A         TEXT('35 QTA POTENZ.GIA TRATTATI')
003700110419     A                                      COLHDG('QTÀ POT.GIA TRATT.' 'X CAU')
003800110419     A            RCATEPP        6S 0       TEXT('TEL.ESEG. POTENZIALI PERSI')
003900110419     A                                      COLHDG('T.ESEG' 'POTENZ' 'PERSI')
004000110419     A            RCACAAPP      70A         TEXT('SK 35 CAU.POTENZ. PERSI')
004100110419     A                                      COLHDG('35 CAUSALI' 'POTENZ.PERSI')
004200110419     A            RCANRAPP     175A         TEXT('35 QTA POTENZIALI PERSI')
004300110419     A                                      COLHDG('QTÀ POT.PERSI' 'X CAU')
004400110419     A            RCATECFT       6S 0       TEXT('TEL.ESEG. CLIENTI FUORI TRAT')
004500110419     A                                      COLHDG('T.ESEG' 'CLIENTI' 'FUORI TR-
004600110419     A                                      AT')
004700110419     A            RCACAACF      70A         TEXT('SK 35 CAU.CLIENTI FUORI TRAT')
004800110419     A                                      COLHDG('35 CAUSALI' 'CLIENTI FUORI -
004900110419     A                                      TRAT')
005000110419     A            RCANRACF     175A         TEXT('35 QTA CLIENTI FUORI TRATT.')
005100110419     A                                      COLHDG('QTÀ CL.FUORI TRAT' 'X CAUS')
005200110419     A            RCATEPT        6S 0       TEXT('TEL.ESEG. POTENZIALI IN TRAT')
005300110419     A                                      COLHDG('T.ESEG' 'POTENZ' 'IN TRAT.')
005400110419     A            RCACAAPT      70A         TEXT('SK 35 CAU.POTENZ.IN TRATT.')
005500110419     A                                      COLHDG('35 CAUSALI' 'POTENZ. IN TRA-
005600110419     A                                      TT.')
005700110419     A            RCANRAPT     175A         TEXT('35 QTA POTENZ. IN TRATT.')
005800110419     A                                      COLHDG('QTÀ POTENZ.IN TRAT' 'X CAU')
005900110419     A            RCATECT        6S 0       TEXT('TEL.ESEG. CLIENTI  IN TRAT')
006000110419     A                                      COLHDG('T.ESEG' 'CLIENTI' 'IN TRAT')
006100110419     A            RCACAACT      70A         TEXT('SK 35 CAU.CLIENTI IN TRATT.')
006200110419     A                                      COLHDG('35 CAUSALI' 'CLIENTI IN TRA-
006300110419     A                                      TT.')
006400110419     A            RCANRACT     175A         TEXT('35 QTA CLIENTI IN TRATTATIVA')
006500110419     A                                      COLHDG('QTÀ CL.IN TRATT.' 'X CAUS.')
006600110419     A            RCATEPPT       6S 0       TEXT('TEL.ESEG. PERSI IN TRAT')
006700110419     A                                      COLHDG('T.ESEG' 'PERSI' 'IN TRAT.')
006800110419     A            RCACAAPPT     70A         TEXT('SK 35 CAU.PERSI IN TRATT.')
006900110419     A                                      COLHDG('35 CAUSALI' 'PERSI IN TRATT-
007000110419     A                                      ')
007100110419     A            RCANRAPPT    175A         TEXT('35 QTA PERSI IN TRATTATIVA')
007200110419     A                                      COLHDG('QTÀ PERSI IN TR.' 'X CAUS.')
007300110419     A            RCATEPOST      6S 0       TEXT('TEL.ESEG. POST OFFERTA')
007400110419     A                                      COLHDG('T.ESEG' 'POST OFFERTA')
007500110419     A            RCATEPO30M     6S 0       TEXT('TEL.ES. POST OFF. C. 30 MIA')
007600110419     A                                      COLHDG('TEL.ESEG' 'POST OFFERTA' 'C-
007700110419     A                                      AUSALE 30 MIA')
007800110419     A            RCATEPO30A     6S 0       TEXT('TEL.ES.POST OFF. C.30 ALTRI')
007900110419     A                                      COLHDG('TEL.ESEG' 'POST OFFERTA' 'C-
008000110419     A                                      AUSALE 30 ALTRI')
008100110419     A            RCATEPO33M     6S 0       TEXT('TEL.ES.POST OFF. C.33 MIA')
008200110419     A                                      COLHDG('TEL.ESEG' 'POST OFFERTA' 'C-
008300110419     A                                      AUSALE 33 MIA')
008400110419     A            RCATEPO33A     6S 0       TEXT('TEL.ES.POST OFF. C.33 ALTRI')
008500110419     A                                      COLHDG('TEL.ESEG' 'POST OFFERTA' 'C-
008600110419     A                                      AUSALE 33 ALTRI')
008700110419     A            RCATECALDI     6S 0       TEXT('TEL.ESEG. CALDI')
008800110419     A                                      COLHDG('T.ESEG' 'CALDI')
008900100423     A            RCATEPC31M     6S 0       TEXT('TEL.ESEG.POT. CALDI C31 MIA')
009000100423     A                                      COLHDG('TEL.ESEG' 'POTENZ' 'CALDI 3-
009100100423     A                                      1 MIA')
009200100423     A            RCATEPC31A     6S 0       TEXT('TEL.ESEG.POT. CALDI C31 ALTR')
009300100423     A                                      COLHDG('TEL.ESEG' 'POTENZ' 'CALDI 3-
009400100423     A                                      1 ALTRI')
009500110419     A            RCATEPC44M     6S 0       TEXT('TEL.ESEG.POT. CALDI C44 MIA')
009600110419     A                                      COLHDG('TEL.ESEG' 'POTENZ' 'CALDI 4-
009700110419     A                                      4 MIA')
009800110419     A            RCATEPC44A     6S 0       TEXT('TEL.ESEG.POT. CALDI C44 ALTR')
009900110419     A                                      COLHDG('TEL.ESEG' 'POTENZ' 'CALDI 4-
010000110419     A                                      4 ALTRI')
010100110419     A            RCATEPOSVE     6S 0       TEXT('TEL.ESEG. POST VENDITA')
010200110419     A                                      COLHDG('T.ESEG' 'POST VENDITA')
010300100423     A            RCATEPV32M     6S 0       TEXT('TEL.ES.POT.POST VEN.C32 MIA')
010400100423     A                                      COLHDG('TEL.ESEG' 'POTENZ' 'POST VE-
010500100423     A                                      NDITA 32 MIA')
010600100423     A            RCATEPV32A     6S 0       TEXT('TEL.ES.POT.POST VEN.C32 ALTR')
010700100423     A                                      COLHDG('TEL.ESEG' 'POTENZ' 'POST VE-
010800100423     A                                      NDITA 32 ALT')
010900110419     A            RCATEMANTE     6S 0       TEXT('TEL.ESEG. MANTENIMENTI')
011000110419     A                                      COLHDG('T.ESEG' 'MANTENIMENTI')
011100100604     A            RCATEPC40M     6S 0       TEXT('TEL.ES. KSC C.40 MIA ')
011200100604     A                                      COLHDG('TEL.ESEG' 'CLIENTI' 'CAUSAL-
011300100604     A                                      E 40 MIA')
011400100604     A            RCATEPC40A     6S 0       TEXT('TEL.ES. KSC C.40 ALTRI')
011500100604     A                                      COLHDG('TEL.ESEG' 'CLIENTI' 'CAUSAL-
011600100604     A                                      E 40 ALTRI')
011700110419     A            RCATEINCRE     6S 0       TEXT('TEL.ESEG. INCR/AUMENTI')
011800110419     A                                      COLHDG('T.ESEG' 'INCR/AUMENTI')
011900110419     A            RCATEPC50M     6S 0       TEXT('TEL.ES. KSC C.50  MIA')
012000100604     A                                      COLHDG('TEL.ESEG' 'CLIENTI' 'CAUSAL-
012100110419     A                                      E 50 MIA')
012200110419     A            RCATEPC50A     6S 0       TEXT('TEL.ES. KSC C.50 ALTRI')
012300100604     A                                      COLHDG('TEL.ESEG' 'CLIENTI' 'CAUSAL-
012400110419     A                                      E 50 ALTRI')
012500110419     A            RCATELESE      6S 0       TEXT('TOTALE TELFONATE ESEGUITE')
012600110419     A                                      COLHDG('TOTALE' 'TEL.ESEGUITE')
012700100604     A            RCATAPP        6S 0       TEXT('TOT.APPUNTAMENTI PRESI')
012800100604     A                                      COLHDG('TOT. APPUNT.' 'PRESI')
012900100604     A            RCAPATN        6S 0       TEXT('1° APPUNTAMENTO PRESO NUOVO')
013000100604     A                                      COLHDG('1° APPUNT' 'NUOVO')
013100100604     A            RCAPATM        6S 0       TEXT('1° APP.TRATT. MANTENIMENTO')
013200100604     A                                      COLHDG('1° APPUNT' 'TRAT.MANTEN.')
013300110118     A            RCAPATA        6S 0       TEXT('1° APP.TRATT. AUMENTO')
013400110118     A                                      COLHDG('1° APPUNT' 'TRAT.AUMENTO')
013500100604     A            RCAPATC        6S 0       TEXT('1° APP.TRATT. INCASSO')
013600100604     A                                      COLHDG('1° APPUNT' 'TRAT.INCASSO')
013700110118     A            RCAPATI        6S 0       TEXT('1° APP.TRATT. INCREMENTO')
013800110118     A                                      COLHDG('1° APPUNT' 'TRAT.INCREM.')
013900110118     A            RCAPATR        6S 0       TEXT('1° APP.TRATT. RESTYLING')
014000110118     A                                      COLHDG('1° APPUNT' 'TRAT.RESTYL.')
014100100608     A            RCAAPPTN       6S 0       TEXT('APP.TRATT. NUOVO')
014200100608     A                                      COLHDG('APPUNT' 'NUOVO')
014300100608     A            RCAAPPTM       6S 0       TEXT('APP.TRATT. MANTENIMENTO')
014400100608     A                                      COLHDG('APPUNT' 'TRAT.MANTEN.')
014500110118     A            RCAAPPTA       6S 0       TEXT('APP.TRATT. AUMENTO')
014600110118     A                                      COLHDG('APPUNT' 'TRAT.AUMENTO')
014700100608     A            RCAAPPTC       6S 0       TEXT('APP.TRATT. INCASSO')
014800100608     A                                      COLHDG('APPUNT' 'TRAT.INCASSO')
014900110118     A            RCAAPPTI       6S 0       TEXT('APP.TRATT. INCREMENTO')
015000110118     A                                      COLHDG('APPUNT' 'TRAT.INCREMENTO')
015100110118     A            RCAAPPTR       6S 0       TEXT('APP.TRATT. RESTYLING')
015200110118     A                                      COLHDG('APPUNT' 'TRAT.RESTYLING')
015300100423     A            RCAAPTN        6S 0       TEXT('APP.ESEG.SU TRATT. TIPO N')
015400100423     A                                      COLHDG('APP.ESE' 'TRATT. N')
015500100423     A            RCAAPTM        6S 0       TEXT('APP.ESEG.SU TRATT. TIPO M')
015600100423     A                                      COLHDG('APP.ESE' 'TRATT. M')
015700100423     A            RCAAPTA        6S 0       TEXT('APP.ESEG.SU TRATT. TIPO A')
015800100423     A                                      COLHDG('APP.ESE' 'TRATT. A')
015900100423     A            RCAAPTC        6S 0       TEXT('APP.ESEG.SU TRATT. TIPO C')
016000100423     A                                      COLHDG('APP.ESE' 'TRATT. C')
016100110118     A            RCAAPTI        6S 0       TEXT('APP.ESEG.SU TRATT. TIPO I')
016200110118     A                                      COLHDG('APP.ESE' 'TRATT. I')
016300110118     A            RCAAPTR        6S 0       TEXT('APP.ESEG.SU TRATT. TIPO R')
016400110118     A                                      COLHDG('APP.ESE' 'TRATT. R')
016500100423     A            RCAAFTN        6S 0       TEXT('AFF.ESEG.SU TRATT. TIPO N')
016600100423     A                                      COLHDG('AFF.ESE' 'TRATT. N')
016700100423     A            RCAAFTM        6S 0       TEXT('AFF.ESEG.SU TRATT. TIPO M')
016800100423     A                                      COLHDG('AFF.ESE' 'TRATT. M')
016900100423     A            RCAAFTA        6S 0       TEXT('AFF.ESEG.SU TRATT. TIPO A')
017000100423     A                                      COLHDG('AFF.ESE' 'TRATT. A')
017100100423     A            RCAAFTC        6S 0       TEXT('AFF.ESEG.SU TRATT. TIPO C')
017200100423     A                                      COLHDG('AFF.ESE' 'TRATT. C')
017300110118     A            RCAAFTI        6S 0       TEXT('AFF.ESEG.SU TRATT. TIPO I')
017400110118     A                                      COLHDG('AFF.ESE' 'TRATT. I')
017500110118     A            RCAAFTR        6S 0       TEXT('AFF.ESEG.SU TRATT. TIPO R')
017600110118     A                                      COLHDG('AFF.ESE' 'TRATT. R')
017700100423     A            RCAAP24        6S 0       TEXT('APP. DISDETTI C. 24 ')
017800100423     A                                      COLHDG('APPUNTAM.' 'DISDETTI CAUS. -
017900100423     A                                      24')
018000100423     A            RCAFERIEGG     3S 0       TEXT('GIORNI FERIE')
018100100423     A                                      COLHDG('GIORNI' 'FERIE')
018200100526     A            RCAFERIEHH     5S 2       TEXT('HHMM FERIE')
018300100423     A                                      COLHDG('HHMM' 'FERIE')
018400100526     A            RCAUFRA        5S 2       TEXT('HHMM RIUNIONE AREA')
018500100423     A                                      COLHDG('HHMM' 'RIUNIONE AREA')
018600100526     A            RCAUFRC        5S 2       TEXT('HHMM RIUNIONE COMMERCIALE')
018700100423     A                                      COLHDG('HHMM' 'RIUNIONE COMM.LE')
018800100526     A            RCAUFUF        5S 2       TEXT('HHMM ATTIVITA UFFICIO')
018900100423     A                                      COLHDG('HHMM' 'ATTIVITA UFFICIO')
019000110419     A            RCAINEVASE     6S 0       TEXT('TELEFONATE INEVASE')
019100110419     A                                      COLHDG('TEL' 'INEVASE')
019200110419     A            RCACAAI       70A         TEXT('SK 35 CAUSALI INEVASE')
019300110419     A                                      COLHDG('35 CAUSALI' 'ATTIVITA INEVA-
019400100423     A                                      SE')
019500110419     A            RCANRAI      175A         TEXT('35 QTA NUM.DI 5 ATT.INEVASE')
019600100423     A                                      COLHDG('QTÀ ATT.INEVAS' 'X CAUSALE')
019700100423     A            RCADAT    R     S         REFFLD($DA8)
019800100423     A                                      TEXT('DATA ESECUZIONE')
019900100423     A                                      COLHDG('DATA' 'ESECUZ.')
020000100423     A            RCAPRU    R               REFFLD($PRU)
020100100423     A                                      TEXT('UTENTE ESECUZIONE')
020200100423     A                                      COLHDG('UTENTE' 'ESECUZ.')
