000100980727     A*------------------------------------------------------------------------*
000200990406     A* WORKFILE REPORT DANNI                                         -IN GRU- *
000300980727     A*------------------------------------------------------------------------*
000400980727     A                                      REF(CNDIZION)
000500990406     A          R WFRDN000                  TEXT('WFILE REPORT DANNI')
000600990406     A            RDNDIV    R               REFFLD($DIT)
000700990406     A            RDNARE    R     S         REFFLD($CAR)
000800990406     A            RDNFIL    R     S         REFFLD($FIL)
000900990406     A            RDNANN    R     S         REFFLD($AAA)
001000990406     A            RDNMES    R     S         REFFLD($MMM)
001100990406     A            RDNTAE    R               REFFLD($TAD)
001200990406                                            TEXT('TIPO ANOMALIA EVENTO')
001300990917                                            COLHDG('TIPO ANOM.' 'EVENTO')
001400990406     A            RDNRGA         1          TEXT('RAGGRUPPAMENTO ANOMALIA')
001500990917                                            COLHDG('RAGGRUP.' 'ANOM')
001600990406     A            RDNTAD    R               REFFLD($TAD)
001700990917     A            RDNCRC    R               REFFLD($CRC)
001800990406     A            RDNCRS         1          TEXT('S/N CALCOLO RESPONSABILITA''')
001900990406     A            RDNCCH    R               REFFLD($CCH)
002000990406                                            TEXT('CAUSALE CHIUSURA CA')
002100990406                                            COLHDG('CAUS' 'CHIUSURA' 'CA')
002200990406     A            RDNFPR    R               REFFLD($FLA)
002300990406                                            TEXT('TIPO GESTIONE : T/P')
002400990406                                            COLHDG('TIPO GESTIONE : T/P')
002500990408     A            RDNNCN        13S 2
002600990406                                            TEXT('NUMERO COLLI DANNEGGIATI/MANC+
002700990406                                            ANTI')
002800990406                                            COLHDG('COLLI' 'DANNEGG/MANC')
002900990413     A            RDNNCO        13S 2
003000990413                                            TEXT('TOTALE COLLI PARTENZA/ARRIVO/+
003100990413                                            TRANSITO')
003200990413                                            COLHDG('TOT' 'COLLI P/A/T')
