000100010604     A*------------------------------------------------------------------------*
000200010604     A* WORKFILE REPORT O.R.M.                                        -IN GRU- *
000300010604     A*------------------------------------------------------------------------*
000400010604     A                                      REF(CNDIZION)
000500010604     A          R WFROR000                  TEXT('WFILE REPORT O.R.M.')
000600030912     A            RORTRC    R               REFFLD($TRC)
000700010604     A            RORPOE    R     S         REFFLD($FIL)
000800010605     A                                      TEXT('PUNTO OPERATIVO ELABORATO')
000900010604     A                                      COLHDG('P.O.' 'ELA.')
001000010604     A                                      EDTCDE(Z)
001100010604     A            RORDAE    R     S         REFFLD($DA8)
001200010604     A                                      TEXT('DATA ELABORAZIONE')
001300010604     A                                      COLHDG('DATA' 'ELA.')
001400010604     A            RORDIS    R               REFFLD($DIT)
001500010604     A            RORARE    R               REFFLD($CAR)
001600010604     A            ROROIM         5S 0       TEXT('NR.RITIRI IMMESSI')
001700010704     A                                      COLHDG('IMM.')
001800010704     A                                      EDTCDE(Z)
001900010604     A            ROROCO         5S 0       TEXT('NR.RITIRI COMMISSIONATI')
002000010704     A                                      COLHDG('COM.')
002100010704     A                                      EDTCDE(Z)
002200010604     A            RORODE         5S 0       TEXT('NR.RITIRI DA ESEGUIRE')
002300010704     A                                      COLHDG('DA' 'ESEG.')
002400010704     A                                      EDTCDE(Z)
002500010604     A            ROROES         5S 0       TEXT('NR.RITIRI ESEGUITI')
002600010704     A                                      COLHDG('ESEG.')
002700010704     A                                      EDTCDE(Z)
002800010604     A            RORONE         5S 0       TEXT('NR.RITIRI NON ESEGUITI')
002900010704     A                                      COLHDG('NON' 'ESEG.')
003000010704     A                                      EDTCDE(Z)
003100010704     A            RORN01         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
003200010704     A                                          01')
003300010704     A                                      COLHDG('NO ES' 'CAU' '01')
003400010704     A                                      EDTCDE(Z)
003500010704     A            RORN02         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
003600010704     A                                          02')
003700010704     A                                      COLHDG('NO ES' 'CAU' '02')
003800010704     A                                      EDTCDE(Z)
003900010704     A            RORN03         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
004000010704     A                                          03')
004100010704     A                                      COLHDG('NO ES' 'CAU' '03')
004200010704     A                                      EDTCDE(Z)
004300010704     A            RORN04         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
004400030912     A                                          04')
004500030912     A                                      COLHDG('NO ES' 'CAU' '04')
004600010704     A                                      EDTCDE(Z)
004700010704     A            RORN05         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
004800010704     A                                          XX')
004900010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
005000010704     A                                      EDTCDE(Z)
005100010704     A            RORN06         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
005200010704     A                                          XX')
005300010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
005400010704     A                                      EDTCDE(Z)
005500010704     A            RORN07         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
005600010704     A                                          XX')
005700010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
005800010704     A                                      EDTCDE(Z)
005900010704     A            RORN08         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
006000010704     A                                          XX')
006100010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
006200010704     A                                      EDTCDE(Z)
006300010704     A            RORN09         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
006400010704     A                                          XX')
006500010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
006600010704     A                                      EDTCDE(Z)
006700010704     A            RORN10         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
006800010704     A                                          XX')
006900010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
007000010704     A                                      EDTCDE(Z)
007100010704     A            ROROEA         5S 0       TEXT('NR.RITIRI CON ESITO ANOMALO')
007200010704     A                                      COLHDG('ESEG.' 'ANOMALO')
007300010704     A                                      EDTCDE(Z)
007400010704     A            RORA01         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
007500010704     A                                          80')
007600010704     A                                      COLHDG('ES AN' 'CAU' '80')
007700010704     A                                      EDTCDE(Z)
007800010704     A            RORA02         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
007900010704     A                                          81')
008000010704     A                                      COLHDG('ES AN' 'CAU' '81')
008100010704     A                                      EDTCDE(Z)
008200010704     A            RORA03         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
008300010704     A                                          90')
008400010704     A                                      COLHDG('ES AN' 'CAU' '90')
008500010704     A                                      EDTCDE(Z)
008600010704     A            RORA04         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
008700010704     A                                          91')
008800010704     A                                      COLHDG('ES AN' 'CAU' '91')
008900010704     A                                      EDTCDE(Z)
009000010704     A            RORA05         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
009100010704     A                                          92')
009200010704     A                                      COLHDG('ES AN' 'CAU' '92')
009300010704     A                                      EDTCDE(Z)
009400010704     A            RORA06         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
009500010704     A                                          93')
009600010704     A                                      COLHDG('ES AN' 'CAU' '93')
009700010704     A                                      EDTCDE(Z)
009800010704     A            RORA07         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
009900010704     A                                          94')
010000010704     A                                      COLHDG('ES AN' 'CAU' '94')
010100010704     A                                      EDTCDE(Z)
010200010704     A            RORA08         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
010300030912     A                                          95')
010400030912     A                                      COLHDG('ES AN' 'CAU' '95')
010500010704     A                                      EDTCDE(Z)
010600010704     A            RORA09         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
010700030912     A                                          82')
010800030912     A                                      COLHDG('ES AN' 'CAU' '82')
010900010704     A                                      EDTCDE(Z)
011000010704     A            RORA10         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
011100010704     A                                          XX')
011200010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
011300010704     A                                      EDTCDE(Z)
011400010704     A            RORA11         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
011500010704     A                                          XX')
011600010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
011700010704     A                                      EDTCDE(Z)
011800010704     A            RORA12         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
011900010704     A                                          XX')
012000010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
012100010704     A                                      EDTCDE(Z)
012200010704     A            RORA13         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
012300010704     A                                          XX')
012400010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
012500010704     A                                      EDTCDE(Z)
012600010704     A            RORA14         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
012700010704     A                                          XX')
012800010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
012900010704     A                                      EDTCDE(Z)
013000010704     A            RORA15         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
013100010704     A                                          XX')
013200010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
013300010704     A                                      EDTCDE(Z)
013400010620     A            RORDAN         5S 0       TEXT('NR.RIT.DA ES. IN ANTICIPO')
013500010704     A                                      COLHDG('DA ES' 'ANT.')
013600010704     A                                      EDTCDE(Z)
013700010604     A            RORDIT         5S 0       TEXT('NR.RIT.DA ES. IN TEMPO')
013800010704     A                                      COLHDG('DA ES' 'TEMPO')
013900010704     A                                      EDTCDE(Z)
014000010604     A            RORDR1         5S 0       TEXT('NR.RIT.DA ES. IN RIT.1 G.')
014100010704     A                                      COLHDG('DA ES' '1GG.')
014200010704     A                                      EDTCDE(Z)
014300010604     A            RORDR2         5S 0       TEXT('NR.RIT.DA ES. IN RIT.2 G.')
014400010704     A                                      COLHDG('DA ES' '2GG.')
014500010704     A                                      EDTCDE(Z)
014600010604     A            RORDRO         5S 0       TEXT('NR.RIT.DA ES. IN RIT.OLTRE')
014700010704     A                                      COLHDG('DA ES' 'OLTRE')
014800010704     A                                      EDTCDE(Z)
014900010614     A            ROREAN         5S 0       TEXT('NR.RIT.ES. IN ANTICIPO')
015000010704     A                                      COLHDG('ESEG.' 'ANT.')
015100010704     A                                      EDTCDE(Z)
015200010604     A            ROREIT         5S 0       TEXT('NR.RIT.ES. IN TEMPO')
015300010704     A                                      COLHDG('ESEG.' 'TEMPO')
015400010704     A                                      EDTCDE(Z)
015500010604     A            RORER1         5S 0       TEXT('NR.RIT.ES. IN RIT.1 G.')
015600010704     A                                      COLHDG('ESEG.' '1GG')
015700010704     A                                      EDTCDE(Z)
015800010604     A            RORER2         5S 0       TEXT('NR.RIT.ES. IN RIT.2 G.')
015900010704     A                                      COLHDG('ESEG.' '2GG')
016000010704     A                                      EDTCDE(Z)
016100010604     A            RORERO         5S 0       TEXT('NR.RIT.ES. IN RIT.OLTRE')
016200010704     A                                      COLHDG('ESEG.' 'OLTRE')
016300010704     A                                      EDTCDE(Z)
016400010620     A            RORNAN         5S 0       TEXT('NR.RIT.NON ES. IN ANTICIPO')
016500010704     A                                      COLHDG('NO ES' 'ANT.')
016600010704     A                                      EDTCDE(Z)
016700010604     A            RORNIT         5S 0       TEXT('NR.RIT.NON ES. IN TEMPO')
016800010704     A                                      COLHDG('NO ES' 'TEMPO')
016900010704     A                                      EDTCDE(Z)
017000010604     A            RORNR1         5S 0       TEXT('NR.RIT.NON ES. IN RIT.1 G.')
017100010704     A                                      COLHDG('NO ES' '1GG')
017200010704     A                                      EDTCDE(Z)
017300010604     A            RORNR2         5S 0       TEXT('NR.RIT.NON ES. IN RIT.2 G.')
017400010704     A                                      COLHDG('NO ES' '2GG')
017500010704     A                                      EDTCDE(Z)
017600010604     A            RORNRO         5S 0       TEXT('NR.RIT.NON ES. IN RIT.OLTRE')
017700010704     A                                      COLHDG('NO ES' 'OLTRE')
017800010704     A                                      EDTCDE(Z)
017900010620     A            RORAAN         5S 0       TEXT('NR.RIT.ES.AN. IN ANTICIPO')
018000010704     A                                      COLHDG('ES AN' 'ANT.')
018100010704     A                                      EDTCDE(Z)
018200010604     A            RORAIT         5S 0       TEXT('NR.RIT.ES.AN. IN TEMPO')
018300010704     A                                      COLHDG('ES AN' 'TEMPO')
018400010704     A                                      EDTCDE(Z)
018500010604     A            RORAR1         5S 0       TEXT('NR.RIT.ES.AN. IN RIT.1 G.')
018600010704     A                                      COLHDG('ES AN' '1GG')
018700010704     A                                      EDTCDE(Z)
018800010604     A            RORAR2         5S 0       TEXT('NR.RIT.ES.AN. IN RIT.2 G.')
018900010704     A                                      COLHDG('ES AN' '2GG')
019000010704     A                                      EDTCDE(Z)
019100010604     A            RORARO         5S 0       TEXT('NR.RIT.ES.AN. IN RIT.OLTRE')
019200010704     A                                      COLHDG('ES AN' 'OLTRE')
019300010704     A                                      EDTCDE(Z)
019400010604     A            RORICO         5S 0       TEXT('NR.RIT.IMM. CODIFICATI')
019500010704     A                                      COLHDG('CODIF.')
019600010704     A                                      EDTCDE(Z)
019700010604     A            RORINC         5S 0       TEXT('NR.RIT.IMM. NON CODIFICATI')
019800010704     A                                      COLHDG('NON' 'CODIF.')
019900010704     A                                      EDTCDE(Z)
020000010604     A            RORIFI         5S 0       TEXT('NR.RIT.IMM. FISSI')
020100010704     A                                      COLHDG('FISSI')
020200010704     A                                      EDTCDE(Z)
020300010604     A            RORICE         5S 0       TEXT('NR.RIT.IMM. CENTRALINO')
020400010704     A                                      COLHDG('CENTR.')
020500010704     A                                      EDTCDE(Z)
020600010604     A            RORIIN         5S 0       TEXT('NR.RIT.IMM. INTERNET')
020700010704     A                                      COLHDG('INTERNET')
020800010704     A                                      EDTCDE(Z)
020900010604     A            RORIVA         5S 0       TEXT('NR.RIT.IMM. VAS')
021000010704     A                                      COLHDG('VAS')
021100010704     A                                      EDTCDE(Z)
021200010604     A            RORICC         5S 0       TEXT('NR.RIT.IMM. CALL CENTER')
021300010704     A                                      COLHDG('CALL' 'CENTER')
021400010704     A                                      EDTCDE(Z)
021500010604     A            RORNQD         5S 0       TEXT('NR.RIT.BOLL.NON QUADRATI')
021600010704     A                                      COLHDG('BOLL' 'NO QUA.')
021700010704     A                                      EDTCDE(Z)
021800010604     A            RORNBL         5S 0       TEXT('NR.RIT.NON BOLLETTATI')
021900010704     A                                      COLHDG('NON' 'BOLL')
022000010704     A                                      EDTCDE(Z)
022100010614     A            RORMDR         5S 0       TEXT('NR.MANUT.DATA RITIRO')
022200010704     A                                      COLHDG('MAN.' 'DATA' 'RITIRO')
022300010704     A                                      EDTCDE(Z)
022400010614     A            RORNAS         5S 0       TEXT('NR.RIT.NON ASSEGNATI')
022500010704     A                                      COLHDG('NON' 'ASS.')
022600010704     A                                      EDTCDE(Z)
022700030912     A            RORONED        5S 0       TEXT('NR.RITIRI NON ESEGUITI DT >')
022800030912     A                                      COLHDG('NON' 'ESEG.' 'DT >')
022900030912     A                                      EDTCDE(Z)
023000030912     A            RORN01D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
023100030912     A                                          01 DT >')
023200030912     A                                      COLHDG('NO ES' 'CAU' '01>')
023300030912     A                                      EDTCDE(Z)
023400030912     A            RORN02D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
023500030912     A                                          02 DT >')
023600030912     A                                      COLHDG('NO ES' 'CAU' '02>')
023700030912     A                                      EDTCDE(Z)
023800030912     A            RORN03D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
023900030912     A                                          03 DT >')
024000030912     A                                      COLHDG('NO ES' 'CAU' '03>')
024100030912     A                                      EDTCDE(Z)
024200030912     A            RORN04D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
024300030912     A                                          04 DT >')
024400030912     A                                      COLHDG('NO ES' 'CAU' '04>')
024500030912     A                                      EDTCDE(Z)
024600030912     A            RORN05D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
024700030912     A                                          XX DT >')
024800030912     A                                      COLHDG('NO ES' 'CAU' 'XX>')
024900030912     A                                      EDTCDE(Z)
025000030912     A            RORN06D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
025100030912     A                                          XX DT >')
025200030912     A                                      COLHDG('NO ES' 'CAU' 'XX>')
025300030912     A                                      EDTCDE(Z)
025400030912     A            RORN07D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
025500030912     A                                          XX DT >')
025600030912     A                                      COLHDG('NO ES' 'CAU' 'XX>')
025700030912     A                                      EDTCDE(Z)
025800030912     A            RORN08D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
025900030912     A                                          XX DT >')
026000030912     A                                      COLHDG('NO ES' 'CAU' 'XX>')
026100030912     A                                      EDTCDE(Z)
026200030912     A            RORN09D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
026300030912     A                                          XX DT >')
026400030912     A                                      COLHDG('NO ES' 'CAU' 'XX>')
026500030912     A                                      EDTCDE(Z)
026600030912     A            RORN10D        5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
026700030912     A                                          XX DT >')
026800030912     A                                      COLHDG('NO ES' 'CAU' 'XX>')
026900030912     A                                      EDTCDE(Z)
027000030912     A            RORIFINE       5S 0       TEXT('NR.RIT.IMM. FISSI NON ES')
027100030912     A                                      COLHDG('FISSI' 'NON' 'ES')
027200030912     A                                      EDTCDE(Z)
027300030912     A            RORICENE       5S 0       TEXT('NR.RIT.IMM. CENTRALINO NON ES-
027400030912     A                                      ')
027500030912     A                                      COLHDG('CENTR.' 'NON' 'ES')
027600030912     A                                      EDTCDE(Z)
027700030912     A            RORIINNE       5S 0       TEXT('NR.RIT.IMM. INTERNET NON ES')
027800030912     A                                      COLHDG('INTERNET' 'NON' 'ES')
027900030912     A                                      EDTCDE(Z)
028000030912     A            RORIVANE       5S 0       TEXT('NR.RIT.IMM. VAS NON ES')
028100030912     A                                      COLHDG('VAS' 'NON' 'ES')
028200030912     A                                      EDTCDE(Z)
028300030912     A            RORICCNE       5S 0       TEXT('NR.RIT.IMM. CALL CENTER NON E-
028400030912     A                                      S')
028500030912     A                                      COLHDG('CALL' 'CENTER' 'NON ES')
028600030912     A                                      EDTCDE(Z)
028700030912     A            RORIFIAN       5S 0       TEXT('NR.RIT.IMM. FISSI ES AN')
028800030912     A                                      COLHDG('FISSI' 'ES' 'AN')
028900030912     A                                      EDTCDE(Z)
029000030912     A            RORICEAN       5S 0       TEXT('NR.RIT.IMM. CENTRALINO ES AN')
029100030912     A                                      COLHDG('CENTR.' 'ES' 'AN')
029200030912     A                                      EDTCDE(Z)
029300030912     A            RORIINAN       5S 0       TEXT('NR.RIT.IMM. INTERNET ES AN')
029400030912     A                                      COLHDG('INTERNET' 'ES' 'AN')
029500030912     A                                      EDTCDE(Z)
029600030912     A            RORIVAAN       5S 0       TEXT('NR.RIT.IMM. VAS ES AN')
029700030912     A                                      COLHDG('VAS' 'ES' 'AN')
029800030912     A                                      EDTCDE(Z)
029900030912     A            RORICCAN       5S 0       TEXT('NR.RIT.IMM. CALL CENTER ES AN-
030000030912     A                                      ')
030100030912     A                                      COLHDG('CALL' 'CENTER' 'ES AN')
030200030912     A                                      EDTCDE(Z)
030300030912     A            RORIFID        5S 0       TEXT('NR.RIT.IMM. FISSI DT >')
030400030912     A                                      COLHDG('FISSI' 'DT' '>')
030500030912     A                                      EDTCDE(Z)
030600030912     A            RORICED        5S 0       TEXT('NR.RIT.IMM. CENTRALINO DT >')
030700030912     A                                      COLHDG('CENTR.' 'DT' '>')
030800030912     A                                      EDTCDE(Z)
030900030912     A            RORIIND        5S 0       TEXT('NR.RIT.IMM. INTERNET DT >')
031000030912     A                                      COLHDG('INTERNET' 'DT' '>')
031100030912     A                                      EDTCDE(Z)
031200030912     A            RORIVAD        5S 0       TEXT('NR.RIT.IMM. VAS DT >')
031300030912     A                                      COLHDG('VAS' 'DT' '>')
031400030912     A                                      EDTCDE(Z)
031500030912     A            RORICCD        5S 0       TEXT('NR.RIT.IMM. CALL CENTER DT >')
031600030912     A                                      COLHDG('CALL' 'CENTER' 'DT >')
031700030912     A                                      EDTCDE(Z)
