000100010604     A*------------------------------------------------------------------------*
000200010604     A* WORKFILE REPORT O.R.M.                                        -IN GRU- *
000300010604     A*------------------------------------------------------------------------*
000400010604     A                                      REF(CNDIZION)
000500151106     A          R WFROR200                  TEXT('WFILE REPORT O.R.M.')
000600030912     A            RORTRC    R               REFFLD($TRC)
000700010604     A            RORPOE    R     S         REFFLD($FIL)
000800010605     A                                      TEXT('PUNTO OPERATIVO ELABORATO')
000900010604     A                                      COLHDG('P.O.' 'ELA.')
001000010604     A            RORDAE    R     S         REFFLD($DA8)
001100010604     A                                      TEXT('DATA ELABORAZIONE')
001200010604     A                                      COLHDG('DATA' 'ELA.')
001300010604     A            RORDIS    R               REFFLD($DIT)
001400010604     A            RORARE    R               REFFLD($CAR)
001500010604     A            RORODE         5S 0       TEXT('NR.RITIRI DA ESEGUIRE')
001600010704     A                                      COLHDG('DA' 'ESEG.')
001700010604     A            ROROES         5S 0       TEXT('NR.RITIRI ESEGUITI')
001800010704     A                                      COLHDG('ESEG.')
001900010604     A            RORONE         5S 0       TEXT('NR.RITIRI NON ESEGUITI')
002000010704     A                                      COLHDG('NON' 'ESEG.')
002100010704     A            RORN01         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
002200010704     A                                          01')
002300010704     A                                      COLHDG('NO ES' 'CAU' '01')
002400010704     A            RORN02         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
002500010704     A                                          02')
002600010704     A                                      COLHDG('NO ES' 'CAU' '02')
002700010704     A            RORN03         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
002800010704     A                                          03')
002900010704     A                                      COLHDG('NO ES' 'CAU' '03')
003000010704     A            RORN04         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
003100030912     A                                          04')
003200030912     A                                      COLHDG('NO ES' 'CAU' '04')
003300010704     A            RORN05         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
003400010704     A                                          XX')
003500010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
003600010704     A            RORN06         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
003700010704     A                                          XX')
003800010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
003900010704     A            RORN07         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
004000010704     A                                          XX')
004100010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
004200010704     A            RORN08         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
004300010704     A                                          XX')
004400010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
004500010704     A            RORN09         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
004600010704     A                                          XX')
004700010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
004800010704     A            RORN10         5S 0       TEXT('NR.RITIRI NON ESEGUITI CAU -
004900010704     A                                          XX')
005000010704     A                                      COLHDG('NO ES' 'CAU' 'XX')
005100010704     A            ROROEA         5S 0       TEXT('NR.RITIRI CON ESITO ANOMALO')
005200010704     A                                      COLHDG('ESEG.' 'ANOMALO')
005300010704     A            RORA01         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
005400010704     A                                          80')
005500010704     A                                      COLHDG('ES AN' 'CAU' '80')
005600010704     A            RORA02         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
005700010704     A                                          81')
005800010704     A                                      COLHDG('ES AN' 'CAU' '81')
005900010704     A            RORA03         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
006000010704     A                                          90')
006100010704     A                                      COLHDG('ES AN' 'CAU' '90')
006200010704     A            RORA04         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
006300010704     A                                          91')
006400010704     A                                      COLHDG('ES AN' 'CAU' '91')
006500010704     A            RORA05         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
006600010704     A                                          92')
006700010704     A                                      COLHDG('ES AN' 'CAU' '92')
006800010704     A            RORA06         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
006900010704     A                                          93')
007000010704     A                                      COLHDG('ES AN' 'CAU' '93')
007100010704     A            RORA07         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
007200010704     A                                          94')
007300010704     A                                      COLHDG('ES AN' 'CAU' '94')
007400010704     A            RORA08         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
007500030912     A                                          95')
007600030912     A                                      COLHDG('ES AN' 'CAU' '95')
007700010704     A            RORA09         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
007800030912     A                                          82')
007900030912     A                                      COLHDG('ES AN' 'CAU' '82')
008000010704     A            RORA10         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
008100010704     A                                          XX')
008200151106     A                                      COLHDG('ES AN' 'CAU' '96')
008300010704     A            RORA11         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
008400010704     A                                          XX')
008500151106     A                                      COLHDG('ES AN' 'CAU' '97')
008600010704     A            RORA12         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
008700010704     A                                          XX')
008800010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
008900010704     A            RORA13         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
009000010704     A                                          XX')
009100010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
009200010704     A            RORA14         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
009300010704     A                                          XX')
009400010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
009500010704     A            RORA15         5S 0       TEXT('NR.RITIRI ESITO ANOMALO CAU -
009600010704     A                                          XX')
009700010704     A                                      COLHDG('ES AN' 'CAU' 'XX')
009800010620     A            RORDAN         5S 0       TEXT('NR.RIT.DA ES. IN ANTICIPO')
009900010704     A                                      COLHDG('DA ES' 'ANT.')
010000010614     A            ROREAN         5S 0       TEXT('NR.RIT.ES. IN ANTICIPO')
010100010704     A                                      COLHDG('ESEG.' 'ANT.')
010200010620     A            RORNAN         5S 0       TEXT('NR.RIT.NON ES. IN ANTICIPO')
010300010704     A                                      COLHDG('NO ES' 'ANT.')
010400010620     A            RORAAN         5S 0       TEXT('NR.RIT.ES.AN. IN ANTICIPO')
010500010704     A                                      COLHDG('ES AN' 'ANT.')
010600151106     A            RORNFI         5S 0       TEXT('NR.RIT.FISSI NON ES')
010700030912     A                                      COLHDG('FISSI' 'NON' 'ES')
010800151106     A            RORNF01        5S 0       TEXT('FISSI NON ESEGUITI CAU -
010900151106     A                                          01')
011000151106     A                                      COLHDG('N FISSI' 'CAU' '01')
011100151106     A            RORNF02        5S 0       TEXT('FISSI NON ESEGUITI CAU -
011200151106     A                                          02')
011300151106     A                                      COLHDG('N FISSI' 'CAU' '02')
011400151106     A            RORNF03        5S 0       TEXT('FISSI NON ESEGUITI CAU -
011500151106     A                                          03')
011600151106     A                                      COLHDG('N FISSI' 'CAU' '03')
011700151106     A            RORNF04        5S 0       TEXT('FISSI NON ESEGUITI CAU -
011800151106     A                                          04')
011900151106     A                                      COLHDG('N FISSI' 'CAU' '04')
012000151106     A            RORNF05        5S 0       TEXT('FISSI NON ESEGUITI CAU -
012100151106     A                                          XX')
012200151106     A                                      COLHDG('N FISSI' 'CAU' 'XX')
012300151106     A            RORNF06        5S 0       TEXT('FISSI NON ESEGUITI CAU -
012400151106     A                                          XX')
012500151106     A                                      COLHDG('N FISSI' 'CAU' 'XX')
012600151106     A            RORNF07        5S 0       TEXT('FISSI NON ESEGUITI CAU -
012700151106     A                                          XX')
012800151106     A                                      COLHDG('N FISSI' 'CAU' 'XX')
012900151106     A            RORNF08        5S 0       TEXT('FISSI NON ESEGUITI CAU -
013000151106     A                                          XX')
013100151106     A                                      COLHDG('N FISSI' 'CAU' 'XX')
013200151106     A            RORNF09        5S 0       TEXT('FISSI NON ESEGUITI CAU -
013300151106     A                                          XX')
013400151106     A                                      COLHDG('N FISSI' 'CAU' 'XX')
013500151106     A            RORNF10        5S 0       TEXT('FISSI NON ESEGUITI CAU -
013600151106     A                                          XX')
013700151106     A                                      COLHDG('N FISSI' 'CAU' 'XX')
013800151106     A            RORAFI         5S 0       TEXT('FISSI FISSI ES AN')
013900030912     A                                      COLHDG('FISSI' 'ES' 'AN')
014000151106     A            RORAF01        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
014100151106     A                                          80')
014200151106     A                                      COLHDG('AN FISSI' 'CAU' '80')
014300151106     A            RORAF02        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
014400151106     A                                          81')
014500151106     A                                      COLHDG('AN FISSI' 'CAU' '81')
014600151106     A            RORAF03        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
014700151106     A                                          90')
014800151106     A                                      COLHDG('AN FISSI' 'CAU' '90')
014900151106     A            RORAF04        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
015000151106     A                                          91')
015100151106     A                                      COLHDG('AN FISSI' 'CAU' '91')
015200151106     A            RORAF05        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
015300151106     A                                          92')
015400151106     A                                      COLHDG('AN FISSI' 'CAU' '92')
015500151106     A            RORAF06        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
015600151106     A                                          93')
015700151106     A                                      COLHDG('AN FISSI' 'CAU' '93')
015800151106     A            RORAF07        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
015900151106     A                                          94')
016000151106     A                                      COLHDG('AN FISSI' 'CAU' '94')
016100151106     A            RORAF08        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
016200151106     A                                          95')
016300151106     A                                      COLHDG('AN FISSI' 'CAU' '95')
016400151106     A            RORAF09        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
016500151106     A                                          82')
016600151106     A                                      COLHDG('AN FISSI' 'CAU' '82')
016700151106     A            RORAF10        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
016800151106     A                                          XX')
016900151106     A                                      COLHDG('AN FISSI' 'CAU' '96')
017000151106     A            RORAF11        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
017100151106     A                                          XX')
017200151106     A                                      COLHDG('AN FISSI' 'CAU' '97')
017300151106     A            RORAF12        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
017400151106     A                                          XX')
017500151106     A                                      COLHDG('AN FISSI' 'CAU' 'XX')
017600151106     A            RORAF13        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
017700151106     A                                          XX')
017800151106     A                                      COLHDG('AN FISSI' 'CAU' 'XX')
017900151106     A            RORAF14        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
018000151106     A                                          XX')
018100151106     A                                      COLHDG('AN FISSI' 'CAU' 'XX')
018200151106     A            RORAF15        5S 0       TEXT('FISSI ESITO ANOMALO CAU -
018300151106     A                                          XX')
018400151106     A                                      COLHDG('AN FISSI' 'CAU' 'XX')
