000100100423     A*------------------------------------------------------------------------*
000200100517     A* WORKFILE REPORT PREVENTIVO COMMERCIALE ATTIVITA ' DI FILIALE           *
000300100423     A*------------------------------------------------------------------------*
000400980727     A                                      REF(CNDIZION)
000500100517     A          R WFRPA000                  TEXT('WFILE REPORT PREV. ATTIVITA')
000600100517     A            RPADIV    R               REFFLD($DIT)
000700100423     A                                      TEXT('DISTRETTO UNIFICANTE')
000800100517     A            RPADID        25          TEXT('DESCRIZIONE DISTRETTO')
000900100517     A            RPAARE    R     S         REFFLD($CAR)
001000100517     A            RPAARD        25          TEXT('DESRIZIONE AREA')
001100100517     A            RPAFIL    R     S         REFFLD($FIL)
001200100517     A            RPAFID        25          TEXT('DESRIZIONE FILIALE')
001300100517     A            RPAPDA         8S 0       TEXT('PERIODO PREVENTIVO DAL')
001400100517     A            RPAPAL         8S 0       TEXT('PERIODO PREVENTIVO AL')
001500100517     A            RPARGF    R     S         REFFLD($AGE)
001600100423     A                                      TEXT('AGENTE UNIFICANTE')
001700100423     A                                      COLHDG('AGE UNIF')
001800100517     A            RPADRG        25          TEXT('DESCRIZIONE AGENTE')
001900100423     A                                      COLHDG('DESCRIZIONE AGE UNIF')
002000100517     A            RPAFUN         5          TEXT('FUNZIONE AZIENDALE')
002100100423     A                                      COLHDG('FUNZIONE AZIENDALE')
002200100819     A            RPAAPPM        3S 0       TEXT('APPUNTAMENTI TRATTATIVE M')
002300100517     A                                      COLHDG('APP.' 'TRATT. M.')
002400100819     A            RPAAPPN        3S 0       TEXT('APPUNTAMENTI TRATTATIVE N')
002500100517     A                                      COLHDG('APP.' 'TRATT. N.')
002600100819     A            RPAAPPA        3S 0       TEXT('APPUNTAMENTI TRATTATIVE A')
002700100517     A                                      COLHDG('APP.' 'TRATT. A.')
002800100819     A            RPAAPPC        3S 0       TEXT('APPUNTAMENTI TRATTATIVE C')
002900100517     A                                      COLHDG('APP.' 'TRATT. C.')
002901110118     A            RPAAPPI        3S 0       TEXT('APPUNTAMENTI TRATTATIVE I')
002902110118     A                                      COLHDG('APP.' 'TRATT. I.')
002903110118     A            RPAAPPR        3S 0       TEXT('APPUNTAMENTI TRATTATIVE R')
002904110118     A                                      COLHDG('APP.' 'TRATT. R.')
003000100819     A            RPAAFFM        3S 0       TEXT('AFFIANCAMENTI TRATTATIVE M')
003100100517     A                                      COLHDG('AFF.' 'TRATT. M.')
003200100819     A            RPAAFFN        3S 0       TEXT('AFFIANCAMENTI TRATTATIVE N')
003300100517     A                                      COLHDG('AFF.' 'TRATT. N.')
003400100819     A            RPAAFFA        3S 0       TEXT('AFFIANCAMENTI TRATTATIVE A')
003500100819     A                                      COLHDG('AFF.' 'TRATT. A.')
003600100819     A            RPAAFFC        3S 0       TEXT('AFFIANCAMENTI TRATTATIVE C')
003700100517     A                                      COLHDG('AFF.' 'TRATT. C.')
003701110118     A            RPAAFFI        3S 0       TEXT('AFFIANCAMENTI TRATTATIVE I')
003702110118     A                                      COLHDG('AFF.' 'TRATT. I.')
003703110118     A            RPAAFFR        3S 0       TEXT('AFFIANCAMENTI TRATTATIVE R')
003704110118     A                                      COLHDG('AFF.' 'TRATT. R.')
003800100819     A            RPATC19        4S 0       TEXT('TELEFONATE CAUSALE 19')
003900100517     A                                      COLHDG('TELEF.' 'CAUS.19')
004000100819     A            RPATC20        4S 0       TEXT('TELEFONATE CAUSALE 20')
004100100517     A                                      COLHDG('TELEF.' 'CAUS.20')
004200100819     A            RPATC21        4S 0       TEXT('TELEFONATE CAUSALE 21')
004300100517     A                                      COLHDG('TELEF.' 'CAUS.21')
004400100819     A            RPATC22        4S 0       TEXT('TELEFONATE CAUSALE 22')
004500100517     A                                      COLHDG('TELEF.' 'CAUS.22')
004600100819     A            RPATC24        4S 0       TEXT('TELEFONATE CAUSALE 24')
004700100819     A                                      COLHDG('TELEF.' 'CAUS.24')
004800100819     A            RPATC25        4S 0       TEXT('TELEFONATE CAUSALE 25')
004900100517     A                                      COLHDG('TELEF.' 'CAUS.25')
005000100819     A            RPATC26        4S 0       TEXT('TELEFONATE CAUSALE 26')
005100100517     A                                      COLHDG('TELEF.' 'CAUS.26')
005200100819     A            RPATC27        4S 0       TEXT('TELEFONATE CAUSALE 27')
005300100517     A                                      COLHDG('TELEF.' 'CAUS.27')
005400100819     A            RPATC28        4S 0       TEXT('TELEFONATE CAUSALE 28')
005500100517     A                                      COLHDG('TELEF.' 'CAUS.28')
005600100819     A            RPATC30        4S 0       TEXT('TELEFONATE CAUSALE 30')
005700100517     A                                      COLHDG('TELEF.' 'CAUS.30')
005800100819     A            RPATC31        4S 0       TEXT('TELEFONATE CAUSALE 31')
005900100517     A                                      COLHDG('TELEF.' 'CAUS.31')
006000100819     A            RPATC32        4S 0       TEXT('TELEFONATE CAUSALE 32')
006100100819     A                                      COLHDG('TELEF.' 'CAUS.32')
006200100819     A            RPATC33        4S 0       TEXT('TELEFONATE CAUSALE 33')
006300100517     A                                      COLHDG('TELEF.' 'CAUS.33')
006301110117     A            RPATC44        4S 0       TEXT('TELEFONATE CAUSALE 44')
006302110117     A                                      COLHDG('TELEF.' 'CAUS.44')
006400100819     A            RPATC60        4S 0       TEXT('TELEFONATE CAUSALE 60')
006500100517     A                                      COLHDG('TELEF.' 'CAUS.60')
006600100819     A            RPAOFF         4S 0       TEXT('ATTIVITA OFFERTE')
006700100517     A                                      COLHDG('ATTIVITA' 'OFFERTE')
006800100517     A            RPAUFF         5S 2       TEXT('ORE UFFICIO')
006900100517     A                                      COLHDG('ORE UFFICIO')
007000100517     A            RPAFERIE       5S 2       TEXT('ORE FERIE')
007100100517     A                                      COLHDG('ORE FERIE')
007200100526     A            RPAFEGG        3S 0       TEXT('GG FERIE')
007300100526     A                                      COLHDG('GG FERIE')
007400100517     A            RPADAT    R     S         REFFLD($DA8)
007500100423     A                                      TEXT('DATA ESECUZIONE')
007600100423     A                                      COLHDG('DATA' 'ESECUZ.')
007700100517     A            RPAPRU    R               REFFLD($PRU)
007800100423     A                                      TEXT('UTENTE ESECUZIONE')
007900100423     A                                      COLHDG('UTENTE' 'ESECUZ.')
