000100170321     A*------------------------------------------------------------------------*
000200170321     A* CONTROLLO AUMENTO TARIFFE CON RITASSAZIONE - TESTATA
000300170321     A*------------------------------------------------------------------------*
000400170321     A                                      REF(CNDIZION)
000500170321     A          R WFRST000                  TEXT('CTRL.AUMENTO TARIFFE -
000600170321     A                                      RITASSAZ. - TESTATA')
000700170321     A            RSTKSC    R               REFFLD($CSC)
000800170321     A            RSTCTR    R               REFFLD($CTR)
000900170321     A            RSTPRG    R               REFFLD($PRG)
001000170321     A            RSTDTE    R               REFFLD($DA8)
001100170321     A                                      TEXT('DATA ELABORAZIONE')
001200170321     A                                      COLHDG('DATA' 'ELABORAZIONE')
001300170321     A            RSTDDT    R               REFFLD($DDT)
001400170321     A            RSTDSPI   R               REFFLD($DA8)
001500170321     A                                      TEXT('DATA SPED. INIZIO')
001600170321     A                                      COLHDG('DATA SPED.' 'INIZIO')
001700170321     A            RSTDSPF   R               REFFLD($DA8)
001800170321     A                                      TEXT('DATA SPED. FINE')
001900170321     A                                      COLHDG('DATA SPED.' 'FINE')
002000170321     A            RSTIMVF   R               REFFLD($IMV)
002100170321     A                                      TEXT('IMPONIBILE FATTURATO')
002200170321     A                                      COLHDG('IMPONIBILE' 'FATTURATO')
002300170321     A            RSTIMVR   R               REFFLD($IMV)
002400170321     A                                      TEXT('IMPONIBILE RITASSATO')
002500170321     A                                      COLHDG('IMPONIBILE' 'RITASSATO')
002600170321     A            RSTMCT         1A         TEXT('FLG MANCATO CONFRONTO TAR.')
002700170321     A                                      COLHDG('NO' 'CONF.')
002800170321     A            RSTNBELA       9S 0       TEXT('NR. BOLLE ANALIZZATE')
002900170321     A                                      COLHDG('BOLLE' 'ANALIZZATE')
003000170321     A            RSTNBTAS       9S 0       TEXT('NR. BOLLE TASSATE')
003100170321     A                                      COLHDG('BOLLE' 'TASSATE')
003200170321     A            RSTNBNTA       9S 0       TEXT('NR. BOLLE NON TASSATE')
003300170321     A                                      COLHDG('BOLLE' 'NO TASSATE')
003400170321     A            RSTNBTIM       9S 0       TEXT('NR. BOLLE TASSATE FINO -
003500170321     A                                      IMPONIBILE')
003600170321     A                                      COLHDG('BOLLE' 'TASSATE IMP.')
003700170321     A            RSTNBVAR       9S 0       TEXT('NR. BOLLE VARIATE')
003800170321     A            RSTTAPVP       1A         TEXT('TIPO APPLICAZIONE VDL PRG.+
003900170321     A                                      PRECEDENTE')
004000170321     A                                      COLHDG('APPL.' 'VDL' 'PRECED.')
004100170321     A            RSTTAPVN       1A         TEXT('TIPO APPLICAZIONE VDL PRG.+
004200170321     A                                      NUOVO')
004300170321     A                                      COLHDG('APPL.' 'VDL' 'NUOVO')
