000100050616     A          R WFS7W510                  TEXT('FILE ST. ESITI CONSEGNE')
000200050616     A*
000300050616     A            W5KSC          8A
000400050616     A*
000500050616     A            W5LNA          3S 0
000600050616     A            W5LNADES      20A
000700050616     A*
000800050617     A            W5TOTCONTT     7S 0
000900050616     A            W5TOTCON       7S 0
001000050617     A            W5PERCONSL     5S 2
001100050616     A            W5CONANT       7S 0
001200050617     A            W5PERANT       5S 2
001300050616     A            W5CON00        7S 0
001400050617     A            W5PER00        5S 2
001500050616     A            W5CON12        7S 0
001600050617     A            W5PER12        5S 2
001700050616     A            W5CON24        7S 0
001800050617     A            W5PER24        5S 2
001900050616     A            W5CON48        7S 0
002000050617     A            W5PER48        5S 2
002100050616     A            W5CON72        7S 0
002200050617     A            W5PER72        5S 2
002300050616     A            W5CON96        7S 0
002400050617     A            W5PER96        5S 2
002500050616     A            W5CON120       7S 0
002600050617     A            W5PER120       5S 2
002700050617     A            W5TMPMED       7S 0
002800050617     A            W5TOTDADEF     7S 0
002900050616     A            W5TOTGICH      7S 0
003000050616     A            W5TOTRESI      7S 0
003100050617     A            W5TOTANO       7S 0
003200050617     A            W5TOTCONL      7S 0
003300050617     A            W5PERCONL      5S 2
003400050616     A            W5TOTGIA       7S 0
003500050616     A            W5TOTPAR       7S 0
003600050616     A            W5TOTAPP       7S 0
003700050616     A            W5TOTLAV       7S 0
003800050617     A            W5TOTALT       7S 0
003900050617     A            W5TOTNOCON     7S 0
004000050617 XXX A            W5PERNOCON     5S 2
004100050526     A*
004200050616     A          K W5KSC
