000100941206     A*------------------------------------------------------------------------*
000200991122     A*  L.F. X  DATA+ORA+KSC
000300941206     A*------------------------------------------------------------------------*
000400991117     A          R WFSTL                     PFILE(WFSTL00F)
000500991122     A          K WFVDAT
000600930625     A          K WFVKSC
