000100940503     A*------------------------------------------------------------------------*
000200940629     A* BOLLE : NUMERO SPEDIZIONI E IMPORTO RITIRO X GESTIONE STOP
000300950523     A* LF      - CLIENTE
000400940720     A*         - DATA
000500940503     A*------------------------------------------------------------------------*
000600940503     A                                      UNIQUE
000700950523     A          R WFSTP                     PFILE(WFSTP00F)
000800940629     A          K STPKSC
000900940629     A          K STPDAT
