000100941206     A*------------------------------------------------------------------------*
000200050107     A*  L.F. X  DIV/ARE/FIL/RAG                                               *
000300941206     A*------------------------------------------------------------------------*
000400041214     A          R WFSUV000                  PFILE(WFSUV00F)
000500041231     A          K WFSDIV
000600041231     A          K WFSARE
000700041231     A          K WFSFIL
000800050107     A          K WFSRAG
