000100941206     A*------------------------------------------------------------------------*
000200041214     A* FILE DI LAVORO PER STATISTICA UTILIZZO SERVIZI VAS INTERNET            *
000300941206     A*------------------------------------------------------------------------*
000400991117     A                                      REF(CNDIZION)
000500041214     A          R WFSUV000                  TEXT('WF STAT.SERV.INTERNET')
000600050107     A            WFSDAI         6  0       TEXT('PERIODO DA')
000700050107     A                                      COLHDG('PERIODO DA')
000800050107     A            WFSDAF         6  0       TEXT('PERIODO A')
000900050107     A                                      COLHDG('PERIODO A')
001000041214     A            WFSDIV         1          TEXT('DIVISIONE')
001100041214     A                                      COLHDG('DIVISIONE')
001200041214     A            WFSARE         3  0       TEXT('AREA')
001300930615     A                                      COLHDG('AREA')
001400041214     A            WFSFIL         3  0       TEXT('FILIALE')
001500041214     A                                      COLHDG('FILIALE')
001600041214     A            WFSCAT         1          TEXT('IMPORTANZA CLIENTE')
001700041214     A                                      COLHDG('IMPORTANZA CLIENTE')
001800041214     A            WFSTIP         2          TEXT('TIPO CLIENTE')
001900041214     A                                      COLHDG('TIPO CLIENTE')
002000041214     A            WFSKSC         7  0       TEXT('CLIENTE')
002100041214     A                                      COLHDG('CLIENTE')
002200041214     A            WFSRAG        40          TEXT('RAGIONE SOCIALE')
002300991105     A                                      COLHDG('RAG. SOC.')
002400041216     A            WFSEMAIL     400          TEXT('INDIRIZZI E-MAIL')
002500041214     A                                      COLHDG('INDIRIZZI EMAIL')
002600041214     A            WFSSPED        9  0       TEXT('NUM. SPEDIZIONI')
002700041214     A                                      COLHDG('NUM. SPED.')
002800041214     A            WFSFATT       13  3       TEXT('FATTURATO')
002900041214     A                                      COLHDG('FATTURATO')
003000041216     A            WFSFVTA        1          TEXT('FLAG S/N BOLLE TIVTA')
003100041216     A                                      COLHDG('FLAG S/N BOLLE TIVTA')
