000100100510      *---------------------------------------------------------------*
000200150917      *?            WORKFILE PER CONTROLLO TELEFONATE/BOLLE          ?*
000300100510      *---------------------------------------------------------------*
000400100510     A                                      REF(CNDIZION)
000500150917     A          R WFTGT000                  TEXT('WF CONTROLLO TELEF/BOLLE')
000600150917     A            WATDTADA  R               REFFLD($DA8)
000700150917     A                                      TEXT('Data ELABOR. DAL')
000800150917     A            WATDTAA   R               REFFLD($DA8)
000900150917     A                                      TEXT('Data ELABOR. AL')
001000150917      * Tipo CHIAMANTE
001100150917     A            WTGTTCH   R               REFFLD($FLAG)
001200150917     A                                      TEXT('Tipo CHIAMANTE: M/D/C')
001300150917     A* FASCIA ORRRIA
001400150917     A            WTGTFORA       4  0       TEXT('FASCIA ORARIO')
001500150917     A
001600150917     A* PREVISTO ALERT SI/NO
001700150917     A            WTGTFASN       1          TEXT('ALERT SI/NO')
001800150917
001900150917     A* 1* TENT. CONSEGNA SI/NO
002000150917     A            WTGTTCON       1
002100161122     A                                      TEXT('DOPO 1°TENT.CONSEGNA SI/NO')
002200161122     A* OPPURE DOPO MIC   SI/NO
002300161122     A            WTGTTMIC       1
002400161122     A                                      TEXT('DOPO MIC SI/NO')
002500150917      * CONTEGGI
002600150917     A            WTGTTOT        7  0
002700150917     A                                      TEXT('TOTALE R.A.')
002800150917     A            WTGTBP         7  0
002900150917     A                                      TEXT('DI CUI A PRIVATI')
003000150917     A            WTGTGIA        7  0
003100150917     A                                      TEXT('DI CUI CON GIACENZA')
003200150921     A**          WTGTDIR        7  0
003300150921     A**                                    TEXT('POI DIROTTATA')
003400150921     A**          WTGTRESO       7  0
003500150921     A**                                    TEXT('POI RESA')
003600150921     A            WTGTMA1        3
003700150921     A                                      TEXT('MOTIVO R.A. 1')
003800150921     A            WTGTTO1        7  0
003900150921     A                                      TEXT('TOTALE MOTIVO 1')
004000150921     A            WTGTMA2        3
004100150921     A                                      TEXT('MOTIVO R.A. 1')
004200150921     A            WTGTTO2        7  0
004300150921     A                                      TEXT('TOTALE MOTIVO 1')
004400150921     A            WTGTMA3        3
004500150921     A                                      TEXT('MOTIVO R.A. 1')
004600150921     A            WTGTTO3        7  0
004700150921     A                                      TEXT('TOTALE MOTIVO 1')
004800150921     A            WTGTMA4        3
004900150921     A                                      TEXT('MOTIVO R.A. 1')
005000150921     A            WTGTTO4        7  0
005100150921     A                                      TEXT('TOTALE MOTIVO 1')
005200150921     A            WTGTMA5        3
005300150921     A                                      TEXT('MOTIVO R.A. 1')
005400150921     A            WTGTTO5        7  0
005500150921     A                                      TEXT('TOTALE MOTIVO 1')
005600150921     A            WTGTMA6        3
005700150921     A                                      TEXT('MOTIVO R.A. 1')
005800150921     A            WTGTTO6        7  0
005900150921     A                                      TEXT('TOTALE MOTIVO 1')
006000150921     A            WTGTMA7        3
006100150921     A                                      TEXT('MOTIVO R.A. 1')
006200150921     A            WTGTTO7        7  0
006300150921     A                                      TEXT('TOTALE MOTIVO 1')
006400150921     A            WTGTMA8        3
006500150921     A                                      TEXT('MOTIVO R.A. 1')
006600150921     A            WTGTTO8        7  0
006700150921     A                                      TEXT('TOTALE MOTIVO 1')
006800150921     A            WTGTMA9        3
006900150921     A                                      TEXT('MOTIVO R.A. 1')
007000150921     A            WTGTTO9        7  0
007100150921     A                                      TEXT('TOTALE MOTIVO 1')
007200150921     A            WTGTMA10       3
007300150921     A                                      TEXT('MOTIVO R.A. 1')
007400150921     A            WTGTTO10       7  0
007500150921     A                                      TEXT('TOTALE MOTIVO 1')
007600150921     A            WTGTMA11       3
007700150921     A                                      TEXT('MOTIVO R.A. 1')
007800150921     A            WTGTTO11       7  0
007900150921     A                                      TEXT('TOTALE MOTIVO 1')
008000150921     A            WTGTMA12       3
008100150921     A                                      TEXT('MOTIVO R.A. 1')
008200150921     A            WTGTTO12       7  0
008300150921     A                                      TEXT('TOTALE MOTIVO 1')
008400150921     A            WTGTMA13       3
008500150921     A                                      TEXT('MOTIVO R.A. 1')
008600150921     A            WTGTTO13       7  0
008700150921     A                                      TEXT('TOTALE MOTIVO 1')
008800150921     A            WTGTMA14       3
008900150921     A                                      TEXT('MOTIVO R.A. 1')
009000150921     A            WTGTTO14       7  0
009100150921     A                                      TEXT('TOTALE MOTIVO 1')
009200150921     A            WTGTMA15       3
009300150921     A                                      TEXT('MOTIVO R.A. 1')
009400150921     A            WTGTTO15       7  0
009500150921     A                                      TEXT('TOTALE MOTIVO 1')
009600150921     A            WTGTMA16       3
009700150921     A                                      TEXT('MOTIVO R.A. 1')
009800150921     A            WTGTTO16       7  0
009900150921     A                                      TEXT('TOTALE MOTIVO 1')
010000150921     A            WTGTMA17       3
010100150921     A                                      TEXT('MOTIVO R.A. 1')
010200150921     A            WTGTTO17       7  0
010300150921     A                                      TEXT('TOTALE MOTIVO 1')
010400150921     A            WTGTMA18       3
010500150921     A                                      TEXT('MOTIVO R.A. 1')
010600150921     A            WTGTTO18       7  0
010700150921     A                                      TEXT('TOTALE MOTIVO 1')
010800150921     A            WTGTMA19       3
010900150921     A                                      TEXT('MOTIVO R.A. 1')
011000150921     A            WTGTTO19       7  0
011100150921     A                                      TEXT('TOTALE MOTIVO 1')
011200150921     A            WTGTMA20       3
011300150921     A                                      TEXT('MOTIVO R.A. 1')
011400150921     A            WTGTTO20       7  0
011500150921     A                                      TEXT('TOTALE MOTIVO 1')
011600150921     A            WTGTMA21       3
011700150921     A                                      TEXT('MOTIVO R.A. 1')
011800150921     A            WTGTTO21       7  0
011900150921     A                                      TEXT('TOTALE MOTIVO 1')
012000150921     A            WTGTMA22       3
012100150921     A                                      TEXT('MOTIVO R.A. 1')
012200150921     A            WTGTTO22       7  0
012300150921     A                                      TEXT('TOTALE MOTIVO 1')
012400150921     A            WTGTMA23       3
012500150921     A                                      TEXT('MOTIVO R.A. 1')
012600150921     A            WTGTTO23       7  0
012700150921     A                                      TEXT('TOTALE MOTIVO 1')
012800150921     A            WTGTMA24       3
012900150921     A                                      TEXT('MOTIVO R.A. 1')
013000150921     A            WTGTTO24       7  0
013100150921     A                                      TEXT('TOTALE MOTIVO 1')
013200150921     A            WTGTMA25       3
013300150921     A                                      TEXT('MOTIVO R.A. 1')
013400150921     A            WTGTTO25       7  0
013500150921     A                                      TEXT('TOTALE MOTIVO 1')
013600150921     A            WTGTMA26       3
013700150921     A                                      TEXT('MOTIVO R.A. 1')
013800150921     A            WTGTTO26       7  0
013900150921     A                                      TEXT('TOTALE MOTIVO 1')
014000150921     A            WTGTMA27       3
014100150921     A                                      TEXT('MOTIVO R.A. 1')
014200150921     A            WTGTTO27       7  0
014300150921     A                                      TEXT('TOTALE MOTIVO 1')
014400150921     A            WTGTMA28       3
014500150921     A                                      TEXT('MOTIVO R.A. 1')
014600150921     A            WTGTTO28       7  0
014700150921     A                                      TEXT('TOTALE MOTIVO 1')
014800150921     A            WTGTMA29       3
014900150921     A                                      TEXT('MOTIVO R.A. 1')
015000150921     A            WTGTTO29       7  0
015100150921     A                                      TEXT('TOTALE MOTIVO 1')
015200150921     A            WTGTMA30       3
015300150921     A                                      TEXT('MOTIVO R.A. 1')
015400150921     A            WTGTTO30       7  0
015500150921     A                                      TEXT('TOTALE MOTIVO 1')
015600150921     A            WTGTMA31       3
015700150921     A                                      TEXT('MOTIVO R.A. 1')
015800150921     A            WTGTTO31       7  0
015900150921     A                                      TEXT('TOTALE MOTIVO 1')
