000100030915     A*------------------------------------------------------------------------*
000200030915     A* WFILE STATISTICA DELTA DEL TISE94R                                     *
000300030915     A*------------------------------------------------------------------------*
000400030915     A                                      REF(CNDIZION)
000500030916     A          R WFTISE940                 TEXT('WF DELTA DEL TISE94R')
000600030919     A            SE94NRR        7S 0       TEXT('N.RIGA')
000700030915     A            SE94IOE   R               REFFLD($FLA)
000800030915     A                                      TEXT('ITA/EST')
000900030915     A            SE94DIV   R               REFFLD($DIT)
001000030915     A                                      TEXT('DIV')
001100030917     A            SE94RGF   R     S         REFFLD($AGE)
001200030917     A                                      TEXT('AGENTE')
001300030917     A            SE94DES       18          TEXT('DESCRIZIONE RIGA')
001400030916     A*
001500030916     A            SE94CPR        7S 0       TEXT('CLIENTI:         12M PREC')
001600030916     A            SE94NPR        9S 0       TEXT('SPEDIZIONI:      12M PREC')
001700030916     A            SE94RPR        7S 0       TEXT('RICAVO REALE:    12M PREC')
001800030916     A            SE94DPR        4S 1       TEXT('DELTA:           12M PREC')
001900030916     A*
002000030916     A            SE94C01        7S 0       TEXT('CLIENTI:          MESE 01')
002100030916     A            SE94N01        9S 0       TEXT('SPEDIZIONI:       MESE 01')
002200030916     A            SE94R01        7S 0       TEXT('RICAVO REALE:     MESE 01')
002300030916     A            SE94D01        4S 1       TEXT('DELTA:            MESE 01')
002400030916     A*
002500030916     A            SE94C02        7S 0       TEXT('CLIENTI:          MESE 02')
002600030916     A            SE94N02        9S 0       TEXT('SPEDIZIONI:       MESE 02')
002700030916     A            SE94R02        7S 0       TEXT('RICAVO REALE:     MESE 02')
002800030916     A            SE94D02        4S 1       TEXT('DELTA:            MESE 02')
002900030916     A*
003000030916     A            SE94C03        7S 0       TEXT('CLIENTI:          MESE 03')
003100030916     A            SE94N03        9S 0       TEXT('SPEDIZIONI:       MESE 03')
003200030916     A            SE94R03        7S 0       TEXT('RICAVO REALE:     MESE 03')
003300030916     A            SE94D03        4S 1       TEXT('DELTA:            MESE 03')
003400030916     A*
003500030916     A            SE94C04        7S 0       TEXT('CLIENTI:          MESE 04')
003600030916     A            SE94N04        9S 0       TEXT('SPEDIZIONI:       MESE 04')
003700030916     A            SE94R04        7S 0       TEXT('RICAVO REALE:     MESE 04')
003800030916     A            SE94D04        4S 1       TEXT('DELTA:            MESE 04')
003900030916     A*
004000030916     A            SE94C05        7S 0       TEXT('CLIENTI:          MESE 05')
004100030916     A            SE94N05        9S 0       TEXT('SPEDIZIONI:       MESE 05')
004200030916     A            SE94R05        7S 0       TEXT('RICAVO REALE:     MESE 05')
004300030916     A            SE94D05        4S 1       TEXT('DELTA:            MESE 05')
004400030916     A*
004500030916     A            SE94C06        7S 0       TEXT('CLIENTI:          MESE 06')
004600030916     A            SE94N06        9S 0       TEXT('SPEDIZIONI:       MESE 06')
004700030916     A            SE94R06        7S 0       TEXT('RICAVO REALE:     MESE 06')
004800030916     A            SE94D06        4S 1       TEXT('DELTA:            MESE 06')
004900030916     A*
005000030916     A            SE94C07        7S 0       TEXT('CLIENTI:          MESE 07')
005100030916     A            SE94N07        9S 0       TEXT('SPEDIZIONI:       MESE 07')
005200030916     A            SE94R07        7S 0       TEXT('RICAVO REALE:     MESE 07')
005300030916     A            SE94D07        4S 1       TEXT('DELTA:            MESE 07')
005400030916     A*
005500030916     A            SE94C08        7S 0       TEXT('CLIENTI:          MESE 08')
005600030916     A            SE94N08        9S 0       TEXT('SPEDIZIONI:       MESE 08')
005700030916     A            SE94R08        7S 0       TEXT('RICAVO REALE:     MESE 08')
005800030916     A            SE94D08        4S 1       TEXT('DELTA:            MESE 08')
005900030916     A*
006000030916     A            SE94C09        7S 0       TEXT('CLIENTI:          MESE 09')
006100030916     A            SE94N09        9S 0       TEXT('SPEDIZIONI:       MESE 09')
006200030916     A            SE94R09        7S 0       TEXT('RICAVO REALE:     MESE 09')
006300030916     A            SE94D09        4S 1       TEXT('DELTA:            MESE 09')
006400030916     A*
006500030916     A            SE94C10        7S 0       TEXT('CLIENTI:          MESE 10')
006600030916     A            SE94N10        9S 0       TEXT('SPEDIZIONI:       MESE 10')
006700030916     A            SE94R10        7S 0       TEXT('RICAVO REALE:     MESE 10')
006800030916     A            SE94D10        4S 1       TEXT('DELTA:            MESE 10')
006900030916     A*
007000030916     A            SE94C11        7S 0       TEXT('CLIENTI:          MESE 11')
007100030916     A            SE94N11        9S 0       TEXT('SPEDIZIONI:       MESE 11')
007200030916     A            SE94R11        7S 0       TEXT('RICAVO REALE:     MESE 11')
007300030916     A            SE94D11        4S 1       TEXT('DELTA:            MESE 11')
007400030916     A*
007500030916     A            SE94C12        7S 0       TEXT('CLIENTI:          MESE 12')
007600030916     A            SE94N12        9S 0       TEXT('SPEDIZIONI:       MESE 12')
007700030916     A            SE94R12        7S 0       TEXT('RICAVO REALE:     MESE 12')
007800030916     A            SE94D12        4S 1       TEXT('DELTA:            MESE 12')
007900030916     A*
008000030916     A            SE94CTO        7S 0       TEXT('CLIENTI:           TOTALI')
008100030916     A            SE94NTO        9S 0       TEXT('SPEDIZIONI:        TOTALI')
008200030916     A            SE94RTO        7S 0       TEXT('RICAVO REALE:      TOTALI')
008300030916     A            SE94DTO        4S 1       TEXT('DELTA:             TOTALI')
