000100940503     A*------------------------------------------------------------------------*
000200141121     A* TRAINI - FILIALI   WRKFILE
000300940503     A*------------------------------------------------------------------------*
000400890911     A                                      REF(CNDIZION)
000500141121     A          R WFTWF000                  TEXT('TRAINI - WF FILIALI')
000600141121     A            TWFAFIL       20A         TEXT('CODICE FILIALE')
000700141121     A            TWFDESF       30A         TEXT('DESCRIZIONE FILIALE')
000800141121     A            TWFFTFP        1S 0       TEXT('1=TERMINAL; 0=NO TERMINAL')
000900141121     A            TWFATFP       20A         TEXT('TERMINAL DI PARTENZA')
001000141121     A            TWFATFA       20A         TEXT('TERMINAL DI ARRIVO ')
001100141121     A            TWFFFLP        1S 0       TEXT('1=SI TRANSITO; 0=NO TRANSITO')
001200141121     A            TWFFPSC        1S 0       TEXT('1=SI SCAMBIO; 0=NO SCAMBIO')
001300151023     A            TWFFAUT        1S 0       TEXT('1=UN SOLO AUT; 0=PIU'' AUT')
001400151023     A            TWFFPOS        1S 0       TEXT('0=NON DEFINITO;1=NORD;2=CENTR-
001500151023     A                                      O;3=SUD;4=ISOLE')
001600151023     A            TWFAHHX        2A         TEXT('ORA    MAX ARRIVO')
001700151023     A            TWFAMMX        2A         TEXT('MINUTI MAX ARRIVO')
001800141121     A            TWFNBAP        2S 0       TEXT('N. BAIE IN PARTENZA')
001900141121     A            TWFNBAA        2S 0       TEXT('N. BAIE IN ARRIVO')
002000141121     A            TWFNCAS        3S 0       TEXT('N. CASSE MOBILI')
002100151029     A            TWFNSMR        3S 0       TEXT('N. SEMIRIMORCHI')
002200151023     A            TWFAFAIHH      2A         TEXT('FASCIA APERTURA-INIZIO-ORA')
002300151023     A            TWFAFAIMM      2A         TEXT('FASCIA APERTURA-INIZIO-MINUT')
002400151023     A            TWFAFAFHH      2A         TEXT('FASCIA APERTURA-FINE  -ORA')
002500151023     A            TWFAFAFMM      2A         TEXT('FASCIA APERTURA-FINE  -MINUT')
002600151023     A            TWFAFPIHH      2A         TEXT('FASCIA PAUSA   -INIZIO-ORA')
002700151023     A            TWFAFPIMM      2A         TEXT('FASCIA PAUSA   -INIZIO-MINUT')
002800151023     A            TWFAFPFHH      2A         TEXT('FASCIA PAUSA   -FINE  -ORA')
002900151023     A            TWFAFPFMM      2A         TEXT('FASCIA PAUSA   -FINE  -MINUT')
003000141121     A            TWFTFIC        4S 0       TEXT('TEMPO FISSO CASSA')
003100141121     A            TWFTFIS        4S 0       TEXT('TEMPO FISSO SEMIRIMORCHIO')
003200141121     A            TWFTVVC        4S 0       TEXT('TEMPO VARIAB.VOLUME- CARICA')
003300141121     A            TWFTVVS        4S 0       TEXT('TEMPO VARIAB.VOLUME-SCARICA')
