000100000913     A*------------------------------------------------------------------------*
000200030808     A* WRK-FILE VARIE FATTURATE                                               *
000300000913     A*------------------------------------------------------------------------*
000400001113     A                                      UNIQUE
000500030808     A          R WFVFT000                  PFILE(WFVFT00F)
000600030808     A          K VFTAMF
000700030808     A          K VFTSVN
000800030808     A          K VFTFPT
