000100871021     A*--------------------------------------------------------------*
000200091009     A* WFILE  VISITE CLIENTI IN COMPROPRIETÀ
000300840614     A*--------------------------------------------------------------*
000400920414     A                                      REF(CNDIZION)
000500091019     A          R WFVCC000                  TEXT('VISITE CLIENTI IN COMPROPRIET-
000600091009                                            À')
000700091009      *
000800091009      * - Riferimenti al lancio:
000900091009     A            WCCUTE    R               REFFLD($PRU)
001000091009     A                                      TEXT('Utente')
001100091009     A                                      COLHDG('Utente')
001200091009     A            WCCDTA    R     S         REFFLD($DA8)
001300091009     A                                      TEXT('Data di lancio')
001400091009     A                                      COLHDG('Data' +
001500091009     A                                             'Lancio')
001600091009     A                                      EDTWRD('    /  /  ')
001700091009     A            WCCDTI    R     S         REFFLD($DA8)
001800091009     A                                      TEXT('Data inizio periodo')
001900091009     A                                      COLHDG('Data' +
002000091009     A                                             'Iniziale')
002100091009     A                                      EDTWRD('    /  /  ')
002200091009     A            WCCDTF    R     S         REFFLD($DA8)
002300091009     A                                      TEXT('Data fine periodo')
002400091009     A                                      COLHDG('Data' +
002500091009     A                                             'Finale')
002600091009     A                                      EDTWRD('    /  /  ')
002700920414     A*
002800091009     A            WCCKSCU        7S 0       TEXT('COD.CLIENTE UNIFICANTE')
002900091019     A            WCCCPO        11S 0       TEXT('CODICE POTENZIALE DELLA -
003000091019     A                                      VISITA')
003100091016     C* I SEGUENTI DATI SI RRIFERISCONO AL CLIENTE UNIFCIANTE O AL POTENZIALE
003200091016     A            WCCRAG        48          TEXT('RRAGIONE SOCIALE')
003300091009     A            WCCCLV    R               REFFLD($CLV)
003400091009     A                                      TEXT('CODICE IMPORTANZA CLIENTE')
003500091009     A
003600091009     A            WCCCMERC       5A         TEXT('SETTORE MERCEOLOGICO')
003700091009     A            WCCDMERC      40A         TEXT('DESCRIZIONE SETT.MERCEOLOG')
003800091009     A
003900091016     A* DATI VISITA
004000091009     A            WCCKSCV        7S 0       TEXT('COD.CLIENTE DELLA VISITA')
004100091009     A            WCCRAGV       48          TEXT('RAGSOC.CLIENTE VISITA')
004200071212     A
004300091009     A            WCCDVI         8S 0       TEXT('DATA VISITA')
004400091009     A            WCCTPV    R               REFFLD($TPV)
004500091016     A            WCCCMM         7S 0       TEXT('AGENTE DELLA VISITA')
004600091009     A            WCCDCMM       25A         TEXT('DESCRIZIONE AGE VISITA')
004700091009     A            WCCFIL         3S 0       TEXT('FILIALE AGENTE')
004800091009     A            WCCDFIL       25A         TEXT('DESCRIZIONE FILIALE')
004900091009     A            WCCARE         3S 0       TEXT('AREA AGENTE')
005000091009     A            WCCDARE       25A         TEXT('DESCRIZIONE AREA')
005100091009     A            WCCDIV         1A         TEXT('DISTRETTO AGENTE')
005200091009     A            WCCDDIV       25A         TEXT('DESCRIZIONE DISTRETTO')
005300071212     A
005400090209     A* INFO COMMERCIALI
005500091009     A            WCCCPOIFO     11S 0       TEXT('POTENZIALE DA CUI PRESE LE -
005600091009     A                                      INFO')
005700091009     A            WCCCPI         1A         TEXT('S= INFO COMPLETE')
005800091009     A            WCCSPT        11S 0       TEXT('SPESA TOT TRASP')
005900091009     A            WCCSNA         7S 0       TEXT('SPEDIZIONI ANNUE PRESUNTI')
006000091016     A            WCCKMS         5S 0       TEXT('PESO MEDIO A SPEDIZIONE')
006100090209     A
006200091009     A            WCCBAR         3S 0       TEXT(' %   -BARTOLINI')
006300091009     A            WCCMEZ         3S 0       TEXT(' %   -MEZZI PROPRI')
006400091009     A            WCCARCO        3S 0       TEXT(' %   -AROC')
006500091009     A            WCCARTO        3S 0       TEXT(' %   -ARTONI')
006600091009     A            WCCAWS         3S 0       TEXT(' %   -AWS')
006700091009     A            WCCBARS        3S 0       TEXT(' %   -BARS')
006800091009     A            WCCDHL         3S 0       TEXT(' %   -DHL')
006900091009     A            WCCEXEC        3S 0       TEXT(' %   -EXECUTIVE')
007000091009     A            WCCFERC        3S 0       TEXT(' %   -FERCAM')
007100091009     A            WCCMAIL        3S 0       TEXT(' %   -MAIL BOXES')
007200091009     A            WCCMTN         3S 0       TEXT(' %   -MTN')
007300091009     A            WCCSDA         3S 0       TEXT(' %   -SDA')
007400091009     A            WCCSUSA        3S 0       TEXT(' %   -SUSA')
007500091009     A            WCCTNT         3S 0       TEXT(' %   -TNT')
007600091009     A            WCCUPS         3S 0       TEXT(' %   -USP')
007700091016     A            WCCCATR        3S 0       TEXT(' %   -ALTRI')
007800091016
007900091016     A            WCCPRF         3S 0       TEXT('% -IT-PARCEL FINO 50 KG')
008000091016     A            WCCPRO         3S 0       TEXT('% -IT-MESSAGGERIA ESPRESSA')
008100091016     A            WCCMES         3S 0       TEXT('% -IT-MESSAGGERIA TRADIZION.')
008200091016     A            WCCAER         3S 0       TEXT('% -EST-VIA AEREA')
008300091016     A            WCCCAE         3S 0       TEXT('% -EST-SERVIZIO CAMIONISTICO')
008400091016     A            WCCSATR        3S 0       TEXT('% -EST-ALTRO')
