000100000000     A*------------------------------------------------------------------------*
000200160511     A*  FILE WORK - TASSAZIONE CON VOLUME VDL SUL REALE                       *
000300030311     A*------------------------------------------------------------------------*
000400000000     A                                      REF(CNDIZION)
000500160511     A          R WFVDL000                  TEXT('WF TASSAZIONE VOLUME VDL')
000600160511     A            VDLTVR         1          TEXT('TASSAZ. VDL : =RITASSATO;+
000700150713     A                                      M=MANCA TARIFFA;N=MAI VDL')
000800160511     A                                      COLHDG('M=MANCA TAR.' 'N=MAI VDL')
000900160511     A            VDLAAS    R               REFFLD($AAS)
001000160511     A            VDLLNP    R               REFFLD($LNP)
001100160511     A            VDLNRS    R               REFFLD($NRS)
001200160511     A            VDLNSP    R               REFFLD($NSP)
001300160511     A            VDLKSC    R               REFFLD($KSC)
001400050603     A                                      TEXT('CODICE CLIENTE TASSAZIONE')
001500160511     A            VDLCTR    R               REFFLD($CTR)
001501160511     A            VDLPVL    R               REFFLD($PVL)
001502160511     A            VDLVLF    R               REFFLD($VLF)
001503160511     A            VDLVLC    R               REFFLD($VLC)
002000160511     A            VDLIMV    R               REFFLD($IMV)
002100150713     A                                      TEXT('TOT.IMPONIBILE')
002200150714     A                                      COLHDG('IMP.' 'FATTURA')
002300160511     A            VDLIMVR   R               REFFLD($IMV)
002400150713     A                                      TEXT('TOT.IMPONIBILE RITASSATO')
002500150714     A                                      COLHDG('IMP.' 'RITASSATO')
