000100000000     A*--------------------------------------------------------------*
000200101109     A                                      REF(CNDIZION)
000300101109     A          R TITAS010                  TEXT('BOLLE FATTURATE ULTIMI MESI')
000400101109     A            TASAAS    R               REFFLD($AAS)
000500101109     A            TASLNP    R               REFFLD($LNP)
000600101109     A            TASNRS    R               REFFLD($NRS)
000700101109     A            TASNSP    R               REFFLD($NSP)
000800101109     A            TASTBL    R               REFFLD($TBL)
000900101109     A            TASCBO    R               REFFLD($CBO)
001000101109     A            TASMGS    R               REFFLD($MMG)
001100101109     A                                      TEXT('MESE/GIORNO SPEDIZIONE')
001200101109     A            TASKSC    R               REFFLD($CSC)
001300101109     A                                      TEXT('CODICE CLIENTE FATTURAZIONE')
001400101109     A            TASLNA    R               REFFLD($LNA)
001500101109     A            TASNCL    R               REFFLD($NCL)
001600101109     A* PESO
001700101109     A            TASPKB    R               REFFLD($PKB)
001800101109     A            TASFPB    R               REFFLD($FPB)
001900101109     A            TASPKC    R               REFFLD($PKC)
002000101109     A            TASNCP    R               REFFLD($NCP)
002100101109     A            TASPKF    R               REFFLD($PKF)
002200101109     A            TASFPF    R               REFFLD($FPF)
002300101109     A            TASPVL    R               REFFLD($PVL)
002400101109     A                                      TEXT('PESO TASSABILE')
002500101109     A* VOLUME
002600101109     A            TASFVB    R               REFFLD($FVB)
002700101109     A            TASVLB    R               REFFLD($VLB)
002800101109     A            TASVLC    R               REFFLD($VLC)
002900101109     A            TASNCR    R               REFFLD($NCR)
003000101109     A            TASVLF    R               REFFLD($VLF)
003100101109     A            TASFVF    R               REFFLD($FVF)
003200101109     A            TASQFT    R               REFFLD($QFT)
003300101109     A            TASIAS    R               REFFLD($IAS)
003400101109     A            TASVAS    R               REFFLD($VAS)
003500101109     A            TASFCM         1A
003600101109     A                                      TEXT('F=TASIAS IMMESSO DALLA FATTUR-
003700101109                                            AZIONE')
003800101109     A                                      COLHDG('IAS DA' 'FATTURAZ')
003900101109     A            TASCTR    R               REFFLD($CTR)
004000101109     A            TASTSP    R               REFFLD($TSP)
004100101109     A* DESTINATARIO
004200101109     A            TASRSD    R               REFFLD($RSD)
004300101109     A            TASIND    R               REFFLD($IND)
004400101109     A            TASCAD    R               REFFLD($CAD)
004500101109     A            TASLOD    R               REFFLD($LOD)
004600101109     A            TASPRD    R               REFFLD($PRD)
004700101109     A            TASNZD    R               REFFLD($NZD)
004800101109     A            TASCPD    R               REFFLD($CPI)
004900101109     A            TASCTS    R               REFFLD($CTS)
005000101109     A                                      TEXT('COD.TASSAZIONE DESTINATARIO')
005100101109     A            TASFIN    R               REFFLD($FIN)
005200101109     A* MITTENTE
005300101109     A            TASCCM    R               REFFLD($CCM)
005400101109     A            TASRMN    R               REFFLD($RMN)
005500101109     A            TASMCT    R               REFFLD($CTS)
005600101109     A                                      TEXT('CODICE TASSAZIONE MITTENTE')
005700101109     A                                      COLHDG('COD' 'TASS' 'MITT')
005800101109     A            TASFAP    R               REFFLD($FAP)
005900101109     A            TASFTM    R               REFFLD($FTM)
006000101109     A            TASNAS    R               REFFLD($NAS)
006100101109     A            TASFLB    R               REFFLD($FLB)
006200101109     A            TASFLP    R               REFFLD($FLP)
006300101109     A                                      TEXT('1° FILIALE DI TRANSITO')
006400101109     A            TASFL2    R               REFFLD($FLP)
006500101109     A                                      TEXT('2° FILIALE DI TRANSITO')
006600101109     A            TASTFA    R               REFFLD($TFA)
006700101109     A            TASTFP    R               REFFLD($TFP)
006800101109     A            TASDIM    R               REFFLD($DIM)
006900101109     A            TASSOP    R               REFFLD($SOP)
007000101109     A            TASPDR    R               REFFLD($PDR)
007100101109     A                                      TEXT('COD.PADRONCINO RITIRO')
007200101109     A            TASDRT    R               REFFLD($DRT)
007300101109     A            TASHRT    R               REFFLD($HRT)
007400101109     A            TASNRT    R               REFFLD($NRT)
007500101109     A            TASFPP    R               REFFLD($FPP)
007600101109     A            TASSTR    R               REFFLD($STP)
007700101109     A                                      TEXT('NR. STOP RITIRO')
007800101109     A            TASCTM    R               REFFLD($CTM)
007900101109     A            TASFNS    R               REFFLD($FNS)
008000101109     A            TASFLS    R               REFFLD($FLS)
008100101109     A            TASNCD    R               REFFLD($NSC)
008200101109     A                                      TEXT('NUM.SEGNACOLLO -DAL-')
008300101109     A            TASNCA    R               REFFLD($NSC)
008400101109     A                                      TEXT('NUM.SEGNACOLLO -AL-')
008500101109     A            TASXCO    R               REFFLD($XCO)
008600101109     A            TASDBR    R               REFFLD($DBR)
008700101109     A            TASDUC    R               REFFLD($DUC)
008800101109     A            TASDTI    R               REFFLD($DTI)
008900101109     A                                      TEXT('DATA ARRIVO ULTIMO COLLO O BO-
009000101109                                            LLA')
009100101109     A                                      COLHDG('DAT ARR' 'ULTIMO' 'COLLO')
009200101109     A            TASHTI    R               REFFLD($HTI)
009300101109     A                                      TEXT('ORA  ARRIVO ULTIMO COLLO O BO-
009400101109                                            LLA')
009500101109     A                                      COLHDG('ORA ARR' 'ULTIMO' 'COLLO')
009600101109     A            TASZNC    R               REFFLD($ZSC)
009700101109     A            TASPDC    R               REFFLD($PDR)
009800101109     A                                      TEXT('COD.PADRONCINO CONSEGNA')
009900101109     A                                      COLHDG('PADR' 'CONSEGNA')
010000101109     A            TASNDC    R               REFFLD($NDC)
010100101109     A                                      TEXT('NR.DISTINTA CONSEGNA')
010200101109     A                                      COLHDG('NUM' 'DIST.CONS')
010300101109     A            TASDDC    R               REFFLD($DDC)
010400101109     A                                      TEXT('DATA DISTINTA CONSEGNA')
010500101109     A                                      COLHDG('DATA' 'DIST.CONS')
010600101109     A            TASSTP    R               REFFLD($STP)
010700101109     A            TASDCE    R               REFFLD($DCE)
010800101109     A            TASHCE    R               REFFLD($HCE)
010900101109     A            TASDCP    R               REFFLD($DCP)
011000101109     A            TASDCM    R               REFFLD($DCM)
011100101109     A            TASHMC    R               REFFLD($HMC)
011200101109     A            TASCCA    R               REFFLD($CCA)
011300101109     A            TASNPI    R               REFFLD($NPI)
011400101109     A            TASNCI    R               REFFLD($NCI)
011500101109     A            TASNRC    R               REFFLD($NRC)
011600101109     A            TASFDN    R               REFFLD($FDN)
011700101109     A            TASFFD    R               REFFLD($FFD)
011800101109     A            TASFTC    R               REFFLD($CCP)
011900101109     A                                      TEXT('COD. 1°CONSEGNA PARTICOLARE')
012000101109     A            TASTC2    R               REFFLD($CCP)
012100101109     A                                      TEXT('COD. 2°CONSEGNA PARTICOLARE')
012200101109     A                                      COLHDG('2 CONS' 'PARTIC')
012300101109     A            TASGC1    R               REFFLD($GC1)
012400101109     A            TASGC2    R               REFFLD($GC2)
012500101109     A            TASTCR    R               REFFLD($TCR)
012600101109     A            TASDCR    R               REFFLD($DCR)
012700101109     A            TASHCR    R               REFFLD($HCR)
012800101109     A* FLAG BOLLA
012900101109     A            TASFBR    R               REFFLD($FBR)
013000101109     A            TASLL1         1A         TEXT('FLAG DDT')
013100101109     A                                      COLHDG('FLAG' 'DDT')
013200101109     A            TASLL2         1A         TEXT('FLAG RILANCIO C.E.')
013300101109     A                                      COLHDG('RILANCIO' 'C.E')
013400101109     A            TASFA2         1A         TEXT('S=EMESSA N.C. A STORNO TOT.')
013500101109     A            TASFCA         1A         TEXT('S=HA AVUTO CONTRASSEGNO')
013600101109     A            TASFA1         1A         TEXT('S=HA AVUTO LEGAME BOLLA')
013700101109     A            TASFGC    R               REFFLD($FGC)
013800101109     A            TASFDA    R               REFFLD($FDA)
013900101109     A            TASGUF    R               REFFLD($GUF)
014000101109     A            TASFLO    R               REFFLD($FLO)
014100101109     A*
014200101109     A            TASGGS    R               REFFLD($GGS)
014300101109     A            TASGGA    R               REFFLD($GGA)
014400101109     A            TASGMA    R               REFFLD($GMA)
014500101109     A            TASGVA    R               REFFLD($GVA)
014600101109     A* TASSAZIONE
014700101109     A            TASNZM    R               REFFLD($NZM)
014800101109     A                                      TEXT('NAZIONE MITTENTE DI FATTURAZI+
014900101109     A                                      ONE')
015000101109     A            TASCAM    R               REFFLD($CAM)
015100101109     A                                      TEXT('CAP MITTENTE DI FATTURAZIONE')
015200101109     A            TASDIV    R               REFFLD($DIV)
015300101109     A            TASPOR    R               REFFLD($POR)
015400101109     A            TASSV1    R               REFFLD($SV1)
015500101109     A            TASVA1    R               REFFLD($VA1)
015600101109     A            TASSV2    R               REFFLD($SV2)
015700101109     A            TASVA2    R               REFFLD($VA2)
015800101109     A            TASSV3    R               REFFLD($SV3)
015900101109     A            TASVA3    R               REFFLD($VA3)
016000101109     A            TASIMV    R               REFFLD($IMV)
016100101109     A            TASDFT    R               REFFLD($DFT)
016200101109     A            TASNFT    R               REFFLD($NFT)
016300101109     A            TASFIV    R               REFFLD($FIV)
016400101109     A            TASFEI    R               REFFLD($CEI)
016500101109     A            TASFTS    R               REFFLD($FTS)
016600101109     A            TASFIC    R               REFFLD($FIC)
016700101109     A            TASSCL         1          TEXT('BOLLA BARTOLINI/SDI')
016800101109     A                                      COLHDG('BAR/SDI')
016900101109     A            CSBCAS    R               REFFLD($CAS)
017000101109     A            CSBVCA    R               REFFLD($VCA)
017100101109     A            CSBCMB    R               REFFLD($CMB)
017200101109     A                                      TEXT('CAMBIO INCASSO')
017300101109     A                                      COLHDG('CAMBIO' 'INCASSO')
017400101109     A            CSBTPI    R               REFFLD($TPI)
017500101109     A            CSBFUS         1A         TEXT('FLAG USI FUTURI')
017600101109     A                                      COLHDG('FLAG' 'USI' 'FUTURI')
