000100060828     A          R WP2LED0001                TEXT('FILE PIATTO 001 X DWL LED')
000200060828     A            DATI        1024A         TEXT('DATI')
000300060828     A                                      COLHDG('DATI')
