000100941102     A*------------------------------------------------------------------------*
000200091006     A* SALDI STATISTICA MENSILE "REPORT SETTIMANALE"  - EXTRA BUDGET -        *
000300941102     A*------------------------------------------------------------------------*
000400091006     A                                      REF(CNDIZION)
000500091006     A          R WSLSS500                  FORMAT(WSLSS50F)
