000100950904     A*%%TS  SD  19950904  183809  FORNASARI   REL-V3R1M0  5763-PW1
000200961219     A*%%EC **
000300950904     A                                      DSPSIZ(24 80 *DS3)
000400070115B0931A****                                  REF(*LIBL/PRDIZ)
000500070115B0931A                                      REF(*LIBL/ANDIZ00F)
000600950904     A                                      CHGINPDFT(HI CS)
000700950904     A                                      PRINT
000800950904     A                                      ERRSFL
000900950904     A                                      ALTHELP
001000950904     A                                      HLPTITLE('Creazione registro')
001100950904     A                                      HELP
001200901011     A*-------------------------------------*
001300940916    >A*l'abilitazione al singolo tasto non deve essere tolta anche se
001400940916    >A*non usato perchè ciò viene controllato a programma tramite la
001500940916    >A*schiera $FCn
001600941212     A          R A007D1
001700941212     A*%%TS  SD  19941212  095049  LOFFREDO    REL-V3R0M5  5763-PW1
001800941212     A                                      CF02
001900941212     A                                      CA03
002000941212     A                                      CF04
002100941212     A                                      CF05
002200941212     A                                      CF06
002300980608     A                                      CF07
002400941212     A                                      CA08
002500980608     A                                      CF09
002600941212     A                                      CF10
002700980608     A                                      CF11
002800941212     A                                      CA12
002900980608     A                                      CF13
003000980608     A                                      CF14
003100980608     A                                      CF15
003200980608     A                                      CF16
003300941212     A                                      CF17
003400941212     A                                      CF18
003500980608     A                                      CF19
003600980608     A                                      CF20
003700980608     A                                      CF21
003800980608     A                                      CF22
003900941212     A                                      CF23
004000941212     A                                      CF24
004100941212     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
004200941212     A                                      CSRLOC(H1RIGA     H1COLO)
004300941212     A                                      OVERLAY
004400941212     A          H                           HLPPNLGRP(LABEL01 ANA007DH)
004500941212     A                                      HLPARA(01 001 23 079)
004600941212     A            H1NMRC        10A  H      TEXT('Nome Record')
004700941212     A            H1NMFL        10A  H      TEXT('Nome Campo')
004800941212     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
004900941212     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
005000941212     A                                      ore')
005100941212     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
005200941212     A                                      ursore')
005300941212     A            D1MSG          1A  O  4  2TEXT('serve per emettere msg relati-
005400941212     A                                      vi a tutta la videata')
005500941212     A  98                                  ERRMSGID(PRO0008 *LIBL/PROMSG 98)
005600941212     A  97                                  ERRMSGID(CPD6A60 *LIBL/QCPFMSG 97)
005700961210     A            D1TIT         30A  O  3 26MSGID(COS 0059 PROMSG)
005800941212     A                                  5  2'Società ....................:'
005900941212     A            D1SOC     R        B  5 33REFFLD(ANSIF000/SIFSOCIETA *LIBL/AN-
006000941212     A                                      SIF00F)
006100941212     A                                  7  2'Capofila per anagrafiche ...:'
006200941212     A            D1CPA     R        B  7 33REFFLD(ANSIF000/SIFCAPOFAN *LIBL/AN-
006300941212     A                                      SIF00F)
006400941004    >A*---------------------------------------------------------------
006500950110     A          R A007S1                    SFL
006600950110     A*%%TS  SD  19950110  134706  LOFFREDO    REL-V3R0M5  5763-PW1
006700950110     A                                      TEXT('SUBFILE')
006800950110     A  32                                  SFLNXTCHG
006900950110     A            S1OPZ          2Y 0B 11  3TEXT('Campo Opzione')
007000950110     A                                      EDTCDE(Z)
007100950110     A  40                                  DSPATR(PC)
007200950110     A  40                                  DSPATR(RI)
007300950110     A            S1SOC     R        O 11  9REFFLD(ANSIF000/SIFSOCIETA *LIBL/AN-
007400950110     A                                      SIF00F)
007500950110     A            S1RGS     R        O 11 15REFFLD(ANSIF000/SIFRGS *LIBL/ANSIF0-
007600950110     A                                      0F)
007700950110     A            S1CPA     R        O 11 62REFFLD(ANSIF000/SIFCAPOFAN *LIBL/AN-
007800950110     A                                      SIF00F)
007900961209     A            S1DFV          6  0O 11 70EDTWRD('  /  /  ')
008000940117     A*-------------------------------------*
008100940916    >A*l'abilitazione al singolo tasto non deve essere tolta anche se
008200940916    >A*non usato perchè ciò viene controllato a programma tramite la
008300940916    >A*schiera $FCn
008400950110     A          R A007C1                    SFLCTL(A007S1)
008500950110     A*%%TS  SD  19950110  134706  LOFFREDO    REL-V3R0M5  5763-PW1
008600950110     A                                      SFLSIZ(0011)
008700950110     A                                      SFLPAG(0010)
008800950110     A                                      TEXT('SUBFILE Control')
008900980608     A                                      CF02
009000980608     A                                      CA03
009100980608     A                                      CF04
009200980608     A                                      CF05
009300980608     A                                      CF06
009400980608     A                                      CF07
009500980608     A                                      CA08
009600980608     A                                      CF09
009700980608     A                                      CF10
009800980608     A                                      CF11
009900980608     A                                      CA12
010000980608     A                                      CF13
010100980608     A                                      CF14
010200980608     A                                      CF15
010300980608     A                                      CF16
010400980608     A                                      CF17
010500980608     A                                      CF18
010600980608     A                                      CF19
010700980608     A                                      CF20
010800980608     A                                      CF21
010900980608     A                                      CF22
011000980608     A                                      CF23
011100980608     A                                      CF24
011200950110     A N33                                  ROLLUP
011300950110     A                                      OVERLAY
011400950110     A                                      SFLCSRRRN(&C1NRR)
011500950110     A  30                                  SFLDSP
011600950110     A  31                                  SFLDSPCTL
011700950110     A N31                                  SFLCLR
011800950110     A  33                                  SFLEND(*MORE)
011900950110     A  50                                  SFLMSGID(PRO0004 *LIBL/PROMSG 50)
012000950110     A  51                                  SFLMSGID(PRO0005 *LIBL/PROMSG 51)
012100950110     A  52                                  SFLMSGID(PRO0007 *LIBL/PROMSG 52)
012200950110     A  97                                  SFLMSGID(CPD6A60 *LIBL/QCPFMSG 97)
012300950110     A          H                           HLPPNLGRP(LABEL01 ANA007DH)
012400950110     A                                      HLPARA(09 018 09 068)
012500950110     A            C1RCD          4S 0H      SFLRCDNBR(CURSOR)
012600950110     A            C1NRR          5S 0H
012700950110     A            C1COZ          3S 0H      TEXT('contatore opzioni')
012800950110     A                                  5 41'Inizio elenco da ....:'
012900950110     A            C1POS         15A  B  5 64
013000950110     A            C1OPZ1        76A  O  7  3
013100060224A1148A            H1ALLOPT     960A  H
013200950110     A            C1OPZ2        76A  O  8  3
013300950110     A                                 10  3'Opz'
013400950110     A                                      DSPATR(HI)
013500950110     A                                 10  8'Codice'
013600950110     A                                      DSPATR(HI)
013700950110     A                                 10 16'Descrizione'
013800950110     A                                      DSPATR(HI)
013900950110     A                                 10 60'Capofila'
014000950110     A                                      DSPATR(HI)
014100950110     A                                 10 70'Fine val.'
014200950110     A                                      DSPATR(HI)
014300941011    >A          R A007D3
014400940202     A*%%TS  SD  19940202  121242  CARINI      REL-V2R2M0  5738-PW1
014500940202     A                                      OVERLAY
014600940325     A                                 15 10'(Non esistono dati all''interno de-
014700940609     A                                      lle parzializzazioni eseguite)'
014800950904     A          R A007T1
014900950904     A*%%TS  SD  19950904  183809  FORNASARI   REL-V3R1M0  5763-PW1
015000950904     A            NOMDIT        20A  O  1  2TEXT('DESCRIZIONE DITTA')
015100950904     A                                  1 24'             Società              '
015200950904     A                                      DSPATR(UL)
015300950904     A                                      DSPATR(RI)
015400950904     A                                  1 59USER
015500950904     A                                  1 70DATE
015600950904     A                                      EDTCDE(Y)
015700950904     A            NOMSIF        10A  O  2 11
015800950904     A                                  2  2SYSNAME
015900950904     A            T1OPE         30A  O  2 26
016000950904     A            NOMPGM        10A  O  2 59
016100950904     A                                  2 70'gruppo PRO'
016200941011    >A          R A007Z1
016300940314     A* piede dei parametri
016400940225     A*%%TS  SD  19940225  111248  CARINI      REL-V2R2M0  5738-PW1
016500940225     A                                      OVERLAY
016600940506     A            Z1KE1         79     22  2
016700060224A1148A            H1ALLFUNCT   480A  H
016800940506     A            Z1KE2         79     23  2
016900941011    >A          R A007Z2
017000940314     A* piede del subfile
017100940225     A*%%TS  SD  19940225  111248  CARINI      REL-V2R2M0  5738-PW1
017200940225     A                                      OVERLAY
017300940506     A            Z2KE1         79     22  2
017400060224A1148A            H2ALLFUNCT   480A  H
017500940506     A            Z2KE2         79     23  2
017600940916    >A*l'abilitazione al singolo tasto non deve essere tolta anche se
017700940916    >A*non usato perchè ciò viene controllato a programma tramite la
017800940916    >A*schiera $FCn
017900941212     A          R A007D2
018000941212     A*%%TS  SD  19941212  103357  LOFFREDO    REL-V3R0M5  5763-PW1
018100941212     A                                      WINDOW(A007Z3)
018200941212     A                                      TEXT('Window Modif.valori assunti')
018300980608     A                                      CF02
018400980608     A                                      CA03
018500980608     A                                      CF04
018600980608     A                                      CF05
018700980608     A                                      CF06
018800980608     A                                      CF07
018900980608     A                                      CA08
019000980608     A                                      CF09
019100980608     A                                      CF10
019200980608     A                                      CF11
019300980608     A                                      CA12
019400980608     A                                      CF13
019500980608     A                                      CF14
019600980608     A                                      CF15
019700980608     A                                      CF16
019800980608     A                                      CF17
019900980608     A                                      CF18
020000980608     A                                      CF19
020100980608     A                                      CF20
020200980608     A                                      CF21
020300980608     A                                      CF22
020400980608     A                                      CF23
020500980608     A                                      CF24
020600941212     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
020700941212     A                                      BLINK
020800941212     A                                      CSRLOC(H1RIGA     H1COLO)
020900941212     A                                      OVERLAY
021000941212     A            H1NMRC        10A  H      TEXT('Nome Record')
021100941212     A            H1NMFL        10A  H      TEXT('Nome Campo')
021200941212     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
021300941212     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
021400941212     A                                      ore')
021500941212     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
021600941212     A                                      ursore')
021700941212     A                                  1 18'Modifica valori assunti'
021800941212     A                                  3  2'Prima videata ..:'
021900941212     A            D2LOP          1Y 0B  3 20EDTCDE(Z)
022000941212     A  50                                  ERRMSGID(PRO0002 *LIBL/PROMSG 50)
022100941212     A                                      VALUES(1 2)
022200941212     A                                  3 32'1=Parzial. 2=Lista'
022300941212     A                                  4  2'Ordinamento ....:'
022400941212     A            D2ORD          1Y 0B  4 20EDTCDE(Z)
022500941212     A  51                                  ERRMSGID(PRO0003 *LIBL/PROMSG 51)
022600941212     A                                      VALUES(0 1 2)
022700941212     A                                  4 32'1=Società'
022800941212     A                                  4 43'2=Capofila'
022900941011     A          R A007Z3
023000941004     A*%%TS  SD  19941004  181833  LOFFREDO    REL-V3R0M5  5763-PW1
023100941004     A                                      WINDOW(4 11 7 56)
023200941004     A                                      WDWBORDER((*DSPATR RI) (*CHAR '    -
023300941004     A                                          '))
023400941004     A                                      USRRSTDSP
023500941004     A            Z3KE1         56A  O  5  1
023600060224A1148A            H3ALLFUNCT   480A  H
023700941004     A            Z3KE2         56A  O  6  1
