000100950710     A* TIPO RECORD 11
000200950710     A                                      REF(ANDIZ00F)
000300950710     A*
000400950710    >A          R ANAB911D
000500950710     A*
000600950710     A            AB9CIN11       1A
000700950710     A            AB9DENIST     80A
000800950710     A            AB9TIPO        1A
000900041012>>>>>A            AB9BANSEG      5S 0
001000950710     A            AB9CINSEG      1A
