000100090514     A*--------------------------------------------------------------*
000200090514     A*                                                              *
000300090514     A*  TRACCIATO FILE MINISTERIALE PER IMPORT/EXPORT DATI MOD. 770 *
000400090514     A*  DS Scomposizione campi del Tipo record "Z" - Coda           *
000500110413     A*  ANNO 2011                                                   *
000600090514     A*--------------------------------------------------------------*
000700090514     A*
000800090514     A          R M7TMZ000                  TEXT('Tracciato Ministeriale       -
000900090514     A                                      Tipo record Z                     ')
001000090514     A*
001100090514     A            TMZ0TR         1A         TEXT('Tipo record: Z ')
001200090514     A                                      COLHDG('Tipo' 'Rcd' '= Z ')
001300090514     A*
001400090514     A            TMZFI1        14A         TEXT('Filler')
001500090514     A                                      COLHDG('Filler')
001600090514     A*
001700090514     A            TMZ0NB         9S 0       TEXT('Numero Compl Record B')
001800090514     A                                      COLHDG('Num.' 'Record' 'B')
001900090514     A*
002000090514     A            TMZ0ND         9S 0       TEXT('Numero Compl Record D')
002100090514     A                                      COLHDG('Num.' 'Record' 'D')
002200090514     A*
002300090514     A            TMZ0NE         9S 0       TEXT('Numero Compl Record E')
002400090514     A                                      COLHDG('Num.' 'Record' 'E')
002500090514     A*
002600090514     A            TMZ0NF         9S 0       TEXT('Numero Compl Record F')
002700090514     A                                      COLHDG('Num.' 'Record' 'F')
002800090514     A*
002900090514     A            TMZ0NG         9S 0       TEXT('Numero Compl Record G')
003000090514     A                                      COLHDG('Num.' 'Record' 'G')
003100090514     A*
003200090514     A            TMZ0NH         9S 0       TEXT('Numero Compl Record H')
003300090514     A                                      COLHDG('Num.' 'Record' 'H')
003400090514     A*
003500090514     A            TMZ0NJ         9S 0       TEXT('Numero Compl Record J')
003600090514     A                                      COLHDG('Num.' 'Record' 'J')
003700090514     A*
003800110413R055 A            TMZ0NI         9S 0       TEXT('Numero Compl Record I')
003900110413R055 A                                      COLHDG('Num.' 'Record' 'I')
004000110413R055 A*
004100090514     A* - - - - - - - - - - - - - - - - - - -
004200090514     A*
004300090514     A* Dati non utilizzati
004400090514     A*
004500110413R055 A****        TMZFI2      1819A         TEXT('Filler')
004600110413R055 A            TMZFI2      1810A         TEXT('Filler')
004700090514     A                                      COLHDG('Filler')
004800090514     A*
004900090514     A* - - - - - - - - - - - - - - - - - - -
005000090514     A*
005100090514     A* Dati per controllo record
005200090514     A*
005300090514     A            TMZ0K1         1A         TEXT('Check 1')
005400090514     A                                      COLHDG('Check 1')
005500090514     A            TMZ0K2         2A         TEXT('Check 2')
005600090514     A                                      COLHDG('Check 2')
