000100981228     A*%%TS  SD  19981228  174515  TEO         REL-V3R7M0  5716-PW1
000200980619     A*PARMS RSTDSP(*YES) DFRWRT(*YES)
000300981228     A*%%EC
000400981228     A                                      DSPSIZ(24 80 *DS3)
000500981228     A                                      REF(*LIBL/ANDIZ00F)
000600981228     A                                      CHGINPDFT(HI CS)
000700981228     A                                      PRINT
000800981228     A                                      HLPTITLE(' ')
000900981228     A                                      HLPPNLGRP(LABEL NDC130DH)
001000981228     A                                      ERRSFL
001100981228     A                                      ALTHELP
001200981228     A                                      HELP
001300950612     A          R C130T1
001400950612     A*%%TS  SD  19950612  164353  CASTELLANI  REL-V3R1M0  5763-PW1
001500950612     A            NOMDIT        20A  O  1  2TEXT('DESCRIZIONE DITTA')
001600950612     A                                  1 24'         Stampa mastrini          '
001700950612     A                                      DSPATR(UL)
001800950612     A                                      DSPATR(RI)
001900950612     A                                  1 59USER
002000950612     A                                  1 70DATE
002100950612     A                                      EDTCDE(Y)
002200950612     A                                  2  2SYSNAME
002300950612     A            NOMSIF        10A  O  2 11
002400950612     A            T1TIT         30A  O  2 26
002500950612     A            NOMPGM        10A  O  2 59
002600950612     A                                  2 70'gruppo PRO'
002700950612     A            T1OPE         30A  O  3 26
002800901011     A*-------------------------------------*
002900950301     A*l'abilitazione al singolo tasto non deve essere tolta anche se
003000950301     A*non usato perchè ciò viene controllato a programma tramite la
003100950301     A*schiera $FCn
003200981228     A          R C130D1
003300981228     A*%%TS  SD  19981228  174515  TEO         REL-V3R7M0  5716-PW1
003400981228     A                                      CF02
003500981228     A                                      CA03
003600981228     A                                      CF04
003700981228     A                                      CF05
003800981228     A                                      CF06
003900981228     A                                      CA08
004000981228     A                                      CF10
004100981228     A                                      CA12
004200981228     A                                      CF17
004300981228     A                                      CF18
004400981228     A                                      CF21
004500981228     A                                      CF23
004600981228     A                                      CF24
004700981228     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
004800981228     A                                      CSRLOC(H1RIGA     H1COLO)
004900981228     A                                      OVERLAY
005000981228     A          H                           HLPPNLGRP(D1DESCRH NDC130DH)
005100981228     A                                      HLPARA(*FLD D1DESCRIZ)
005200981228     A          H                           HLPPNLGRP(D1CTBH NDC130DH)
005300981228     A                                      HLPARA(*FLD D1CTB)
005400981228     A          H                           HLPPNLGRP(D1UNIH NDC130DH)
005500981228     A                                      HLPARA(*FLD D1UNI)
005600981228     A          H                           HLPPNLGRP(D1DTCH NDC130DH)
005700981228     A                                      HLPARA(*FLD D1DTC)
005800981228     A          H                           HLPPNLGRP(D1SEOH NDC130DH)
005900981228     A                                      HLPARA(*FLD D1SEO)
006000981228     A          H                           HLPPNLGRP(D1DTIH NDC130DH)
006100981228     A                                      HLPARA(*FLD D1DTI)
006200981228     A          H                           HLPPNLGRP(D1DTFH NDC130DH)
006300981228     A                                      HLPARA(*FLD D1DTF)
006400981228     A          H                           HLPPNLGRP(D1DEFH NDC130DH)
006500981228     A                                      HLPARA(*FLD D1DEF)
006600981228     A          H                           HLPPNLGRP(D1PROH NDC130DH)
006700981228     A                                      HLPARA(*FLD D1PRO)
006800981228     A          H                           HLPPNLGRP(D1GESH NDC130DH)
006900981228     A                                      HLPARA(*FLD D1GES)
007000981228     A          H                           HLPPNLGRP(D1DETH NDC130DH)
007100981228     A                                      HLPARA(*FLD D1DET)
007200981228     A          H                           HLPPNLGRP(D1NMOH NDC130DH)
007300981228     A                                      HLPARA(*FLD D1NMO)
007400981228     A          H                           HLPPNLGRP(D1SLMH NDC130DH)
007500981228     A                                      HLPARA(*FLD D1SLM)
007600981228     A          H                           HLPPNLGRP(D1SLPH NDC130DH)
007700981228     A                                      HLPARA(*FLD D1SLP)
007800981228     A          H                           HLPPNLGRP(D1CAUH NDC130DH)
007900981228     A                                      HLPARA(*FLD D1CAU)
008000041012     A          H                           HLPPNLGRP(D1YCDH NDC130DH)
008100041012     A                                      HLPARA(*FLD D1YCD)
008200981228     A            H1NMRC        10A  H      TEXT('Nome Record')
008300981228     A            H1NMFL        10A  H      TEXT('Nome Campo')
008400981228     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
008500981228     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
008600981228     A                                      ore')
008700981228     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
008800981228     A                                      ursore')
008900981228     A                                  4  2'Descrizione elaborazione ...:'
009000981228     A            D1DESCRIZ R        B  4 33REFFLD(ANDIZ000/DESCR *LIBL/ANDIZ00-
009100981228     A                                      F)
009200981228     A  66                                  ERRMSGID(PRO0014 *LIBL/PROMSG 66)
009300981228     A                                      CHECK(LC)
009400981228     A            D1MSG          1A  O  4 79TEXT('serve per emettere msg relati-
009500981228     A                                      vi a tutta la videata')
009600981228     A  96                                  ERRMSGID(PRO0013 *LIBL/PROMSG 96)
009700981228     A  97                                  ERRMSGID(CPD6A60 *LIBL/QCPFMSG 97)
009800981228     A  98                                  ERRMSGID(PRO0008 *LIBL/PROMSG 98)
009900981228     A                                  6  2'Contabilità ................:'
010000981228     A            D1CTB          2A  B  6 33
010100981228     A  11                                  DSPATR(PR)
010200981228     A N11                                  DSPATR(CS)
010300981228     A N11                                  DSPATR(HI)
010400981228     A  67                                  ERRMSGID(PRO0321 *LIBL/PROMSG 67)
010500981228     A  68                                  ERRMSGID(PRO0354 *LIBL/PROMSG 68)
010600981228     A  69                                  ERRMSGID(PRO0352 *LIBL/PROMSG 69)
010700981228     A            D1CTBD        25A  O  6 50
010800981228     A                                  7  2'Data ultima chiusura .......:'
010900981228     A            D1DTC          6Y 0O  7 33EDTWRD('  /  /  ')
011000981228     A                                  8  2'Unità ......................:'
011100981228     A N12                                  DSPATR(ND)
011200981228     A            D1UNI     R        B  8 33REFFLD(UNITA)
011300981228     A N12                                  DSPATR(PR)
011400981228     A  12                                  DSPATR(CS)
011500981228     A  12                                  DSPATR(HI)
011600981228     A  50                                  ERRMSGID(PRO0028 *LIBL/PROMSG 50)
011700981228     A  78                                  ERRMSGID(PRO0048 *LIBL/PROMSG 78)
011800981228     A            D1UNID        20A  O  8 50
011900981228     A                                  9  2'Data registrazione ...... da:'
012000981228     A            D1DTI          6Y 0B  9 33EDTWRD('  /  /  ')
012100981228     A  51                                  ERRMSGID(PRO0001 *LIBL/PROMSG 51)
012200981228     A                                  9 43'a:'
012300981228     A            D1DTF          6Y 0B  9 47EDTWRD('  /  /  ')
012400981228     A  52                                  ERRMSGID(PRO0001 *LIBL/PROMSG 52)
012500981228     A  53                                  ERRMSGID(PRO0298 *LIBL/PROMSG 53)
012600981228     A                                 10  2'Data ordinamento ...........:'
012700981228     A            D1SEO          1A  B 10 33
012800981228     A  59                                  ERRMSGID(PRO0048 *LIBL/PROMSG 59)
012900981228     A                                 10 50'R=Registrazione G=Giornale'
013000981228     A                                 11  2'Registrazioni definitive ...:'
013100981228     A            D1DEF          1A  B 11 33
013200981228     A  70                                  ERRMSGID(PRO0048 *LIBL/PROMSG 70)
013300981228     A  69                                  ERRMSGID(MVC0036 *LIBL/PROMSG 69)
013400981228     A            D1ON6          1A  O 11 50
013500981228     A                                 11 52'/'
013600981228     A            D1OF6          1A  O 11 54
013700981228     A                                 12  2'Registrazioni provvisorie ..:'
013800981228     A            D1PRO          1A  B 12 33
013900981228     A  72                                  ERRMSGID(PRO0048 *LIBL/PROMSG 72)
014000981228     A  71                                  ERRMSGID(MVC0036 *LIBL/PROMSG 71)
014100981228     A            D1ON7          1A  O 12 50
014200981228     A                                 12 52'/'
014300981228     A            D1OF7          1A  O 12 54
014400981228     A                                 13  2'Registrazioni gestionali ...:'
014500981228     A            D1GES          1A  B 13 33
014600981228     A  74                                  ERRMSGID(PRO0048 *LIBL/PROMSG 74)
014700981228     A  73                                  ERRMSGID(MVC0036 *LIBL/PROMSG 73)
014800981228     A            D1ON8          1A  O 13 50
014900981228     A                                 13 52'/'
015000981228     A            D1OF8          1A  O 13 54
015100981228     A                                 14  2'Stampa dettaglio ...........:'
015200981228     A            D1DET          1A  B 14 33
015300981228     A  54                                  ERRMSGID(PRO0048 *LIBL/PROMSG 54)
015400981228     A            D1ON1          1A  O 14 50
015500981228     A                                 14 52'/'
015600981228     A            D1OF1          1A  O 14 54
015700981228     A                                 15  2'Stampa conti non movimentati:'
015800981228     A            D1NMO          1A  B 15 33
015900981228     A  55                                  ERRMSGID(PRO0048 *LIBL/PROMSG 55)
016000981228     A            D1ON2          1A  O 15 50
016100981228     A                                 15 52'/'
016200981228     A            D1OF2          1A  O 15 54
016300981228     A                                 16  2'Stampa saldi parz. mensili .:'
016400981228     A            D1SLM          1A  B 16 33
016500981228     A  56                                  ERRMSGID(PRO0048 *LIBL/PROMSG 56)
016600981228     A            D1ON3          1A  O 16 50
016700981228     A                                 16 52'/'
016800981228     A            D1OF3          1A  O 16 54
016900981228     A                                 17  2'Stampa saldi progressivi ...:'
017000981228     A            D1SLP          1A  B 17 33
017100981228     A  57                                  ERRMSGID(PRO0048 *LIBL/PROMSG 57)
017200981228     A            D1ON4          1A  O 17 50
017300981228     A                                 17 52'/'
017400981228     A            D1OF4          1A  O 17 54
017500981228     A                                 18  2'Stampa elenco causali ......:'
017600981228     A            D1CAU          1A  B 18 33
017700981228     A  58                                  ERRMSGID(PRO0048 *LIBL/PROMSG 58)
017800981228     A            D1ON5          1A  O 18 50
017900981228     A                                 18 52'/'
018000981228     A            D1OF5          1A  O 18 54
018100041012     A                                 19  2'Stampa per CD ..............:'
018200041012     A            D1YCD     R        B 19 33REFFLD(NDC131S/YCD131 *LIBL/NDC131D-
018300041012     A                                      S)
018400041012     A                                      VALUES('N' 'S')
018500041012     A                                 19 50'S / N'
018600981228     A                                 20 71'Segue ...'
018700981228     A                                      DSPATR(HI)
018800981228     A                                      DSPATR(ND)
018900950612     A          R C130Z1
019000940225     A                                      OVERLAY
019100950510     A* se tasti standard
019200950510     A          H                           HLPPNLGRP(KEYDEFS  ANDIZH  )
019300950510     A                                      HLPARA(*RCD)
019400940506     A            Z1KE1         79     22  2
019500090504C1913A            H1ALLFUNCT   480A  H
019600940506     A            Z1KE2         79     23  2
019700950612    >A          R C130D2
019800950124     A                                      CF02
019900950124     A                                      CA03
020000950124     A                                      CF04
020100950124     A                                      CF05
020200950124     A                                      CF06
020300950124     A                                      CA08
020400950124     A                                      CF10
020500950124     A                                      CA12
020600950124     A                                      CF17
020700950124     A                                      CF18
020800950124     A                                      CF21
020900950124     A                                      CF23
021000950124     A                                      CF24
021100940510    >A                                      ROLLDOWN
021200940510     A                                      RTNCSRLOC(&H1NMRC &H1NMFL &H1POSC)
021300940510     A                                      CSRLOC(H1RIGA     H1COLO)
021400940510     A                                      OVERLAY
021500950301     A* inserire qui l'aiuto per tutti i campi di manutenzione
021600940510     A            H1NMRC        10A  H      TEXT('Nome Record')
021700940510     A            H1NMFL        10A  H      TEXT('Nome Campo')
021800940510     A            H1POSC         4S 0H      TEXT('Posizione Cursore nel Campo')
021900940510     A            H1RIGA         3S 0H      TEXT('Riga dove posizionare il curs-
022000940510     A                                      ore')
022100940510     A            H1COLO         3S 0H      TEXT('Colonna dove posizionare il c-
022200940510     A                                      ursore')
022300950301     A*----------------------------------------------------------------
022400950301     A* aggiungere qui gli ulteriori campi del rcd
022500950301     A*----------------------------------------------------------------
022600950301     A*----------------------------------------------------------------
022700950301     A* cercare per il campo D1MSG una posizione non di disturbo
022800950301     A*----------------------------------------------------------------
022900950301    >A            D1MSG          1A  O  3  2TEXT('serve per emettere msg relati-
023000950301     A                                      vi a tutta la videata')
023100950301     A* Esistono errori su altri schermi
023200950301     A  96                                  ERRMSGID(PRO0013 *LIBL/PROMSG 96)
023300950301     A* Tasto funzionale non consentito
023400950301     A  97                                  ERRMSGID(CPD6A60 *LIBL/QCPFMSG 97)
023500950301     A* La funzione di ricerca non è abilitata in questa posizione
023600950301     A  98                                  ERRMSGID(PRO0008 *LIBL/PROMSG 98)
023700950301     A*----------------------------------------------------------------
023800950301     A* se esistono altre videate collegate mediante il ROLL
023900950301     A* lasciare la scritta "Fine" altrimenti asteriscarle
024000950301     A*----------------------------------------------------------------
024100950301     A                                 21 76'Fine'
024200950404     A                                      DSPATR(HI)
024300950530     A*l'abilitazione al singolo tasto non deve essere tolta anche se
024400950530     A*non usato perchè ciò viene controllato a programma tramite la
024500950530     A*schiera $FCn
024600981216     A          R PROTECT
024700981216     A*l'abilitazione al singolo tasto non deve essere tolta anche se
024800981216     A*non usato perchè ciò viene controllato a programma tramite la
024900981216     A*schiera $FCn
025000981216     A                                      TEXT('Serve x inibire tutto il vide-
025100981216     A                                      o')
025200981216     A                                      CF02
025300981216     A                                      CA03
025400981216     A                                      CF04
025500981216     A                                      CF05
025600981216     A                                      CF06
025700981216     A                                      CF07
025800981216     A                                      CA08
025900981216     A                                      CF09
026000981216     A                                      CF10
026100981216     A                                      CF11
026200981216     A                                      CA12
026300981216     A                                      CF13
026400981216     A                                      CF14
026500981216     A                                      CF15
026600981216     A                                      CF16
026700981216     A                                      CF17
026800981216     A                                      CF18
026900981216     A                                      CF19
027000981216     A                                      CF20
027100981216     A                                      CF21
027200981216     A                                      CF22
027300981216     A                                      CF23
027400981216     A                                      CF24
027500981216     A                                      OVERLAY
027600981216     A                                      PROTECT
027700981216     A                                      CLRL(*NO)
