000100030616     H*PARMS OPTION(*NOXREF *NODEBUGIO) DFTACTGRP(*NO) BNDDIR(PJXBND)
000200030619     H*PARMS ACTGRP(QILE) CVTOPT(*NONE)
000300000929     H DECEDIT('0,') DATEDIT(*DMY.)
000400051013
000500001201     D KPJBA         E DS
000600030616     D Modulo          S              2A
000700030616     D Installato      S              1A
000800051013
000900010321     C*----------------------------------------------------
001000010321     C* FLUSSO PRINCIPALE DEL PROGRAMMA
001100010321     C*----------------------------------------------------
001200001201     C                   exsr      InzVar
001300030616     C                   exsr      EndPgm
001400001130     C*
001500030616     C*----------------------------------------------------
001600030616     C* Fine programma
001700030616     C*----------------------------------------------------
001800030616     C     EndPgm        begsr
001900030616     C*
002000030616     C                   seton                                        LR
002100030616     C                   return
002200030616     C*
002300030616     C                   endsr
002400001130     C*----------------------------------------------------
002500030616     C* Inizializzazione variabili
002600001130     C*----------------------------------------------------
002700030616     C     InzVar        begsr
002800001213     C*
002900030616     C                   eval      Installato = *Off
003000001206     C*
003100001128     C                   endsr
003200030616     C*----------------------------------------------------
003300030616     C* Operazioni iniziali
003400030616     C*----------------------------------------------------
003500030616     C     *InzSr        begsr
003600030616     C*
003700030616     C     *entry        plist
003800030616     C                   parm                    KPJBA
003900030616     C                   parm                    Modulo
004000030616     C                   parm                    Installato
004100030616     C*
004200030616     C                   endsr
