000100950630             PGM        PARM(&NETA)
000200960918             DCL        VAR(&NETA) TYPE(*CHAR) LEN(8)
000300950208
000400100427             RTVNETA    LCLCPNAME(&NETA)
000500950630
000600950127             ENDPGM
