000100111129     D ConvertSecondsToCharacterTimestamp...
000200111130     D                 PR                  EXTPROC('CEEDATM') OPDESC
000300111129     ** Required Parameter Group
000400111129     D  input_seconds...
000500111129     D                                8F   CONST
000600111129     D  picture_string...
000700111129     D                            32767A   OPTIONS(*VARSIZE:*OMIT) CONST
000800111130     D                                     VARYING
000900111129     D  output_timestamp...
001000111130     D                            32767A   OPTIONS(*VARSIZE)
001100111130     D                                     VARYING
001200111129     ** Omissible Parameter
001300111129     D  fc...
001400111129     D                               12A   OPTIONS(*NOPASS)
