000100111130     D GetOffsetFromUniversalTimeCoordinatedToLocalTime...
000200111130     D                 PR                  EXTPROC('CEEUTCO')
000300111130     ** Required Parameter Group
000400111130     D  offset_hours...
000500111130     D                               10I 0
000600111130     D  offset_minutes...
000700111130     D                               10I 0
000800111130     D  offset_seconds...
000900111130     D                                8F
001000111130     ** Omissible Parameter
001100111130     D  fc...
001200111130     D                               12A   OPTIONS(*NOPASS)
