000100080805     D*Assegnazione manuale consegne
000200080805     D fidg30c         pr                  extpgm('FIDG30C')
000300080731     D  kpjba                              likeds(kpjba)
