000100120217     D*--------------------------------------------------
000200140307     D* Procedure name: FIORB00_Anagrafica
000300131001     D* Purpose:        Controlla/Scrive ORM
000400120217     D* Returns:
000500120217     D*--------------------------------------------------
000600140307     D Fiorb00_Anagrafica...
000700140307     D                 PR                  EXTPGM('FIORB00R')
000800120217     D prmRqsOpCode...
000900140210     D                               10I 0 CONST
001000120217     D prmRpyOpCode...
001100120220     D                               10I 0
001200120217     D prmRpyIdMsg...
001300120217     D                               10I 0
001400120217     D prmRqsFormato...
001500140312     D                               10A   CONST OPTIONS(*NOPASS)
001600120217     D prmRqsData...
001700140312     D                            32767A   OPTIONS(*VARSIZE : *NOPASS)
001800120217     D prmRqsDataSize...
001900140312     D                               10I 0 CONST OPTIONS(*NOPASS)
002000120217     D prmRpyFormato...
002100140312     D                               10A   CONST OPTIONS(*NOPASS)
002200120217     D prmRpyData...
002300140312     D                            32767A   OPTIONS(*VARSIZE : *NOPASS)
002400120217     D prmRpyDataSize...
002500140312     D                               10I 0 CONST OPTIONS(*NOPASS)
