000100080806     D*Visualizza ORM
000200080806     D fior07r         pr                  extpgm('FIOR07R')
000300080728     D  kpjba                              likeds(kpjba)
