000100120217     D*--------------------------------------------------
000200170331     D* Procedure name: FIORA01_Scrivi
000300170331     D* Purpose:        Scrive ORM
000400120217     D* Returns:
000500120217     D*--------------------------------------------------
000600170331     D Fiora01_Scrivi...
000700170331     D                 PR                  EXTPGM('FIORA01R')
000800120217     D prmRqsOpCode...
000900140210     D                               10I 0 CONST
001000120217     D prmRpyOpCode...
001100120220     D                               10I 0
001200120217     D prmRpyIdMsg...
001300120217     D                               10I 0
001400120217     D prmRqsFormato...
001500140210     D                               10A   CONST
001600120217     D prmRqsData...
001700131219     D                            32767A   OPTIONS(*VARSIZE)
001800120217     D prmRqsDataSize...
001900140210     D                               10I 0 CONST
002000170331     D prmRqsFormato1...
002100140210     D                               10A   CONST
002200170331     D prmRqsData1...
002300120217     D                            32767A   OPTIONS(*VARSIZE)
002400170331     D prmRqsData1Size...
002500140210     D                               10I 0 CONST
002600170420     D prmRpyFormato...
002700170420     D                               10A   CONST
002800170420     D prmRpyData...
002900170420     D                            32767A   OPTIONS(*VARSIZE)
003000170420     D prmRpyDataSize...
003100170420     D                               10I 0 CONST
003200170420     D prmKPJBA...
003300170420     D                              502A   CONST OPTIONS(*NOPASS)
