000100120217     D*--------------------------------------------------
000200131007     D* Procedure name: FIORA00_Immetti
000300131001     D* Purpose:        Controlla/Scrive ORM
000400120217     D* Returns:
000500120217     D*--------------------------------------------------
000600131007     D Fiora00_Immetti...
000700131001     D                 PR                  EXTPGM('FIORA00R')
000800120217     D prmRqsOpCode...
000900140210     D                               10I 0 CONST
001000120217     D prmRpyOpCode...
001100120220     D                               10I 0
001200120217     D prmRpyIdMsg...
001300120217     D                               10I 0
001400120217     D prmRqsFormato...
001500140210     D                               10A   CONST
001600120217     D prmRqsData...
001700131219     D                            32767A   OPTIONS(*VARSIZE)
001800120217     D prmRqsDataSize...
001900140210     D                               10I 0 CONST
002000120217     D prmRpyFormato...
002100140210     D                               10A   CONST
002200120217     D prmRpyData...
002300120217     D                            32767A   OPTIONS(*VARSIZE)
002400120217     D prmRpyDataSize...
002500140210     D                               10I 0 CONST
002600131001     D prmRpyFormMsg...
002700140409     D                               10A   CONST OPTIONS(*NOPASS)
002800131001     D prmRpyMessage...
002900140409     D                            32767A   OPTIONS(*VARSIZE : *NOPASS)
003000131001     D prmRpyMsgSize...
003100140409     D                               10I 0 CONST OPTIONS(*NOPASS)
003200131008     D prmRpyFormForz...
003300140409     D                               10A   CONST OPTIONS(*NOPASS)
003400131008     D prmRpyForzatu...
003500140409     D                            32767A   OPTIONS(*VARSIZE : *NOPASS)
003600131001     D prmRpyForSize...
003700140409     D                               10I 0 CONST OPTIONS(*NOPASS)
003800140409
003900140409     D*--------------------------------------------------
004000140409     D* Procedure name: FIORA00_GetInfoORM
004100140409     D* Purpose:        Ritorna Info ORM
004200140409     D* Returns:
004300140409     D*--------------------------------------------------
004400140409     D Fiora00_GetInfoORM...
004500140409     D                 PR                  EXTPGM('FIORA00R')
004600140409     D prmRqsOpCode...
004700140409     D                               10I 0 CONST
004800140409     D prmRpyOpCode...
004900140409     D                               10I 0
005000140409     D prmRpyIdMsg...
005100140409     D                               10I 0
005200140409     D prmRqsFormato...
005300140409     D                               10A   CONST
005400140409     D prmRqsData...
005500140409     D                            32767A   OPTIONS(*VARSIZE)
005600140409     D prmRqsDataSize...
005700140409     D                               10I 0 CONST
005800140409     D prmRpyFormato...
005900140409     D                               10A   CONST
006000140409     D prmRpyData...
006100140409     D                            32767A   OPTIONS(*VARSIZE)
006200140409     D prmRpyDataSize...
006300140409     D                               10I 0 CONST
