000100080728     D*Ricerca fasi distinte
000200081117     D fnlre1r         pr                  extpgm('FNLRE1R')
000300080728     D  kpjba                              likeds(kpjba)
