000100170127     D*Interrogazione bolla di filiale (selezione e sfl)
000200170127     D fnlru6r         pr                  extpgm('FNLRU6R')
000300080728     D  kpjba                              likeds(kpjba)
000400170127     D  fnlru6ds                           likeds(fnlru6ds)  options(*nopass)
