000100110217     D*  Variazione bolle in arrivo
000200110218     D fnlr66r         pr                  extpgm('FNLR66R')
000300080728     D  kpjba                              likeds(kpjba)
