000100080728     D*Ricerca fasi distinte
000200120920     D fnlre11r        pr                  extpgm('FNLRE11R')
000300080728     D  kpjba                              likeds(kpjba)
