000100110311       // -?Interrogazione LOG BartAUT?
000200110311     d fnlvP2r         pr                  extpgm('FNLVP2R')
000300100208     d   kpjba                             likeds(KPJBA)
