000100100922     D getHostByAddr...
000200100922     D                 PR              *   ExtProc('gethostbyaddr')
000300100922     D  HostEnt                      10U 0
000400100922     D  AddrLen                      10I 0 Value
000500100922     D  AddrType                     10I 0 Value
