000100110225     D SendMIMEMail    PR                  EXTPROC('QtmmSendMail')
000200110225     D  fileName...
000300110302     D                              255A   CONST OPTIONS(*VARSIZE)
000400110225     D  lengthOfFileName...
000500110302     D                               10I 0 CONST
000600110225     D  originatorAddress...
000700110302     D                              256A   CONST OPTIONS(*VARSIZE)
000800110225     D  lengthOfOriginatorAddress...
000900110302     D                               10I 0 CONST
001000110225     D  firstRecipientAddress...
001100110302     D                            65535A   CONST OPTIONS(*VARSIZE)
001200110225     D  totalNumberOfRecipents...
001300110302     D                               10I 0 CONST
001400110225     D  errorCode...
001500110302     D                            65535A   OPTIONS(*VARSIZE)
