000100110218      /COPY GAITRASRC/SRCPROTOPR,QUSCRTUS
000200110218      /COPY GAITRASRC/SRCPROTOPR,QUSDLTUS
000300110218      /COPY GAITRASRC/SRCPROTOPR,QUSCUSAT
000400110218      /COPY GAITRASRC/SRCPROTOPR,QUSCHGUS
000500110218      /COPY GAITRASRC/SRCPROTOPR,QUSRTVUS
