000100110218     D ChangeUserSpaceAttributes...
000200110218     D                 PR                  EXTPGM('QUSCUSAT')
000300110218     D returnedLibraryName...                                                   1
000400110218     D                               10A
000500110218     D qualifiedUserSpaceName...                                                2
000600101118     D                               20A   CONST
000700110218     D attributesToChange...                                                    3
000800110218     D                            65535A   CONST OPTIONS(*VARSIZE)
000900110218     D errorCode...                                                             4
001000110218     D                            65535A   OPTIONS(*VARSIZE)
