000100131009     d rtvMsgLang      PR          3512A                                        Messaggio in lingua
000200131009     d  msgId                         7A   CONST
000300131009     d  piLinguaISO2                  2A   OPTIONS(*OMIT:*NOPASS)
000400131009     d  piMsgDta                    512A   OPTIONS(*OMIT:*NOPASS:*VARSIZE) CONST
000500131009     d  piMsg                       644A   OPTIONS(*OMIT:*NOPASS)
000600131009     d                                     VARYING
000700131009     d  piSecLvl                   3512A   OPTIONS(*OMIT:*NOPASS)
000800131009     d                                     VARYING
000900131009     d  piRtnCode                    10A   OPTIONS(*OMIT:*NOPASS)
001000131009     d  piEsito                      15P 0 OPTIONS(*OMIT:*NOPASS)
