000100080401     D TNTBE_RicercaControllo...
000200080626     D                 PR                  EXTPGM('TIBS02R')
000300080401     D  kpjba                              LIKEDS(kpjba)
000400080401     D  tibs02ds                           LIKEDS(tibs02ds)
