000100100121       // Crea variazioni anagrafiche
000200100121     d tibs73r         pr                  extpgm('TIBS73R')
000300100121     d   TIBS73ds                          likeds(TIBS73ds)
000400100121     d   CNACO_73                          likeds(ds_CNACO)
000500100121     d   CNIND_73                          likeds(ds_CNIND)
000600100121     d   CNCLP_73                          likeds(ds_CNCLP)
000700100121     d   FNCLS_73                          likeds(ds_FNCLS)
000800161017     d   TFNTC_73                          likeds(ds_TFNTC) options(*nopass)
