000100100115       // - Modifica descrizione del profilo utente
000200100115     d tibs31c         pr                  extpgm('TIBS31C')
000300100115     d  BS31prf                      10a
000400100115     d  BS31txt                      50a
000500100115     d  BS31err                       1a
