000100081202       // Controllo/Decodifica cliente
000200081202     d tibs69r         pr                  extpgm('TIBS69R')
000300081202     d   TIBS69ds                          likeds(TIBS69ds)
000400081202     d   ds_CNACO                          likeds(ds_CNACO)
000500081202     d   ds_CNIND                          likeds(ds_CNIND)
000600081202     d   ds_CNCLP                          likeds(ds_CNCLP)
000700081202     d   ds_FNCLS                          likeds(ds_FNCLS)
