000100101020       // -?Interrogazione clienti STRATEGI?
000200100208     d tis724r         pr                  extpgm('TIS724R')
000300100208     d   kpjba                             likeds(KPJBA)
