000100120217     D*--------------------------------------------------
000200150504     D* Procedure name: TISI795_GetTempi2
000300150522     D* Purpose:        Visualizza tempi di consegna su web
000400120217     D*--------------------------------------------------
000500150504     D Tisi795_GetTempi2...
000600150504     D                 PR                  EXTPGM('TISI795R')
000700120217     D prmRqsOpCode...
000800140210     D                               10I 0 CONST
000900120217     D prmRpyOpCode...
001000120220     D                               10I 0
001100120217     D prmRpyIdMsg...
001200120217     D                               10I 0
001300120217     D prmRqsFormato...
001400140210     D                               10A   CONST
001500120217     D prmRqsData...
001600131219     D                            32767A   OPTIONS(*VARSIZE)
001700120217     D prmRqsDataSize...
001800140210     D                               10I 0 CONST
001900120217     D prmRpyFormato...
002000140210     D                               10A   CONST
002100120217     D prmRpyData...
002200120217     D                            32767A   OPTIONS(*VARSIZE)
002300120217     D prmRpyDataSize...
002400140210     D                               10I 0 CONST
002500131001     D prmRpyFormMsg...
002600140409     D                               10A   CONST OPTIONS(*NOPASS)
002700131001     D prmRpyMessage...
002800140409     D                            32767A   OPTIONS(*VARSIZE : *NOPASS)
002900131001     D prmRpyMsgSize...
003000140409     D                               10I 0 CONST OPTIONS(*NOPASS)
003100131008     D prmRpyFormForz...
003200140409     D                               10A   CONST OPTIONS(*NOPASS)
003300131008     D prmRpyForzatu...
003400140409     D                            32767A   OPTIONS(*VARSIZE : *NOPASS)
003500131001     D prmRpyForSize...
003600140409     D                               10I 0 CONST OPTIONS(*NOPASS)
003700140409
