000100100909     D* gestione movimenti EDP
000200100909     D tnsdu4r         pr                  extpgm('TNSDU4R')
000300080731     D  kpjba                              likeds(kpjba)
