000100121130     D* gestione invii/rietri giornalieri  - modifica data conferma movimento
000200121130     D tnsduor1        pr                  extpgm('TNSDUOR1')
000300080731     D  kpjba                              likeds(kpjba)
