000100100205       // -?Interrogazione organigramma?
000200100909     d tnsd20r         pr                  extpgm('TNSD20R')
000300100205     d   pInFIL                       3
000400100909     d   pInfag                       1
000500100909     d   pInDES                      25
