000100090330     D Societa_Gestione...
000200090330     D                 PR                  EXTPGM('TNSD4000R')
000300090330     D  piKpjba...
000400090330     D                                     LIKEDS(kpjba)
000500090330     D Societa_Filtro...
000600090330     D                 PR                  EXTPGM('TNSD4010R')
000700090330     D  piRqsOpCode...
000800090330     D                               10A
000900090330     D                                     CONST
001000090330     D  piRpyOpCode...
001100090330     D                               10A
001200090330     D  piRpyIdMsg...
001300090330     D                               10I 0
001400090330     D  piRqsFormato...
001500090330     D                               10A
001600090330     D                                     CONST
001700090330     D                                     OPTIONS(*NOPASS)
001800090330     D  piRqsData...
001900090330     D                            65535A   OPTIONS(*VARSIZE:*NOPASS)
002000090330     D                                     CONST
002100090330     D  piRqsDataSize...
002200090330     D                               10I 0
002300090330     D                                     CONST
002400090330     D                                     OPTIONS(*NOPASS)
002500090330     D  piRpyFormato...
002600090330     D                               10A
002700090330     D                                     CONST
002800090330     D                                     OPTIONS(*NOPASS)
002900090330     D  piRpyData...
003000090330     D                            65535A   OPTIONS(*VARSIZE:*NOPASS)
003100090330     D  piRpyDataSize...
003200090330     D                               10I 0
003300090330     D                                     CONST
003400090330     D                                     OPTIONS(*NOPASS)
003500090330     D Societa_Elenco...
003600090330     D                 PR                  EXTPGM('TNSD4020R')
003700090403     D  piRqsOpCode...
003800090403     D                               10A
003900090403     D                                     CONST
004000090403     D  piRpyOpCode...
004100090403     D                               10A
004200090403     D  piRpyIdMsg...
004300090403     D                               10I 0
004400090403     D  piRqsFormato...
004500090403     D                               10A
004600090403     D                                     CONST
004700090403     D                                     OPTIONS(*NOPASS)
004800090403     D  piRqsData...
004900090403     D                            65535A   OPTIONS(*VARSIZE:*NOPASS)
005000090403     D                                     CONST
005100090403     D  piRqsDataSize...
005200090403     D                               10I 0
005300090403     D                                     CONST
005400090403     D                                     OPTIONS(*NOPASS)
005500090403     D  piRpyFormato...
005600090403     D                               10A
005700090403     D                                     CONST
005800090403     D                                     OPTIONS(*NOPASS)
005900090403     D  piRpyData...
006000090403     D                            65535A   OPTIONS(*VARSIZE:*NOPASS)
006100090403     D  piRpyDataSize...
006200090403     D                               10I 0
006300090403     D                                     CONST
006400090403     D                                     OPTIONS(*NOPASS)
006500090403     D Societa_Selezione...
006600090330     D                 PR                  EXTPGM('TNSD4030R')
006700090402     D  piRqsOpCode...
006800090402     D                               10A
006900090402     D                                     CONST
007000090402     D  piRpyOpCode...
007100090402     D                               10A
007200090402     D  piRpyIdMsg...
007300090402     D                               10I 0
007400090402     D  piRqsFormato...
007500090402     D                               10A
007600090402     D                                     CONST
007700090403     D                                     OPTIONS(*NOPASS:*OMIT)
007800090402     D  piRqsData...
007900090403     D                            65535A   OPTIONS(*VARSIZE:*NOPASS:*OMIT)
008000090402     D                                     CONST
008100090402     D  piRqsDataSize...
008200090402     D                               10I 0
008300090402     D                                     CONST
008400090403     D                                     OPTIONS(*NOPASS:*OMIT)
008500090402     D  piRpyFormato...
008600090402     D                               10A
008700090402     D                                     CONST
008800090402     D                                     OPTIONS(*NOPASS)
008900090402     D  piRpyData...
009000090402     D                            65535A   OPTIONS(*VARSIZE:*NOPASS)
009100090402     D  piRpyDataSize...
009200090402     D                               10I 0
009300090402     D                                     CONST
009400090402     D                                     OPTIONS(*NOPASS)
009500090330     D Societa_Manutenzione...
009600090330     D                 PR                  EXTPGM('TNSD4040R')
009700090330     D  piRqsOpCode...
009800090330     D                               10A
009900090330     D                                     CONST
010000090330     D  piRpyOpCode...
010100090330     D                               10A
010200090330     D  piRpyIdMsg...
010300090330     D                               10I 0
010400090330     D  piRqsFormato...
010500090330     D                               10A
010600090409     D                                     OPTIONS(*NOPASS:*OMIT)
010700090330     D                                     CONST
010800090330     D  piRqsData...
010900090409     D                            65535A   OPTIONS(*VARSIZE:*NOPASS:*OMIT)
011000090330     D                                     CONST
011100090330     D  piRqsDataSize...
011200090330     D                               10I 0
011300090330     D                                     CONST
011400090409     D                                     OPTIONS(*NOPASS:*OMIT)
011500090330     D  piRpyFormato...
011600090330     D                               10A
011700090330     D                                     CONST
011800090409     D                                     OPTIONS(*NOPASS)
011900090330     D  piRpyData...
012000090409     D                            65535A   OPTIONS(*VARSIZE:*NOPASS)
012100090330     D  piRpyDataSize...
012200090330     D                               10I 0
012300090330     D                                     CONST
012400090409     D                                     OPTIONS(*NOPASS)
