000100090812       // - Manutenzione/Cancellazione/Copia note della singola tariffa
000200090812     d tnta29r         pr                  extpgm('TNTA29R')
000300090713     d  kpjba                              likeds(KPJBA)
