000100071116      //************************************************************************
000200100521     D* controllo numero trattative presenti su potenziale/cliente/commerciale
000300100521     D TNTA43R         pr                  extpgm('TNTA43R')
000400100521     D  TNTA43DS                           likeds(TNTA43DS)
