000100071116      //************************************************************************
000200100122     D* dati tipo conto economico
000300100122     D TNTA33R         pr                  extpgm('TNTA33R')
000400080220     D  kpjba                              likeds(kpjba)
