000100160211       // -?Controllo tipologia tariffa tra Tariffe/Offerte stesso cliente?
000200160211     d tntaT1r         pr                  extpgm('TNTAT1R')
000300160211     d   kpjba                             likeds(KPJBA)
