000100150223       // -?Modifica campagna x codice unificante?
000200150223     d TRKC75R         pr                  extpgm('TRKC75R')
000300150223     d   kpjba                             likeds(KPJBA)
000400150223     d   trkc75ds                          likeds(TRKC75ds)
