000100071116      //************************************************************************
000200090609     D*Gestione Contatti Commerciali
000300090609     D TRMK19R         pr                  extpgm('TRMK19R')
000400080220     D  kpjba                              likeds(kpjba)
000500090609     D  trmk19ds                           likeds(trmk19ds)
000600100409     D  trmk01ds                           likeds(trmk01ds) options(*nopass)
