000100071116      //************************************************************************
000200090121     D*controlli per mappatura ...
000300090121     D TRMKMAP0R       pr                  extpgm('TRMKMAP0R')
000400080220     D  kpjba                              likeds(kpjba)
