000100071116      //************************************************************************
000200080414     D*GestioneInterrogazione_potenziale...
000300091027     D TRMK02R         pr                  extpgm('TRMK02R')
000400080220     D  kpjba                              likeds(kpjba)
000500091027     D  trmk01ds                           likeds(trmk01ds)
