000100071116      //************************************************************************
000200080606     D*Info_commerciali...
000300080929     D TRMK50R         pr                  extpgm('TRMK50R')
000400080220     D  kpjba                              likeds(kpjba)
000500080929     D  TRMK50DS                           likeds(TRMK50DS)
