000100071116      //************************************************************************
000200080414     D*GestioneInterrogazione_potenziale...
000300091103     D TRMK01R         pr                  extpgm('TRMK01R')
000400080220     D  kpjba                              likeds(kpjba)
