000100071116      //************************************************************************
000200081022     D*Stampa_Info_commerciali...
000300081022     D TRMK51R         pr                  extpgm('TRMK51R')
000400080220     D  kpjba                              likeds(kpjba)
