000100091102       // - Gestione scambio dati C/A e fattura con clienti
000200091102     d trtb44r         pr                  extpgm('TRTB44R')
000300091102     d   kpjba                             likeds(kpjba)
