000100120217     D*--------------------------------------------------
000200160310     D* Procedure name: TRTC0TT_HTTP
000300160310     D* Purpose:        ritorna la stringa x interrogare il T&T del PARTNER
000400120217     D* Returns:
000500120217     D*--------------------------------------------------
000600160310     D TRTC0TT_HTTP...
000700160310     D                 PR                  EXTPGM('TRTC0TTR')
000800120217     D prmRqsOpCode...
000900140210     D                               10I 0 CONST
001000120217     D prmRpyOpCode...
001100120220     D                               10I 0
001200120217     D prmRpyIdMsg...
001300120217     D                               10I 0
001400120217     D prmRqsFormato...
001500140210     D                               10A   CONST
001600120217     D prmRqsData...
001700131219     D                            32767A   OPTIONS(*VARSIZE)
001800120217     D prmRqsDataSize...
001900140210     D                               10I 0 CONST
002000120217     D prmRpyFormato...
002100140210     D                               10A   CONST
002200120217     D prmRpyData...
002300120217     D                            32767A   OPTIONS(*VARSIZE)
002400120217     D prmRpyDataSize...
002500140210     D                               10I 0 CONST
