000100130121       // -?Controllo riempimento schiera?
000200130121     d trul0Sr         pr                  extpgm('TRUL0SR')
000300130121     d   kpjba                             likeds(KPJBA)
