000100160922       // pgm
000200161107     d UBBRTETIR_P...
000300161107     d                 pr                  extpgm('UBBRTETIR')
000400161107     d UBBRTETIDS                          likeds(UBBRTETIDS)
000500160922
000600160922       // procedura da srvpgm
000700161107     d UBBRTETIR_S...
000800161107     d                 pr                  extproc('UBBRTETIR')
000900161107     d UBBRTETIDS                          likeds(UBBRTETIDS)
