000100090810       //--------------------------------------------------------------
000200090810       // Procedure name: UBRTVTPO_Init
000300090810       // Purpose:        Inizializzazione variabili di lavoro
000400090810       // Returns:        Boolean (Init_Code)
000500090810       //--------------------------------------------------------------
000600090810     d UBRTVTPO_Init...
000700090810     d                 pr              n
000800090810
000900090810       //--------------------------------------------------------------
001000090810       // Procedure name: UBRTVTPO_RtvPorto
001100090810       // Purpose:        Reperimento "Tipo Porto" da "Tipo Bolla"
001200090810       // Returns:        Boolean (Check_Code)
001300090810       // Parameter:      pInTpBolla    => Tipo bolla
001400090810       // Parameter:      pOutTpPorto   => Tipo porto corrispondente
001500090810       //--------------------------------------------------------------
001600090810     d UBRTVTPO_RtvPorto...
001700090810     d                 pr              n
001800090810     d  pInTpBolla                    2a   const
001900090810     d  pOutTpPorto                   1a
