000100170413     D UBWAS70R...
000200170413     D                 PR                  extpgm('UBWAS70R')
000300170413     D IWAS7IFSDS                          likeds(IWAS7IFSDS)
000400170413     D OWAS7ESI                            like(OWAS7ESI)
