000100151014     D UBXLATENCD_Translate...
000200090316     D                 PR                  EXTPGM('QDCXLATE')
000300090316     D  lengthOfDataBeingConverted...
000400090316     D                                5P 0 CONST
000500090316     D  conversionData...
000600160331     D                            32766A   OPTIONS(*VARSIZE)
000700090316     D  sbcsConversionTableName...
000800090316     D                               10A   CONST
