000100080411     D*Ricerca_TABEL00F...
000200080411     D X§TABER         pr                  extpgm('X§TABER')
000300080411     d  x§tkut                             like(TBLkut)     const
000400080411     d  x§tcod                             like(TBLcod)
000500080411     d  x§tkey                             like(TBLkey)
000600080411     d  x§tdes                       30
