000100090929     D DataRegistrazioneUltimaFattura...
000200090929     D                 PR                  EXTPGM('YCODRUFC')
000300090929     D  opCode                       10A   CONST
000400090929     D  esito                        10I 0
000500090929     D  csc                           7P 0 OPTIONS(*NOPASS)
000600090929     D  drufc                          D   OPTIONS(*NOPASS)
