000100160303       // --------------------------------------------------
000101160303       // Prototype for procedure: YhSetBank
000102160303       // --------------------------------------------------
000103160303
000104160303       DCL-PR YhSetBank EXTPGM('YHSETBANK');
000105160304         piSocieta CHAR(3) CONST;
000106160304         piKcc CHAR(6) CONST OPTIONS(*NOPASS);
000109160304       END-PR ;
