000100141127      *PARMS MBR(*NONE) SIZE(1 0 0)
000200141127     /*PRM mbr(*none) size(1 0 0)
000300141127     /*END
000400141127      *
000500141127      *--------------------------------------------------------------*
000600141127      *?Parametri per "Interrogazione Clienti" NON in Campagna.     ?*
000700141127      *--------------------------------------------------------------*
000800141127      *
000900141127     A                                      REF(CNDIZION)
001000141127      *
001100141128     A          R MKCM20S                   TEXT('DS INTERROGAZ. -
001200141128     A                                      CLIENTI IN CAMPAGNA E NON')
001300141127      *
001400141127      *--------------------------------------------------------------*
001500141127      *?C A M P I   D I   I N P U T                                 ?*
001600141127      *--------------------------------------------------------------*
001700141127      *
001800141128     A            ICM20RIC  R               REFFLD($FLA)
001900141128     A                                      TEXT('A=ATTIVITÀ, +
002000141128     A                                            T=TRATTATIVA, +
002100141128     A                                            _=SELEZIONE')
002200141128     A            ICM20ABI       2A         TEXT('CODICE ABILITAZIONE')
002300141128      *
002400141128     A            CM20KSC   R               REFFLD($CSC)
002500141128     A            CM20OSF   R               REFFLD($FLA)
002600141127     A                                      TEXT('ORDINAM.ELENCO: +
002700141127     A                                            I=IMPORT.,+
002800141127     A                                            R=RAG.SOC.')
002900141128     A            CM20RAG   R               REFFLD($RAGSOC)
003000141128     A            CM20CIC1  R               REFFLD($CLV)
003100141128     A            CM20CIC2  R               REFFLD($CLV)
003200141128     A            CM20CIC3  R               REFFLD($CLV)
003300141128     A            CM20CIC4  R               REFFLD($CLV)
003400141128     A            CM20CIC5  R               REFFLD($CLV)
003500141128     A            CM20LOC   R               REFFLD($LOC)
003600141128     A            CM20PRV   R               REFFLD($PRO)
003700141128     A            CM20CAP   R               REFFLD(INDCAE     CNIND00F)
003800141128     A            CM20FLT   R               REFFLD($APP)
003900141128     A            CM20CAR   R               REFFLD($CAR)
004000141128     A            CM20PIV   R               REFFLD($CPI)
004100141128     A            CM20CDF   R               REFFLD($CDFISCAL)
004200141128     A            CM20SCT1  R               REFFLD($SCT)
004300141128     A            CM20SCT2  R               REFFLD($SCT)
004400141128     A            CM20SCT3  R               REFFLD($SCT)
004500141128     A            CM20CMU   R               REFFLD($CMM)
004600141127     A                                      TEXT('CODICE COMMERCIALE +
004700141127     A                                            UNIFICANTE')
004800141128     A            CM20UNI   R               REFFLD($FLA)
004900141127     A                                      TEXT('CLIENTI UNIFICANTI: +
005000141127     A                                            S/N/_')
005100141128     A            CM20BLC   R               REFFLD($FLA)
005200141127     A                                      TEXT('CLIENTI BLOCCATI: +
005300141127     A                                            S/N/_')
005400141128     A            CM20TTR   R               REFFLD($FLA)
005500141127     A                                      TEXT('CLIENTI CON TRATT. +
005600141127     A                                            IN CORSO: S/N/_')
005700141127      *
005800141128     A            CM20NCM   R               REFFLD(CMPNCM     TICMP00F)
005900141128     A            CM20TCM   R               REFFLD($FLA)
006000141128     A                                      TEXT('CLIENTI CON TRATT. +
006100141128     A                                            CAMPAGNA AVVIATA: +
006200141128     A                                            S/N/_')
006300141128     A            CM20EAT   R               REFFLD($FLA)
006400141128     A                                      TEXT('ESCLUSIONE CLIENTI +
006500141128     A                                            CON ATTIVITÀ IN CORSO: +
006600141128     A                                            S/N/_')
006700141128      *
006800141128     A            CM20BRTI  R    3          REFFLD(CPIVAL     TICPI00F)
006900141128     A            CM20BRTF  R    3          REFFLD(CPIVAL     TICPI00F)
007000141128     A            CM20NRFI  R               REFFLD(CPIPFT     TICPI00F)
007100141128     A            CM20NRFF  R               REFFLD(CPIPFT     TICPI00F)
007200141128     A            CM20NROI  R               REFFLD(CPIPFT     TICPI00F)
007300141128     A            CM20NROF  R               REFFLD(CPIPFT     TICPI00F)
007400141128     A            CM20NERI  R               REFFLD(CPIPFT     TICPI00F)
007500141128     A            CM20NERF  R               REFFLD(CPIPFT     TICPI00F)
007600141128     A            CM20NAEI  R               REFFLD(CPIPFT     TICPI00F)
007700141128     A            CM20NAEF  R               REFFLD(CPIPFT     TICPI00F)
007800141128     A            CM20NTRI  R               REFFLD(CPIPFT     TICPI00F)
007900141128     A            CM20NTRF  R               REFFLD(CPIPFT     TICPI00F)
008000141128     A            CM20EST1  R               REFFLD($STATO)
008100141128     A            CM20EST2  R               REFFLD($STATO)
008200141128     A            CM20EST3  R               REFFLD($STATO)
008300141128     A            CM20PKGI  R               REFFLD(CPIVAL     TICPI00F)
008400141128     A            CM20PKGF  R               REFFLD(CPIVAL     TICPI00F)
008500141128     A            CM20SHP   R               REFFLD($FLA)
008600141127     A                                      TEXT('S=SPEDIZIONI +
008700141127     A                                            10:30/PRIORITY')
008800141128     A            CM20SECM  R               REFFLD($FLA)
008900141127     A                                      TEXT('S=SPEDIZIONI +
009000141127     A                                            E-COMMERCE')
009100141128     A            CM20SBX   R               REFFLD($FLA)
009200141127     A                                      TEXT('S=PUÒ USARE +
009300141127     A                                            SECURE BOX')
009400141128     A            CM20CONC1 R               REFFLD($SPF)
009500141127     A                                      TEXT('CONCORRENTE')
009600141128     A            CM20CONC2 R               REFFLD($SPF)
009700141127     A                                      TEXT('CONCORRENTE')
009800141128     A            CM20CONC3 R               REFFLD($SPF)
009900141127     A                                      TEXT('CONCORRENTE')
010000141128     A            CM20INT   R               REFFLD($FLA)
010100141127     A                                      TEXT('S=INTERESSATI +
010200141127     A                                            ALLA LOGISTICA')
010300141128     A            CM20DIL1  R               REFFLD($DA8)
010400141127     A                                      TEXT('IMMESSI DAL')
010500141128     A            CM20DIL2  R               REFFLD($DA8)
010600141127     A                                      TEXT('IMMESSI AL')
010700141128     A            CM20LOS   R               REFFLD($FLA)
010800141127     A                                      TEXT('S=LOGISTICA IN +
010900141127     A                                            OUTSOURCING')
011000141128     A            CM20CONL1 R               REFFLD($SPF)
011100141127     A                                      TEXT('CONCORRENTE LOGISTICA')
011200141128     A            CM20CONL2 R               REFFLD($SPF)
011300141127     A                                      TEXT('CONCORRENTE LOGISTICA')
011400141128     A            CM20CONL3 R               REFFLD($SPF)
011500141127     A                                      TEXT('CONCORRENTE LOGISTICA')
011600141128      *
011700141128     A            OCM20FXX       2A         TEXT('TASTO FUNZIONALE DI-
011800141128     A                                       USCITA: 03=F3, 12=F12')
011900141128     A            OCM20ERR       1A         TEXT('1=ERRORE')
012000141128     A            OCM20MSG      78A         TEXT('MESSAGGIO DI ERRORE')
