000010150205     A*%%TS  SD  20150205  105304  EDPMB       REL-V7R1M0  5770-WDS
000020150112     A*PARMS RSTDSP(*YES) DFRWRT(*YES) DECFMT(*JOB)
000030150112     A*/*PRM rstdsp(*yes) dfrwrt(*yes) decfmt(*job)
000040150112     A*/*END
000050150112     A*---------------------------------------------------------------*
000060150112     A*?TRKC03D - Interrogazione STORICO FASI.                       ?*
000070150112     A*---------------------------------------------------------------*
000080150205     A*%%EC
000090150205     A                                      DSPSIZ(24 80 *DS3)
000100150205     A                                      REF(*LIBL/TICMF00F)
000110150205     A                                      CHGINPDFT(HI UL)
000120150205     A                                      INDARA
000130150205     A                                      PRINT
000140150205     A                                      CA12
000150150112      **-------------------------------------------------------------**
000160150112     A          R KC03T01
000170141112     A            RSUT      R        O  1  2REFFLD(RSUT DDATIUTE)
000180141112     A                                  1 34'** Storico **'
000190141112     A                                      DSPATR(RI)
000200141112     A                                      DSPATR(UL)
000210141112     A            V01PGM    R        O  1 59REFFLD($PGM CNDIZION)
000220141112     A                                  1 70DATE(*JOB *YY)
000230141112     A                                      EDTCDE(Y)
000240141112     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000250141112     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000260141112     A                                  2 70TIME
000270150112     A**-------------------------------------------------------------**
000280150205     A          R KC03S02                   SFL
000290150205     A*%%TS  SD  20150205  105304  EDPMB       REL-V7R1M0  5770-WDS
000300150205     A  32                                  SFLNXTCHG
000310150205     A            VH2ACM    R        H      REFFLD(CMFACM)
000320150205     A            VS2OPZ         1A  B 10  3
000330150205     A  50                                  DSPATR(PC)
000340150205     A            VS2DES    R   30   O 10  6REFFLD(CMPDES TICMP00F)
000350141125     A*//         VS2OBJ    R     Y      + 1REFFLD(CMFPEA)
000360141125     A*//                                   EDTCDE(L)
000370150205     A            VS2OBJ    R    7A  O 10 37REFFLD(CMFPEA)
000380150205     A            VS2DATA   R    6Y00O 10 45REFFLD(CMFDFA)
000390150205     A                                      EDTCDE(Y)
000400150205     A            VS2ORA    R   -2Y  O 10 54REFFLD(CMFHFC)
000410150205     A                                      EDTWRD('  :  ')
000420150205     A            VS2UTE    R        O 10 61REFFLD(CMFPRU)
000430150205     A            VS2NRV    R     Y  O 10 72REFFLD(CMFNRV)
000440150205     A                                      EDTCDE(Z)
000450150126     A*
000460150205     A            VS2ECMD   R   -9   O 11 37REFFLD(§ECMDES DECM)
000470150205     A                                      TEXT('Descrizione Causale Chiusura -
000480150205     A                                      Campagna')
000490150205     A                                      COLOR(BLU)
000500150205     A            VS2CFP        21   O 11 59TEXT('"Fatturato del aaaa/mm"')
000510150205     A                                      DSPATR(HI)
000520150112      **-------------------------------------------------------------**
000530150112     A          R KC03C02                   SFLCTL(KC03S02)
000540141113     A                                      SFLSIZ(9999)
000550150126     A                                      SFLPAG(0006)
000560141113     A                                      OVERLAY
000570141118     A                                      CF18
000580141113     A N30                                  SFLDSP
000590141113     A N31                                  SFLDSPCTL
000600141113     A  30 31                               SFLCLR
000610141113     A  33                                  SFLEND(*MORE)
000620150126     A                                      SFLDROP(CF09)
000630141113     A            V02RCD         4S 0H      SFLRCDNBR(CURSOR)
000640141113     A            V02CSR         5S 0H
000650141118      *
000660141118     A  28        VIDMSG        78   M
000670141118      *
000680141113     A                                  4  2'Campagna'
000690141113     A            V02NCM         7Y 0O  4 11DSPATR(HI)
000700141113     A                                      EDTCDE(Z)
000710141113     A            V02DES        40A  O  4 19COLOR(BLU)
000720141118      *
000730141113     A N42                              5  2'Cliente'
000740141118     A     41     V02KSC         7S 0O  5 11DSPATR(HI)
000750141118     A     43     V02KSU         7S 0O  5 11DSPATR(HI)
000760141113     A N42        V02RAG        40A  O  5 19COLOR(BLU)
000770141118      *
000780141113     A  42                              5  2'Potenziale'
000790141113     A  42        V02CPO        11S 0O  5 13DSPATR(HI)
000800141113     A  42        V02CPOD       40A  O  5 25COLOR(BLU)
000810141118      *
000820141118     A                                  7  2'Opzioni:'
000830141118     A                                      COLOR(BLU)
000840141118     A                                      DSPATR(UL)
000850141118     A                                   + 1'N=Note.'
000860141118     A                                      COLOR(BLU)
000870141118      *
000880150115     A                                  8  2'                                  -
000890150116     A                                       Perc. /                           -
000900150115     A                                               '
000910150115     A                                      DSPATR(HI)
000920141118     A                                  9  2'Opz Descrizione                   -
000930150115     A*//                                     % Obj      Data/Ora      Utente  -
000940150126     A                                       Causale    Data/Ora     Utente  -
000950150126     A                                         Tratt. '
000960141113     A                                      DSPATR(HI)
000970141113     A                                      DSPATR(UL)
000980150112      **-------------------------------------------------------------**
000990150112     A          R KC03P02
001000141113     A                                      OVERLAY
001010150126     A                                 24  2'F9=Altri Dati'
001020150126     A                                      COLOR(BLU)
001030150126     A                                   + 3'F12=Ritorno'
001040141113     A                                      COLOR(BLU)
001050150126     A                                   + 3'F18=Note'
001060141118     A                                      COLOR(BLU)
001070150123     A  18                                  DSPATR(RI)
