000010150831     A*%%TS  SD  20150831  123200  EDPMB       REL-V7R1M0  5770-WDS
000020150831     A*%%EC
000030150831     A                                      DSPSIZ(24 80 *DS3)
000040150831     A                                      CHGINPDFT(HI UL)
000050150831     A                                      INDARA
000060150831     A                                      PRINT
000070150729     A*---------------------------------------------------------------*
000080150729     A          R KC09T01
000090150729     A*%%TS  SD  20150729  101355  EDPMB       REL-V7R1M0  5770-WDS
000100150729     A            RSUT      R        O  1  2REFFLD(RSUT DDATIUTE)
000110150729     A                                  1 34'** Campagne **'
000120150729     A                                      DSPATR(RI)
000130150729     A                                      DSPATR(UL)
000140150729     A            V01PGM    R        O  1 57REFFLD($PGM CNDIZION)
000150150729     A                                  1 71DATE(*JOB *YY)
000160150729     A                                      EDTCDE(Y)
000170150729     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000180150729     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000190150729     A                                  2 73TIME
000200150729     A*---------------------------------------------------------------*
000210150807     A          R KC09S02                   SFL
000220150807     A*%%TS  SD  20150807  124517  EDPMB       REL-V7R1M0  5770-WDS
000230150807     A  32                                  SFLNXTCHG
000240150807     A            V02DFCH        8S 0H
000250150807     A            V02DICH        8S 0H
000260150807     A            V02OPZ         1A  B 10  3
000270150807     A  50                                  DSPATR(PC)
000280150807     A                                      DSPATR(UL)
000290150807     A  50                                  COLOR(RED)
000300150807     A            V02NCM         7Y 0O 10  6EDTCDE(Z)
000310150807     A            V02ATTIVA      1   O 10 14
000320150807     A  40                                  COLOR(PNK)
000330150807     A            V02DES        40A  O 10 17
000340150807     A            V02TPC         1A  O 10 59
000350150807     A            V02DIC         8A  O 10 63
000360150807     A            V02DFC         8A  O 10 72
000370150729     A*---------------------------------------------------------------*
000380150807     A          R KC09C02                   SFLCTL(KC09S02)
000390150807     A*%%TS  SD  20150807  120918  EDPMB       REL-V7R1M0  5770-WDS
000400150807     A                                      SFLSIZ(9999)
000410150807     A                                      SFLPAG(0013)
000420150807     A                                      CF12
000430150807     A                                      OVERLAY
000440150807     A N30                                  SFLDSP
000450150807     A N31                                  SFLDSPCTL
000460150807     A  30 31                               SFLCLR
000470150807     A  33                                  SFLEND(*MORE)
000480150807     A            V02RCD         4S 0H      SFLRCDNBR(CURSOR)
000490150807     A            V02CSR         5S 0H
000500150807     A  28        V02MSG        78   M
000510150807     A                                  4  2'Cliente:'
000520150807     A                                      COLOR(BLU)
000530150807     A            V02KSC         7Y 0O  4 11DSPATR(HI)
000540150807     A            V02RAG        48A  O  4 19
000550150807     A                                  6  2'Immettere le opzioni e premere Inv-
000560150807     A                                      io.'
000570150807     A                                      COLOR(BLU)
000580150807     A                                  7  2'5=Visualizza'
000590150807     A                                  9  2'Opz Campagna   Descrizione        -
000600150807     A                                                            Tipo Inizio  -
000610150807     A                                       Fine    '
000620150807     A                                      DSPATR(HI)
000630150807     A                                      DSPATR(UL)
000640150729     A*---------------------------------------------------------------*
000650150729     A          R KC09P02
000660150729     A*%%TS  SD  20150729  100932  EDPMB       REL-V7R1M0  5770-WDS
000670150729     A                                      OVERLAY
000680150729     A                                 24 68'F12=Ritorno'
000690150729     A                                      COLOR(BLU)
000700150831     A*---------------------------------------------------------------*
000710150831     A          R KC09D03
000720150831     A*%%TS  SD  20150831  123200  EDPMB       REL-V7R1M0  5770-WDS
000730150831     A                                      CF12
000740150831     A                                      OVERLAY
000750150831     A  28        V02MSG        78   M
000760150831     A                                  4  2'Cliente:'
000770150831     A                                      COLOR(BLU)
000780150831     A            V02KSC         7Y 0O  4 11DSPATR(HI)
000790150831     A            V02RAG        48A  O  4 19
000800150831     A                                  6  2'Immettere le opzioni e premere Inv-
000810150831     A                                      io.'
000820150831     A                                      COLOR(BLU)
000830150831     A                                  7  2'5=Visualizza'
000840150831     A                                  9  2'Opz Campagna   Descrizione        -
000850150831     A                                                            Tipo Inizio  -
000860150831     A                                       Fine    '
000870150831     A                                      DSPATR(HI)
000880150831     A                                      DSPATR(UL)
000890150831     A                                 24 68'F12=Ritorno'
000900150831     A                                      COLOR(BLU)
000910150831     A                                 14 27'Nessun dato da visualizzare'
000920150831     A                                      COLOR(RED)
