000100141106      *--------------------------------------------------------------*
000200141107      *?Parametri per "Aggiorna Obiettivo da Confronto Fatturazione"?*
000300141106      *--------------------------------------------------------------*
000400150112     A          R TRKC05S                   TEXT('DS PER OBJ CONFR.-
000500141107     A                                      FATT.')
000600141106      *--------------------------------------------------------------*
000700141106      *?C A M P I   D I   I N P U T                                 ?*
000800141106      *--------------------------------------------------------------*
000900141106      *
001000150122     A            IKC05LIB      10A         TEXT('Libreria')
001100150112     A            IKC05NCM       7S 0       TEXT('Campagna')
001200141106      *--------------------------------------------------------------*
001300141106      *?C A M P I   D I   O U T P U T                   ?            *
001400141106      *--------------------------------------------------------------*
