000001150608     A*%%***********************************************************************
000002150608     A*%%TS  RD  20150608  093839  EDPMB       REL-V7R1M0  5770-WDS
000003150608     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004150608     A*%%FI       0000000000000000000000000000000000000000000000000
000005150608     A*%%***********************************************************************
000006150608      *--------------------
000007150608     A          R KC41PAR
000008150608     A*%%***********************************************************************
000009150608     A*%%RI 00000
000010150608     A*%%***********************************************************************
000011150608     A                                      SKIPB(001)
000012150608     A                                      SPACEA(003)
000013150608     A            RSUT          20A        1
000014150608     A                                      SPACEB(001)
000015150608     A                                    50
000016150608     A                                      'REPORT CAMPAGNA COMMERCIALE'
000017150608     A                                      HIGHLIGHT
000018150608     A            PDESNCM       50A  O    +2
000019150608     A                                      HIGHLIGHT
000020150608     A            NOMEPGM       10A  O   154
000021150608     A            DATAELA        8S 0    172
000022150608     A                                      EDTWRD('  /  /    ')
000023150608     A            KNSIF     R              1
000024150608     A                                      REFFLD(KNSIF KPJBA)
000025150608     A                                      SPACEB(001)
000026150608     A            KNMUS     R             12
000027150608     A                                      REFFLD(KNMUS KPJBA)
000028150608     A            ORAELA         6S 0O   174
000029150608     A                                      EDTWRD('  :  :  ')
000030150608     A                                   187
000031150608     A                                      'PAG.'
000032150608     A                                   192
000033150608     A                                      PAGNBR
000034150608     A                                      EDTCDE(Z)
000035150608     A                                     1
000036150608     A                                      ' '
000037150608     A                                      SPACEB(001)
000038150608     A  01                                 1
000039150608     A                                      'Distretto ..................:'
000040150608     A                                      SPACEB(001)
000041150608     A  01        IKC41CDI       1A  O    +3
000042150608     A  01        PDESDIS       25A  O    +8
000043150608     A  02                                 1
000044150608     A                                      'Area .......................:'
000045150608     A                                      SPACEB(001)
000046150608     A  02        IKC41CAR       3S 0O    +3
000047150608     A                                      EDTCDE(Z)
000048150608     A  02        PDESCAR       25A  O    +6
000049150608     A                                     1
000050150608     A                                      'Commerciale Unificante .....:'
000051150608     A                                      SPACEB(001)
000052150608     A            IKC41CMM       7S 0O    33
000053150608     A                                      EDTCDE(Z)
000054150608     A            PDESCMM       25A  O    42
000055150608     A                                     1
000056150608     A                                      'Cod. Importanza Cliente ....:'
000057150608     A                                      SPACEB(002)
000058150608     A            IKC41CLV1      1A  O    +3
000059150608     A            IKC41CLV2      1A  O    +1
000060150608     A            IKC41CLV3      1A  O    +1
000061150608     A            IKC41CLV4      1A  O    +1
000062150608     A            IKC41CLV5      1A  O    +1
000063150608     A                                     1
000064150608     A                                      'Solo clienti con Obiettivo Propost-
000065150608     A                                      o a zero:'
000066150608     A                                      SPACEB(002)
000067150608     A            IKC41OBJP      1A  O    +2
000068150608     A                                    +2
000069150608     A                                      'S=sì'
000070150608     A                                     1
000071150608     A                                      'Solo clienti con Obiettivo Finale -
000072150608     A                                      a zero..:'
000073150608     A                                      SPACEB(001)
000074150608     A            IKC41OBJF      1A  O    +2
000075150608     A                                    +2
000076150608     A                                      'S=sì'
000077150608     A                                     1
000078150608     A                                      'Stampa totali per ..........:'
000079150608     A                                      SPACEB(002)
000080150608     A            PDESTOT1      11A  O    +3
000081150608     A            PDESTOT2      11A  O    +1
000082150608     A            PDESTOT3      11A  O    +1
000083150608     A            PDESTOT4      11A  O    +1
000084150608     A*%%***********************************************************************
000085150608     A*%%SS
000086150608     A*%%CL 001
000087150608     A*%%CL 001
000088150608     A*%%CL 001
000089150608     A*%%CL 001
000090150608     A*%%CL 001
000091150608     A*%%CL 001
000092150608     A*%%CL 002
000093150608     A*%%CL 002
000094150608     A*%%CL 001
000095150608     A*%%CL 002
000096150608     A*%%CL 003
000097150608     A*%%***********************************************************************
000098150608      *--------------------
000099150608     A          R KC41PAGINA
000100150608     A*%%***********************************************************************
000101150608     A*%%RI 00000
000102150608     A*%%***********************************************************************
000103150608     A                                      SKIPB(001)
000104150608     A                                     1
000105150608     A                                      ' '
000106150608     A*%%***********************************************************************
000107150608     A*%%SS
000108150608     A*%%***********************************************************************
000109150608      *--------------------
000110150608     A          R KC41TESTA
000111150608     A*%%***********************************************************************
000112150608     A*%%RI 00000
000113150608     A*%%***********************************************************************
000114150608     A                                      SPACEB(001)
000115150608     A            RSUT          20A        1
000116150608     A                                    50
000117150608     A                                      'REPORT CAMPAGNA COMMERCIALE'
000118150608     A                                      HIGHLIGHT
000119150608     A            PDESNCM       50A  O    +2
000120150608     A                                      HIGHLIGHT
000121150608     A            NOMEPGM       10A  O   154
000122150608     A            DATAELA        8S 0    172
000123150608     A                                      EDTWRD('  /  /    ')
000124150608     A                                   187
000125150608     A                                      'PAG.'
000126150608     A                                   192
000127150608     A                                      PAGNBR
000128150608     A                                      EDTCDE(Z)
000129150608     A            KNSIF     R              1
000130150608     A                                      REFFLD(KNSIF KPJBA)
000131150608     A                                      SPACEB(001)
000132150608     A            KNMUS     R             12
000133150608     A                                      REFFLD(KNMUS KPJBA)
000134150608     A  04                               138
000135150608     A                                      'Periodo Conf.Fatt.'
000136150608     A  04        PAAMMCF        7A      157
000137150608     A            ORAELA         6S 0O   174
000138150608     A                                      EDTWRD('  :  :  ')
000139150608     A*%%***********************************************************************
000140150608     A*%%SS
000141150608     A*%%CL 001
000142150608     A*%%***********************************************************************
000143150608      *--------------------
000144150608     A          R KC41TOTAZ
000145150608     A*%%***********************************************************************
000146150608     A*%%RI 00000
000147150608     A*%%FS 001
000148150608     A*%%***********************************************************************
000149150608     A                                      SPACEB(002)
000150150608     A                                    57
000151150608     A                                      'Azienda'
000152150608     A                                      UNDERLINE
000153150608     A                                      HIGHLIGHT
000154150608     A*%%***********************************************************************
000155150608     A*%%SS
000156150608     A*%%***********************************************************************
000157150608      *--------------------
000158150608     A          R KC41TOTDI
000159150608     A*%%***********************************************************************
000160150608     A*%%RI 00000
000161150608     A*%%FS 001
000162150608     A*%%***********************************************************************
000163150608     A                                      SPACEB(002)
000164150608     A                                    57
000165150608     A                                      'Distretto'
000166150608     A                                      UNDERLINE
000167150608     A                                      HIGHLIGHT
000168150608     A            PCODDIS        1A  O    67
000169150608     A                                      HIGHLIGHT
000170150608     A            PDESDIS       25A  O    69
000171150608     A                                      HIGHLIGHT
000172150608     A*%%***********************************************************************
000173150608     A*%%SS
000174150608     A*%%***********************************************************************
000175150608      *--------------------
000176150608     A          R KC41TOTRA
000177150608     A*%%***********************************************************************
000178150608     A*%%RI 00000
000179150608     A*%%FS 001
000180150608     A*%%***********************************************************************
000181150608     A                                      SPACEB(002)
000182150608     A                                    57
000183150608     A                                      'Area'
000184150608     A                                      UNDERLINE
000185150608     A                                      HIGHLIGHT
000186150608     A            PCODCAR        3S 0O    62
000187150608     A                                      EDTCDE(Z)
000188150608     A                                      HIGHLIGHT
000189150608     A            PDESCAR       25A  O    66
000190150608     A                                      HIGHLIGHT
000191150608     A*%%***********************************************************************
000192150608     A*%%SS
000193150608     A*%%***********************************************************************
000194150608      *--------------------
000195150608     A          R KC41TOTCM
000196150608     A*%%***********************************************************************
000197150608     A*%%RI 00000
000198150608     A*%%FS 001
000199150608     A*%%***********************************************************************
000200150608     A                                      SPACEB(002)
000201150608     A                                    57
000202150608     A                                      'Commerciale'
000203150608     A                                      UNDERLINE
000204150608     A                                      HIGHLIGHT
000205150608     A            PCODUNI        7S 0O    69
000206150608     A                                      EDTCDE(Z)
000207150608     A                                      HIGHLIGHT
000208150608     A            PDESUNI       25A  O    77
000209150608     A                                      HIGHLIGHT
000210150608     A*%%***********************************************************************
000211150608     A*%%SS
000212150608     A*%%***********************************************************************
000213150608      *--------------------
000214150608     A          R KC41CATEG
000215150608     A*%%***********************************************************************
000216150608     A*%%RI 00000
000217150608     A*%%FS 001
000218150608     A*%%***********************************************************************
000219150608     A                                      SPACEB(002)
000220150608     A                                     1
000221150608     A                                      'Importanza cliente'
000222150608     A                                      UNDERLINE
000223150608     A                                      HIGHLIGHT
000224150608     A            PCODCLV        1A  O    +1
000225150608     A                                      HIGHLIGHT
000226150608     A            PDESCLV       30A  O    +1
000227150608     A                                      HIGHLIGHT
000228150608     A*%%***********************************************************************
000229150608     A*%%SS
000230150608     A*%%***********************************************************************
000231150608      *--------------------
000232150608     A          R KC41RIGA
000233150608     A*%%***********************************************************************
000234150608     A*%%RI 00000
000235150608     A*%%***********************************************************************
000236150608     A                                      SPACEB(001)
000237150608     A N03                                 1
000238150608     A                                      'TOTALE'
000239150608     A                                    21
000240150608     A                                      '|----------------|-----------------
000241150608     A                                      |----------------|----------------|-
000242150608     A                                      ----------------|----------------|--
000243150608     A                                      ---------------|'
000244150608     A                                      SPACEB(001)
000245150608     A                                   142
000246150608     A                                      '|----------------|-----------------
000247150608     A                                      |'
000248150608     A                                   178
000249150608     A                                      '|----------------|'
000250150608     A                                    21
000251150608     A                                      '|'
000252150608     A                                      SPACEB(001)
000253150608     A                                    26
000254150608     A                                      'Iniziale'
000255150608     A                                    38
000256150608     A                                      '|'
000257150608     A                                    42
000258150608     A                                      'Proposto'
000259150608     A                                    55
000260150608     A                                      '|'
000261150608     A                                    60
000262150608     A                                      'Finale'
000263150608     A                                    72
000264150608     A                                      '|'
000265150608     A                                    75
000266150608     A                                      'Non avviati'
000267150608     A                                    89
000268150608     A                                      '|'
000269150608     A                                    95
000270150608     A                                      'Avviati'
000271150608     A                                   106
000272150608     A                                      '|'
000273150608     A                                   108
000274150608     A                                      'Avviati con OFF'
000275150608     A                                   123
000276150608     A                                      '|'
000277150608     A                                   129
000278150608     A                                      'Chiusi'
000279150608     A                                   140
000280150608     A                                      '|'
000281150608     A                                   142
000282150608     A                                      '|'
000283150608     A                                   146
000284150608     A                                      'Confronto'
000285150608     A                                   159
000286150608     A                                      '|'
000287150608     A                                   161
000288150608     A                                      'Non Confrontati'
000289150608     A                                   176
000290150608     A                                      '|'
000291150608     A                                   178
000292150608     A                                      '|     Persi      |'
000293150608     A                                     1
000294150608     A                                      '|-------------------|--------------
000295150608     A                                      ---|----------------|---------------
000296150608     A                                      --|----------------|----------------
000297150608     A                                      -|----------------|-----------------
000298150608     A                                      |'
000299150608     A                                      SPACEB(001)
000300150608     A                                   142
000301150608     A                                      '|----------------|-----------------
000302150608     A                                      |'
000303150608     A                                   178
000304150608     A                                      '|----------------|'
000305150608     A                                     1
000306150608     A                                      '|'
000307150608     A                                      SPACEB(001)
000308150608     A                                     6
000309150608     A                                      'N° Clienti'
000310150608     A                                    21
000311150608     A                                      '|'
000312150608     A            CLAUI          6S 0O    +8
000313150608     A                                      EDTCDE(K)
000314150608     A                                    +0
000315150608     A                                      '|'
000316150608     A            CLAUP          6S 0O    +8
000317150608     A                                      EDTCDE(K)
000318150608     A                                    +0
000319150608     A                                      '|'
000320150608     A            CLAUF          6S 0O    +8
000321150608     A                                      EDTCDE(K)
000322150608     A                                    +0
000323150608     A                                      '|'
000324150608     A            CLNAVVIO       6S 0O    +8
000325150608     A                                      EDTCDE(K)
000326150608     A                                    +0
000327150608     A                                      '|'
000328150608     A            CLAVVIO        6S 0O    +8
000329150608     A                                      EDTCDE(K)
000330150608     A                                    +0
000331150608     A                                      '|'
000332150608     A            CLAVVTR        6S 0O    +8
000333150608     A                                      EDTCDE(K)
000334150608     A                                    +0
000335150608     A                                      '|'
000336150608     A            CLCHIUSO       6S 0O    +8
000337150608     A                                      EDTCDE(K)
000338150608     A                                    +0
000339150608     A                                      '|'
000340150608     A                                    +1
000341150608     A                                      '|'
000342150608     A            CLCONFR        6S 0O    +8
000343150608     A                                      EDTCDE(K)
000344150608     A                                    +0
000345150608     A                                      '|'
000346150608     A            CLNOCF         6S 0O    +8
000347150608     A                                      EDTCDE(K)
000348150608     A                                    +0
000349150608     A                                      '|'
000350150608     A                                    +1
000351150608     A                                      '|'
000352150608     A            CLPERSO        6S 0O    +8
000353150608     A                                      EDTCDE(K)
000354150608     A                                    +0
000355150608     A                                      '|'
000356150608     A                                     1
000357150608     A                                      '|'
000358150608     A                                      SPACEB(001)
000359150608     A                                     6
000360150608     A                                      'Fatturato'
000361150608     A                                    21
000362150608     A                                      '|'
000363150608     A            FTAUI         11S 0O    +1
000364150608     A                                      EDTCDE(K)
000365150608     A                                    +0
000366150608     A                                      '|'
000367150608     A            FTAUP         11S 0O    +1
000368150608     A                                      EDTCDE(K)
000369150608     A                                    +0
000370150608     A                                      '|'
000371150608     A            FTAUF         11S 0O    +1
000372150608     A                                      EDTCDE(K)
000373150608     A                                    +0
000374150608     A                                      '|'
000375150608     A            FTNAVVIO      11S 0O    +1
000376150608     A                                      EDTCDE(K)
000377150608     A                                    +0
000378150608     A                                      '|'
000379150608     A            FTAVVIO       11S 0O    +1
000380150608     A                                      EDTCDE(K)
000381150608     A                                    +0
000382150608     A                                      '|'
000383150608     A            FTAVVTR       11S 0O    +1
000384150608     A                                      EDTCDE(K)
000385150608     A                                    +0
000386150608     A                                      '|'
000387150608     A            FTCHIUSO      11S 0O    +1
000388150608     A                                      EDTCDE(K)
000389150608     A                                    +0
000390150608     A                                      '|'
000391150608     A                                    +1
000392150608     A                                      '|'
000393150608     A            FTCONFR       11S 0O    +1
000394150608     A                                      EDTCDE(K)
000395150608     A                                    +0
000396150608     A                                      '|'
000397150608     A            FTNOCF        11S 0O    +1
000398150608     A                                      EDTCDE(K)
000399150608     A                                    +0
000400150608     A                                      '|'
000401150608     A                                    +1
000402150608     A                                      '|'
000403150608     A            FTPERSO       11S 0O    +1
000404150608     A                                      EDTCDE(K)
000405150608     A                                    +0
000406150608     A                                      '|'
000407150608     A                                     1
000408150608     A                                      '|'
000409150608     A                                      SPACEB(001)
000410150608     A                                     2
000411150608     A                                      '% Aumento Richiesto'
000412150608     A                                    21
000413150608     A                                      '|'
000414150608     A            ARAUI          5S 2O    +9
000415150608     A                                      EDTCDE(K)
000416150608     A                                    +0
000417150608     A                                      '|'
000418150608     A            ARAUP          5S 2O    +9
000419150608     A                                      EDTCDE(K)
000420150608     A                                    +0
000421150608     A                                      '|'
000422150608     A            ARAUF          5S 2O    +9
000423150608     A                                      EDTCDE(K)
000424150608     A                                    +0
000425150608     A                                      '|'
000426150608     A            ARNAVVIO       5S 2O    +9
000427150608     A                                      EDTCDE(K)
000428150608     A                                    +0
000429150608     A                                      '|'
000430150608     A            ARAVVIO        5S 2O    +9
000431150608     A                                      EDTCDE(K)
000432150608     A                                    +0
000433150608     A                                      '|'
000434150608     A            ARAVVTR        5S 2O    +9
000435150608     A                                      EDTCDE(K)
000436150608     A                                    +0
000437150608     A                                      '|'
000438150608     A            ARCHIUSO       5S 2O    +9
000439150608     A                                      EDTCDE(K)
000440150608     A                                    +0
000441150608     A                                      '|'
000442150608     A                                    +1
000443150608     A                                      '|'
000444150608     A            ARCONFR        5S 2O    +9
000445150608     A                                      EDTCDE(K)
000446150608     A                                    +0
000447150608     A                                      '|'
000448150608     A            ARNOCF         5S 2O    +9
000449150608     A                                      EDTCDE(K)
000450150608     A                                    +0
000451150608     A                                      '|'
000452150608     A                                    +1
000453150608     A                                      '|'
000454150608     A            ARPERSO        5S 2O    +9
000455150608     A                                      EDTCDE(K)
000456150608     A                                    +0
000457150608     A                                      '|'
000458150608     A                                     1
000459150608     A                                      '|'
000460150608     A                                      SPACEB(001)
000461150608     A                                     4
000462150608     A                                      'Importo Aumento '
000463150608     A                                    21
000464150608     A                                      '|'
000465150608     A            IAAUI         11S 0O    +1
000466150608     A                                      EDTCDE(K)
000467150608     A                                    +0
000468150608     A                                      '|'
000469150608     A            IAAUP         11S 0O    +1
000470150608     A                                      EDTCDE(K)
000471150608     A                                    +0
000472150608     A                                      '|'
000473150608     A            IAAUF         11S 0O    +1
000474150608     A                                      EDTCDE(K)
000475150608     A                                    +0
000476150608     A                                      '|'
000477150608     A            IANAVVIO      11S 0O    +1
000478150608     A                                      EDTCDE(K)
000479150608     A                                    +0
000480150608     A                                      '|'
000481150608     A            IAAVVIO       11S 0O    +1
000482150608     A                                      EDTCDE(K)
000483150608     A                                    +0
000484150608     A                                      '|'
000485150608     A            IAAVVTR       11S 0O    +1
000486150608     A                                      EDTCDE(K)
000487150608     A                                    +0
000488150608     A                                      '|'
000489150608     A            IACHIUSO      11S 0O    +1
000490150608     A                                      EDTCDE(K)
000491150608     A                                    +0
000492150608     A                                      '|'
000493150608     A                                    +1
000494150608     A                                      '|'
000495150608     A            IACONFR       11S 0O    +1
000496150608     A                                      EDTCDE(K)
000497150608     A                                    +0
000498150608     A                                      '|'
000499150608     A            IANOCF        11S 0O    +1
000500150608     A                                      EDTCDE(K)
000501150608     A                                    +0
000502150608     A                                      '|'
000503150608     A                                    +1
000504150608     A                                      '|'
000505150608     A            IAPERSO       11S 0O    +1
000506150608     A                                      EDTCDE(K)
000507150608     A                                    +0
000508150608     A                                      '|'
000509150608     A                                     1
000510150608     A                                      '|'
000511150608     A                                      SPACEB(001)
000512150608     A                                    21
000513150608     A                                      '|----------------------------------
000514150608     A                                      ----------------------------------|'
000515150608     A                                   +16
000516150608     A                                      '|'
000517150608     A                                   +16
000518150608     A                                      '|'
000519150608     A                                   +16
000520150608     A                                      '|'
000521150608     A                                    +1
000522150608     A                                      '|'
000523150608     A                                   +16
000524150608     A                                      '|----------------|'
000525150608     A                                    +1
000526150608     A                                      '|----------------|'
000527150608     A                                     1
000528150608     A                                      '|'
000529150608     A                                      SPACEB(001)
000530150608     A                                     2
000531150608     A                                      '% Aumento OTTENUTO'
000532150608     A                                    21
000533150608     A                                      '|'
000534150608     A                                    89
000535150608     A                                      '|'
000536150608     A            AOAVVIO        5S 2O    +9
000537150608     A                                      EDTCDE(K)
000538150608     A                                    +0
000539150608     A                                      '|'
000540150608     A            AOAVVTR        5S 2O    +9
000541150608     A                                      EDTCDE(K)
000542150608     A                                    +0
000543150608     A                                      '|'
000544150608     A            AOCHIUSO       5S 2O    +9
000545150608     A                                      EDTCDE(K)
000546150608     A                                    +0
000547150608     A                                      '|'
000548150608     A                                    +1
000549150608     A                                      '|'
000550150608     A            AOCONFR        5S 2O    +9
000551150608     A                                      EDTCDE(K)
000552150608     A                                    +0
000553150608     A                                      '|'
000554150608     A                                     1
000555150608     A                                      '|'
000556150608     A                                      SPACEB(001)
000557150608     A                                     4
000558150608     A                                      'Aumento OTTENUTO'
000559150608     A                                    21
000560150608     A                                      '|'
000561150608     A                                    89
000562150608     A                                      '|'
000563150608     A            IOAVVIO       11S 0O    +1
000564150608     A                                      EDTCDE(K)
000565150608     A                                    +0
000566150608     A                                      '|'
000567150608     A            IOAVVTR       11S 0O    +1
000568150608     A                                      EDTCDE(K)
000569150608     A                                    +0
000570150608     A                                      '|'
000571150608     A            IOCHIUSO      11S 0O    +1
000572150608     A                                      EDTCDE(K)
000573150608     A                                    +0
000574150608     A                                      '|'
000575150608     A                                    +1
000576150608     A                                      '|'
000577150608     A            IOCONFR       11S 0O    +1
000578150608     A                                      EDTCDE(K)
000579150608     A                                    +0
000580150608     A                                      '|'
000581150608     A                                     1
000582150608     A                                      '|'
000583150608     A                                      SPACEB(001)
000584150608     A                                     2
000585150608     A                                      '% Aumento CONF.FAT.'
000586150608     A                                    21
000587150608     A                                      '|'
000588150608     A                                    89
000589150608     A                                      '|'
000590150608     A                                   +16
000591150608     A                                      '|'
000592150608     A                                   +16
000593150608     A                                      '|'
000594150608     A                                   +16
000595150608     A                                      '|'
000596150608     A                                    +1
000597150608     A                                      '|'
000598150608     A            CFCONFR        5S 2O    +9
000599150608     A                                      EDTCDE(K)
000600150608     A                                    +0
000601150608     A                                      '|'
000602150608     A                                     1
000603150608     A                                      '|'
000604150608     A                                      SPACEB(001)
000605150608     A                                     4
000606150608     A                                      'Aumento CONF.FAT.'
000607150608     A                                    21
000608150608     A                                      '|'
000609150608     A                                    89
000610150608     A                                      '|'
000611150608     A                                   +16
000612150608     A                                      '|'
000613150608     A                                   +16
000614150608     A                                      '|'
000615150608     A                                   +16
000616150608     A                                      '|'
000617150608     A                                    +1
000618150608     A                                      '|'
000619150608     A            ICFCONFR      11S 0O    +1
000620150608     A                                      EDTCDE(K)
000621150608     A                                    +0
000622150608     A                                      '|'
000623150608     A                                     1
000624150608     A                                      '|-------------------|             -
000625150608     A                                                                         -
000626150608     A                                                         |----------------
000627150608     A                                      -|----------------|-----------------
000628150608     A                                      |'
000629150608     A                                      SPACEB(001)
000630150608     A                                    +1
000631150608     A                                      '|----------------|'
000632150608     A*%%***********************************************************************
000633150608     A*%%SS
000634150608     A*%%CL 001
000635150608     A*%%CL 001
000636150608     A*%%CL 001
000637150608     A*%%CL 001
000638150608     A*%%CL 001
000639150608     A*%%CL 001
000640150608     A*%%CL 001
000641150608     A*%%CL 001
000642150608     A*%%CL 001
000643150608     A*%%CL 001
000644150608     A*%%CL 001
000645150608     A*%%CL 001
000646150608     A*%%CL 001
000647150608     A*%%***********************************************************************
000648150608      *--------------------
000649150608     A          R KC41FINE
000650150608     A*%%***********************************************************************
000651150608     A*%%RI 00000
000652150608     A*%%FS 003
000653150608     A*%%***********************************************************************
000654150608     A                                      SPACEB(004)
000655150608     A                                    52
000656150608     A                                      '***   FINE  STAMPA   ***'
000657150608     A*%%***********************************************************************
000658150608     A*%%SS
000659150608     A*%%CP+999CRTPRTF
000660150608     A*%%CP+    FILE(GAITRAFIL/TRKC41P)
000661150608     A*%%CP+    DEVTYPE(*SCS)
000662150608     A*%%CP+    PAGESIZE(*N 198)
000663150608     A*%%CP+    CPI(15)
000664150608     A*%%CP     OVRFLW(65)
000665150608     A*%%***********************************************************************
