000100141106      *--------------------------------------------------------------*
000200150202      *?Parametri per "Crea WF Clienti in Campagna"                 ?*
000300141106      *--------------------------------------------------------------*
000400150202     A          R TRKC51S                   TEXT('DS WF CLI.IN -
000500150202     A                                      CAMPAGNA')
000600141106      *--------------------------------------------------------------*
000700141106      *?C A M P I   D I   I N P U T                                 ?*
000800141106      *--------------------------------------------------------------*
000900141106      *
001000150202     A            IKC51NCM       7S 0       TEXT('Campagna')
001100141106      *--------------------------------------------------------------*
001200141106      *?C A M P I   D I   O U T P U T                   ?            *
001300141106      *--------------------------------------------------------------*
