000001091125     A*%%***********************************************************************
000002091125     A*%%TS  RD  20091125  091447  EDPBA       REL-V5R4M0  5722-WDS
000003091125     A*%%FI+10660100000000000000000000000000000000000000000000000000
000004091125     A*%%FI       0000000000000000000000000000000000000000000000000
000005091125     A*%%***********************************************************************
000006091125      *PARMS PAGESIZE(66 198) CPI(15) OVRFLW(64)
000007091125      *PARMS PRTQLTY(*DRAFT) USRDTA('DATI TIPO')
000008091125     A*------------------------------------------------------------------------*
000009091125     A* Compilare --> LARGHEZZA PAGINA  : 198
000010091125     A*               CPI               : 15
000011091125     A*               OVRFLW            : 64
000012091125     A*               PRTQLTY           : *DRAFT
000013091125     A*               USRDTA            : DATI TIPO
000014091125     A*------------------------------------------------------------------------*
000015091125     A* TESTATA
000016091125     A*------------------------------------------------------------------------*
000017091125     A          R TE41TE
000018091125     A*%%***********************************************************************
000019091125     A*%%RI 00000
000020091125     A*%%***********************************************************************
000021091125     A                                      SKIPB(001)
000022091125     A                                      SPACEA(001)
000023091125     A            DSFIRS        20   O     1
000024091125     A                                    +1
000025091125     A                                      '/'
000026091125     A            DSFIFI         3S 0O    +1
000027091125     A                                      EDTCDE(Z)
000028091125     A            TECPGM        10A  O   +21
000029091125     A            TEDLAN        30A  O   +23
000030091125     A                                   148
000031091125     A                                      'DATA'
000032091125     A                                   153
000033091125     A                                      DATE
000034091125     A                                      EDTCDE(Y)
000035091125     A                                   168
000036091125     A                                      'ORA'
000037091125     A                                   172
000038091125     A                                      TIME
000039091125     A                                      EDTWRD('  :  :  ')
000040091125     A                                   191
000041091125     A                                      'PAG.'
000042091125     A                                   195
000043091125     A                                      PAGNBR
000044091125     A                                      EDTCDE(Z)
000045091125     A*%%***********************************************************************
000046091125     A*%%SS
000047091125     A*%%CL 001
000048091125     A*%%***********************************************************************
000049091125     A*------------------------------------------------------------------------*
000050091125     A* INTESTAZIONE GENERALE -1-
000051091125     A*------------------------------------------------------------------------*
000052091125     A          R TE41IN
000053091125     A*%%***********************************************************************
000054091125     A*%%RI 00000
000055091125     A*%%***********************************************************************
000056091125     A                                      SPACEB(001)
000057091125     A                                      SPACEA(001)
000058091125     A            INDCTO         8A  O     1
000059091125     A                                      HIGHLIGHT
000060091125     A            INCKSC         7S 0O    10
000061091125     A                                      EDTCDE(Z)
000062091125     A            INCRAG        20A  O    +1
000063091125     A                                    +3
000064091125     A                                      'TARIFFA:'
000065091125     A                                      HIGHLIGHT
000066091125     A            INCCTR         3S 0O    +1
000067091125     A            INDCTR        10A  O    +1
000068091125     A            INCDIV         3A  O    +1
000069091125     A            INDPRG        12A  O    +4
000070091201     A                                      HIGHLIGHT
000071091125     A            INCPRG         3S 0O    +1
000072091125     A                                    92
000073091125     A                                      'LINEA DI PARTENZA:'
000074091125     A                                      HIGHLIGHT
000075091125     A            INCLNP         3S 0O    +1
000076091125     A                                      EDTCDE(Z)
000077091125     A            INDLNP        20A  O    +1
000078091125     A*%%***********************************************************************
000079091125     A*%%SS
000080091125     A*%%CL 001
000081091125     A*%%***********************************************************************
000082091125     A*------------------------------------------------------------------------*
000083091125     A* INTESTAZIONE GENERALE -3-
000084091125     A*------------------------------------------------------------------------*
000085091125     A          R TE41I2
000086091125     A*%%***********************************************************************
000087091125     A*%%RI 00000
000088091125     A*%%***********************************************************************
000089091125     A                                      SPACEB(001)
000090091125     A                                     1
000091091125     A                                      'TARIFFA:'
000092091125     A                                      HIGHLIGHT
000093091125     A            I2DFIE        20A  O    +1
000094091125     A*%%***********************************************************************
000095091125     A*%%SS
000096091125     A*%%***********************************************************************
000097091125     A*------------------------------------------------------------------------*
000098091125     A* INTESTAZIONE DATI TIPO GENERALI -1-
000099091125     A*------------------------------------------------------------------------*
000100091125     A          R TE41IC1
000101091125     A*%%***********************************************************************
000102091125     A*%%RI 00000
000103091125     A*%%***********************************************************************
000104091125     A                                      SPACEB(001)
000105091125     A                                     1
000106091125     A                                      'QLTA'''
000107091125     A                                    +1
000108091125     A                                      'DISK'
000109091125     A                                    13
000110091125     A                                      'PROC. DISCK "C"'
000111091125     A                                    31
000112091125     A                                      'CHI ETICHETTA'
000113091125     A                                    50
000114091125     A                                      'CHI SCARICA'
000115091125     A                                    63
000116091125     A                                      'ARROTONAM.'
000117091125     A                                    78
000118091125     A                                      'DESCRIZIONE'
000119091125     A*                                   94
000120091125     A*                                     'S/F'
000121091125     A                                   100
000122091125     A                                      'PKL'
000123091125     A*%%***********************************************************************
000124091125     A*%%SS
000125091125     A*%%***********************************************************************
000126091125     A*------------------------------------------------------------------------*
000127091125     A* DATI TIPO GENERALI -1-
000128091125     A*------------------------------------------------------------------------*
000129091125     A          R TE41DC1
000130091125     A*%%***********************************************************************
000131091125     A*%%RI 00000
000132091125     A*%%***********************************************************************
000133091125     A                                      SPACEB(001)
000134091125     A            DC1CLV         1A  O     2
000135091125     A            DC1BOL         1A  O     8
000136091125     A            DC1DKC         2A  O    19
000137091125     A            DC1IX1        13A  O    31
000138091125     A            DC1IX2        13A  O    48
000139091125     A            DC1FAR         1A  O    63
000140091125     A            DC1IAR         7S 2O    65
000141091125     A                                      EDTCDE(2)
000142091125     A            DC1DCV        15A  O    76
000143091125     A            DC1PKL         1A  O   101
000144091125     A*%%***********************************************************************
000145091125     A*%%SS
000146091125     A*%%***********************************************************************
000147091125     A*------------------------------------------------------------------------*
000148091125     A* INTESTAZIONE DATI TIPO GENERALI -1-
000149091125     A*------------------------------------------------------------------------*
000150091125     A          R TE41IC2
000151091125     A*%%***********************************************************************
000152091125     A*%%RI 00000
000153091125     A*%%***********************************************************************
000154091125     A                                      SPACEB(001)
000155091125     A                                     1
000156091125     A                                      'G PAG'
000157091125     A                                     7
000158091125     A                                      'SPED/RIT.'
000159091125     A                                    17
000160091125     A                                      'PESO/COL'
000161091125     A                                    27
000162091125     A                                      'VOL/COLLO'
000163091125     A                                    38
000164091125     A                                      '%FRA'
000165091125     A                                    46
000166091125     A                                      '%ASS'
000167091125     A                                    53
000168091125     A                                      '%CON PR'
000169091125     A                                    61
000170091125     A                                      '%CON MAG'
000171091125     A                                    71
000172091125     A                                      '%F.DEP'
000173091125     A                                    78
000174091125     A                                      '%APPUN/ING'
000175091125     A                                    89
000176091125     A                                      '%PIANI/ING'
000177091125     A                                   100
000178091125     A                                      '%SUPER/ING'
000179091125     A                                   111
000180091125     A                                      '%F.MIS/ING'
000181091125     A                                   122
000182091125     A                                      '%D D T/ING'
000183091125     A                                   133
000184091125     A                                      '%C.STO/ING'
000185091125     A                                   144
000186091125     A                                      '%L.DIS/ING'
000187091125     A                                   155
000188091125     A                                      '%C.ISO/ING'
000189091125     A                                   166
000190091125     A                                      '%R.ISO/ING'
000191091125     A                                   177
000192091125     A                                      '%MERCE VAL'
000193091125     A                                   188
000194091125     A                                      '%D.DIS.'
000195091125     A                                   196
000196091125     A                                      'ING'
000197091125     A*%%***********************************************************************
000198091125     A*%%SS
000199091125     A*%%***********************************************************************
000200091125     A*------------------------------------------------------------------------*
000201091125     A* DATI TIPO GENERALI -1-
000202091125     A*------------------------------------------------------------------------*
000203091125     A          R TE41DC2
000204091125     A*%%***********************************************************************
000205091125     A*%%RI 00000
000206091125     A*%%***********************************************************************
000207091125     A                                      SPACEB(001)
000208091125     A            DC1GGP         5S 0O     1
000209091125     A                                      EDTCDE(Z)
000210091125     A            DC1SPR         7S 0O     7
000211091125     A                                      EDTCDE(2)
000212091125     A            DC1PMC         7S 1O    17
000213091125     A                                      EDTCDE(2)
000214091125     A            DC1VMC         7S 3O    27
000215091125     A                                      EDTCDE(2)
000216091125     A            DC1FRA         6S 3O    37
000217091125     A                                      EDTCDE(2)
000218091125     A            DC1ASS         6S 3O    45
000219091125     A                                      EDTCDE(2)
000220091125     A            DC1PCV         6S 3O    53
000221091125     A                                      EDTCDE(2)
000222091125     A            DC1PCM         6S 3O    62
000223091125     A                                      EDTCDE(2)
000224091125     A            DC1PFD         6S 3O    70
000225091125     A                                      EDTCDE(2)
000226091125     A            DC1PCA         6S 3O    78
000227091125     A                                      EDTCDE(2)
000228091125     A            DC1IAP         1A  O    86
000229091125     A            DC1PCP         6S 3O    89
000230091125     A                                      EDTCDE(2)
000231091125     A            DC1IPI         1A  O    97
000232091125     A            DC1PCS         6S 3O   100
000233091125     A                                      EDTCDE(2)
000234091125     A            DC1ISU         1A  O   108
000235091125     A            DC1PCF         6S 3O   111
000236091125     A                                      EDTCDE(2)
000237091125     A            DC1IFU         1A  O   119
000238091125     A            DC1PCD         6S 3O   122
000239091125     A                                      EDTCDE(2)
000240091125     A            DC1IDD         1A  O   130
000241091125     A            DC1PCC         6S 3O   133
000242091125     A                                      EDTCDE(2)
000243091125     A            DC1ICE         1A  O   141
000244091125     A            DC1PCL         6S 3O   144
000245091125     A                                      EDTCDE(2)
000246091125     A            DC1ILO         1A  O   152
000247091125     A            DC1CIS         6S 3O   155
000248091125     A                                      EDTCDE(2)
000249091125     A            DC1ISO         1A  O   163
000250091125     A            DC1SAM         6S 3O   166
000251091125     A                                      EDTCDE(2)
000252091125     A            DC1INR         1A  O   174
000253091125     A            DC1VAL         6S 3O   178
000254091125     A                                      EDTCDE(2)
000255091125     A            DC1DES         6S 3O   188
000256091125     A                                      EDTCDE(2)
000257091125     A            DC1IDE         1A  O   197
000258091125     A*%%***********************************************************************
000259091125     A*%%SS
000260091125     A*%%***********************************************************************
000261091125     A*------------------------------------------------------------------------*
000262091125     A* INTESTAZIONE DATI TIPO GENERALI -2-
000263091125     A*------------------------------------------------------------------------*
000264091125     A          R TE41IC3
000265091125     A*%%***********************************************************************
000266091125     A*%%RI 00000
000267091125     A*%%***********************************************************************
000268091125     A                                      SPACEB(001)
000269091125     A                                     1
000270091125     A                                      '%SPED PRO/ING'
000271091125     A            COSTES        10A  O    +2
000272091125     A                                    30
000273091125     A                                      'CONTRASSEGNO'
000274091125     A                                    47
000275091125     A                                      '%BARTOLINI'
000276091125     A                                    59
000277091125     A                                      '%MITTENTE'
000278091125     A                                    70
000279091125     A                                      'ING'
000280091125     A                                    77
000281091125     A                                      'ASSICURAZIONE'
000282091125     A                                    94
000283091125     A                                      '%AC PLUS'
000284091125     A                                   104
000285091125     A                                      'ING'
000286091125     A                                   109
000287091125     A                                      '% RCV'
000288091125     A                                   116
000289091125     A                                      '%AC BASE'
000290091125     A                                   126
000291091125     A                                      '%GIACENZE'
000292091125     A                                   136
000293091125     A                                      'GG SOSTA'
000294091125     A                                   155
000295091125     A                                      '%SPED BAN'
000296091125     A                                   165
000297091125     A                                      'MEDIA BAN'
000298091125     A                                   175
000299091125     A                                      'ING'
000300091125     A                                   180
000301091125     A                                      '%SPED BNB'
000302091125     A                                   190
000303091125     A                                      'MEDIA BNB'
000304091125     A*%%***********************************************************************
000305091125     A*%%SS
000306091125     A*%%***********************************************************************
000307091125     A*------------------------------------------------------------------------*
000308091125     A* DATI TIPO GENERALI -2-
000309091125     A*------------------------------------------------------------------------*
000310091125     A          R TE41DC3
000311091125     A*%%***********************************************************************
000312091125     A*%%RI 00000
000313091125     A*%%***********************************************************************
000314091125     A                                      SPACEB(001)
000315091125     A            DC2PPV         6S 3O     3
000316091125     A                                      EDTCDE(2)
000317091125     A            DC2SIN         1A  O    12
000318091125     A            DC2ESP         6S 3O    16
000319091125     A                                      EDTCDE(2)
000320091125     A            DC2IES         1A  O    24
000321091125     A            DC2CAS        15S 3O    27
000322091125     A                                      EDTCDE(2)
000323091125     A            DC2PAB         6S 3O    49
000324091125     A                                      EDTCDE(2)
000325091125     A            DC2PAM         6S 3O    60
000326091125     A                                      EDTCDE(2)
000327091125     A            DC2ICA         1A  O    71
000328091125     A            DC2ASC        15S 3O    74
000329091125     A                                      EDTCDE(2)
000330091125     A            DC2PAC         6S 3O    95
000331091125     A                                      EDTCDE(2)
000332091125     A            DC2IAS         1A  O   105
000333091125     A            DC2PAR         6S 3O   108
000334091125     A                                      EDTCDE(2)
000335091125     A            DC2XX1         6S 3O   117
000336091125     A                                      EDTCDE(2)
000337091125     A            DC2PGI         6S 3O   127
000338091125     A                                      EDTCDE(2)
000339091125     A            DC2GGG         5S 0O   137
000340091125     A                                      EDTCDE(2)
000341091125     A            DC2IGI         1A  O   145
000342091125     A            DC2NRG         5S 0O   147
000343091125     A                                      EDTCDE(2)
000344091125     A            DC2BAN         6S 3O   156
000345091125     A                                      EDTCDE(2)
000346091125     A            DC2NBA         7S 0O   165
000347091125     A                                      EDTCDE(2)
000348091125     A            DC2IBA         1A  O   176
000349091125     A            DC2BNB         6S 3O   181
000350091125     A                                      EDTCDE(2)
000351091125     A            DC2NBN         7S 0O   190
000352091125     A                                      EDTCDE(2)
000353091125     A*%%***********************************************************************
000354091125     A*%%SS
000355091125     A*%%***********************************************************************
000356091125     A*------------------------------------------------------------------------*
000357091125     A* INTESTAZIONE DATI TIPO SCAGLIONI
000358091125     A*------------------------------------------------------------------------*
000359091125     A          R TE41ISB
000360091125     A*%%***********************************************************************
000361091125     A*%%RI 00000
000362091125     A*%%***********************************************************************
000363091125     A                                      SPACEB(001)
000364091125     A N44                                 1
000365091125     A                                      'SCAGLIONI PER RICAVI'
000366091125     A  44                                 1
000367091125     A                                      'SCAGLIONI PER COMPETENZE'
000368091125     A*%%***********************************************************************
000369091125     A*%%SS
000370091125     A*%%***********************************************************************
000371091125     A          R TE41IS
000372091125     A*%%***********************************************************************
000373091125     A*%%RI 00000
000374091125     A*%%***********************************************************************
000375091125     A                                      SPACEB(001)
000376091125     A                                     1
000377091125     A                                      'SCAGLIONE IN'
000378091125     A            ISDSGL         5A  O    +1
000379091125     A                                    +2
000380091125     A                                      'PESO -KG-'
000381091125     A                                    +4
000382091125     A                                      'COLLI'
000383091125     A                                    +6
000384091125     A                                      'VOLUME'
000385091125     A                                    +7
000386091125     A                                      'INOLTRO'
000387091125     A                                    +6
000388091125     A                                      'P/V'
000389091125     A                                    +4
000390091125     A                                      'DELTA'
000391091125     A                                    85
000392091125     A                                      '%INCIDENZA'
000393091125     A*%%***********************************************************************
000394091125     A*%%SS
000395091125     A*%%***********************************************************************
000396091125     A*------------------------------------------------------------------------*
000397091125     A* DATI TIPO SCAGLIONI
000398091125     A*------------------------------------------------------------------------*
000399091125     A          R TE41DS
000400091125     A*%%***********************************************************************
000401091125     A*%%RI 00000
000402091125     A*%%***********************************************************************
000403091125     A                                      SPACEB(001)
000404091125     A            DSCSGL        13S 3O     1
000405091125     A                                      EDTCDE(2)
000406091125     A            DSCPSC         7S 1O    +3
000407091125     A                                      EDTCDE(2)
000408091125     A            DSCCSC         7S 1O    +2
000409091125     A                                      EDTCDE(2)
000410091125     A            DSCVSC         7S 3O    +2
000411091125     A                                      EDTCDE(2)
000412091125     A            DSCINL        11S 3O    +2
000413091125     A                                      EDTCDE(2)
000414091125     A            DSCRPV         3S 1O    +2
000415091125     A                                      EDTCDE(2)
000416091125     A            DSCSDE         1A  O    +2
000417091125     A            DSCPDE         6S 3O    +0
000418091125     A                                      EDTCDE(2)
000419091125     A            DSCPPE         4S 1O    +4
000420091125     A                                      EDTCDE(2)
000421091125     A            DSDDED        35A  O    +4
000422091125     A*%%***********************************************************************
000423091125     A*%%SS
000424091125     A*%%***********************************************************************
000425091125     A*------------------------------------------------------------------------*
000426091125     A* INTESTAZIONE DATI TIPO CODICI TASSAZIONE
000427091125     A*------------------------------------------------------------------------*
000428091125     A          R TE41IT
000429091125     A*%%***********************************************************************
000430091125     A*%%RI 00000
000431091125     A*%%***********************************************************************
000432091125     A                                      SPACEB(001)
000433091125     A                                    78
000434091125     A                                      '%INCIDENZA'
000435091125     A                                     1
000436091125     A                                      '_______ CODICE TASSAZIONE _______'
000437091125     A                                    +2
000438091125     A                                      'CLUOGO'
000439091125     A                                    44
000440091125     A                                      '________ RAGGRUPPAMENTO ________'
000441091125     A*%%***********************************************************************
000442091125     A*%%SS
000443091125     A*%%***********************************************************************
000444091125     A*------------------------------------------------------------------------*
000445091125     A* DATI TIPO CODICI TASSAZIONE
000446091125     A*------------------------------------------------------------------------*
000447091125     A          R TE41DT
000448091125     A*%%***********************************************************************
000449091125     A*%%RI 00000
000450091125     A*%%***********************************************************************
000451091125     A                                      SPACEB(001)
000452091125     A            DTCCTS         2A  O     1
000453091125     A            DTDCTS        30A  O    +1
000454091125     A            DTCFCR         1A  O    +5
000455091125     A            DTCRCT         1A  O    44
000456091125     A            DTDRCT        30A  O    46
000457091125     A            DTCPPE         4S 1O    80
000458091125     A                                      EDTCDE(2)
000459091125     A            DTDDED        35A  O   +12
000460091125     A*%%***********************************************************************
000461091125     A*%%SS
000462091125     A*%%***********************************************************************
000463091125     A*------------------------------------------------------------------------*
000464091125     A* RIGA DI SEPARAZIONE -1-
000465091125     A*------------------------------------------------------------------------*
000466091125     A          R TE41R1
000467091125     A*%%***********************************************************************
000468091125     A*%%RI 00000
000469091125     A*%%***********************************************************************
000470091125     A                                      SPACEB(001)
000471091125     A                                     1
000472091125     A                                      '-----------------------------------
000473091125     A                                      ------------------------------------
000474091125     A                                      ------------------------------------
000475091125     A                                      ------------------------------------
000476091125     A                                      ------------------------------------
000477091125     A                                      ------------------------'
000478091125     A*%%***********************************************************************
000479091125     A*%%SS
000480091125     A*%%***********************************************************************
000481091125     A*------------------------------------------------------------------------*
000482091125     A* RIGA DI SEPARAZIONE -2-
000483091125     A*------------------------------------------------------------------------*
000484091125     A          R TE41R2
000485091125     A*%%***********************************************************************
000486091125     A*%%RI 00000
000487091125     A*%%***********************************************************************
000488091125     A                                      SPACEB(001)
000489091125     A                                     1
000490091125     A                                      '-----------------------------------
000491091125     A                                      ------------------------------------
000492091125     A                                      -------------------------'
000493091125     A*%%***********************************************************************
000494091125     A*%%SS
000495091125     A*%%***********************************************************************
000496091125     A*------------------------------------------------------------------------*
000497091125     A* PARAMETRI DI LANCIO PER IL "TNTE41R" - CREAZIONE DATI TIPO
000498091125     A*------------------------------------------------------------------------*
000499091125     A          R TE41P41
000500091125     A*%%***********************************************************************
000501091125     A*%%RI 00000
000502091125     A*%%***********************************************************************
000503091125     A                                      SPACEB(001)
000504091125     A                                    81
000505091125     A                                      '***  PARAMETRI  DI LANCIO  ***'
000506091125     A                                      SPACEB(001)
000507091125     A                                    81
000508091125     A                                      'UTENTE ......................:'
000509091125     A                                      SPACEB(001)
000510091125     A            PROFIL        10A  O   113
000511091125     A*                                   81
000512091125     A*                                     'LANCIO IN SEDE O IN FILIALE .:'
000513091125     A*                                     SPACEB(001)
000514091125     A            PACELA         1A  O    +2
000515091125     A                                    81
000516091125     A                                      'SIMULAZIONE .................:'
000517091125     A                                      SPACEB(001)
000518091125     A            PADSIM         2A  O   113
000519091125     A                                    81
000520091125     A                                      'CLIENTE .....................:'
000521091125     A                                      SPACEB(001)
000522091125     A            PACKSC         7S 0O    +2
000523091125     A                                      EDTCDE(Z)
000524091125     A            PADKSC        30A  O    +2
000525091125     A            PADUNI        12A  O    +2
000526091125     A                                    81
000527091125     A                                      'DATA SPEDIZIONE DAL / AL ....:'
000528091125     A                                      SPACEB(001)
000529091125     A            PACDS1         8S 0O   113
000530091125     A                                      EDTCDE(8)
000531091125     A                                   124
000532091125     A                                      '-'
000533091125     A            PACDS2         8S 0O   126
000534091125     A                                      EDTCDE(8)
000535091125     A                                    81
000536091125     A                                      'LINEA DI PARTENZA ...........:'
000537091125     A                                      SPACEB(001)
000538091125     A            PACFPA         3S 0O    +2
000539091125     A                                      EDTCDE(Z)
000540091125     A            PADFPA        20A  O    +6
000541091125     A                                    81
000542091125     A                                      'LINEA DI ARRIVO .............:'
000543091125     A                                      SPACEB(001)
000544091125     A            PACFAR         3S 0O    +2
000545091125     A                                      EDTCDE(Z)
000546091125     A            PADFAR        20A  O    +6
000547091125     A                                    81
000548091125     A                                      'LINEA DI PARTENZA O ARRIVO ..:'
000549091125     A                                      SPACEB(001)
000550091125     A            PACFAP         3S 0O    +2
000551091125     A                                      EDTCDE(Z)
000552091125     A            PADFAP        20A  O    +6
000553091125     A                                    81
000554091125     A                                      'CODICE TARIFFA ..............:'
000555091125     A                                      SPACEB(001)
000556091125     A            PACTAR         3A  O    +2
000557091125     A            PADCTOD       30A  O    81
000558091125     A                                      SPACEB(001)
000559091125     A            PADCTO        10A  O   113
000560091125     A            PADKOVD       30A  O    81
000561091125     A                                      SPACEB(001)
000562091125     A            PACKOV         7S 0O   113
000563091125     A                                      EDTCDE(Z)
000564091125     A            PADKOV        20A  O    +2
000565091125     A            PACCTR         3S 0O   113
000566091125     A                                      SPACEB(001)
000567091125     A            PACDIV         3A  O   117
000568091125     A            PADCTR        20A  O   122
000569091125     A                                    81
000570091125     A                                      'TARIFFA .....................:'
000571091125     A            PADPRGD       30A  O    81
000572091125     A                                      SPACEB(001)
000573091125     A            PACPRG         3S 0O   113
000574091125     A                                    81
000575091125     A                                      'LINEA DI PARTENZA ...........:'
000576091125     A                                      SPACEB(001)
000577091125     A            PACLNP         3S 0O   113
000578091125     A                                      EDTCDE(Z)
000579091125     A            PADLNP        20A  O   122
000580091125     A                                    81
000581091125     A                                      'TARIFFA ITALIA / ESTERO .....:'
000582091125     A                                      SPACEB(001)
000583091125     A            PACFIE         1A  O   113
000584091125     A            PADFIE        10A  O   122
000585091125     A*%%***********************************************************************
000586091125     A*%%SS
000587091125     A*%%CL 001
000588091125     A*%%CL 001
000589091125     A*%%CL 001
000590091125     A*%%CL 001
000591091125     A*%%CL 001
000592091125     A*%%CL 001
000593091125     A*%%CL 001
000594091125     A*%%CL 001
000595091125     A*%%CL 001
000596091125     A*%%CL 001
000597091125     A*%%CL 001
000598091125     A*%%CL 001
000599091125     A*%%CL 001
000600091125     A*%%CL 001
000601091125     A*%%CL 001
000602091125     A*%%***********************************************************************
000603091125     A*------------------------------------------------------------------------*
000604091125     A* PARAMETRI DI LANCIO PER IL "TNTE43R" - STAMPA DATI TIPO
000605091125     A*------------------------------------------------------------------------*
000606091125     A          R TE41P43
000607091125     A*%%***********************************************************************
000608091125     A*%%RI 00000
000609091125     A*%%***********************************************************************
000610091125     A                                      SPACEB(001)
000611091125     A                                    81
000612091125     A                                      '***  PARAMETRI  DI LANCIO  ***'
000613091125     A                                      SPACEB(001)
000614091125     A                                    81
000615091125     A                                      'UTENTE ......................:'
000616091125     A                                      SPACEB(001)
000617091125     A            PROFIL        10A  O   113
000618091125     A            PADCTOD       30A  O    81
000619091125     A                                      SPACEB(001)
000620091125     A            PADCTO        10A  O   113
000621091125     A            PADKSCD       30A  O    81
000622091125     A                                      SPACEB(001)
000623091125     A            PACKSC         7S 0O   113
000624091125     A                                      EDTCDE(Z)
000625091125     A            PADKSC        30A  O   122
000626091125     A                                    81
000627091125     A                                      'TARIFFA .....................:'
000628091125     A                                      SPACEB(001)
000629091125     A            PACCTR         3S 0O   113
000630091125     A            PACDIV         3A  O   117
000631091125     A            PADCTR        20A  O   122
000632091125     A            PADPRGD       30A  O    81
000633091125     A                                      SPACEB(001)
000634091125     A            PACPRG         3S 0O   113
000635091125     A                                    81
000636091125     A                                      'LINEA DI PARTENZA ...........:'
000637091125     A                                      SPACEB(001)
000638091125     A            PACLNP         3S 0O   113
000639091125     A                                      EDTCDE(Z)
000640091125     A            PADLNP        20A  O   122
000641091125     A                                    81
000642091125     A                                      'TARIFFA ITALIA / ESTERO .....:'
000643091125     A                                      SPACEB(001)
000644091125     A            PACSIE         1A  O   113
000645091125     A            PADSIE        10A  O   122
000650091125     A                                    81
000651091125     A                                      'RAPPRESENTAZIONE C.TASSAZIONE:'
000652091125     A                                      SPACEB(001)
000653091125     A            PACSCT         1A  O    +2
000654091125     A            PADSCT        30A  O   122
000655091125     A*%%***********************************************************************
000656091125     A*%%SS
000657091125     A*%%CL 001
000658091125     A*%%CL 001
000659091125     A*%%CL 001
000660091125     A*%%CL 001
000661091125     A*%%CL 001
000662091125     A*%%CL 001
000663091125     A*%%CL 001
000664091125     A*%%CL 001
000665091125     A*%%CL 001
000666091125     A*%%***********************************************************************
000667091125     A*------------------------------------------------------------------------*
000668091125     A* FINE PROSPETTO
000669091125     A*------------------------------------------------------------------------*
000670091125     A          R TE41FI
000671091125     A*%%***********************************************************************
000672091125     A*%%RI 00000
000673091125     A*%%FS 002
000674091125     A*%%***********************************************************************
000675091125     A                                      SPACEB(003)
000676091125     A                                    81
000677091125     A                                      '***  F I N E   P R O S P E T T O  -
000678091125     A                                      ***'
000679091125     A*%%***********************************************************************
000680091125     A*%%SS
000681091125     A*%%CP+999CRTPRTF
000682091125     A*%%CP+    FILE(GAITRASRC/TNTE41P)
000683091125     A*%%CP+    DEVTYPE(*SCS)
000684091125     A*%%CP     PAGESIZE(*N       198      *N     )
000685091125     A*%%***********************************************************************
000686091125     A*------------------------------------------------------------------------*
