000010060913     A*%%TS  SD  20060913  142135  EDPBA       REL-V5R3M0  5722-WDS
000020000000     A*------------------------------------------------------------------------*
000030060913     A*%%EC
000040060913     A                                      DSPSIZ(24 80 *DS3)
000050060913     A                                      CHGINPDFT(HI CS)
000060060913     A                                      PRINT
000070060913     A                                      CF01
000080060913     A                                      CF02
000090060913     A                                      CF03
000100060913     A                                      CF04
000110060913     A                                      CF05
000120060913     A                                      CF06
000130060913     A                                      CF07
000140060913     A                                      CF08
000150060913     A                                      CF09
000160060913     A                                      CF10
000170060913     A                                      CF11
000180060913     A                                      CF12
000190060913     A                                      CF13
000200060913     A                                      CF14
000210060913     A                                      CF15
000220060913     A                                      CF16
000230060913     A                                      CF17
000240060913     A                                      CF18
000250060913     A                                      CF19
000260060913     A                                      CF20
000270060913     A                                      CF21
000280060913     A                                      CF22
000290060913     A                                      CF23
000300060913     A                                      CF24
000310060913     A                                      HELP
000320000000     A*------------------------------------------------------------------------*
000330060913     A          R TE51D01
000340060913     A*%%TS  SD  20060913  142135  EDPBA       REL-V5R3M0  5722-WDS
000350060913     A            DSFIRS        20A  O  1  2
000360060913     A                                  1 30'SIMULAZIONE DELTA TARIFFA'
000370060913     A                                      DSPATR(RI)
000380060913     A                                      DSPATR(UL)
000390060913     A                                  1 62'TNTE51R'
000400060913     A                                  1 72DATE
000410060913     A                                      EDTCDE(Y)
000420060913     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000430060913     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000440060913     A                                  2 72TIME
000450060913     A                                  2 29'DA SPEDIZIONI REALI DA SEDE'
000460060913     A                                      DSPATR(RI)
000470060913     A                                      DSPATR(UL)
000480000000     A*------------------------------------------------------------------------*
000490000000     A          R TE51D02
000500000000     A                                      OVERLAY
000510000000     A            FUN001        19A  O 22  2
000520000000     A            FUN002        19A  O 22 22
000530000000     A            FUN003        19A  O 22 42
000540000000     A            FUN004        19A  O 22 62
000550000000     A            FUN005        19A  O 23  2
000560000000     A            FUN006        19A  O 23 22
000570000000     A            FUN007        19A  O 23 42
000580000000     A            FUN008        19A  O 23 62
000590000000     A*------------------------------------------------------------------------*
000600020218     A          R TE51D03
000610020218     A*%%TS  SD  20020218  154127  EDPRN       REL-V4R4M0  5769-PW1
000620020218     A                                      OVERLAY
000630020218     A                                  4  2'INPUT'
000640020218     A                                      DSPATR(HI)
000650020218     A                                  5  2'Tipo Lancio:'
000660020218     A            D50TLA         1A  B  5 15DSPATR(UL)
000670020218     A                                  6  2'Anno bolla.:'
000680020218     A            D50AAS         4Y 0B  6 15EDTCDE(Z)
000690020218     A                                      DSPATR(UL)
000700020218     A                                  6 21'P.O.partenza:'
000710020218     A            D50LNP         3Y 0B  6 35EDTCDE(Z)
000720020218     A                                      DSPATR(UL)
000730020218     A                                  6 45'Serie ..:'
000740020218     A            D50NRS         2Y 0B  6 55EDTCDE(Z)
000750020218     A                                      DSPATR(UL)
000760020218     A                                  6 60'Spedizione.:'
000770020218     A            D50NSP         7Y 0B  6 73EDTCDE(Z)
000780020218     A                                      DSPATR(UL)
000790020218     A                                  7  2'Tarif/Offer:'
000800020218     A            D50CTO         1A  B  7 15DSPATR(UL)
000810020218     A                                  7 21'Cliente.....:'
000820020218     A            D50KSC         7Y 0B  7 35EDTCDE(Z)
000830020218     A                                      DSPATR(UL)
000840020218     A                                  7 45'Tariffa :'
000850020218     A            D50CTR         3Y 0B  7 55EDTCDE(Z)
000860020218     A                                      DSPATR(UL)
000870020218     A                                  7 60'Progressivo:'
000880020218     A            D50PRG         3Y 0B  7 73EDTCDE(Z)
000890020218     A                                      DSPATR(UL)
000900020218     A                                  8  2'Data riferimento calcolo ......:'
000910020218     A            D50DTR         8Y 0B  8 35EDTCDE(Z)
000920020218     A                                      DSPATR(UL)
000930020218     A                                  9  2'Errore.....:'
000940020218     A            D50ERR         4A  B  9 15
000950020218     A            D50MSG        80A  B  9 21
000960020218     A                                 12  2'OUTPUT'
000970020218     A                                      DSPATR(HI)
000980020218     A                                 13  2'Ricavi...........:'
000990020218     A            D50RIC        15Y 3B 13 21EDTCDE(2)
001000020218     A                                 14  2'Competenze.......:'
001010020218     A            D50COM        15Y 3B 14 21EDTCDE(2)
001020020218     A                                 15  2'Delta............:'
001030020218     A            D50DEL         4Y 1B 15 21EDTCDE(N)
001040020218     A                                 16  2'Peso tassabile...:'
001050020218     A            D50PVL         9Y 1B 16 21EDTCDE(N)
001060000000     A*------------------------------------------------------------------------*
001070000000     A          R TE51DMS                   SFL
001080000000     A                                      SFLMSGRCD(24)
001090000000     A            MSGKEY                    SFLMSGKEY
001100000000     A            MSGQUE                    SFLPGMQ
001110000000     A*------------------------------------------------------------------------*
001120000000     A          R TE51DMC                   SFLCTL(TE51DMS)
001130000000     A                                      OVERLAY
001140000000     A                                      SFLDSP
001150000000     A  40                                  SFLCLR
001160000000     A                                      SFLSIZ(0002)
001170000000     A                                      SFLPAG(0001)
