000010120713     A*%%TS  SD  20120713  094301  EDPMB       REL-V6R1M0  5761-WDS
000020970423     A*------------------------------------------------------------------------*
000030120713     A*%%EC
000040120713     A                                      DSPSIZ(24 80 *DS3)
000050120713     A                                      CHGINPDFT(HI CS)
000060120713     A                                      PRINT
000070120713     A                                      CA03
000080970423     A*------------------------------------------------------------------------*
000090060913     A          R TE55D00
000100060913     A*%%TS  SD  20060913  142026  EDPBA       REL-V5R3M0  5722-WDS
000110060913     A                                      TEXT('Testata')
000120060913     A            DSFIRS        20A  O  1  2
000130060913     A                                  1 29'SIMULAZIONE DELTA TARIFFA'
000140060913     A                                      DSPATR(RI)
000150060913     A                                      DSPATR(UL)
000160060913     A                                  1 61'TNTE55R'
000170060913     A                                  1 72DATE
000180060913     A                                      EDTCDE(Y)
000190060913     A            KNSIF     R        O  2  2REFFLD(KNSIF KPJBA)
000200060913     A            KNMUS     R        O  2 13REFFLD(KNMUS KPJBA)
000210060913     A                                  2 72TIME
000220060913     A                                  2 28'DA SPEDIZIONI REALI DI SEDE'
000230060913     A                                      DSPATR(RI)
000240060913     A                                      DSPATR(UL)
000250970423     A*------------------------------------------------------------------------*
000260120713     A          R TE55D01
000270120713     A*%%TS  SD  20120713  094301  EDPMB       REL-V6R1M0  5761-WDS
000280120713     A                                      TEXT('Parametri')
000290120713     A                                      OVERLAY
000300120713     A                                      CF06
000310120713     A  90        $MSG          78   M
000320120713     A                                  3  2'SPEDIZIONI DA ELABORARE:'
000330120713     A                                      DSPATR(HI)
000340120713     A                                  4 56'LNP Sped.(999=Tutte)'
000350120713     A                                      DSPATR(HI)
000360120713     A            V1CKS1         7A  B  5  2
000370120713     A N20                                  DSPATR(HI)
000380120713     A  20                                  DSPATR(RI)
000390120713     A N20                                  DSPATR(CS)
000400120713     A  20                                  DSPATR(PC)
000410120713     A                                      CHECK(RZ)
000420120713     A            V1CTA1         3Y 0B  5 36
000430120713     A N21                                  DSPATR(HI)
000440120713     A  21                                  DSPATR(RI)
000450120713     A N21                                  DSPATR(CS)
000460120713     A  21                                  DSPATR(PC)
000470120713     A                                      CHECK(RZ)
000480120713     A            V1DKS1        25A  O  5 10
000490120713     A            V1CLN1         3Y 0B  5 56
000500120713     A N51                                  DSPATR(HI)
000510120713     A  51                                  DSPATR(RI)
000520120713     A N51                                  DSPATR(CS)
000530120713     A  51                                  DSPATR(PC)
000540120713     A                                      CHECK(RZ)
000550120713     A            V1DLN1        18A  O  5 60
000560120713     A            V1CKS2         7A  B  6  2
000570120713     A N22                                  DSPATR(HI)
000580120713     A  22                                  DSPATR(RI)
000590120713     A N22                                  DSPATR(CS)
000600120713     A  22                                  DSPATR(PC)
000610120713     A                                      CHECK(RZ)
000620120713     A            V1CTA2         3Y 0B  6 36
000630120713     A N23                                  DSPATR(HI)
000640120713     A  23                                  DSPATR(RI)
000650120713     A N23                                  DSPATR(CS)
000660120713     A  23                                  DSPATR(PC)
000670120713     A                                      CHECK(RZ)
000680120713     A            V1DKS2        25A  O  6 10
000690120713     A            V1CLN2         3Y 0B  6 56
000700120713     A N52                                  DSPATR(HI)
000710120713     A  52                                  DSPATR(RI)
000720120713     A N52                                  DSPATR(CS)
000730120713     A  52                                  DSPATR(PC)
000740120713     A                                      CHECK(RZ)
000750120713     A            V1DLN2        18A  O  6 60
000760120713     A            V1CKS3         7A  B  7  2
000770120713     A N24                                  DSPATR(HI)
000780120713     A  24                                  DSPATR(RI)
000790120713     A N24                                  DSPATR(CS)
000800120713     A  24                                  DSPATR(PC)
000810120713     A                                      CHECK(RZ)
000820120713     A            V1CTA3         3Y 0B  7 36
000830120713     A N25                                  DSPATR(HI)
000840120713     A  25                                  DSPATR(RI)
000850120713     A N25                                  DSPATR(CS)
000860120713     A  25                                  DSPATR(PC)
000870120713     A                                      CHECK(RZ)
000880120713     A            V1DKS3        25A  O  7 10
000890120713     A            V1CLN3         3Y 0B  7 56
000900120713     A N53                                  DSPATR(HI)
000910120713     A  53                                  DSPATR(RI)
000920120713     A N53                                  DSPATR(CS)
000930120713     A  53                                  DSPATR(PC)
000940120713     A                                      CHECK(RZ)
000950120713     A            V1DLN3        18A  O  7 60
000960120713     A            V1CKS4         7A  B  8  2
000970120713     A N26                                  DSPATR(HI)
000980120713     A  26                                  DSPATR(RI)
000990120713     A N26                                  DSPATR(CS)
001000120713     A  26                                  DSPATR(PC)
001010120713     A                                      CHECK(RZ)
001020120713     A            V1CTA4         3Y 0B  8 36
001030120713     A N27                                  DSPATR(HI)
001040120713     A  27                                  DSPATR(RI)
001050120713     A N27                                  DSPATR(CS)
001060120713     A  27                                  DSPATR(PC)
001070120713     A                                      CHECK(RZ)
001080120713     A            V1DKS4        25A  O  8 10
001090120713     A            V1CLN4         3Y 0B  8 56
001100120713     A N54                                  DSPATR(HI)
001110120713     A  54                                  DSPATR(RI)
001120120713     A N54                                  DSPATR(CS)
001130120713     A  54                                  DSPATR(PC)
001140120713     A                                      CHECK(RZ)
001150120713     A            V1DLN4        18A  O  8 60
001160120713     A            V1CKS5         7A  B  9  2
001170120713     A N28                                  DSPATR(HI)
001180120713     A  28                                  DSPATR(RI)
001190120713     A N28                                  DSPATR(CS)
001200120713     A  28                                  DSPATR(PC)
001210120713     A                                      CHECK(RZ)
001220120713     A            V1CTA5         3Y 0B  9 36
001230120713     A N29                                  DSPATR(HI)
001240120713     A  29                                  DSPATR(RI)
001250120713     A N29                                  DSPATR(CS)
001260120713     A  29                                  DSPATR(PC)
001270120713     A                                      CHECK(RZ)
001280120713     A            V1DKS5        25A  O  9 10
001290120713     A            V1CLN5         3Y 0B  9 56
001300120713     A N56                                  DSPATR(HI)
001310120713     A  56                                  DSPATR(RI)
001320120713     A N56                                  DSPATR(CS)
001330120713     A  56                                  DSPATR(PC)
001340120713     A                                      CHECK(RZ)
001350120713     A            V1DLN5        18A  O  9 60
001360120713     A                                 10  2'Data spedizione dal/al .........:'
001370120713     A            V1CDS1         8Y 0B 10 36
001380120713     A N30                                  DSPATR(HI)
001390120713     A  30                                  DSPATR(RI)
001400120713     A N30                                  DSPATR(CS)
001410120713     A  30                                  DSPATR(PC)
001420120713     A                                      EDTCDE(8)
001430120713     A                                      CHECK(RB)
001440120713     A                                 10 47'-'
001450120713     A            V1CDS2         8Y 0B 10 49
001460120713     A N31                                  DSPATR(HI)
001470120713     A  31                                  DSPATR(RI)
001480120713     A N31                                  DSPATR(CS)
001490120713     A  31                                  DSPATR(PC)
001500120713     A                                      EDTCDE(8)
001510120713     A                                      CHECK(RB)
001520120713     A                                 10 66'(gg/mm/anno)'
001530120713     A                                 13  2'Solo codici tassazione arrivo .?:'
001540120713     A            V1CCT1         2A  B 13 36
001550120713     A N41                                  DSPATR(HI)
001560120713     A  41                                  DSPATR(RI)
001570120713     A N41                                  DSPATR(CS)
001580120713     A  41                                  DSPATR(PC)
001590120713     A            V1CCT2         2A  B 13 40
001600120713     A N42                                  DSPATR(HI)
001610120713     A  42                                  DSPATR(RI)
001620120713     A N42                                  DSPATR(CS)
001630120713     A  42                                  DSPATR(PC)
001640120713     A            V1CCT3         2A  B 13 44
001650120713     A N43                                  DSPATR(HI)
001660120713     A  43                                  DSPATR(RI)
001670120713     A N43                                  DSPATR(CS)
001680120713     A  43                                  DSPATR(PC)
001690120713     A            V1CCT4         2A  B 13 48
001700120713     A N44                                  DSPATR(HI)
001710120713     A  44                                  DSPATR(RI)
001720120713     A N44                                  DSPATR(CS)
001730120713     A  44                                  DSPATR(PC)
001740120713     A            V1CCT5         2A  B 13 52
001750120713     A N45                                  DSPATR(HI)
001760120713     A  45                                  DSPATR(RI)
001770120713     A N45                                  DSPATR(CS)
001780120713     A  45                                  DSPATR(PC)
001790120713     A            V1CCT6         2A  B 13 56
001800120713     A N46                                  DSPATR(HI)
001810120713     A  46                                  DSPATR(RI)
001820120713     A N46                                  DSPATR(CS)
001830120713     A  46                                  DSPATR(PC)
001840120713     A            V1CCT7         2A  B 13 60
001850120713     A N47                                  DSPATR(HI)
001860120713     A  47                                  DSPATR(RI)
001870120713     A N47                                  DSPATR(CS)
001880120713     A  47                                  DSPATR(PC)
001890120713     A            V1CCT8         2A  B 13 64
001900120713     A N48                                  DSPATR(HI)
001910120713     A  48                                  DSPATR(RI)
001920120713     A N48                                  DSPATR(CS)
001930120713     A  48                                  DSPATR(PC)
001940120713     A            V1CCT9         2A  B 13 68
001950120713     A N49                                  DSPATR(HI)
001960120713     A  49                                  DSPATR(RI)
001970120713     A N49                                  DSPATR(CS)
001980120713     A  49                                  DSPATR(PC)
001990120713     A            V1CCT0         2A  B 13 72
002000120713     A N50                                  DSPATR(HI)
002010120713     A  50                                  DSPATR(RI)
002020120713     A N50                                  DSPATR(CS)
002030120713     A  50                                  DSPATR(PC)
002040120713     A                                 14  2'Solo spedizioni con peso da/a ..:'
002050120713     A            V1CKGD         7Y 1B 14 36
002060120713     A N37                                  DSPATR(HI)
002070120713     A  37                                  DSPATR(RI)
002080120713     A N37                                  DSPATR(CS)
002090120713     A  37                                  DSPATR(PC)
002100120713     A                                      CHECK(RB)
002110120713     A                                      EDTCDE(4)
002120120713     A                                 14 45'-'
002130120713     A            V1CKGA         7Y 1B 14 47
002140120713     A N38                                  DSPATR(HI)
002150120713     A  38                                  DSPATR(RI)
002160120713     A N38                                  DSPATR(CS)
002170120713     A  38                                  DSPATR(PC)
002180120713     A                                      CHECK(RB)
002190120713     A                                      EDTCDE(4)
002200120713     A                                 15  2'Solo spedizioni con colli da/a .:'
002210120713     A            V1CCOD         6Y 0B 15 36
002220120713     A N39                                  DSPATR(HI)
002230120713     A  39                                  DSPATR(RI)
002240120713     A N39                                  DSPATR(CS)
002250120713     A  39                                  DSPATR(PC)
002260120713     A                                      CHECK(RB)
002270120713     A                                 15 45'-'
002280120713     A            V1CCOA         6Y 0B 15 47
002290120713     A N40                                  DSPATR(HI)
002300120713     A  40                                  DSPATR(RI)
002310120713     A N40                                  DSPATR(CS)
002320120713     A  40                                  DSPATR(PC)
002330120713     A                                      CHECK(RB)
002340120713     A                                 12  2'SELEZIONI:'
002350120713     A                                      DSPATR(HI)
002360120713     A                                 18  2'Cliente/tariffa per tassazione .:'
002370120713     A            V1CKTT         7A  B 18 36
002380120713     A N32                                  DSPATR(HI)
002390120713     A  32                                  DSPATR(RI)
002400120713     A N32                                  DSPATR(CS)
002410120713     A  32                                  DSPATR(PC)
002420120713     A                                      CHECK(RZ)
002430120713     A                                 18 44'/'
002440120713     A            V1CTTT         3Y 0B 18 46
002450120713     A N33                                  DSPATR(HI)
002460120713     A  33                                  DSPATR(RI)
002470120713     A N33                                  DSPATR(CS)
002480120713     A  33                                  DSPATR(PC)
002490120713     A                                      CHECK(RZ)
002500120713     A            V1DKTT        20A  O 18 50
002510120713     A                                 19  7'Data validità tariffa .....:'
002520120713     A            V1CDVT         8Y 0B 19 36
002530120713     A N34                                  DSPATR(HI)
002540120713     A  34                                  DSPATR(RI)
002550120713     A N34                                  DSPATR(CS)
002560120713     A  34                                  DSPATR(PC)
002570120713     A                                      EDTCDE(8)
002580120713     A                                      CHECK(RB)
002590120713     A                                 20  7'LNP tariffa ...............:'
002600120713     A            V1CLNP         3Y 0B 20 36
002610120713     A N36                                  DSPATR(HI)
002620120713     A  36                                  DSPATR(RI)
002630120713     A N36                                  DSPATR(CS)
002640120713     A  36                                  DSPATR(PC)
002650120713     A                                      CHECK(RZ)
002660120713     A            V1DLNP        20A  O 20 40
002670120713     A                                 20 63'(999=LNP sped.)'
002680120713     A                                 22  2'Stampa dettaglio per spedizione :'
002690120713     A            V1CDET         1A  B 22 36
002700120713     A N35                                  DSPATR(HI)
002710120713     A  35                                  DSPATR(RI)
002720120713     A N35                                  DSPATR(CS)
002730120713     A  35                                  DSPATR(PC)
002740120713     A                                 22 45'(S/N)'
002750120713     A                                 23  2'F3-Fine'
002760120713     A                                      COLOR(BLU)
002770120713     A                                 23 12'F6-Conferma'
002780120713     A                                      COLOR(BLU)
002790120713     A                                 17  2'DATI DI TASSAZIONE:'
002800120713     A                                      DSPATR(HI)
002810120713     A                                  4  2'Cliente'
002820120713     A                                      DSPATR(HI)
002830120713     A                                  4 36'Tar.(999=Tutte)'
002840120713     A                                      DSPATR(HI)
